{
 "score": 363,
 "id": "6fxq5r",
 "num_comments": 143,
 "date": "2017-06-07 18:01:51",
 "comments": [
  {
   "score": 101,
   "id": "diltypo",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 18:17:38",
   "depth": 0,
   "text": "wtf, that was crazy. didn't think things would escalate *this* much"
  },
  {
   "score": 2,
   "id": "diqfk97",
   "pid": "t1_diltypo",
   "date": "2017-06-10 15:43:15",
   "depth": 1,
   "text": "Both OP and ED are too much of a mood whiplash"
  },
  {
   "score": 7,
   "id": "dinzrdu",
   "pid": "t1_diltypo",
   "date": "2017-06-09 00:48:46",
   "depth": 1,
   "text": "Yeah, kinda feels like things went from 0-60 without much warning.  A little jarring, honestly.  Not really sure if I like it.  \n\n&nbsp;\n\nWatching an episode like this makes me wonder why the empress is in school, rather than a supermax prison.  "
  },
  {
   "score": 85,
   "id": "dilum5h",
   "pid": "t1_diltypo",
   "date": "2017-06-07 18:30:44",
   "depth": 1,
   "text": "Yeah, it went from dicking around with Onigawara and Kikakujou to mortally wounding people real fast."
  },
  {
   "score": 31,
   "id": "dilzfka",
   "pid": "t1_dilum5h",
   "date": "2017-06-07 20:09:08",
   "depth": 2,
   "text": "I kinda miss those dicking around days, I was kinda looking forward to this being a comedy show in a season already packed full with serious action shows, I need some comedic relief"
  },
  {
   "score": 86,
   "id": "dilts4j",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 18:13:38",
   "depth": 0,
   "text": "[Well she's legitimately terrifying.](http://i.imgur.com/XKlKIlt.jpg) There's few anime/anime characters that I thought actually elicited terror or unsettled me as a viewer (offhand I can think of Nui, Asakura and [Hawk](http://i.imgur.com/lUEYAN2.jpg) from [The Bloodspray of Ishikawa Goemon](https://myanimelist.net/anime/34021/Lupin_the_IIIrd__Chikemuri_no_Ishikawa_Goemon)), but she feels *incredibly* threatening and I think it's really cool.\n\nI like the parallel that she's a karate user who turned her body into a blade, and Nomura is a blade user who turned his sword into karate"
  },
  {
   "score": 9,
   "id": "dim0ec3",
   "pid": "t1_dilts4j",
   "date": "2017-06-07 20:29:15",
   "depth": 1,
   "text": "Where is his sword though?"
  },
  {
   "score": 5,
   "id": "dim0p1i",
   "pid": "t1_dim0ec3",
   "date": "2017-06-07 20:35:25",
   "depth": 2,
   "text": "[removed]"
  },
  {
   "score": -8,
   "id": "dim6s7h",
   "pid": "t1_dim0p1i",
   "date": "2017-06-07 23:11:33",
   "depth": 3,
   "text": "This comment has been removed.\n\n- This comment has been reported as containing untagged spoilers. Please review for any tags you may have missed and reply to this message to have your post re-approved.\n\n  Self and link posts should be properly spoiler-tagged and should include the name(s) of the show(s) referenced in the title. Self posts may opt to tag spoilers in the self post instead. (Using the same format as comment spoilers below)\n\n  Comments should use `[spoiler source](/s \"spoiler-chan died\")` to protect spoilers. Spoiler source should, at a minimum, contain the relevant source of the spoiler (e.g. One Piece episode 200, or if it's from a different medium, LN/Manga/VN). Spoiler source is only required in the first of any set of spoilers for the same source and is not required in a discussion thread while discussing that thread's series.\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 6,
   "id": "dim1vz4",
   "pid": "t1_dim0p1i",
   "date": "2017-06-07 20:57:55",
   "depth": 3,
   "text": "You son of a bitch."
  },
  {
   "score": 2,
   "id": "dim7sac",
   "pid": "t1_dim1vz4",
   "date": "2017-06-07 23:47:09",
   "depth": 4,
   "text": "Mind sharing the spoiler? I'm fine wirh it since this season is short anyway and second seasons are rare."
  },
  {
   "score": 7,
   "id": "dimhycv",
   "pid": "t1_dim7sac",
   "date": "2017-06-08 06:07:10",
   "depth": 5,
   "text": "It wasn't a spoiler, it was a lenny, implying his sword was in his pants! Not sure why he deleted it."
  },
  {
   "score": 2,
   "id": "dims1hs",
   "pid": "t1_dimhycv",
   "date": "2017-06-08 09:17:52",
   "depth": 6,
   "text": "He didn't, he got mod'd improperly."
  },
  {
   "score": 2,
   "id": "dimtcg6",
   "pid": "t1_dims1hs",
   "date": "2017-06-08 09:38:25",
   "depth": 7,
   "text": "For that or something else?"
  },
  {
   "score": 3,
   "id": "dimuvp7",
   "pid": "t1_dimtcg6",
   "date": "2017-06-08 10:02:53",
   "depth": 8,
   "text": "I didn't see the original post, but overreporting spoilers is definitely a thing in this sub."
  },
  {
   "score": 16,
   "id": "dim0xm5",
   "pid": "t1_dim0ec3",
   "date": "2017-06-07 20:40:33",
   "depth": 2,
   "text": "He doesn't use it anymore. He took his knowledge of the sword school (part of his backstory we already knew that was expounded upon by Tsukuyo in this episode) and adapted it into his fists, whereas the Empress took the knowledge of her karate school and sharpened her strikes into blades"
  },
  {
   "score": 20,
   "id": "dim4xr9",
   "pid": "t1_dilts4j",
   "date": "2017-06-07 22:13:41",
   "depth": 1,
   "text": "[Semi-Spoilers](/s \"She's just really horny. Women at max horniness are the scariest according to Distance.\")"
  },
  {
   "score": 6,
   "id": "dime02l",
   "pid": "t1_dim4xr9",
   "date": "2017-06-08 04:13:33",
   "depth": 2,
   "text": "How are you guys reading ahead? I looked up the manga and it's translations are way behind the anime.\n\nEDIT: I knew there'd be people who can read the raws/other translations, I made this comment out of frustration because I can't :("
  },
  {
   "score": 2,
   "id": "dimio5f",
   "pid": "t1_dime02l",
   "date": "2017-06-08 06:23:19",
   "depth": 3,
   "text": "Chinese and Veit translations are way ahead"
  },
  {
   "score": 18,
   "id": "dimihhm",
   "pid": "t1_dime02l",
   "date": "2017-06-08 06:19:18",
   "depth": 3,
   "text": "I think there are more than a few people here who can read Japanese."
  },
  {
   "score": 28,
   "id": "dilvfff",
   "pid": "t1_dilts4j",
   "date": "2017-06-07 18:46:53",
   "depth": 1,
   "text": "Yo that's my jam--fear boners."
  },
  {
   "score": 46,
   "id": "dilxr4x",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 19:33:46",
   "depth": 0,
   "text": "Man, what a cliffhanger. I already liked this show but after these past 2 episodes now I'm really into it "
  },
  {
   "score": 17,
   "id": "dim5c5i",
   "pid": "t1_dilxr4x",
   "date": "2017-06-07 22:25:16",
   "depth": 1,
   "text": "I know, I actually liked how badass the MC was, but now the show has become really good. It was a really intense episode. \n\nThis will be probably an unpopular opinion, but I can't see Amou as the villain here, those girls were ruling a regime in the school, now it's time to pay for their sins. **Long live the empress**"
  },
  {
   "score": 2,
   "id": "diqkdfp",
   "pid": "t1_dim5c5i",
   "date": "2017-06-10 17:45:41",
   "depth": 2,
   "text": "I agreed with her for a time, but now to me its clear she's just attacking people indiscriminately. It's one thing to beat them but it's an entirely different thing to try to kill them when they're on the ground defeated!"
  },
  {
   "score": 2,
   "id": "dims5eo",
   "pid": "t1_dim5c5i",
   "date": "2017-06-08 09:19:42",
   "depth": 2,
   "text": "I mean...after great first episode we got weak second episode, but the show was on upswing since that. Hope to get only better"
  },
  {
   "score": 21,
   "id": "dim3a0a",
   "pid": "t1_dilxr4x",
   "date": "2017-06-07 21:29:38",
   "depth": 1,
   "text": "Right?! This show is getting crazy good really damn fast! \n\nHow many more episodes do we got left?!"
  },
  {
   "score": 47,
   "id": "dim05fz",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 20:24:10",
   "depth": 0,
   "text": "This show has gotten so damn intense. \n\nAmou (aka Maou, or The Devil) is an incredible villain character. She's managed to defeat almost all of the leaders, and she's done more than just stab a few of them. *When she sliced at the eyelids, I physically cringed...* Most shows don't cause that reaction from me, so I'm very impressed.\n\nInaba had a rather quick change of character, but the monologue from her was interesting, and the fact that she seemed to know Nomura as well was cool. Of course fight Amou wouldn't go so well, but I was surprised that the girl like Inaba would have such a basic sword to use (probably being so fast she underestimated ever needing a quality weapon). It may be just me, but I found the moment where Nomura pulled Inaba out of the way of Amou's attack to be...\n\n[Really cute!](#headpat)\n\nThe rest of the cast showing up and just being bulldozed really makes Amou a scary character. However, this new lady with the empty purple eyes is intriguing... She mentioned that she will take care of the students on the roof, and almost appearing out of nowhere, I'm curious as to if she will heal all the girls that were hurt/ killed. I guess we will find out next episode.\n\nI was **definitely not** expecting anything this good from this show, and I am now very excited for the next episode. Will this be the final confrontation between Nomura and Amou?\n\n[It's too good!](#comfortfood)\n\n**Fun thing I just noticed:** You can spell Amou's name using Nomura, leaving a N and R."
  },
  {
   "score": 2,
   "id": "dipuypk",
   "pid": "t1_dim05fz",
   "date": "2017-06-10 07:37:46",
   "depth": 1,
   "text": ">Fun thing I just noticed: You can spell Amou's name using Nomura, leaving a N and R.\n\nAnother thing: They look really similar - something about their face shape, and hair color. So they may be long lost siblings or whatever."
  },
  {
   "score": 3,
   "id": "diqkhqu",
   "pid": "t1_dim05fz",
   "date": "2017-06-10 17:49:01",
   "depth": 1,
   "text": "I think it's fairly obvious that Inada just wants friends, she doesn't want to be seen as scary or imposing hence the \"fake\" sword. Her motives this episode were based entirely around friends, who has them, how can you get them and does she have them!"
  },
  {
   "score": 7,
   "id": "dimnr2f",
   "pid": "t1_dim05fz",
   "date": "2017-06-08 08:02:31",
   "depth": 1,
   "text": "I wasn't expecting him to pull her out of the way. I was waiting for the generic 'teleport between 2 people to stop the hit' bullshit. The pull was so smooth too, I loved that entire scene. "
  },
  {
   "score": 11,
   "id": "dim0qbw",
   "pid": "t1_dim05fz",
   "date": "2017-06-07 20:36:09",
   "depth": 1,
   "text": "[removed]"
  },
  {
   "score": 9,
   "id": "dim2wtt",
   "pid": "t1_dim0qbw",
   "date": "2017-06-07 21:20:40",
   "depth": 2,
   "text": "I'm sorry but when did she explain the reason the school wasn't shut down and that it was just to contain Amou? Missed that completely apparently"
  },
  {
   "score": 3,
   "id": "dim5a39",
   "pid": "t1_dim2wtt",
   "date": "2017-06-07 22:23:35",
   "depth": 3,
   "text": "[removed]"
  },
  {
   "score": 12,
   "id": "dim82t9",
   "pid": "t1_dim5a39",
   "date": "2017-06-07 23:58:08",
   "depth": 4,
   "text": "I still think that you're jumping to too specific a conclusion without properly justifying it. For example, Inaba reveals that she had been entrusted with the duty of being Nomura's case-worker/disciplinarian/etc.\n\nIt's entirely reasonable to come to the conclusion that the school's existence has become a sort of rat pit in which everyone's eaten except the most dangerous students, and that they have staff on hand to deal with any incidents that may occur in the process of achieving equilibrium.\n\nIt's a completely different story if you want to indicate that the school was created some decades earlier because they thought that one day there would be some dangerous girl running around murdering people.\n\nAfter all- wouldn't it be a better environment for her if the men, as well as the women, were allowed to carry weapons? This is all under the assumption that her driving motivation is that she's just seeking a challenge, which hasn't been established at this point.\n"
  },
  {
   "score": 7,
   "id": "dim20kd",
   "pid": "t1_dim0qbw",
   "date": "2017-06-07 21:00:30",
   "depth": 2,
   "text": "Damn, that is rather intriguing (*and dark*)!\n\nThe show really has improved largely over the past few episodes. I love the progression from leader to leader, with each revealing more about the school and pointing towards this mental case being Amou.\n\nHeres for hoping that Nomura can teach this psycho girl a lesson about the proper way to treat people...\n\n[](#modabuse)"
  },
  {
   "score": 5,
   "id": "dim5g9y",
   "pid": "t1_dim20kd",
   "date": "2017-06-07 22:28:38",
   "depth": 3,
   "text": "It was dark in the beginning before it lightened up, this is the hammer forcing the nail in after it got started. I didn't think the show would get like this but it was worth it and more. A proper final battle is going to be fun since Nomura is going to get his shit kicked in next episode, its a good thing purple haired girl is there to keep people alive and well."
  },
  {
   "score": 32,
   "id": "dim1jqz",
   "pid": "t1_dim05fz",
   "date": "2017-06-07 20:51:32",
   "depth": 1,
   "text": "She was probably using a fake sword for the weight (she didn't seem very healthy/physically strong) or so she didn't actually kill anybody. I get that sorta \"I look imposing but I don't actually want people to die\" vibe from her.  \n\nThis show has seriously blown me away, though. Its surprisingly non-cliche'd to death despite what it is. It feels like a shorter, gender-bent Kill la Kill to me."
  },
  {
   "score": 11,
   "id": "dim1qar",
   "pid": "t1_dim1jqz",
   "date": "2017-06-07 20:54:51",
   "depth": 2,
   "text": "I can agree with that. Each episode has impressed me more and more, and it seems that the past three really piled everything together and put the cherry on top."
  },
  {
   "score": 33,
   "id": "dilvto4",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 18:55:04",
   "depth": 0,
   "text": "I think the reason why the Empress respect the MC is because they both fight without swords, instead using their own body as a weapon.\n\nAside from the quick -dere switch of Inaba, I think this episode is great."
  },
  {
   "score": 1,
   "id": "dipdntd",
   "pid": "t1_dilvto4",
   "date": "2017-06-09 20:28:45",
   "depth": 1,
   "text": "[spoiler](/s \"FYI, after this battle, Inaba demanded Nomura to be her disciple and unfortunately he accepted it xD\")"
  },
  {
   "score": 27,
   "id": "dilx5dz",
   "pid": "t1_dilvto4",
   "date": "2017-06-07 19:21:32",
   "depth": 1,
   "text": "I thought it was because he managed to actually hurt her when they first met though they didn't really play up that he did. Seems like maybe they keeping it as more a reveal for how much damage he actually did."
  },
  {
   "score": 8,
   "id": "dim0h9m",
   "pid": "t1_dilx5dz",
   "date": "2017-06-07 20:30:53",
   "depth": 2,
   "text": "Gotta be a reason she didn't wreck stuff earlier then now. Recovering? Orcus on his throne?"
  },
  {
   "score": 4,
   "id": "dim4894",
   "pid": "t1_dim0h9m",
   "date": "2017-06-07 21:54:12",
   "depth": 3,
   "text": "She probably was bored after being stuck there with weaklings instead of out there fighting the only person to have actually done damage to her in Nomura. He came and she started getting ready for the big fight."
  },
  {
   "score": 2,
   "id": "dim4q05",
   "pid": "t1_dim4894",
   "date": "2017-06-07 22:07:34",
   "depth": 4,
   "text": "[removed]"
  },
  {
   "score": 2,
   "id": "dim9ql2",
   "pid": "t1_dim4q05",
   "date": "2017-06-08 01:07:12",
   "depth": 5,
   "text": "This comment has been removed.\n\n- Untagged or improperly tagged spoilers are not allowed.\nObviously intentional or excessively repeated violations of this rule will result in a ban.\n\n  Self and link posts should be properly spoiler-tagged and should include the name(s) of the show(s) referenced in the title. Self posts may opt to tag spoilers in the self post instead. (Using the same format as comment spoilers below)\n\n  Comments should use `[spoiler source](/s \"spoiler-chan died\")` to protect spoilers. Spoiler source should, at a minimum, contain the relevant source of the spoiler (e.g. One Piece episode 200, or if it's from a different medium, LN/Manga/VN). Spoiler source is only required in the first of any set of spoilers for the same source and is not required in a discussion thread while discussing that thread's series.\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 3,
   "id": "dim8ryh",
   "pid": "t1_dim4q05",
   "date": "2017-06-08 00:25:39",
   "depth": 5,
   "text": "> The anime cuts out this bit of characterization,\n\nThen perhaps consider putting it behind a spoiler tag"
  },
  {
   "score": 2,
   "id": "dim9eqb",
   "pid": "t1_dim8ryh",
   "date": "2017-06-08 00:52:23",
   "depth": 6,
   "text": "It's from a chapter the anime already covered, so it didn't seem like it was necessary. "
  },
  {
   "score": 1,
   "id": "din0suf",
   "pid": "t1_dim9eqb",
   "date": "2017-06-08 11:42:19",
   "depth": 7,
   "text": "could u spoil it with spoiler tag please? i want to know what u said :d"
  },
  {
   "score": 24,
   "id": "dimjix9",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 06:41:39",
   "depth": 0,
   "text": "taken from 4chan, but apparently hardening your body via trauma is a real thing.\n\n>YES, and it actually works to some extent, because there is a physiological base for it. You see, once you start training with repeated trauma it causes micro-fractures in your bones, activating the Osteoblast activity, which in turn makes them gradually more durable the same way consolidated fractured bone is stronger than a regular one.Then, as you continue training, some of the bone cells will separate from your bones and end up in your muscles via blood-stream or by direct proximity, where some of it proliferates exogenously, a condition which is called Myositis Ossificans. This does in fact harden you body...at the expense of chronic arthritis once you reach a certain age. \n\n>T. med fag and martial arts fan.\n\nwell then"
  },
  {
   "score": 4,
   "id": "diooz7i",
   "pid": "t1_dimjix9",
   "date": "2017-06-09 11:35:54",
   "depth": 1,
   "text": "Guess durarara is real"
  },
  {
   "score": 22,
   "id": "dilv3o9",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 18:40:38",
   "depth": 0,
   "text": "This has gotten really fun to watch. I wish the scanlations were further ahead as they are only at the Satori fight and I need to know what happens next."
  },
  {
   "score": 18,
   "id": "dim554p",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 22:19:35",
   "depth": 0,
   "text": "Damn this show got intense as fuck ! Sad most won't give it a watch since they think it's a stupid eechi harem battle school anime. I really like it one of the most fun shows this season for me "
  },
  {
   "score": 13,
   "id": "dim8bs4",
   "pid": "t1_dim554p",
   "date": "2017-06-08 00:07:38",
   "depth": 1,
   "text": "> Sad most won't give it a watch since they think it's a stupid eechi harem battle school anime\n\nTo be honest, the first eight or so episodes were like that. MC beats/accidently kisses/gropes girl, girl falls for MC because plot. It seemed fun so I personally just kept watching it, then episode 9 and this one came along and turned my view around. It's pretty good now and episode 9 was a nice twist due to the unexpected change."
  },
  {
   "score": 1,
   "id": "dim9lo2",
   "pid": "t1_dim8bs4",
   "date": "2017-06-08 01:00:56",
   "depth": 2,
   "text": "yeah too bad some people dont stick around beyond eps 3...many anime give you surprise after eps 3, akashi record for example"
  },
  {
   "score": 2,
   "id": "dimanra",
   "pid": "t1_dim8bs4",
   "date": "2017-06-08 01:49:06",
   "depth": 2,
   "text": "See the thing is I think the first episodes almost put you on a lull, everything was all happy and it left the audience basically \"knowing\" what was going to happen he was going to fight the last girl and win go out meet empress and she and him Would duke it out. It knew what you expected to happen and through everyone for a loop by not doing that it's a great twist on the formulaic nature of these kinds of shows and it's sad not many will give it a watch. "
  },
  {
   "score": 9,
   "id": "dim8kwm",
   "pid": "t1_dim8bs4",
   "date": "2017-06-08 00:17:45",
   "depth": 2,
   "text": "Even of the first eight episodes are like that they some really good fights that I think are worth watching just for those."
  },
  {
   "score": 4,
   "id": "dim8v9w",
   "pid": "t1_dim8kwm",
   "date": "2017-06-08 00:29:21",
   "depth": 3,
   "text": "The fights are what I found fun. Everything else though, too typical (the whole random falling for MC thing). It's just hard to get people into something, especially with school battle harem being one of the first vibes it gives off. Not very popular stuff commonly get overshadowed so sadly this will go unnoticed by many."
  },
  {
   "score": 52,
   "id": "dilwedl",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 19:06:47",
   "depth": 0,
   "text": "Damn that went from 0 to 100 real fast, even though there was backtracking didn't expect it to escalate to slashing eyes and dying. Can't wait for next episode."
  },
  {
   "score": 36,
   "id": "dilyp0n",
   "pid": "t1_dilwedl",
   "date": "2017-06-07 19:53:13",
   "depth": 1,
   "text": "As I said in the last discussion, the big bad just left the final boss room early. Shit hit the fan before it was supposed to and it is awesome."
  },
  {
   "score": 23,
   "id": "dim4euq",
   "pid": "t1_dilyp0n",
   "date": "2017-06-07 21:59:00",
   "depth": 2,
   "text": "She got too hungry for the D and saw potential rivals. Makes sense if you ask me. "
  },
  {
   "score": 8,
   "id": "dim5c8k",
   "pid": "t1_dim4euq",
   "date": "2017-06-07 22:25:20",
   "depth": 3,
   "text": "Yep, the final boss is wrecking her underlings shit over their relationship wth Nomura. Quite fitting with the recent tonal shift."
  },
  {
   "score": 10,
   "id": "dim5jvf",
   "pid": "t1_dim5c8k",
   "date": "2017-06-07 22:31:37",
   "depth": 4,
   "text": "The anime cut out some subtle characterization for Amou and Nomura's relationship, which really sucks. And even when this season ends, we'll be pretty much only 5 chapters behind the raws. So the odds of season 2 are basically 0% at this point. "
  },
  {
   "score": 13,
   "id": "dim5pg5",
   "pid": "t1_dim5jvf",
   "date": "2017-06-07 22:36:24",
   "depth": 5,
   "text": "A damn shame too, this broke a bunch of tropes and it isn't just fun trash anymore. Hopefully it'll be a great example other anime can follow up on through, cliches are boring and the show  had fun with breaking them."
  },
  {
   "score": 9,
   "id": "dim6dff",
   "pid": "t1_dim5pg5",
   "date": "2017-06-07 22:57:41",
   "depth": 6,
   "text": "At least we'll still have the manga...which is 20 chapters behind the raws...and the author might have cancer...shit."
  },
  {
   "score": 2,
   "id": "dim6uc8",
   "pid": "t1_dim6dff",
   "date": "2017-06-07 23:13:37",
   "depth": 7,
   "text": "Every time something that shakes stuff up comes out, somehow it can't keep going. How does that happen?"
  },
  {
   "score": 2,
   "id": "din1ul8",
   "pid": "t1_dim6uc8",
   "date": "2017-06-08 12:00:16",
   "depth": 8,
   "text": "[deleted]"
  },
  {
   "score": 2,
   "id": "din7cn9",
   "pid": "t1_din1ul8",
   "date": "2017-06-08 13:36:56",
   "depth": 9,
   "text": "Cliches have their place. If everything has them and nothing is unique or subverts the usual tropes then they're completely shit. The first episodes​ of this were fairly tropy in their own right, it just rose above them as the writing improved and characters were established."
  },
  {
   "score": 3,
   "id": "dimb6fc",
   "pid": "t1_dim6dff",
   "date": "2017-06-08 02:13:20",
   "depth": 7,
   "text": "> and the author might have cancer\n\nwtf! Link?"
  },
  {
   "score": 15,
   "id": "din4zy3",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 12:55:08",
   "depth": 0,
   "text": "I definitely saw [this move](http://i.imgur.com/c4RulFp.jpg) before.  \n[Ohh, yeah :D](http://imgur.com/v8KtdAz)"
  },
  {
   "score": 23,
   "id": "dim1t37",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 20:56:20",
   "depth": 0,
   "text": "I seriously didn't expect that.\n\nLast episode, I felt that Amou's \"auto counter\" was hax. However, the explanation in this episode regarding reaction times made me understand it's purpose.\n\nSeriously, how did a story about problematic students in a school become this bloody and violent?\n\nI'm so relieved that Warabi's eyes were not injured......I really hope none of the girls die.\n\nGeez, that was an intense episode.\n\nFor people calling Amou hot.....I commend your ability to only see her looks - because her actions and demeanour gives me the heebie jeebies"
  },
  {
   "score": 1,
   "id": "din4yyr",
   "pid": "t1_dim1t37",
   "date": "2017-06-08 12:54:41",
   "depth": 1,
   "text": "Most people who find her hot have definitely read the manga. She had way more characterisation early on that the anime cut out "
  },
  {
   "score": 10,
   "id": "dim25e2",
   "pid": "t1_dim1t37",
   "date": "2017-06-07 21:03:18",
   "depth": 1,
   "text": "Hell, I must be in the minority that gets the heebie jeebies *from her appearance alone!* She's one scary and dangerous individual...\n\n[](#elsienopesout)"
  },
  {
   "score": 7,
   "id": "dim2d2h",
   "pid": "t1_dim25e2",
   "date": "2017-06-07 21:07:53",
   "depth": 2,
   "text": ">Hell, I must be in the minority that gets the heebie jeebies from her appearance alone! She's one scary and dangerous individual...'\n\nIncredibly scary.\n\nShe trumps [Shikimi](https://www.youtube.com/watch?v=uzJQB1Zx9bA) this season......and that's saying something."
  },
  {
   "score": 4,
   "id": "dim2i7a",
   "pid": "t1_dim2d2h",
   "date": "2017-06-07 21:11:06",
   "depth": 3,
   "text": "Don't remind me of **her**!\n\n[](#terror)\n\nHer introduction episode was *messed up*! And I thought Akane was going to be the scariest available, being a yandere and all."
  },
  {
   "score": 3,
   "id": "dim2tbe",
   "pid": "t1_dim2i7a",
   "date": "2017-06-07 21:18:16",
   "depth": 4,
   "text": ">Her introduction episode was messed up! And I thought Akane was going to be the scariest available, being a yandere and all.\n\nThankfully, Akane has mellowed out as a character and there is more dere than yan. \n\nShikimi is a different ball game altogether.\n\nI realised that Renai Boukun would become on of my favourites this season when I became legitimately worried for [Renai Boukun](/s \"Seiji, who's basically immortal due to his love contract with Guri\")\n\nI couldn't believe the Episode 4 discussion thread was filled with people calling her hot......\n\n"
  },
  {
   "score": 12,
   "id": "dim5709",
   "pid": "t1_dim1t37",
   "date": "2017-06-07 22:21:05",
   "depth": 1,
   "text": "Hey I love a girl who can kick my ass and it's just bette that she's hot as hell. There ain't no dere like a yandere "
  },
  {
   "score": 7,
   "id": "dima14z",
   "pid": "t1_dim5709",
   "date": "2017-06-08 01:20:26",
   "depth": 2,
   "text": "Kicking ass is one thing.\n\nSlicing eyelids tho..."
  },
  {
   "score": 4,
   "id": "dimao3u",
   "pid": "t1_dima14z",
   "date": "2017-06-08 01:49:33",
   "depth": 3,
   "text": "Yeah I might need to set some boundaries "
  },
  {
   "score": 8,
   "id": "dim5lw1",
   "pid": "t1_dim5709",
   "date": "2017-06-07 22:33:19",
   "depth": 2,
   "text": ">Hey I love a girl who can kick my ass and it's just bette that she's hot as hell. There ain't no dere like a yandere\n\nI don't see a shred of dere in Amou or Shikimi......but you do you.\n\n[](#shittaste)"
  },
  {
   "score": 1,
   "id": "dirb4us",
   "pid": "t1_dim5lw1",
   "date": "2017-06-11 09:10:41",
   "depth": 3,
   "text": "Shikimi has a lot of dere - it just takes her longer to reach that point, so there's almost no chance it will happen in the anime."
  },
  {
   "score": 1,
   "id": "dircj09",
   "pid": "t1_dirb4us",
   "date": "2017-06-11 09:43:39",
   "depth": 4,
   "text": ">Shikimi has a lot of dere - it just takes her longer to reach that point, so there's almost no chance it will happen in the anime.\n\nSpoiler?\n\nDoes she change?"
  },
  {
   "score": 1,
   "id": "dirivl8",
   "pid": "t1_dircj09",
   "date": "2017-06-11 12:08:27",
   "depth": 5,
   "text": "You should read the manga if you can.  Do a search on r/manga for Renai Boukun if you don't know where to look.  But to answer your question\n\n[Renai Boukun](/s \"She does change - she goes from sadistic torturer to mischievous troll, and goes from trying to steal Seiji because Akane likes him to trying to steal him because she likes him.\")"
  },
  {
   "score": 6,
   "id": "dim6047",
   "pid": "t1_dim5lw1",
   "date": "2017-06-07 22:45:33",
   "depth": 3,
   "text": "Oh no shikimi is awful Akane is amazing though not only is she Yandere she is a red headed goddess.\nAlso the empress probably has a cute dere side deep deep deep deep deep like Satans wine cellar deep down. "
  },
  {
   "score": 10,
   "id": "dimbdo7",
   "pid": "t1_dim6047",
   "date": "2017-06-08 02:22:34",
   "depth": 4,
   "text": "i bet dere amou will be cute AF."
  },
  {
   "score": 7,
   "id": "dimbgna",
   "pid": "t1_dimbdo7",
   "date": "2017-06-08 02:26:33",
   "depth": 5,
   "text": "Dude I hope they animate her blushing it'd be the cutest thing in the entire show and there's a lot of cute moments in this show "
  },
  {
   "score": 21,
   "id": "dilts0d",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 18:13:33",
   "depth": 0,
   "text": "Announcer Voice: Find out next time on [~~Dragon Ball Z~~ Bousou Shoujo Machiavellianism](http://i.imgur.com/eyJjMFh.png)!!"
  },
  {
   "score": 3,
   "id": "dim8gib",
   "pid": "t1_dilts0d",
   "date": "2017-06-08 00:12:48",
   "depth": 1,
   "text": "I literally shouted \"DRAGON BALL Z!\" as the episode ended."
  },
  {
   "score": 5,
   "id": "dim9vgq",
   "pid": "t1_dilts0d",
   "date": "2017-06-08 01:13:17",
   "depth": 1,
   "text": "I felt the Goku Black vibes on Amou so much when she uses that aura!"
  },
  {
   "score": 12,
   "id": "dimglil",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 05:33:30",
   "depth": 0,
   "text": "I find it suprising and hilarous that Inaba only joined the fight against Amou because she made a friend "
  },
  {
   "score": 34,
   "id": "dilw15f",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 18:59:23",
   "depth": 0,
   "text": "Amou is crazy hot and crazy strong."
  },
  {
   "score": 15,
   "id": "diltavv",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 18:03:08",
   "depth": 0,
   "text": "[Is this](http://i.imgur.com/uQ3173b.png) [actually possible?](http://i.imgur.com/qDaAu1F.png)"
  },
  {
   "score": 21,
   "id": "dilvye7",
   "pid": "t1_diltavv",
   "date": "2017-06-07 18:57:47",
   "depth": 1,
   "text": "I imagine you could sever the [muscle](https://en.wikipedia.org/wiki/Levator_palpebrae_superioris_muscle) that allows you to open your eyes without really damaging anything else, but it's a very small muscle and not hitting anything else would require ridiculously good dexterity to do by hand, so in theory yes but IRL no not really."
  },
  {
   "score": 12,
   "id": "dilyttv",
   "pid": "t1_dilvye7",
   "date": "2017-06-07 19:56:06",
   "depth": 2,
   "text": "But the fact that she did makes her so freakin' savage!!!!!!"
  },
  {
   "score": 9,
   "id": "dim2uab",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 21:18:56",
   "depth": 0,
   "text": "Goddamn I love this show's action. Its probably my favorite anime this season even though I can tell by its rating its definitely not everyone's. Question. Are we really unsure about how many episodes there will be in this season? Still unmarked on MAL"
  },
  {
   "score": 5,
   "id": "dim494y",
   "pid": "t1_dim2uab",
   "date": "2017-06-07 21:54:50",
   "depth": 1,
   "text": "We actually don't have much source material past this arc which can be done in 2 episodes with this pace. \n\nEdit : to put it in perspective this episodes finishes at the end of chapter 25 and from what I know there are 35 chapters out at the moment."
  },
  {
   "score": 8,
   "id": "dim31t2",
   "pid": "t1_dim2uab",
   "date": "2017-06-07 21:23:59",
   "depth": 1,
   "text": "I'm sticking with 12 episodes. The way things are going, it doesn't feel like a two cour. Unless some drastic change happens... Which the past three episodes have been essentially!"
  },
  {
   "score": 3,
   "id": "dim365a",
   "pid": "t1_dim31t2",
   "date": "2017-06-07 21:26:57",
   "depth": 2,
   "text": "yeah definitely feels like its coming to a close eh"
  },
  {
   "score": 5,
   "id": "din1xys",
   "pid": "t1_dim365a",
   "date": "2017-06-08 12:01:54",
   "depth": 3,
   "text": "[deleted]"
  },
  {
   "score": 1,
   "id": "din8rpi",
   "pid": "t1_din1xys",
   "date": "2017-06-08 14:02:46",
   "depth": 4,
   "text": "Ayyyy that'd be some fun haha"
  },
  {
   "score": 8,
   "id": "dimcqqc",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 03:24:40",
   "depth": 0,
   "text": "WooOoo!! [Inaba hype](http://i.imgur.com/7LVvoRr.gif)."
  },
  {
   "score": 7,
   "id": "dimd7co",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 03:43:23",
   "depth": 0,
   "text": "Amou did a Gilgamesh on everyone"
  },
  {
   "score": 4,
   "id": "dimq1ew",
   "pid": "t1_dimd7co",
   "date": "2017-06-08 08:43:15",
   "depth": 1,
   "text": "Thats DOCTOR Gilgamesh to you, mongrel."
  },
  {
   "score": 7,
   "id": "dimfd68",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 04:59:10",
   "depth": 0,
   "text": "Holy fucking shit. Those are the only words to describe that episode. Never in a good while have I ever felt an ANIME character legit scare me myself. The act of Amou breaking them systematically one by one without a second of doubt legit terrified me. She has no form of resistance and or second thought on any of her actions.\n\nI never expected that ending. When Nomura pushed Inaba aside and fucking screamed at Amou, and her expression instantly turned into anger I knew shit was about to go down.\n\nI'm saying it: That one was of my favorite episodes in anime in a good while, Amou, Nomura, all of them are insanely cool and the fact that Amou legit terrified me is insane."
  },
  {
   "score": 7,
   "id": "dilx13g",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 19:19:19",
   "depth": 0,
   "text": "I liked last episode because of the twist, but this one felt a bit off. I guess the change of pace was a bit much after 8 and half episode of light humour"
  },
  {
   "score": 5,
   "id": "dim9in7",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 00:57:14",
   "depth": 0,
   "text": "When Inaba sliced the butterfly I was not ready for that shift in frames so quickly. I jumped when I heard the slice...jesus...jump scares in this anime T_T"
  },
  {
   "score": 5,
   "id": "dim9trw",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 01:11:12",
   "depth": 0,
   "text": "Inaba can definitely kickass, too bad she has to carry a weaker lightweight sword for her techniques. She could've easily taken down Amou there if she was using a real one. Also Amou is terrifying af, of course someone who can stab your gut has no qualms about slicing through your eyelids. I honestly thought she permanently blinded Warabi there. "
  },
  {
   "score": 4,
   "id": "dilzloq",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 20:12:42",
   "depth": 0,
   "text": "was kinda curious how crazy Inaba would be but she is just childish in certain situations :P"
  },
  {
   "score": 4,
   "id": "dimqutc",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 08:57:32",
   "depth": 0,
   "text": "THIS IS DEFINITELY NOT THE HAPPY-GO-LUCKY LN PARODY I WAS EXPECTING TO GET FROM THIS SHOW.\n\nCan't say I'm disappointed though. I'm liking the dark (albeit extremely edgy) turn the series is taking."
  },
  {
   "score": 6,
   "id": "dilzuhg",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 20:17:53",
   "depth": 0,
   "text": "So that explains why students are allowed to carry sharp weapons. They're all fake swords. Duh."
  },
  {
   "score": 8,
   "id": "dim7chy",
   "pid": "t1_dilzuhg",
   "date": "2017-06-07 23:31:15",
   "depth": 1,
   "text": "It wasn't a fake sword, it was just a very lightweight one in order to enable her quickdraw.\n\nIt worked about as well as expected on someone whose body had been hardened to the point of being steel, though."
  },
  {
   "score": 24,
   "id": "dim1gw3",
   "pid": "t1_dilzuhg",
   "date": "2017-06-07 20:50:11",
   "depth": 1,
   "text": "And people with hand sized holes on their bodies are actually daijoubu, yay!"
  },
  {
   "score": 3,
   "id": "dilwnma",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 19:11:46",
   "depth": 0,
   "text": "Anyone know why this was like 8 hours late today? genuinely curious"
  },
  {
   "score": 5,
   "id": "dilx93i",
   "pid": "t1_dilwnma",
   "date": "2017-06-07 19:23:35",
   "depth": 1,
   "text": "I think it's because Amazon handles this one and they're not the most consistent when it comes to anime."
  },
  {
   "score": 2,
   "id": "dim3cmc",
   "pid": "t3_6fxq5r",
   "date": "2017-06-07 21:31:28",
   "depth": 0,
   "text": "*The plot thickens even more!* "
  },
  {
   "score": 2,
   "id": "dim9em8",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 00:52:15",
   "depth": 0,
   "text": "Where can I watch this episode? I can't find it."
  },
  {
   "score": 2,
   "id": "dimbett",
   "pid": "t1_dim9em8",
   "date": "2017-06-08 02:24:06",
   "depth": 1,
   "text": "i got it from the seven seas. but iirc the legal place is Amazon"
  },
  {
   "score": 2,
   "id": "dimi7fs",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 06:12:58",
   "depth": 0,
   "text": "Could anyone fill me in (don't care if it's a spoiler - just tag it for other people) why Amou seems to like Nomura for no reason? \n\nIs it because she got \"off\" from the fact that Nomura actually injured her? (in the brawl that got him here)\n\n"
  },
  {
   "score": 1,
   "id": "dipd7r7",
   "pid": "t1_dimi7fs",
   "date": "2017-06-09 20:19:25",
   "depth": 1,
   "text": "[spoiler](/s \"Amou likes Nomura and he likes her as well. It was confirmed at chapter 33 iirc\")"
  },
  {
   "score": 1,
   "id": "dirh0yq",
   "pid": "t1_dipd7r7",
   "date": "2017-06-11 11:26:20",
   "depth": 2,
   "text": "What :O No! [spoiler](/s \"What about my Rin ship?\")"
  },
  {
   "score": 1,
   "id": "dis6v8z",
   "pid": "t1_dirh0yq",
   "date": "2017-06-11 21:07:54",
   "depth": 3,
   "text": "Got rekt xD"
  },
  {
   "score": 1,
   "id": "dipqd45",
   "pid": "t1_dipd7r7",
   "date": "2017-06-10 05:07:59",
   "depth": 2,
   "text": "Where do you read the manga?"
  },
  {
   "score": 1,
   "id": "diqn9b7",
   "pid": "t1_dipqd45",
   "date": "2017-06-10 19:05:12",
   "depth": 3,
   "text": "From vietnamese manga site."
  },
  {
   "score": 7,
   "id": "dimkj3z",
   "pid": "t1_dimi7fs",
   "date": "2017-06-08 07:02:03",
   "depth": 1,
   "text": "\n\n[Semi-spoiler](/s \"Amou liked Nomura ever since they were in their other school. Actually, like is too small. She's obsessed with Nomura. The reason she attacked Satori is because of the picture-fiasco. \")"
  },
  {
   "score": 1,
   "id": "dimwm8j",
   "pid": "t1_dimkj3z",
   "date": "2017-06-08 10:31:22",
   "depth": 2,
   "text": "[Spoiler](/s \"Guess he doesn't like flat-wommen heh. Or the kinda psychotic type. On the other hand, Amou is apparently pretty horny. She wants that Nomura dick.\")"
  },
  {
   "score": 4,
   "id": "dimq7wy",
   "pid": "t1_dimkj3z",
   "date": "2017-06-08 08:46:25",
   "depth": 2,
   "text": "But is no spoiler at all. The anime was able, at least for me, to very clearly get that point across when [Spoiler from previous ep](/s \"she first went to take Satori down.\")"
  },
  {
   "score": 2,
   "id": "dimr4ao",
   "pid": "t1_dimq7wy",
   "date": "2017-06-08 09:01:55",
   "depth": 3,
   "text": "True true actually. But I mean at this point I'll just leave it be. But you're definitely right. "
  },
  {
   "score": 2,
   "id": "diqxq60",
   "pid": "t3_6fxq5r",
   "date": "2017-06-11 00:55:33",
   "depth": 0,
   "text": "So this is how it feels to be the guy in yandere simulator."
  },
  {
   "score": 3,
   "id": "dimimlq",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 06:22:25",
   "depth": 0,
   "text": " I really don't like Amou. Part of the reason is that the anime gave her basically no character.\n\nThe only thing I can see from her is she like beating people up for no reason and has apparently mastered bullshit reflexes along with ridiculously tough skin. "
  },
  {
   "score": 1,
   "id": "dimavu3",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 01:59:53",
   "depth": 0,
   "text": "I have a question, what if Nomura wouldn't have found Amou, how far would this have gone?"
  },
  {
   "score": 3,
   "id": "dimkl6x",
   "pid": "t1_dimavu3",
   "date": "2017-06-08 07:03:12",
   "depth": 1,
   "text": "..Mmmm...all of them would probably be dead by now? Or heavily injured rather."
  },
  {
   "score": 1,
   "id": "dimhc5z",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 05:52:18",
   "depth": 0,
   "text": "so is Amou a man or girl Oo ??"
  },
  {
   "score": 4,
   "id": "dimtgzy",
   "pid": "t1_dimhc5z",
   "date": "2017-06-08 09:40:09",
   "depth": 1,
   "text": "Woman.\n\nShe has breasts if you look properly."
  },
  {
   "score": 1,
   "id": "dimnibm",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 07:58:04",
   "depth": 0,
   "text": "Why does Busou Shoujo Machiavellianism have 34 chapters on Vietnamese manga sites but only have 15 in English sites ?"
  },
  {
   "score": 14,
   "id": "dimu6kn",
   "pid": "t1_dimnibm",
   "date": "2017-06-08 09:51:28",
   "depth": 1,
   "text": "Because a Vietnamese group has translated more than an English group."
  },
  {
   "score": 1,
   "id": "diommza",
   "pid": "t1_dimu6kn",
   "date": "2017-06-09 10:52:19",
   "depth": 2,
   "text": "yep the amount translated depends heavily on the established community, were lucky to speak a widely used language and to have close ties with Japan itself.  I think the Spanish & Arabic anime community's have been fairly successful as well."
  },
  {
   "score": 1,
   "id": "dimurj2",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 10:00:59",
   "depth": 0,
   "text": "oh shit this is so hype cant wait for next week "
  },
  {
   "score": 1,
   "id": "din1fho",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 11:53:04",
   "depth": 0,
   "text": "\"My entire body are swords\"\n\n - somebody...."
  },
  {
   "score": 1,
   "id": "djenfjz",
   "pid": "t1_din1fho",
   "date": "2017-06-25 22:34:07",
   "depth": 1,
   "text": "Is that p a sword too?"
  },
  {
   "score": 1,
   "id": "dincg7m",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 15:12:11",
   "depth": 0,
   "text": "Man, the tone of these episodes compared to the start..."
  },
  {
   "score": 1,
   "id": "dinw7a7",
   "pid": "t3_6fxq5r",
   "date": "2017-06-08 22:32:11",
   "depth": 0,
   "text": "Yo I didn't know I signed up for this intense shit. Thought I was going to get my run of the mill harem. Damn I love Amou. Her cold blooded fighting really makes you feel fear. She is one scary hot woman. She has awoken my fear boner.\n\nLove how Inaba became so flustered because of Normura. She is so adorable. Can't wait for the next episode. Amou vs Normura I'm so hyped."
  },
  {
   "score": 1,
   "id": "dip1jqk",
   "pid": "t3_6fxq5r",
   "date": "2017-06-09 15:45:59",
   "depth": 0,
   "text": "MC game strong. He got to her head even without his charming looks. Though obviously at a disadvantage, he can't use his meat sword, the way he did with Satori. \n\nHo ho. This just keeps on getting edgier. Love it. \n\nApparently loli power was not enough to stop Amou. "
  },
  {
   "score": 1,
   "id": "diqxqa8",
   "pid": "t3_6fxq5r",
   "date": "2017-06-11 00:55:43",
   "depth": 0,
   "text": "So this is how it feels to be the guy in yandere simulator."
  },
  {
   "score": 1,
   "id": "dirk0xr",
   "pid": "t3_6fxq5r",
   "date": "2017-06-11 12:34:13",
   "depth": 0,
   "text": "i feel a esdeath vibe from amou somehow....\n"
  },
  {
   "score": 1,
   "id": "diu3a0m",
   "pid": "t3_6fxq5r",
   "date": "2017-06-13 01:12:26",
   "depth": 0,
   "text": "I'm late to the party but damn I didn't know there were more than one Kyoutouryuu users out there"
  }
 ]
}