{
 "score": 308,
 "id": "6925e2",
 "num_comments": 92,
 "date": "2017-05-03 11:22:08",
 "comments": [
  {
   "score": 89,
   "id": "dh35obu",
   "pid": "t3_6925e2",
   "date": "2017-05-03 11:59:58",
   "depth": 0,
   "text": "You know the action scenes would be more enjoyable if they didn't have to explain everything that happens. And while calling your attacks is nice and all, they didn't need to do for *every* move.\n\nDespite that I still enjoyed that fight scene between Rin and ~~Chitoge~~ Warabi. I love seeing more methodical fights like these even if it isn't as flashy as the fast-paced stuff that most action shows use.\n\nSatori looks like a lot of fun with her small but quick changing expressions in the OP. Looking forward to that fight when it comes.\n"
  },
  {
   "score": 1,
   "id": "dh4kcul",
   "pid": "t1_dh35obu",
   "date": "2017-05-04 09:22:06",
   "depth": 1,
   "text": "Try trinity seven"
  },
  {
   "score": 1,
   "id": "dh4mqiq",
   "pid": "t1_dh4kcul",
   "date": "2017-05-04 10:04:27",
   "depth": 2,
   "text": "Already on MAL but I appreciate the sentiment."
  },
  {
   "score": 2,
   "id": "dh4n6or",
   "pid": "t1_dh4mqiq",
   "date": "2017-05-04 10:12:31",
   "depth": 3,
   "text": "I meant it as a joke. You think this anime is bad? Trinity seven is much worse. \n\nThey will literally have battles where they just talk about every move they do. Its very frustrating to watch. They do a punch talk about it for 2 minutes, walk around, then do it all over again."
  },
  {
   "score": 1,
   "id": "dh4ndaa",
   "pid": "t1_dh4n6or",
   "date": "2017-05-04 10:15:48",
   "depth": 4,
   "text": "Whelp that wooshed right over me. I get you now."
  },
  {
   "score": 3,
   "id": "dh43bko",
   "pid": "t1_dh35obu",
   "date": "2017-05-04 01:19:16",
   "depth": 1,
   "text": "> You know the action scenes would be more enjoyable if they didn't have to explain everything that happens. And while calling your attacks is nice and all, they didn't need to do for every move.\n\nThis is just a thing in anime, since time immemorial. So it's kind of a take it or leave it kind of thing. It extends from the romantic notions of martial arts going back centuries and generations, where the naming, practicing, and mastering of [katas](https://en.wikipedia.org/wiki/Kata) are venerated and celebrated. Most Japanese fans eat this shit up. Personally, I think it's neat. It just wouldn't be anime without it."
  },
  {
   "score": 3,
   "id": "dh4234l",
   "pid": "t1_dh35obu",
   "date": "2017-05-04 00:19:02",
   "depth": 1,
   "text": "I'm glad I'm not the only who noticed how heavily they were laying that on this episode.  Every other shot, I swear.  While not a deal breaker or anything, I'll admit I found it distracting. \n\n&nbsp;\n\nTo be honest, I've never really been a fan of the hidden techniques/styles from ancient school's thing.  Using signature moves is fine and all, but calling them out/naming them every time they appear...it kinda breaks the immersion, y'know?"
  },
  {
   "score": 3,
   "id": "dh36dfq",
   "pid": "t1_dh35obu",
   "date": "2017-05-03 12:12:01",
   "depth": 1,
   "text": "> Satori looks like a lot of fun\n\nOh yeah as a manga reader her fight ought to be ( ͡° ͜ʖ ͡°)"
  },
  {
   "score": 38,
   "id": "dh37r64",
   "pid": "t1_dh35obu",
   "date": "2017-05-03 12:36:30",
   "depth": 1,
   "text": "The explanations are a bit more useful (and funny) in the manga, but the anime seems to skimp on all the relevant details. Nomura's fight with the bear involved a bit more strategy and hilarious build-up than was shown, and, er... French girl's final move was more elaborate than just jumping down the stairs and magically winning. The point of the narration was to make sense of those silly situations, but the anime mostly employs it for useless exposition.\n\nThat said, I don't actually dislike it. It's got that really campy martial arts movie feeling to it, with everything somehow being derived from some ancient fighting style and infinite training, in order to achieve really shoddy choreography and special effects. I could imagine some really obvious harness holding up Warabi while she was doing her spinning attack. "
  },
  {
   "score": 10,
   "id": "dh3f1vq",
   "pid": "t1_dh37r64",
   "date": "2017-05-03 14:47:59",
   "depth": 2,
   "text": "Let's be honest, The manga is still pretty campy when it comes to the fights even if it's slightly more strategic\n\nIt's why I love it"
  },
  {
   "score": 3,
   "id": "dh3h8wb",
   "pid": "t1_dh3f1vq",
   "date": "2017-05-03 15:33:40",
   "depth": 3,
   "text": "Which is why I don't dislike the approach the anime is taking. They're different kinds of camp fit for different forms of media. (The \"strategy\" and \"technique\" against all reasonable odds is still a silly trope, after all.)"
  },
  {
   "score": 5,
   "id": "dh3hv36",
   "pid": "t1_dh3h8wb",
   "date": "2017-05-03 15:46:08",
   "depth": 4,
   "text": "I think it's because it maintains the tone that the manga does\n\nWe have a boxing bear and a ballerina with over the top martial arts style thrown into a blender with comedy \n\nIt's works because it's dumb and campy, Kinda like Adam West Batman "
  },
  {
   "score": 44,
   "id": "dh359di",
   "pid": "t3_6925e2",
   "date": "2017-05-03 11:52:37",
   "depth": 0,
   "text": "[Where did you get so many clones???](http://i.imgur.com/uwiQVxx.jpg)\n\nAlso curious who is gonna explain everything once they are fighting against white hair girl..."
  },
  {
   "score": 11,
   "id": "dh3ghzo",
   "pid": "t1_dh359di",
   "date": "2017-05-03 15:17:50",
   "depth": 1,
   "text": "Mandalorians?"
  },
  {
   "score": 5,
   "id": "dh42xgj",
   "pid": "t1_dh3ghzo",
   "date": "2017-05-04 00:59:17",
   "depth": 2,
   "text": "Manda-lolis"
  },
  {
   "score": 14,
   "id": "dh35sqo",
   "pid": "t1_dh359di",
   "date": "2017-05-03 12:02:02",
   "depth": 1,
   "text": "They might also have a loli, slightly older, and an adult version as well. \n\n[](#misakaheh)"
  },
  {
   "score": 28,
   "id": "dh36b9k",
   "pid": "t3_6925e2",
   "date": "2017-05-03 12:10:59",
   "depth": 0,
   "text": "The [Beelzebub vibes](http://i.imgur.com/bxYipNB.jpg) are strong with this one."
  },
  {
   "score": 26,
   "id": "dh39m94",
   "pid": "t3_6925e2",
   "date": "2017-05-03 13:08:25",
   "depth": 0,
   "text": "[i love mary](http://i.imgur.com/mbkpG3O.jpg)"
  },
  {
   "score": 21,
   "id": "dh38h7n",
   "pid": "t3_6925e2",
   "date": "2017-05-03 12:49:10",
   "depth": 0,
   "text": "Man, I **really** like the creepy vibe Satori has going on. "
  },
  {
   "score": -2,
   "id": "dh4f3ln",
   "pid": "t1_dh38h7n",
   "date": "2017-05-04 07:46:01",
   "depth": 1,
   "text": "Meh their is nothing creepy about her. She goes with emotionless eyes tactics (the opponent would not be able to predict movement/attack base on looking at eyes line of sight) which made the dude creep out is kind of meh of him.\n"
  },
  {
   "score": 20,
   "id": "dh35fdp",
   "pid": "t3_6925e2",
   "date": "2017-05-03 11:55:36",
   "depth": 0,
   "text": "Well that's that arc done. I really couldn't stand Warabi's laugh and her low-budget roaring bear. I mean was that really hard to find stock bear footage noise? Or maybe auto tune to make the VA sound deeper? Anyway since she's gonna be added to the harem this isn't the last time we're gonna see her. \n\nWhat I wanna see more of though is Satori. Dead fish eye fighters are the best since they're always the unpredictable ones. Also there's still Tsukuyo and Empress to deal with. "
  },
  {
   "score": 3,
   "id": "dh3kw05",
   "pid": "t1_dh35fdp",
   "date": "2017-05-03 16:49:54",
   "depth": 1,
   "text": "Is the bear VA same as Warabi VA? When the bear roars right after Warabi talking, it just sounds like Warabi did a roar. "
  },
  {
   "score": 3,
   "id": "dh3zicq",
   "pid": "t1_dh3kw05",
   "date": "2017-05-03 22:22:26",
   "depth": 2,
   "text": "Nah, Kyo-bo is voiced by Saki Fujita(Nanami Ao in Yozakura Quartet, Inami Mahiru in Working!!), while Warabi is voiced by Rina Hidaka(Akatsuki Nagisa in Strike the Blood, Kaburagi Kaede in Tiger&Bunny)."
  },
  {
   "score": 3,
   "id": "dh482u2",
   "pid": "t1_dh3zicq",
   "date": "2017-05-04 04:59:40",
   "depth": 3,
   "text": "[dat ao tho](https://i.imgur.com/psTaEMm.gif)"
  },
  {
   "score": 17,
   "id": "dh36bdp",
   "pid": "t1_dh35fdp",
   "date": "2017-05-03 12:11:02",
   "depth": 1,
   "text": "They were going for a low-budget live-action martial arts movie vibe. Hence all of the cameras and boom mics in the background. Hence the awful bear roar, and ridiculous martial art names, and the way she makes an effort to keep spinning, or land in a cool pose or whatever.\n\nIt was intentionally tacky."
  },
  {
   "score": 36,
   "id": "dh369ft",
   "pid": "t1_dh35fdp",
   "date": "2017-05-03 12:10:08",
   "depth": 1,
   "text": "The bear is kind of a running gag tho... [very minor spoilers regarding Warabi & her bear pet](/s \"Like, she had to pretend to be dangerous and unscrupulous so she could keep her bear pet at the school. After Nomura beats them, the bear repeatedly turns into his chibi variant. So his roar wasn't meant to be scary from the start, he's just bluffing, much like Warabi\")"
  },
  {
   "score": 10,
   "id": "dh36eqq",
   "pid": "t1_dh369ft",
   "date": "2017-05-03 12:12:40",
   "depth": 2,
   "text": "Ohhh. Okay if that's the case then the weak ass roar actually males sense then. Nice to know it's not something that was just lazily done."
  },
  {
   "score": 14,
   "id": "dh36iv2",
   "pid": "t1_dh36eqq",
   "date": "2017-05-03 12:14:38",
   "depth": 3,
   "text": "It's a reason why I'm really enjoying the story. Unfortunately the anime will probably catch up with the fantranslated manga in like two weeks but so far the story has quite a lot of stuff going for it in my opinion. Character designs are top notch, comedy is on point and the story actually manages to be kinda interesting."
  },
  {
   "score": 16,
   "id": "dh3we02",
   "pid": "t3_6925e2",
   "date": "2017-05-03 20:54:18",
   "depth": 0,
   "text": "[Cute face of ***DOOOOM***](http://i.imgur.com/CzUY9S0.jpg)"
  },
  {
   "score": 14,
   "id": "dh36oa2",
   "pid": "t3_6925e2",
   "date": "2017-05-03 12:17:09",
   "depth": 0,
   "text": "[That rabbit sculpture](http://imgur.com/a/926HI)"
  },
  {
   "score": 7,
   "id": "dh41dr6",
   "pid": "t1_dh36oa2",
   "date": "2017-05-03 23:48:12",
   "depth": 1,
   "text": "[Its got huge sharp....He can leap about.....Look at the Bones!](https://youtu.be/tgj3nZWtOfA?t=1m)"
  },
  {
   "score": 13,
   "id": "dh3sz4i",
   "pid": "t3_6925e2",
   "date": "2017-05-03 19:36:37",
   "depth": 0,
   "text": "[when you see that ass](http://imgur.com/a/mUkhM)\n"
  },
  {
   "score": 10,
   "id": "dh3ayqx",
   "pid": "t3_6925e2",
   "date": "2017-05-03 13:32:08",
   "depth": 0,
   "text": "Another girl into the harem.  \nAt least they cut down on the annoying laughs.  \nFavorite moment was when the door just randomly broke and the squad was all confused and Green haired girl came"
  },
  {
   "score": 1,
   "id": "dh3w9dw",
   "pid": "t1_dh3ayqx",
   "date": "2017-05-03 20:51:14",
   "depth": 1,
   "text": "> Green haired girl came\n\n[](#noice)"
  },
  {
   "score": 37,
   "id": "dh387k8",
   "pid": "t3_6925e2",
   "date": "2017-05-03 12:44:35",
   "depth": 0,
   "text": "I'm not sure why people aren't the biggest fans of this show. I mean, I can see why, but how many other anime employ punching a bear in the face as a viable strategy?"
  },
  {
   "score": 0,
   "id": "dh3zark",
   "pid": "t1_dh387k8",
   "date": "2017-05-03 22:15:38",
   "depth": 1,
   "text": "One Punch Man OVA."
  },
  {
   "score": 2,
   "id": "dh42djm",
   "pid": "t1_dh387k8",
   "date": "2017-05-04 00:32:07",
   "depth": 1,
   "text": "Stupid-fun shows walk a fine line between the two and, for me at least, this show is currently veering onto the stupid side of things. \n\nPerhaps it will improve later down the line but currently it's taking itself too seriously but with a weaker base than something like Keijo. "
  },
  {
   "score": 29,
   "id": "dh39iwe",
   "pid": "t1_dh387k8",
   "date": "2017-05-03 13:06:44",
   "depth": 1,
   "text": "Hajime no Ippo?"
  },
  {
   "score": 29,
   "id": "dh394gt",
   "pid": "t1_dh387k8",
   "date": "2017-05-03 12:59:57",
   "depth": 1,
   "text": "Stupid fun shows rarely achieve high levels of popularity. I personally enjoy most of them."
  },
  {
   "score": 12,
   "id": "dh3ox82",
   "pid": "t1_dh394gt",
   "date": "2017-05-03 18:11:54",
   "depth": 2,
   "text": "couldn't \"akashic records\" also be considered a \"stupid fun show\" ? It has a rather high popularity considering the bad reputation magic/harem/school shows usually have.  I guess the fact that it is more comedic and more \"grounded\" gives it a better reception."
  },
  {
   "score": 10,
   "id": "dh41syh",
   "pid": "t1_dh3ox82",
   "date": "2017-05-04 00:06:25",
   "depth": 3,
   "text": "It takes itself more seriously than Machiavellianism, so is more of a typical school battle harem. It's just that the protagonist is fun. "
  },
  {
   "score": 8,
   "id": "dh3tr4u",
   "pid": "t3_6925e2",
   "date": "2017-05-03 19:53:25",
   "depth": 0,
   "text": "[But it's on the Internet. It must be true.](http://imgur.com/a/VmxrV)"
  },
  {
   "score": 1,
   "id": "dh418o5",
   "pid": "t1_dh3tr4u",
   "date": "2017-05-03 23:42:12",
   "depth": 1,
   "text": "I mean what he read on the internet was right. Since he comments later about how everyone knows that a bears weakness is the snout. "
  },
  {
   "score": 1,
   "id": "dh4dzxz",
   "pid": "t1_dh418o5",
   "date": "2017-05-04 07:24:46",
   "depth": 2,
   "text": "LOL any animal have snout would have weakness is the snout."
  },
  {
   "score": 6,
   "id": "dh366wd",
   "pid": "t3_6925e2",
   "date": "2017-05-03 12:08:54",
   "depth": 0,
   "text": "I suspect Kyo-bo trained under the [fist fighting champion of Skellige](https://youtu.be/6WlxCxP6VUs)."
  },
  {
   "score": 7,
   "id": "dh3jioa",
   "pid": "t3_6925e2",
   "date": "2017-05-03 16:21:23",
   "depth": 0,
   "text": "Isn't there a single faculty member in this school? Guess everyone doesn't need to attend lessons either. XD\n\n"
  },
  {
   "score": -10,
   "id": "dh4ekdb",
   "pid": "t1_dh3jioa",
   "date": "2017-05-04 07:35:47",
   "depth": 1,
   "text": "Nah, the faculty member just ignore them nuts case sjw cause if any of them say any thing those bitch would just screams \"RAPE! Sensei is raping me!\" So they keep doing everything as scheduled, it's the female student that chose to attend the lessons or not."
  },
  {
   "score": 1,
   "id": "dh9jz0t",
   "pid": "t1_dh3jioa",
   "date": "2017-05-07 17:46:10",
   "depth": 1,
   "text": "They have classes, Nomura just decides not to go because he's a delinquent and is making a point."
  },
  {
   "score": 1,
   "id": "dh9xu3r",
   "pid": "t1_dh9jz0t",
   "date": "2017-05-08 00:22:05",
   "depth": 2,
   "text": "Well, I would too, if I had to deal with these girls every morning. Between the whole correction thing, and having to fight them every time you open the class doors, it definitely would get annoying."
  },
  {
   "score": 8,
   "id": "dh40016",
   "pid": "t3_6925e2",
   "date": "2017-05-03 22:38:48",
   "depth": 0,
   "text": "\"Totally straight punch!\"\n\nHaven't laughed like that in a while tbh"
  },
  {
   "score": 14,
   "id": "dh3dlrw",
   "pid": "t3_6925e2",
   "date": "2017-05-03 14:20:31",
   "depth": 0,
   "text": "I'm really digging the op, wow."
  },
  {
   "score": 3,
   "id": "dh3pfy4",
   "pid": "t1_dh3dlrw",
   "date": "2017-05-03 18:22:39",
   "depth": 1,
   "text": "Me too, especially the smooth fight sequences. and the little animations focusing in each character instead of just showing still drawings with some names."
  },
  {
   "score": 6,
   "id": "dh3q0dv",
   "pid": "t3_6925e2",
   "date": "2017-05-03 18:34:42",
   "depth": 0,
   "text": "Man, I can't really decide who is best girl out of Rin and Mary... OT3?"
  },
  {
   "score": 2,
   "id": "dh4dwrd",
   "pid": "t1_dh3q0dv",
   "date": "2017-05-04 07:23:02",
   "depth": 1,
   "text": "Definitely OT3 for me. But Rin will always be first and Mary will always be second."
  },
  {
   "score": 4,
   "id": "dh3tjfq",
   "pid": "t1_dh3q0dv",
   "date": "2017-05-03 19:48:40",
   "depth": 1,
   "text": "Nomura x his lady boyfriend"
  },
  {
   "score": 3,
   "id": "dh3dn9v",
   "pid": "t3_6925e2",
   "date": "2017-05-03 14:21:20",
   "depth": 0,
   "text": "Haven't watched the episode yet, but who's next on the list, green haired girl or white haired girl? They've interested me fro the start. Hope they're badass. These first three girls have been very underwhelming for me. "
  },
  {
   "score": 1,
   "id": "dh3i3ki",
   "pid": "t1_dh3dn9v",
   "date": "2017-05-03 15:50:56",
   "depth": 1,
   "text": "[Manga](/s \"according to the manga, green haired is next. And it's still going through that arc.\")\n\n"
  },
  {
   "score": 3,
   "id": "dh3f4q7",
   "pid": "t1_dh3dn9v",
   "date": "2017-05-03 14:49:35",
   "depth": 1,
   "text": "Green is next, It's going to be interesting to see how the sub takes it\n\nVery different format "
  },
  {
   "score": 3,
   "id": "dh3npbx",
   "pid": "t3_6925e2",
   "date": "2017-05-03 17:47:33",
   "depth": 0,
   "text": "Can't wait for next week! I dig it!"
  },
  {
   "score": 5,
   "id": "dh3p5t6",
   "pid": "t3_6925e2",
   "date": "2017-05-03 18:16:47",
   "depth": 0,
   "text": "I've realized that I thoroughly enjoy any anime where names of attacks appear in big letters on the screen."
  },
  {
   "score": 3,
   "id": "dh4lwnn",
   "pid": "t1_dh3p5t6",
   "date": "2017-05-04 09:49:42",
   "depth": 1,
   "text": "You need to watch NEEDLESS then."
  },
  {
   "score": 4,
   "id": "dh4548k",
   "pid": "t1_dh3p5t6",
   "date": "2017-05-04 02:54:11",
   "depth": 1,
   "text": "Kill la Kill and Kekkai Sensen come to mind. What others are there?"
  },
  {
   "score": 2,
   "id": "dha9boz",
   "pid": "t1_dh4548k",
   "date": "2017-05-08 07:25:42",
   "depth": 2,
   "text": "Oldie but goldie: Fist of the North Star.\n\nOr at least I think they appear on the screen, but at the very least they're shouted loudly by a narrator."
  },
  {
   "score": 3,
   "id": "dh48zvj",
   "pid": "t1_dh4548k",
   "date": "2017-05-04 05:27:45",
   "depth": 2,
   "text": "Symphogear."
  },
  {
   "score": 5,
   "id": "dh38sv2",
   "pid": "t3_6925e2",
   "date": "2017-05-03 12:54:30",
   "depth": 0,
   "text": "> Thirteenth Warabimpics\n\nAnd i also recall her saying that she has been on the Five Swords for a long time. But she looks like 13-14 at most. Just how old is this chick!?"
  },
  {
   "score": 16,
   "id": "dh39pga",
   "pid": "t1_dh38sv2",
   "date": "2017-05-03 13:09:57",
   "depth": 1,
   "text": "The Warabimpics are probably not a annual thing. Seems more of a random occurrence."
  },
  {
   "score": 0,
   "id": "dh3aoud",
   "pid": "t1_dh39pga",
   "date": "2017-05-03 13:27:16",
   "depth": 2,
   "text": "Well, i guess i can put the Warabimpics aside. But what about when she said she's stayed on the Five Swords for quite some time? Is it also an exaggeration?"
  },
  {
   "score": 8,
   "id": "dh3baur",
   "pid": "t1_dh3aoud",
   "date": "2017-05-03 13:38:13",
   "depth": 3,
   "text": "I believe she's actually the oldest one of the 5. It could simply be that she is the only sempai from the old 5 swords if she became one as a freshman. Don't think she Van Wilder'd it."
  },
  {
   "score": 0,
   "id": "dh3bwf5",
   "pid": "t1_dh3baur",
   "date": "2017-05-03 13:48:47",
   "depth": 4,
   "text": "Ahh, the ol' \"looks young but actually pretty old\" anime trope. I should've seen that coming. Now i'm interested in seeing her backstory. Man, this show is making me like the blondes so much"
  },
  {
   "score": 2,
   "id": "dh40y5d",
   "pid": "t3_6925e2",
   "date": "2017-05-03 23:29:40",
   "depth": 0,
   "text": "The ojou laugh is annoying af but I love it. "
  },
  {
   "score": 2,
   "id": "dh4ecop",
   "pid": "t1_dh40y5d",
   "date": "2017-05-04 07:31:42",
   "depth": 1,
   "text": "No. Pretty sure it's just annoying and needs to stop."
  },
  {
   "score": 2,
   "id": "dh368w3",
   "pid": "t3_6925e2",
   "date": "2017-05-03 12:09:51",
   "depth": 0,
   "text": "I usually don't like the younger-in-appearance women in these shows, but Warabi is great.\n\nShe just seems like she's constantly having so much fun.\n\nAlso, while I haven't watched any Chinese martial arts films in the last couple decades, something about \"Saiaku no Kenpo. Sono na wa 'Kuma Kenpo!\" cracked me up."
  },
  {
   "score": 1,
   "id": "dh3fzaj",
   "pid": "t3_6925e2",
   "date": "2017-05-03 15:06:51",
   "depth": 0,
   "text": "Kyo-Bo still best bear!"
  },
  {
   "score": 1,
   "id": "dh3g10c",
   "pid": "t3_6925e2",
   "date": "2017-05-03 15:07:52",
   "depth": 0,
   "text": "Well that's the end of this arc. I'm so excited for the next one and I'm even more excited for what happens after that. I hope that the next few episodes are done well."
  },
  {
   "score": 1,
   "id": "dh3oy3h",
   "pid": "t3_6925e2",
   "date": "2017-05-03 18:12:24",
   "depth": 0,
   "text": "These last two episodes have been distasteful, thank God I could skip certain parts"
  },
  {
   "score": 1,
   "id": "dh3q08n",
   "pid": "t3_6925e2",
   "date": "2017-05-03 18:34:37",
   "depth": 0,
   "text": "I'm enjoying this more than I should, and it's like the... third anime this season that makes me think that.\n\nI get the point of the fights being like old low budget karate movies, with the ougi names and constant \"still, but moving\" pannels, but that is indeed something that worked better in the manga (assuming without reading it) and the format should give more space to silly long explanations that were a bit lacking this episode.\n\nBesides from that, third girl sure got more characterization with her ~~sumo~~ BOXING BEAR and her ballerina/circus-like battle moves. It would've been better if they went there from the start. \n\nThe power levels are kind-of correct. One of *the* Five Swords can deal with three shitty underlings, and two Minor Swords can sure Musou-slash 30 clones easily; sounds about right. I'd like a bit more of development from the Three Senpai Musketeers, tho.\n\nEven if it's funny to see everything being turned into an ougi, there's times when it's too much, the animation could at least improve and let those moments shine instead of using them as a tool.\n\nSomething about Satori as a wild card was pretty cool, and by other comments I'm hyped to see her fight. Waiting for next week! \n\nEdit: Forgot to mention, Satori's speech was coordinated with the OST, and that was beautiful, gave her an even more creepy aura."
  },
  {
   "score": 1,
   "id": "dh3qdau",
   "pid": "t1_dh3q08n",
   "date": "2017-05-03 18:42:12",
   "depth": 1,
   "text": ">I'm enjoying this more than I should, and it's like the... third anime this season that makes me think that.\n\nWhat are the other two? I'm of the same opinion, however I've wrote the majority of airing anime off this season - curious whether I should try some of them. "
  },
  {
   "score": 2,
   "id": "dh3qnwy",
   "pid": "t1_dh3qdau",
   "date": "2017-05-03 18:48:32",
   "depth": 2,
   "text": "Rokudenashi was better than expected, and Tsugumomo is getting better. This season is full of surprises."
  },
  {
   "score": 2,
   "id": "dh3tedl",
   "pid": "t1_dh3qnwy",
   "date": "2017-05-03 19:45:42",
   "depth": 3,
   "text": "I'm watching those shows too, and I agree there are better than expected. Although, out of those three battle anime, Tsugumomos main character is obviously more childish and is not as cool as the MC of Rokudenashi and this show."
  },
  {
   "score": 1,
   "id": "dh3u5w2",
   "pid": "t1_dh3tedl",
   "date": "2017-05-03 20:02:45",
   "depth": 4,
   "text": "Then you have Clockwork Planet's MC, who is basically Mineta."
  },
  {
   "score": 3,
   "id": "dh3w92i",
   "pid": "t1_dh3u5w2",
   "date": "2017-05-03 20:51:03",
   "depth": 5,
   "text": "The only series where the phrase \"Show me your clock\" would be appropriate"
  },
  {
   "score": 1,
   "id": "dh47srh",
   "pid": "t1_dh3w92i",
   "date": "2017-05-04 04:50:28",
   "depth": 6,
   "text": "i giggled"
  },
  {
   "score": 1,
   "id": "dh419yy",
   "pid": "t3_6925e2",
   "date": "2017-05-03 23:43:43",
   "depth": 0,
   "text": "Hmmm.... So based on the intro it seems we never got the information that the games are over once they get one win (each?) but they weren't supposed to have a chance to win. \n\nAlso, we lost out on her yelling about the fact that her games she had planned weren't going to be used."
  },
  {
   "score": 1,
   "id": "dh431xr",
   "pid": "t3_6925e2",
   "date": "2017-05-04 01:05:31",
   "depth": 0,
   "text": "kyo-bo best gril.\n\nalso i didn't expect that the blondie will be defeated by masked girl instead of nomura"
  },
  {
   "score": 1,
   "id": "dh44gjt",
   "pid": "t3_6925e2",
   "date": "2017-05-04 02:19:09",
   "depth": 0,
   "text": "This is streamed on Amazon Prime through Anime Strike.  I appreciate the effort put into these posts though, not trying to be rude or anything, just want to let everyone know."
  },
  {
   "score": 1,
   "id": "dh4m05s",
   "pid": "t3_6925e2",
   "date": "2017-05-04 09:51:25",
   "depth": 0,
   "text": "This actually annoys me more than making me enjoy it"
  },
  {
   "score": 1,
   "id": "dh4yf29",
   "pid": "t3_6925e2",
   "date": "2017-05-04 13:30:14",
   "depth": 0,
   "text": "Umu. I think it's better than last week, but still quite lacking, or rather, it's overflowing with harem elements. Harem itself isn't bad, but I think here it's done bad. \n\nOh, and I actually thought that blonde loli's first technique was just throwing that dagger and then doing that circle slash, for show.\n\nBy the way, would you mind me shamelessly self-promoting my excuse of a blog, which would be honoured by your visits, by linking my personal comment of this episode?\n\nWell, I'll do it anyways [here](https://animemangalnvn.wordpress.com/2017/05/04/regarding-busou-shoujo-macchiavellianism-episode-5/). Expect many pictures though."
  },
  {
   "score": 1,
   "id": "dh3lio7",
   "pid": "t3_6925e2",
   "date": "2017-05-03 17:02:29",
   "depth": 0,
   "text": "This anime is ridiculous and bad to the point where it actually becomes fun and enjoyable to watch."
  },
  {
   "score": 9,
   "id": "dh3qa62",
   "pid": "t1_dh3lio7",
   "date": "2017-05-03 18:40:25",
   "depth": 1,
   "text": "I don't think it's bad at all. It's a ridiculous, campy ride, and it makes no qualms about that. Sure, it's not exactly intellectually stimulating, but it's equally as vapid as the implied-yuri SoL this subreddit loves.\n\nThe show tries to be fun, and it succeeds. "
  },
  {
   "score": 2,
   "id": "dh3qpff",
   "pid": "t1_dh3qa62",
   "date": "2017-05-03 18:49:23",
   "depth": 2,
   "text": "Yeah, that's kind of what I was trying to say."
  },
  {
   "score": 2,
   "id": "dh3qy03",
   "pid": "t1_dh3qpff",
   "date": "2017-05-03 18:54:27",
   "depth": 3,
   "text": "I suppose, but bad implies that you tried to do something and failed. In this case, the author tried to do something and succeeded. I would say that Mars of Destruction is bad to the point of being funny, being it designed to be serious, but fails."
  },
  {
   "score": 0,
   "id": "dh6kpq6",
   "pid": "t3_6925e2",
   "date": "2017-05-05 14:08:33",
   "depth": 0,
   "text": "Ah the good ol' \"Thank you\" MC rallying cry. 100% of the time works every time. \n\nLooks like the new girl isn't joining the harem yet, which is good. I hope never to hear her ohyohyo ever again. But i know that's too much to ask.\n\nAt least, kill of the bear. Please? Those bear sounds give me cringe pains. "
  }
 ]
}