{
 "score": 869,
 "id": "663wur",
 "num_comments": 374,
 "date": "2017-04-18 09:29:02",
 "comments": [
  {
   "score": 111,
   "id": "dgfe4rt",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:50:45",
   "depth": 0,
   "text": "As soon as I saw [this scene](http://i.imgur.com/efSmxwW.jpg), I knew something would be fucked up in their world. God bless these kids."
  },
  {
   "score": 1,
   "id": "dgfofqf",
   "pid": "t1_dgfe4rt",
   "date": "2017-04-18 12:54:26",
   "depth": 1,
   "text": "He didn't even seem to give it too much thinking at first when she said she fell and laughed. Hearing the other girls was quite a brutal way to discover how different they are."
  },
  {
   "score": 36,
   "id": "dgfegfg",
   "pid": "t1_dgfe4rt",
   "date": "2017-04-18 09:56:24",
   "depth": 1,
   "text": "Reminded me of [Senki Zesshou Symphogear spoilers.](http://i.imgur.com/UbSPXZf.jpg)"
  },
  {
   "score": 1,
   "id": "dghxgs1",
   "pid": "t1_dgfegfg",
   "date": "2017-04-19 19:05:06",
   "depth": 2,
   "text": "Unpopular opinion but I miss when the stakes seemed higher for Symphogear in the first and some of the second season. Everything becomes rainbow puke friendship fixes everything and kinda ruined it for me. "
  },
  {
   "score": 11,
   "id": "dgff95r",
   "pid": "t1_dgfegfg",
   "date": "2017-04-18 10:10:38",
   "depth": 2,
   "text": "I mean, if you didn't want it to be spoilers you could link a very similar shot from the first 5 min of the first episode."
  },
  {
   "score": 14,
   "id": "dgftfru",
   "pid": "t1_dgff95r",
   "date": "2017-04-18 14:21:31",
   "depth": 3,
   "text": "Yeah but that's the memey one."
  },
  {
   "score": 4,
   "id": "dgg50w2",
   "pid": "t1_dgftfru",
   "date": "2017-04-18 18:13:10",
   "depth": 4,
   "text": "Please send me this meme I need it"
  },
  {
   "score": 11,
   "id": "dgg7z4c",
   "pid": "t1_dgg50w2",
   "date": "2017-04-18 19:09:12",
   "depth": 5,
   "text": "[Jam](http://www.funnyjunk.com/channel/animemanga/They+stole+the+symphogear+s+talent/BLBYLOY#eeb865_5458416)\n\nSpoilers. "
  },
  {
   "score": 259,
   "id": "dgfe5vw",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:51:19",
   "depth": 0,
   "text": "Another really good episode that has a lot of things that I appreciate.\n\nI like how the main character doesn't react hard to anything. Upon hearing about the girls as weapons, he doesn't suddenly break down mentally or even really change his attitude towards them; he feels some sort of negativity about it but also seems to have an understanding of it. When Ithea tries teasing or provoking him, he doesn't immediately go \"EHHHHHHHH?!\" and try stammering around it, he just kinda goes with it. The fanservice is there, but it's tasteful--maybe the massage was provoking with the voice acting, but at least it has a justification that was honestly both hilarious and clever to me. And I'm quickly getting on board with a romance between Chthulu-chan and Willem; it seems only impulsive since Chtholly believes she will die (uh.... yeah, can we not?), but the two have great chemistry together so I can easily believe it.\n\nIt's all good, I'm still really loving it."
  },
  {
   "score": 1,
   "id": "dgfitb5",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-18 11:13:35",
   "depth": 1,
   "text": "> I like how the main character doesn't react hard to anything\n\n>he doesn't immediately go \"EHHHHHHHH?!\" and try stammering around it\n\nI like both premises, it's refreshing to see an MC who's not afraid to interact with girls for a change. \n\nAlthough I'm not to sure how to feel when he's a bit apathetic in cases like the little girl that falls down the cliff. She stands up with her face bleeding and he just lets her stumble her way up to reach the ball.\n"
  },
  {
   "score": 1,
   "id": "dgibjbq",
   "pid": "t1_dgfitb5",
   "date": "2017-04-20 02:34:38",
   "depth": 2,
   "text": "Right after that, the girl is shown already treated in the infirmary.  \nHe was shocked by it precisely because of his concern for them. And right after it he [LN](/s \"stopped the game and took her to the infirmary.\")"
  },
  {
   "score": 2,
   "id": "dggztvn",
   "pid": "t1_dgfitb5",
   "date": "2017-04-19 08:39:21",
   "depth": 2,
   "text": "He was in shock at her reaction. Obviously since the girl wound up in the infirmary, he did something about the situation. He didn't just let the girl go back to playing."
  },
  {
   "score": 27,
   "id": "dgfizgd",
   "pid": "t1_dgfitb5",
   "date": "2017-04-18 11:16:39",
   "depth": 2,
   "text": "I wouldn't call it apathy, at this point he just realizes that it's normal (to them) and he can't really do anything to change it, even if he wanted to."
  },
  {
   "score": -2,
   "id": "dgfj6s3",
   "pid": "t1_dgfizgd",
   "date": "2017-04-18 11:20:16",
   "depth": 3,
   "text": "He could have stopped the girl to prevent further injury and get the ball himself. Show some real human emotion, not just sit there shocked like a cliche manga character."
  },
  {
   "score": 16,
   "id": "dgfngwh",
   "pid": "t1_dgfj6s3",
   "date": "2017-04-18 12:37:10",
   "depth": 4,
   "text": "I looked as it as he was trying to figure out what was going on. Since the girls were treating it as if it was normal. I realize we'd expect an MC to go rushing after her and trying to comfort her, but he could know that rushing into action could make things worse. The shock didn't seem cliche at all to me."
  },
  {
   "score": 1,
   "id": "dgibkon",
   "pid": "t1_dgfngwh",
   "date": "2017-04-20 02:36:40",
   "depth": 5,
   "text": "He did *rush* to stop her right as he could.  \nBut yeah, that shock was very much understandable. On the contrary, it would look weird if he wouldn't be weirded out by that situation."
  },
  {
   "score": 15,
   "id": "dgfjdn4",
   "pid": "t1_dgfizgd",
   "date": "2017-04-18 11:23:37",
   "depth": 3,
   "text": "That, and he was obviously a \"weapon\" of some type himself in the past. Would affect his perspective just a bit, I think."
  },
  {
   "score": 1,
   "id": "dhe3cwn",
   "pid": "t1_dgfe5vw",
   "date": "2017-05-10 13:33:38",
   "depth": 1,
   "text": "pro-tip: its spelled Cthulhu if you were going for that"
  },
  {
   "score": 1,
   "id": "dggfe3z",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-18 21:55:46",
   "depth": 1,
   "text": "> And I'm quickly getting on board with a romance between Chthulu-chan and Willem; it seems only impulsive since Chtholly believes she will die (uh.... yeah, can we not?), but the two have great chemistry together so I can easily believe it.\n\n>since Chtholly believes she will die (uh.... yeah, can we not?)\n\nTook the words out of my mouth. Just going off the OP, ED and that Chtholly's listed as a main character, I'm assuming she'll survive that island 5 attack somehow, though I'm nowhere near as confident she'll last through the final credit roll."
  },
  {
   "score": 6,
   "id": "dgftwi2",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-18 14:30:10",
   "depth": 1,
   "text": "It's just that he's an adult.  Most of the shows you're used to have teens.  (In fact you can contrast his reactions to Chtholly's own.)"
  },
  {
   "score": 1,
   "id": "dgibg8b",
   "pid": "t1_dgftwi2",
   "date": "2017-04-20 02:30:00",
   "depth": 2,
   "text": "You could say that he's both as he's 18. x)"
  },
  {
   "score": 10,
   "id": "dgftlhy",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-18 14:24:26",
   "depth": 1,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dggjtbd",
   "pid": "t1_dgftlhy",
   "date": "2017-04-19 00:42:16",
   "depth": 2,
   "text": "Yeah, can't say I'd care much about anything were that to happen to me. Total freedom not to give a shit."
  },
  {
   "score": 12,
   "id": "dgg2f55",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-18 17:23:20",
   "depth": 1,
   "text": "He's an adult.  That's the difference and why it seems almost out of place in anime.  Ya know, since most anime deal with kids still in school, generally under 18 years old."
  },
  {
   "score": 2,
   "id": "dgibekv",
   "pid": "t1_dgg2f55",
   "date": "2017-04-20 02:27:31",
   "depth": 2,
   "text": "He's 18, so that doesn't really excuse all the other ones. ¯\\\\ _(ツ) _/¯"
  },
  {
   "score": 1,
   "id": "dgic2s8",
   "pid": "t1_dgibekv",
   "date": "2017-04-20 03:03:20",
   "depth": 3,
   "text": "Not buying it.  Plus, he has seen some shit, so even if he was 18 he's more mature than his age because of what he's been through."
  },
  {
   "score": 1,
   "id": "dgica47",
   "pid": "t1_dgic2s8",
   "date": "2017-04-20 03:13:34",
   "depth": 4,
   "text": "True, that he was. But he really is 18, even if he wasn't born 18 years ago."
  },
  {
   "score": 46,
   "id": "dgfj36n",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-18 11:18:28",
   "depth": 1,
   "text": "Between this and Demi Chan/Dragon Maid last season, I'm enjoying the current trend of getting a little maturity with my MCs. "
  },
  {
   "score": 27,
   "id": "dgfvj4v",
   "pid": "t1_dgfj36n",
   "date": "2017-04-18 15:01:55",
   "depth": 2,
   "text": "Don't forget about old man Zouroku from this season's Alice to Zouroku. Though he probably doesn't count, if you want just \"a little\" maturity."
  },
  {
   "score": 11,
   "id": "dggbobu",
   "pid": "t1_dgfvj4v",
   "date": "2017-04-18 20:23:56",
   "depth": 3,
   "text": "Also from this season, the MC from Kado."
  },
  {
   "score": 4,
   "id": "dggiwhi",
   "pid": "t1_dggbobu",
   "date": "2017-04-19 00:01:09",
   "depth": 4,
   "text": "This season has surprisingly good new shows despite also being a sequel season."
  },
  {
   "score": 19,
   "id": "dgiaqea",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-20 01:52:03",
   "depth": 1,
   "text": "I like how when he massaged her ( and she made the pretty unneccessary sex noises) he doesn't get red or swallows hard like EVERY other Anime protagonist would.\n\nHe is mature, he knows his duty, he thinks with his head and not with his dick.\n\nBest Boy 2017 confirmed? I mean, after ep2 he is clearly better than the winner of last year's best boy category..."
  },
  {
   "score": 5,
   "id": "dgiav3s",
   "pid": "t1_dgiaqea",
   "date": "2017-04-20 01:58:51",
   "depth": 2,
   "text": "That's a very good point. He kept the scene from being more awkward than it already kinda was."
  },
  {
   "score": 66,
   "id": "dgfeou2",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-18 10:00:28",
   "depth": 1,
   "text": "> with the voice acting\n\nYeah, I find it hard to believe her claim that it hurts when she's making those sounds. That and the \"afterglow.\" It's like I suddenly went over to a hentai.\n\nOther than that though, I really liked the episode, and I agree that his reactions (or lack thereof) are pretty fantastic. It's also nice seeing another guy who sees kids and treats them like what they are (Takahashi-sensei last season was great for this too)."
  },
  {
   "score": 2,
   "id": "dgh0oez",
   "pid": "t1_dgfeou2",
   "date": "2017-04-19 08:54:04",
   "depth": 2,
   "text": ">Other than that though\n\nwtf. Other than the entire episode, that was at its best!"
  },
  {
   "score": 1,
   "id": "dgh3c34",
   "pid": "t1_dgh0oez",
   "date": "2017-04-19 09:40:00",
   "depth": 3,
   "text": "Sorry? I think you're saying that the massage was the best part of the entire episode. I disagree. I really enjoyed the rest of the episode and just not that part. There's no reason both our opinions can't be right though."
  },
  {
   "score": 15,
   "id": "dgfm7du",
   "pid": "t1_dgfeou2",
   "date": "2017-04-18 12:14:35",
   "depth": 2,
   "text": "Yeah, it was a bit much. :/\n\nWhat made it really uncomfortable was that he's an adult and she's 15."
  },
  {
   "score": -2,
   "id": "dgg1pjd",
   "pid": "t1_dgfm7du",
   "date": "2017-04-18 17:09:53",
   "depth": 3,
   "text": "Well he did kind of admit to being a lolicon"
  },
  {
   "score": 1,
   "id": "dgibcs4",
   "pid": "t1_dgg1pjd",
   "date": "2017-04-20 02:24:57",
   "depth": 4,
   "text": "In the novel he does mention from time to time (even by this point in the anime) that people did think that of him multiple times, but he's obviously not."
  },
  {
   "score": 5,
   "id": "dggjs70",
   "pid": "t1_dgg1pjd",
   "date": "2017-04-19 00:40:48",
   "depth": 4,
   "text": "Uh, please don't perpetuate the idea that a man can't be fond of kids without being a pedophile."
  },
  {
   "score": 7,
   "id": "dggixyg",
   "pid": "t1_dgg1pjd",
   "date": "2017-04-19 00:02:57",
   "depth": 4,
   "text": "No, he admitted to being fond of kids. And he has shown it this episode and last. To conflate anything he's done so far in the show with the little ones as something other than fatherly is doing a disservice to the anime. He's not a lolicon by any means."
  },
  {
   "score": 1,
   "id": "dgh2zt6",
   "pid": "t1_dgfm7du",
   "date": "2017-04-19 09:34:05",
   "depth": 3,
   "text": "He's not real and the girl might not be real either. Not sure about it. \n\nThe voice actors are all adults."
  },
  {
   "score": 21,
   "id": "dgfo00f",
   "pid": "t1_dgfm7du",
   "date": "2017-04-18 12:46:38",
   "depth": 3,
   "text": "I think he's like 18 or something, if it helps. Not Statutory by most state laws. "
  },
  {
   "score": 5,
   "id": "dggonv3",
   "pid": "t1_dgfo00f",
   "date": "2017-04-19 04:30:00",
   "depth": 4,
   "text": "Uhh try a little bit older.\n\nDid you see the after-credits scene from EP01?"
  },
  {
   "score": 9,
   "id": "dggp5n2",
   "pid": "t1_dggonv3",
   "date": "2017-04-19 04:46:53",
   "depth": 5,
   "text": "[Spoilers](/s \"He was in stasis for the entire 500 year period, he went in when he was 16, and he's aged to 18 since then.\")"
  },
  {
   "score": 4,
   "id": "dggp8cc",
   "pid": "t1_dggp5n2",
   "date": "2017-04-19 04:49:20",
   "depth": 6,
   "text": "Hmm, he'd almost get away with that in Australia; our age of consent is 16 as long as the partner is under 18... I think. It wasn't exactly relevant for me."
  },
  {
   "score": 21,
   "id": "dgfn5dp",
   "pid": "t1_dgfm7du",
   "date": "2017-04-18 12:31:26",
   "depth": 3,
   "text": "That didn't bother me so much since, despite the way *she* was acting, he wasn't doing anything particularly inappropriate. ... Aside from his timing. While whatever poisoning sounds like the sort of thing you should take care of quickly, it probably isn't best to associate massages with her asking for a kiss in her head. "
  },
  {
   "score": 22,
   "id": "dggcsst",
   "pid": "t1_dgfeou2",
   "date": "2017-04-18 20:49:24",
   "depth": 2,
   "text": "I would normally consider that scene completely creepy, but it was actually weirdly cute. Maybe I'm just crazy but the scene left a smile on my face rather than being grossed out.\n\nThe obviously allusion is to sex, but honestly I consider it to be a bit of a parody, especially considering the noises she was making are also completely comparable to having muscles massaged. The whole scene was both funny and heart-warming, yet obviously a fulfillment of her request while at the same time incorporating his view of her as a child. It may seem odd to say, but the director's handling of the scene honestly impressed me."
  },
  {
   "score": 4,
   "id": "dggnn8q",
   "pid": "t1_dggcsst",
   "date": "2017-04-19 03:51:08",
   "depth": 3,
   "text": "> also completely comparable to having muscles massaged.\n\nReally? -stares- Hm. So maybe this scene comes off differently depending on your experiences with massages. Like, I've never seen or experienced a real life massage where it sounded anything like that, so I can only think of sex when she makes those noises, but since you've experienced those noises in terms of a massage, you can see it as totally cool. Interesting."
  },
  {
   "score": 15,
   "id": "dggy73u",
   "pid": "t1_dggnn8q",
   "date": "2017-04-19 08:10:53",
   "depth": 4,
   "text": "If your muscles are sore when getting a massage, its very difficult not to audibly make noise, especially when the person doing it isn't holding back."
  },
  {
   "score": 1,
   "id": "dgkng6r",
   "pid": "t1_dggy73u",
   "date": "2017-04-21 12:15:06",
   "depth": 5,
   "text": "Im a little late, but can confirm, my mom do muscle massage to people with several cramps (mostly people with parkinson and that stuff), the sound in this episode is what you can expect. Is painfull for them, but after you retire your hands, come some relief so, is not that weird. (Sorry for the bad english) "
  },
  {
   "score": 4,
   "id": "dgh38oh",
   "pid": "t1_dggy73u",
   "date": "2017-04-19 09:38:19",
   "depth": 5,
   "text": "I know that of course, but if it's pain, doesn't it normally sound more... in pain like? The only \"in pain\" people I've ever heard sounding like that are in hentai anime, and it's pretty debatable whether their \"it hurts\" is actually meant to express pain. I'm not saying no real life person in pain could possibly sound like they're on the way to an orgasm (masochists come to mind, but there may be others), but it's certainly outside my realm of experience with pain or massages."
  },
  {
   "score": 3,
   "id": "dgh3jy2",
   "pid": "t1_dgh38oh",
   "date": "2017-04-19 09:43:45",
   "depth": 6,
   "text": "Its a very complex scene with multiple ways to view it. It is obviously a parody of hentai, but there is more beneath the surface. I enjoyed the scene at least and am interested in watching further."
  },
  {
   "score": 1,
   "id": "dgh3tt9",
   "pid": "t1_dgh3jy2",
   "date": "2017-04-19 09:48:30",
   "depth": 7,
   "text": "Well, hopefully we will both enjoy the rest of the season, even if it may or may not be for different reasons \\^_\\^V"
  },
  {
   "score": 2,
   "id": "dgh40ou",
   "pid": "t1_dgh3tt9",
   "date": "2017-04-19 09:51:49",
   "depth": 8,
   "text": "Believe me, if this show goes full lolicon I'm out. That's one thing that I cannot stand."
  },
  {
   "score": 1,
   "id": "dgib9hq",
   "pid": "t1_dgh40ou",
   "date": "2017-04-20 02:20:01",
   "depth": 9,
   "text": "You mean in the literal sense of that word, not just him being very close/friendly with the kids, right ?"
  },
  {
   "score": 1,
   "id": "dgj9jd8",
   "pid": "t1_dgib9hq",
   "date": "2017-04-20 14:49:11",
   "depth": 1,
   "text": "If he starts wanting to put his dick in the children I am not ok with that."
  },
  {
   "score": 1,
   "id": "dgjrq92",
   "pid": "t1_dgj9jd8",
   "date": "2017-04-20 21:23:52",
   "depth": 2,
   "text": "Then I think you've got nothing to worry about."
  },
  {
   "score": 2,
   "id": "dgh47jz",
   "pid": "t1_dgh40ou",
   "date": "2017-04-19 09:55:04",
   "depth": 9,
   "text": "Lmao. And weirdly, despite what you'd think, that would not put me off in the slightest. "
  },
  {
   "score": 8,
   "id": "dghgvo0",
   "pid": "t1_dgh38oh",
   "date": "2017-04-19 13:33:30",
   "depth": 6,
   "text": "Oh its pain, but idk if you've ever had a terribly sore calf or quad and then used a roller massager on them, it hurts so good. And that pain and pleasure can make you grunt or moan...etc. "
  },
  {
   "score": 3,
   "id": "dghlflg",
   "pid": "t1_dghgvo0",
   "date": "2017-04-19 14:58:08",
   "depth": 7,
   "text": ">  if you've ever had a terribly sore calf or quad and then used a roller massager on them\n\nYes.\n\n> it hurts so good\n\nI *kind* of understand. \n\n> And that pain and pleasure can make you grunt or moan...etc.\n\nI am unfortunately the type of person who has to fake any sounds of pleasure or pain (outside of an initial \"god damn it\" for the latter), so I really don't understand this. And guys always sound like they're in pain either way. \n\n.... ... ...\n\n-revelation- \n\nI just realized/remembered. I originally, back a decade ago, thought that girls in hentai always sounded like they were in pain. Over time I've adjusted to assuming that sound was pleasure. Guys though, being not so prevalent in the kinds of hentai/ecchi I watch, continue to sound like they're in pain to me. I always worry that I'm hurting them, and then they're annoyed because they're like \"don't fucking stop *now*.\" \n\nHoly crap. By myself I'm structured to assume all sounds are pain and with hentai/ecchi conditioning I'm structured to assume all sounds are the opposite. There's something really wrong with me either way. Dear god. I mean, I knew I was messed up, but I didn't realize it was to this extent.\n\nCan I go back to not knowing this?"
  },
  {
   "score": 3,
   "id": "dghrpc6",
   "pid": "t1_dghlflg",
   "date": "2017-04-19 17:08:20",
   "depth": 8,
   "text": "Well they probably sounded like they were in pain, 1: because of the Japanese voice range and language vernacular typically associated with hentai. And 2: because many hentai seiyu are amateurs and whatever sounds close directors will take.\n\nTrying taking a look at some consensual oriented JAV and you'll be able to tell the difference between pro and newb.\n"
  },
  {
   "score": 6,
   "id": "dghondm",
   "pid": "t1_dghlflg",
   "date": "2017-04-19 16:04:12",
   "depth": 8,
   "text": ">Dear god. I mean, I knew I was messed up, but I didn't realize it was to this extent.  \n>Can I go back to not knowing this?  \n\n&nbsp;\n\nNah, don't worry about it.  A little miswiring keeps things interesting."
  },
  {
   "score": 1,
   "id": "dghoz62",
   "pid": "t1_dghondm",
   "date": "2017-04-19 16:11:15",
   "depth": 9,
   "text": "I guess it probably helps in S&M play... "
  },
  {
   "score": 27,
   "id": "dgfeubk",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-18 10:03:13",
   "depth": 1,
   "text": "Yeah, the main character's mature attitude is really refreshing."
  },
  {
   "score": 152,
   "id": "dgfguck",
   "pid": "t1_dgfe5vw",
   "date": "2017-04-18 10:38:42",
   "depth": 1,
   "text": "I have a feeling the whole barely reacting thing has something to do with the past we saw last episode. If you've been around for a long time (either 500, or atleast late 20s then some magic time portal shit), long enough to make a live, have a family then have everyone you know and love die maybe his lack of reaction is supposed to get that across.\n\nBut yea, a main character who isnt an annoying teenager is always g ood."
  },
  {
   "score": 0,
   "id": "dghvj5m",
   "pid": "t1_dgfguck",
   "date": "2017-04-19 18:27:21",
   "depth": 2,
   "text": "He's a loser in the worst possible sense for a soldier. \n"
  },
  {
   "score": 1,
   "id": "dgib4y6",
   "pid": "t1_dgfguck",
   "date": "2017-04-20 02:13:15",
   "depth": 2,
   "text": "Feels awkward saying this, but ... Willem is actually 18."
  },
  {
   "score": 1,
   "id": "dggil0l",
   "pid": "t1_dgfguck",
   "date": "2017-04-18 23:47:34",
   "depth": 2,
   "text": "I also apreciate an emotionally normal adult. "
  },
  {
   "score": 15,
   "id": "dgfjb8s",
   "pid": "t1_dgfguck",
   "date": "2017-04-18 11:22:26",
   "depth": 2,
   "text": "Yeah, I feel like it might be a bit immature to conflate depression with maturity, actually.\n\nThough he's obviously both."
  },
  {
   "score": 27,
   "id": "dgfuisr",
   "pid": "t1_dgfjb8s",
   "date": "2017-04-18 14:41:58",
   "depth": 3,
   "text": "That's a long way from depression in my book. Dealing with difficult situations and having the maturity to brush it aside in your mind is something every adult or person in a position of power does.\n\nYou wouldn't say a general who sends hundreds of soldiers off to die is depressed would you? He knows what he's doing. But at the end of the day, the terrible shit in life nobody wants to get done has to be done by someone."
  },
  {
   "score": 5,
   "id": "dgfvxvl",
   "pid": "t1_dgfuisr",
   "date": "2017-04-18 15:10:11",
   "depth": 4,
   "text": "Absolutely.\n\nI meant \"depressed\" in the sense that he seemed to be letting his past failures push him towards inaction-- like if our hypothetical general didn't order people to die, or to retreat, but just sat at his desk with his face in his hands. Not caring or taking action, because he didn't see the point in it anymore. In the first episode we learned he'd been literally refusing opportunities to better himself or make connections up until his chance run-in with Ctholly.\n\nI'm not denying the inherent maturity of his supporting/understanding the \"weapons\" program despite his distaste for it at all"
  },
  {
   "score": 1,
   "id": "dghvrqa",
   "pid": "t1_dgfvxvl",
   "date": "2017-04-19 18:32:06",
   "depth": 5,
   "text": "His Inaction will be explained properly in the next episode. "
  },
  {
   "score": 7,
   "id": "dghvqgl",
   "pid": "t1_dgfuisr",
   "date": "2017-04-19 18:31:24",
   "depth": 4,
   "text": "2 years as a volunteer firefighter before actual work consumed all my hours. In those 2 years though I saw quite a bit of shit. And some screams never fucking leave you. That being said. I'm content and happy with where I am in life, and even though I Fall asleep to the sound of \"I DON'T WANT TO DIE!\" every night, No one has the slightest clue. I deal with the things I've seen by simply pushing them somewhere else in my consciousness. The screams are the only thing that still bother me, but even then It's easily manageable. That all being said. I know plenty of people that can't cope with shit like that, and some of them break. It has nothing to do with maturity, Some people are just made of a tougher material, if that makes sense. When I'm working, I turn off my emotions to the best of my ability, and I vent to my best friend over drinks, that keeps me sane and doing what I need to do. \n\n"
  },
  {
   "score": 1,
   "id": "dgjcmjr",
   "pid": "t1_dghvqgl",
   "date": "2017-04-20 15:53:07",
   "depth": 5,
   "text": "> even though I Fall asleep to the sound of \"I DON'T WANT TO DIE!\"\n\nDude if you are not bullshitting you need to talk to someone if you are having shit like that run through your mind all the time, reach out to your old department and they will probably be able to point you in the direction of someone to help. I have been doing EMS and briefly firefighting (I really don't like ladders so that didn't work out to say the least) for over 10 years and I can't think of a time where a call has bothered me past the time on the call and I have been in some pretty gnarly shit. The people I remember that were bothered by stuff like that are the ones who burned out fast or developed drinking/drug problems down the line."
  },
  {
   "score": 2,
   "id": "dgjem5t",
   "pid": "t1_dgjcmjr",
   "date": "2017-04-20 16:36:30",
   "depth": 6,
   "text": "I don't really know how to explain it, but it doesn't particularly bother me. I don't dwell on it much and most nights I just tune it out. When it first happened it bothered me but it certainly wasn't the worst call. It only stuck with me because I was friends with the girl in high school. I do appreciate the advice though, lol. I've heard it more than once or twice over the last 2 years since the call, but like I said, it's not the worst thing I've seen doing that job. The best way to describe it is like Tinnitus. It's more annoying than anything. "
  },
  {
   "score": 1,
   "id": "dgjer8g",
   "pid": "t1_dgjem5t",
   "date": "2017-04-20 16:39:35",
   "depth": 7,
   "text": "Gotcha, as long as you are all good. Yeah, those calls where you know people are pretty damn rough, I had to take care of a friend that OD'ed (suicide attempt) he stopped breathing on the way in. He made it through but now every time I see him its a little awkward."
  },
  {
   "score": 49,
   "id": "dgfndz5",
   "pid": "t1_dgfguck",
   "date": "2017-04-18 12:35:44",
   "depth": 2,
   "text": "Another element adding to this is his unwillingness to take the job in the last episode, or the fact that he didn't question the military coming to take back Chtolly. He seems overall apathetic and lacking a goal.\n\nSo far his strongest reaction was when he saw the carillons."
  },
  {
   "score": 83,
   "id": "dgfkb25",
   "pid": "t3_663wur",
   "date": "2017-04-18 11:40:21",
   "depth": 0,
   "text": "I am ready to embrace the future of \n#**WEAPONISED LOLIS**"
  },
  {
   "score": 9,
   "id": "dgflhfo",
   "pid": "t1_dgfkb25",
   "date": "2017-04-18 12:01:35",
   "depth": 1,
   "text": "But in this future the humanity are extinct..."
  },
  {
   "score": 11,
   "id": "dgfltxr",
   "pid": "t1_dgflhfo",
   "date": "2017-04-18 12:07:56",
   "depth": 2,
   "text": "Not yet."
  },
  {
   "score": 13,
   "id": "dgfluex",
   "pid": "t1_dgfltxr",
   "date": "2017-04-18 12:08:10",
   "depth": 3,
   "text": "It's treason, then."
  },
  {
   "score": 26,
   "id": "dgfp7ux",
   "pid": "t1_dgfkb25",
   "date": "2017-04-18 13:08:14",
   "depth": 1,
   "text": "Over my dead body, I won't let you weaponize the lolis."
  },
  {
   "score": 92,
   "id": "dgge307",
   "pid": "t1_dgfkb25",
   "date": "2017-04-18 21:20:46",
   "depth": 1,
   "text": "Ravioli Ravioli\n\nDon't weaponize the leprechaun loli"
  },
  {
   "score": 13,
   "id": "dgh3tas",
   "pid": "t1_dgge307",
   "date": "2017-04-19 09:48:15",
   "depth": 2,
   "text": "I'd rather weaponize the loli than watch an anime girl turn into a jet."
  },
  {
   "score": 180,
   "id": "dgfdjzt",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:40:34",
   "depth": 0,
   "text": "Still plenty of exposition, but I'm still very intrigued. Very shocking when the little girl fell off that cliff! Nephren and Ithea are pretty cool.\n\nI think this will be an emotional one.\n\n[Overall thoughts](http://i.imgur.com/OLIWlGd.png)"
  },
  {
   "score": 1,
   "id": "dgibprp",
   "pid": "t1_dgfdjzt",
   "date": "2017-04-20 02:44:14",
   "depth": 1,
   "text": "[Nephren is a cutie. :3](https://vignette3.wikia.nocookie.net/sonako/images/0/03/Shuumatsu_01_P_004.jpg/revision/latest?cb=20160315082319)  \nWell, Tiat, Pannibal and Lakhesh too ... or maybe all of them ?\n"
  },
  {
   "score": 1,
   "id": "dggfh2f",
   "pid": "t1_dgfdjzt",
   "date": "2017-04-18 21:58:16",
   "depth": 1,
   "text": "> Very shocking when the little girl fell off that cliff! \n\nThey really should have a fence. They're just begging for an accident to happen with cliffs being that close to the mansion..\n"
  },
  {
   "score": 11,
   "id": "dgfiaon",
   "pid": "t1_dgfdjzt",
   "date": "2017-04-18 11:04:21",
   "depth": 1,
   "text": "hope there will be some action and not just meguca-esque suffering."
  },
  {
   "score": 56,
   "id": "dgflh0d",
   "pid": "t1_dgfiaon",
   "date": "2017-04-18 12:01:22",
   "depth": 2,
   "text": "...but I like suffering"
  },
  {
   "score": 50,
   "id": "dgfty1g",
   "pid": "t1_dgflh0d",
   "date": "2017-04-18 14:30:56",
   "depth": 3,
   "text": "Ah, you too play support in quickplay. "
  },
  {
   "score": 27,
   "id": "dgg60uz",
   "pid": "t1_dgfty1g",
   "date": "2017-04-18 18:32:05",
   "depth": 4,
   "text": "http://i.imgur.com/YmGg9TG.jpg\n\nYou brought back PTSD from my moba days. "
  },
  {
   "score": 46,
   "id": "dgfemvb",
   "pid": "t1_dgfdjzt",
   "date": "2017-04-18 09:59:31",
   "depth": 1,
   "text": "b d"
  },
  {
   "score": 118,
   "id": "dgfcyyi",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:30:19",
   "depth": 0,
   "text": "The most powerful weapons on the planet, and the only ones capable of defeating the beasts that drove humans to extinction: Seniorious, Valgulious, Insania, Ignareo and......Percy."
  },
  {
   "score": 3,
   "id": "dgfe0sd",
   "pid": "t1_dgfcyyi",
   "date": "2017-04-18 09:48:51",
   "depth": 1,
   "text": "Ancient weapons that only the certain people can wield how convenient. "
  },
  {
   "score": 2,
   "id": "dgfev7p",
   "pid": "t1_dgfe0sd",
   "date": "2017-04-18 10:03:41",
   "depth": 2,
   "text": "Yup! Just imagine how inconvenient it would be to have ancient weapons that no one could wield. (A show with that would have to go full comedy or full SuperDepressingVideo-style despair I think.)"
  },
  {
   "score": 12,
   "id": "dgfezba",
   "pid": "t1_dgfev7p",
   "date": "2017-04-18 10:05:43",
   "depth": 3,
   "text": "Imagine if the weapons were just ancient and broken or even ancient and useless because people have come out with better weapons in the past thousand years. "
  },
  {
   "score": 20,
   "id": "dgff7w7",
   "pid": "t1_dgfezba",
   "date": "2017-04-18 10:10:00",
   "depth": 4,
   "text": "And then they brought them up at the beginning of the story and said \"these used to be the only things people could fight them with, but we've got much better weapons nowadays\" and everyone spends the entire rest of the series waiting for the \"better\" weapons to suddenly fail and the MC to pick up the \"useless\" weapon and wreck the enemy, but the series ends with the girls just killing all the enemies with the \"better\" weapons and MC never reveals any hidden power and the \"useless\" weapons never become anything more than useless. I think a lot of people would be really angry, but I'd probably find it amusing."
  },
  {
   "score": 6,
   "id": "dgfkl91",
   "pid": "t1_dgff7w7",
   "date": "2017-04-18 11:45:26",
   "depth": 5,
   "text": "Of course the MC picks up the \"useless\" weapon, cause its actually secretly the strongest weapon but nobody can use it like \"he\" can so they think that it sucks.  Maybe it is also the oldest weapon as well and also the \"prototype\" that doesn't work like the others and works on the power of friendship or some shit anime always pulls.\n\nEdit: If this gets marked as a spoiler i'll laugh."
  },
  {
   "score": 4,
   "id": "dgfnep7",
   "pid": "t1_dgfkl91",
   "date": "2017-04-18 12:36:05",
   "depth": 6,
   "text": "I don't know about this show, but I think that might be a spoiler for a certain high school battle harem..."
  },
  {
   "score": 1,
   "id": "dgfx0d6",
   "pid": "t1_dgfnep7",
   "date": "2017-04-18 15:32:03",
   "depth": 7,
   "text": "Which one?"
  },
  {
   "score": 2,
   "id": "dggotvp",
   "pid": "t1_dgfx0d6",
   "date": "2017-04-19 04:35:45",
   "depth": 8,
   "text": "Pfft, pick one."
  },
  {
   "score": 8,
   "id": "dgfw6bo",
   "pid": "t1_dgfnep7",
   "date": "2017-04-18 15:15:01",
   "depth": 7,
   "text": "I think it might be a spoiler for half of them..."
  },
  {
   "score": 23,
   "id": "dgfvmq9",
   "pid": "t1_dgfkl91",
   "date": "2017-04-18 15:03:55",
   "depth": 6,
   "text": "AND ITS NAME SHALL BE:\n\nC\n\nC\n\nC\n\nC\n\nC\n\nC\n\nChunchunmaru"
  },
  {
   "score": 0,
   "id": "dgfwjyo",
   "pid": "t1_dgfvmq9",
   "date": "2017-04-18 15:22:45",
   "depth": 7,
   "text": "Im dead right now.  "
  },
  {
   "score": 8,
   "id": "dggc8s1",
   "pid": "t1_dgff7w7",
   "date": "2017-04-18 20:36:39",
   "depth": 5,
   "text": "This thread reads like the expanding intellect meme."
  },
  {
   "score": 1,
   "id": "dggnlb5",
   "pid": "t1_dggc8s1",
   "date": "2017-04-19 03:48:53",
   "depth": 6,
   "text": "A what?"
  },
  {
   "score": 2,
   "id": "dggnpzs",
   "pid": "t1_dggnlb5",
   "date": "2017-04-19 03:54:17",
   "depth": 7,
   "text": "http://knowyourmeme.com/memes/expanding-brain"
  },
  {
   "score": 2,
   "id": "dggnwru",
   "pid": "t1_dggnpzs",
   "date": "2017-04-19 04:02:03",
   "depth": 8,
   "text": "Huh. Learn something new every day."
  },
  {
   "score": 91,
   "id": "dgfe7vl",
   "pid": "t1_dgfe0sd",
   "date": "2017-04-18 09:52:17",
   "depth": 2,
   "text": "I mean if you invent a super weapon it would be convenient if only you and your potential allies could use them. There's use to limiting who could use a weapon."
  },
  {
   "score": -3,
   "id": "dgg63t2",
   "pid": "t1_dgfe7vl",
   "date": "2017-04-18 18:33:32",
   "depth": 3,
   "text": "Were they worried the beasts would get them? They dont even have opposable thumbs! "
  },
  {
   "score": 17,
   "id": "dgg6gk2",
   "pid": "t1_dgg63t2",
   "date": "2017-04-18 18:40:03",
   "depth": 4,
   "text": "Elves, Nygglatho, beastkin, goblins, ogres, Nygglatho again, etc... \n\nThey really didn't want to get eaten by Nygglatho. "
  },
  {
   "score": 2,
   "id": "dgfdufg",
   "pid": "t1_dgfcyyi",
   "date": "2017-04-18 09:45:42",
   "depth": 1,
   "text": "Classic Percy"
  },
  {
   "score": 5,
   "id": "dggnyz2",
   "pid": "t1_dgfcyyi",
   "date": "2017-04-19 04:04:28",
   "depth": 1,
   "text": "You know Sir Percival was the strongest of the Knights of the Round table?"
  },
  {
   "score": 1,
   "id": "dggsr6r",
   "pid": "t1_dggnyz2",
   "date": "2017-04-19 06:23:55",
   "depth": 2,
   "text": "that depends on which story you look at. Sometimes it's Lancelot or Gawain and sometimes it's Percival's replacement, Galahad."
  },
  {
   "score": 1,
   "id": "dgi6d5y",
   "pid": "t1_dggsr6r",
   "date": "2017-04-19 22:41:08",
   "depth": 3,
   "text": "I always thought that Lancelot was the bravest, Gawain was the most gifted swordsman, Percival was the strongest physically & Galahad was the most pure."
  },
  {
   "score": 1,
   "id": "dgi6imi",
   "pid": "t1_dgi6d5y",
   "date": "2017-04-19 22:46:31",
   "depth": 4,
   "text": "As per usual, authors don't agree with each other. But I believe the most popular version of the round table has Lancelot as the most skilled, Gawain as the strongest, especially around midday and Galahad was an all rounded perfect Knight. I'm not too familiar with Percival myself but yeah in some versions, Sir Tristan was the strongest knight so it really depends on which story you're looking at"
  },
  {
   "score": 12,
   "id": "dgfi9bj",
   "pid": "t1_dgfcyyi",
   "date": "2017-04-18 11:03:40",
   "depth": 1,
   "text": "Percival, like the knight of the round table, if I understand my references right."
  },
  {
   "score": 1,
   "id": "dgg11s9",
   "pid": "t1_dgfi9bj",
   "date": "2017-04-18 16:56:43",
   "depth": 2,
   "text": "My first thought was the Bakugan but yeah that makes more sense"
  },
  {
   "score": 5,
   "id": "dgfiq20",
   "pid": "t1_dgfi9bj",
   "date": "2017-04-18 11:11:56",
   "depth": 2,
   "text": "A noble knight! Who just so happens to have a name that makes him sound like he's a middle-class, 9 year old boy from Buckinghamshire"
  },
  {
   "score": 49,
   "id": "dgfdw26",
   "pid": "t1_dgfcyyi",
   "date": "2017-04-18 09:46:30",
   "depth": 1,
   "text": "If you look on the official website's [character listing,](http://sukasuka-anime.com/chara/willem.html) you can see which swords belong to whom. Potential major spoilers though.\n\nEDIT: Also, come on, Percival's a pretty cool name for a sword. Don't you think? I think so."
  },
  {
   "score": 1,
   "id": "dgfn3y2",
   "pid": "t1_dgfdw26",
   "date": "2017-04-18 12:30:42",
   "depth": 2,
   "text": "wait how is it possible that he's like 18 but he had like a ~10 year old kid in the flashback last episode"
  },
  {
   "score": 20,
   "id": "dgfnuws",
   "pid": "t1_dgfn3y2",
   "date": "2017-04-18 12:44:08",
   "depth": 3,
   "text": "She's not his kid, all the kids in the orphanage call him \"dad\" because he's the oldest one there"
  },
  {
   "score": 4,
   "id": "dgfwdml",
   "pid": "t1_dgfnuws",
   "date": "2017-04-18 15:19:11",
   "depth": 4,
   "text": "somehow i missed that it was an orphanage, thanks"
  },
  {
   "score": 1,
   "id": "dgibzcz",
   "pid": "t1_dgfwdml",
   "date": "2017-04-20 02:58:26",
   "depth": 5,
   "text": "I don't think it was mentioned in the first episode. In the novel they talked about it more.  \nThis episode you could see him remember his days in the orphanage few times."
  },
  {
   "score": 2,
   "id": "dgfeq14",
   "pid": "t1_dgfdw26",
   "date": "2017-04-18 10:01:03",
   "depth": 2,
   "text": "Would be careful, contains a big spoiler"
  },
  {
   "score": 7,
   "id": "dgfeph2",
   "pid": "t1_dgfdw26",
   "date": "2017-04-18 10:00:46",
   "depth": 2,
   "text": "> Also, come on, Percival's a pretty cool name for a sword. Don't you think? I think so.\n\nSorry, but when I hear Percival/Percy all I can think of is the smug prick from Harry Potter, and the hot one from Merlin. So I'm just disgusted and slightly aroused rather than impressed"
  },
  {
   "score": 1,
   "id": "dgfha52",
   "pid": "t1_dgfeph2",
   "date": "2017-04-18 10:46:25",
   "depth": 3,
   "text": "lmao that's exactly what I thought of when they said it!"
  },
  {
   "score": 7,
   "id": "dgibx9y",
   "pid": "t1_dgfeph2",
   "date": "2017-04-20 02:55:20",
   "depth": 3,
   "text": "Come on... Arthur, Lancelot, Gawain, Percival, Gareth, Bedivere, Galahad, Tristan, etc. ... They are all pretty cool. "
  },
  {
   "score": 6,
   "id": "dgflbhl",
   "pid": "t1_dgfeph2",
   "date": "2017-04-18 11:58:36",
   "depth": 3,
   "text": "When I hear Percy I think of the most wanted husbando in Granblue Fantasy"
  },
  {
   "score": 1,
   "id": "dgibxvq",
   "pid": "t1_dgflbhl",
   "date": "2017-04-20 02:56:15",
   "depth": 4,
   "text": "Lancelot (Or maybe Gawain cuz I'm a filthy windmemer) FTW."
  },
  {
   "score": 16,
   "id": "dgff3rx",
   "pid": "t1_dgfeph2",
   "date": "2017-04-18 10:07:57",
   "depth": 3,
   "text": "I think of Thomas the Tank Engine's friend: Percy the Small Engine."
  },
  {
   "score": 3,
   "id": "dgfo9qz",
   "pid": "t1_dgff3rx",
   "date": "2017-04-18 12:51:31",
   "depth": 4,
   "text": "I For me it's the idiot of the round table in Kaamelott."
  },
  {
   "score": 1,
   "id": "dgfw3ak",
   "pid": "t1_dgfo9qz",
   "date": "2017-04-18 15:13:16",
   "depth": 5,
   "text": "Kamelåså?\n\nKamelåså!"
  },
  {
   "score": 66,
   "id": "dgfe66z",
   "pid": "t1_dgfdw26",
   "date": "2017-04-18 09:51:28",
   "depth": 2,
   "text": "Thanks for that, now I can look forward to the fiery redhead known as [Assplay-san](http://sukasuka-anime.com/chara/lillia.html#c_list_block_0002)."
  },
  {
   "score": 1,
   "id": "dgfw8cz",
   "pid": "t1_dgfe66z",
   "date": "2017-04-18 15:16:10",
   "depth": 3,
   "text": "Good lord. I'm looking forward to her. I'm a sucker for redheads. "
  },
  {
   "score": 5,
   "id": "dgftzdt",
   "pid": "t1_dgfe66z",
   "date": "2017-04-18 14:31:38",
   "depth": 3,
   "text": "(͡° ͜ʖ ͡°)"
  },
  {
   "score": 6,
   "id": "dggorj8",
   "pid": "t1_dgfe66z",
   "date": "2017-04-19 04:33:31",
   "depth": 3,
   "text": "She reminds me a lot of the chick from *The Sacred Blacksmith.*"
  },
  {
   "score": 29,
   "id": "dgfeb2n",
   "pid": "t1_dgfe66z",
   "date": "2017-04-18 09:53:49",
   "depth": 3,
   "text": "Oh Jesus, that's one (very Engrish) way to spell Aspley I suppose."
  },
  {
   "score": 66,
   "id": "dgffjcf",
   "pid": "t1_dgfeb2n",
   "date": "2017-04-18 10:15:41",
   "depth": 4,
   "text": "* Only redhead\n\n* Ponytail\n\n* Knight\n\n* Long white gloves\n\n* Only character design with a smug face\n\n* Named \"Assplay-san\"\n\nYep, the other girls can go ahead and pack up."
  },
  {
   "score": 11,
   "id": "dgfiqzc",
   "pid": "t1_dgffjcf",
   "date": "2017-04-18 11:12:24",
   "depth": 5,
   "text": "[Spoilers](/s \"Only redhead so far.\")"
  },
  {
   "score": 1,
   "id": "dgibs1o",
   "pid": "t1_dgfiqzc",
   "date": "2017-04-20 02:47:38",
   "depth": 6,
   "text": "Doesn't the intro count ? ^ ^"
  },
  {
   "score": 5,
   "id": "dghvzx5",
   "pid": "t1_dgfiqzc",
   "date": "2017-04-19 18:36:30",
   "depth": 6,
   "text": "Fuck that spoiler, lol. \n\n"
  },
  {
   "score": 1,
   "id": "dghwh5m",
   "pid": "t1_dghvzx5",
   "date": "2017-04-19 18:45:56",
   "depth": 7,
   "text": "It's a bit of a cruel joke "
  },
  {
   "score": 91,
   "id": "dgfdbc9",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:36:19",
   "depth": 0,
   "text": "Kutori is cute and must be protected.\n\n...\n\n\"If I told you that I had 5 days left to live, would you be kinder to me?\"\n\n---\n\nEDIT: This episode covered pages 86-168 of volume 1 from the chapter \"Deep within the forest above the skies.\" A full adaptation of all 5 volumes (excluding EX) miiiiiiiiight be possible at this rate."
  },
  {
   "score": 1,
   "id": "dggbszq",
   "pid": "t1_dgfdbc9",
   "date": "2017-04-18 20:26:51",
   "depth": 1,
   "text": "How many episodes could this be?"
  },
  {
   "score": 3,
   "id": "dgflqu3",
   "pid": "t1_dgfdbc9",
   "date": "2017-04-18 12:06:22",
   "depth": 1,
   "text": "Is the series complete or is it ongoing?"
  },
  {
   "score": 21,
   "id": "dgfnjjs",
   "pid": "t1_dgflqu3",
   "date": "2017-04-18 12:38:30",
   "depth": 2,
   "text": "The series is complete with 5 books à 5 chapter. There is a EX series and a sequel series, but I don't know anything about them. \n\nTranslated is for now up to book 4."
  },
  {
   "score": 4,
   "id": "dgfnoij",
   "pid": "t1_dgfnjjs",
   "date": "2017-04-18 12:40:55",
   "depth": 3,
   "text": "Ah, ok. "
  },
  {
   "score": 1,
   "id": "dghw2mv",
   "pid": "t1_dgfnoij",
   "date": "2017-04-19 18:37:59",
   "depth": 4,
   "text": "As far as I know, the Sequel MIGHT, Resolve the first 5 novels, which at the current rate, are probably going to end on a cliffhanger. "
  },
  {
   "score": 11,
   "id": "dgfu0qr",
   "pid": "t1_dgfdbc9",
   "date": "2017-04-18 14:32:20",
   "depth": 1,
   "text": "> \"If I told you that I had 5 days left to live, would you be kinder to me?\"\n\nKinda expected him to ask if that meant he wasn't being kind to her"
  },
  {
   "score": 43,
   "id": "dgfdkdf",
   "pid": "t1_dgfdbc9",
   "date": "2017-04-18 09:40:46",
   "depth": 1,
   "text": "\"The more precious the burden, the heavier and more difficult it is to shoulder it.\"\n\n-Gintama"
  },
  {
   "score": 133,
   "id": "dgfhl64",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:51:50",
   "depth": 0,
   "text": "> Guy on top of girl, girl half naked\n\n> Girl says: O-ow, that really hurts!\n\n> Guy says: Once it loosens up, you'll feel better\n\nPerfect situation for r/nocontext"
  },
  {
   "score": 1,
   "id": "dgiarcv",
   "pid": "t1_dgfhl64",
   "date": "2017-04-20 01:53:24",
   "depth": 1,
   "text": "But I like how mature he is throughout the situation and doesn't get red or a hard one like anime protagonist 101 would."
  },
  {
   "score": 11,
   "id": "dgg8qkd",
   "pid": "t1_dgfhl64",
   "date": "2017-04-18 19:23:35",
   "depth": 1,
   "text": "Holy crap....I never noticed that hahaha. Here I was just wondering if straining muscle without ever getting a massage afterwards could lead to serious problems lol "
  },
  {
   "score": 15,
   "id": "dggi9tn",
   "pid": "t1_dgg8qkd",
   "date": "2017-04-18 23:34:51",
   "depth": 2,
   "text": "It can lead to big issues, if lactic acid is left to build up it can leave massive issues on the body."
  },
  {
   "score": 4,
   "id": "dggne1l",
   "pid": "t1_dggi9tn",
   "date": "2017-04-19 03:40:13",
   "depth": 3,
   "text": "Oh wow! Thanks! Maybe I should go see a chiropractor then. "
  },
  {
   "score": 4,
   "id": "dgjtvvy",
   "pid": "t1_dggne1l",
   "date": "2017-04-20 22:34:14",
   "depth": 4,
   "text": "You can pretty effectively give yourself a massage with a foam roller and one of those massage sticks"
  },
  {
   "score": 122,
   "id": "dgfl824",
   "pid": "t1_dgfhl64",
   "date": "2017-04-18 11:56:55",
   "depth": 1,
   "text": "[that face](http://i.imgur.com/Z1rf9z8.png)"
  },
  {
   "score": 34,
   "id": "dgfocns",
   "pid": "t1_dgfl824",
   "date": "2017-04-18 12:52:55",
   "depth": 2,
   "text": "[](#head-tilt)"
  },
  {
   "score": 37,
   "id": "dgghx80",
   "pid": "t3_663wur",
   "date": "2017-04-18 23:20:56",
   "depth": 0,
   "text": "The term “emnetwiht” actually derives from Old English, and etymologically is related to the term “barrowwiht” or “barrow wight”. “Barrow” and “Emnet” are actually opposites, meaning mound and a level plain, respectively. This is interesting since the official page lists both emnetwiht **and** barrowwiht as [races](http://sukasuka-anime.com/chara/souwong.html).\n\nBoth terms were used by [Tolkien](http://oldewyrd.blogspot.com/):\n\n>And in the first book of The Lord of the Rings, the hobbits encounter a barrow-wight, a supernatural being that guards the treasure in a barrow or grave. The term was actually coined in the 19th century by Andrew Lang, a writer about myths and legends. It is a compounding of barrow and wight, an Old English term for a living creature, especially a human. This sense long ago fell out of use. Wight also has had a sense of a supernatural being since c. 950. This second sense also fell out of general use, although writers, like Lang and Tolkien, have made occasional use of it over the centuries to evoke an archaic atmosphere.\n\n>A barrow is a mound of earth and stones erected over a grave. Originally from an Old English word for mountain, that sense has long passed out of the language, except in the names of particular hills. The term survived as a local term for a grave mound in the Southwest of England. It since has enjoyed a revival as an archeological term. Tolkien uses it the sense of a grave mound, especially those found just outside the borders of the Shire.\n\nFurther:\n\n>Place names in Rohan are also from Old English. The capital is Edoras, or the courts, and the king’s hall is Meduseld, or mead-hall. Districts in Rohan are Eastemnet and Westemnet, from the Old English emnet meaning plain or level ground.\n\n    Interesting…"
  },
  {
   "score": 15,
   "id": "dggpzf1",
   "pid": "t1_dgghx80",
   "date": "2017-04-19 05:12:41",
   "depth": 1,
   "text": "Jesus, thank you. I was wondering why CR kept translating \"ningen\" and \"jinrui\" as that. Like there had to be a significance why they didn't just call them human..."
  },
  {
   "score": 5,
   "id": "dgh61wu",
   "pid": "t1_dggpzf1",
   "date": "2017-04-19 10:27:03",
   "depth": 2,
   "text": "I too was wondering what that was. It looks like a botched anagram."
  },
  {
   "score": 67,
   "id": "dgfd8fp",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:34:52",
   "depth": 0,
   "text": "[removed]"
  },
  {
   "score": 3,
   "id": "dgfzo32",
   "pid": "t1_dgfd8fp",
   "date": "2017-04-18 16:28:02",
   "depth": 1,
   "text": "> This anime is still so cute even with all that inevitable suffering!!!\n\nI really shouldn't watch this show right after Alice to Zouroku. Two [CGDCTBIAD](https://www.reddit.com/r/anime/comments/65pijg/spoilers_alice_to_zouroku_episode_3_discussion/dgcidqv/) anime in succession is just too much for my heart (for various reasons). "
  },
  {
   "score": 1,
   "id": "dggjthq",
   "pid": "t1_dgfzo32",
   "date": "2017-04-19 00:42:30",
   "depth": 2,
   "text": "What does the BIAD part stand for?"
  },
  {
   "score": 1,
   "id": "dghdiaa",
   "pid": "t1_dggjthq",
   "date": "2017-04-19 12:36:00",
   "depth": 3,
   "text": "But it's actually despair. That's why I linked [this thread](https://www.reddit.com/r/anime/comments/65pijg/spoilers_alice_to_zouroku_episode_3_discussion/dgcidqv/)."
  },
  {
   "score": 1,
   "id": "dggnslr",
   "pid": "t1_dggjthq",
   "date": "2017-04-19 03:57:18",
   "depth": 3,
   "text": "'But it's actually despair'"
  },
  {
   "score": 1,
   "id": "dggrlbs",
   "pid": "t1_dggnslr",
   "date": "2017-04-19 05:56:37",
   "depth": 4,
   "text": "Aaah, thanks. Interesting abbreviation although it's pretty much a word on it's own at this point."
  },
  {
   "score": 15,
   "id": "dgfdw1f",
   "pid": "t1_dgfd8fp",
   "date": "2017-04-18 09:46:29",
   "depth": 1,
   "text": "Kid took so long to get the ball"
  },
  {
   "score": 1,
   "id": "dggn47a",
   "pid": "t1_dgfdw1f",
   "date": "2017-04-19 03:27:54",
   "depth": 2,
   "text": "I laughed at this harder than I should have..... welps see you guys in hell."
  },
  {
   "score": 1,
   "id": "dgg5bxx",
   "pid": "t1_dgfdw1f",
   "date": "2017-04-18 18:19:02",
   "depth": 2,
   "text": "I know right, its like wth is wrong with her. We're all forced to wait on her to return with the ball, she's just an attention whore. "
  },
  {
   "score": 84,
   "id": "dgfflqp",
   "pid": "t1_dgfd8fp",
   "date": "2017-04-18 10:16:53",
   "depth": 1,
   "text": "The most chilling thing about that ball scene isn't that she doesn't care for her own life. It's that the rest of the girls don't seem to care about hers."
  },
  {
   "score": -5,
   "id": "dgfhmmi",
   "pid": "t1_dgfflqp",
   "date": "2017-04-18 10:52:34",
   "depth": 2,
   "text": "I know I'm going to get disliked for this but, I mean, she was clearly still alive after all. Head wounds usually bleed a lot, so there being a lot of blood isn't really all that worrisome either. "
  },
  {
   "score": 2,
   "id": "dgg2lws",
   "pid": "t1_dgfhmmi",
   "date": "2017-04-18 17:27:04",
   "depth": 3,
   "text": "> Head wounds usually bleed a lot\n\nMost people don't know that.  Especially 'normal' kids.  The saw her fall down a pretty steep hill, stand up shakily with blood gushing down her face and acted like she might have just tripped and stood back up with just dust on her knees.  So yeah, it's kind of a big deal that they didn't react."
  },
  {
   "score": 4,
   "id": "dgfp9b5",
   "pid": "t1_dgfhmmi",
   "date": "2017-04-18 13:08:58",
   "depth": 3,
   "text": "They were not alarmed at all when she fell. They didn't rush over to see if she was alright. They casually walked over to the cliff with no urgency even before knowing she was OK."
  },
  {
   "score": 2,
   "id": "dgft0sq",
   "pid": "t1_dgfp9b5",
   "date": "2017-04-18 14:14:16",
   "depth": 4,
   "text": "Hm, I guess that's true. "
  },
  {
   "score": 5,
   "id": "dgfnxjp",
   "pid": "t1_dgfhmmi",
   "date": "2017-04-18 12:45:26",
   "depth": 3,
   "text": "It seems that the fall may actually have been quite bad. Given how weak she was, I doubt faeries are much more resilient than humans. But the others looked surprised that he would even care about her injuries.\nIn the same way, it doesn't look like Chtolly cared about suffering from venenum poisoning.\n\nIt's a wonder how they are (barely) able to reach adolescence when they lack any care not only for their life, but even for their well being."
  },
  {
   "score": 1,
   "id": "dghd138",
   "pid": "t1_dgfnxjp",
   "date": "2017-04-19 12:27:57",
   "depth": 4,
   "text": "Empathy and it's expression can both be taught and suppressed--this is part of military training and the kids are trained to be child soldiers from an early age. We also don't know much about faerie psychology yet either, although we do see the kids expressing playfulness and Cthulu-chan having a crush on senpai. She's certain that she's going to die in a few days, though, so it's not like any of these kids plan on living that long either... they've probably seen plenty of their friends die already. Reaching adulthood is apparently a rarity for them."
  },
  {
   "score": 2,
   "id": "dgfx97v",
   "pid": "t1_dgfnxjp",
   "date": "2017-04-18 15:37:07",
   "depth": 4,
   "text": "Yeah, i would imagine they would die very easily, i wonder how many have died by jumping from the second floor without rhinking about it."
  },
  {
   "score": 47,
   "id": "dgfknrw",
   "pid": "t1_dgfhmmi",
   "date": "2017-04-18 11:46:43",
   "depth": 3,
   "text": "It was enough to put her in the infirmary and you can clearly see she was struggling to walk straight when she went to get the ball. \n\nBlood isn't the worrying part about a head injury."
  },
  {
   "score": -5,
   "id": "dgfnc4v",
   "pid": "t1_dgfknrw",
   "date": "2017-04-18 12:34:49",
   "depth": 4,
   "text": "That's true... I just... Part of it's having seen my sister in similar condition for similar reasons as a child (although it was rolling down cement steps headfirst rather than stepping off a cliff), so it feels very familiar. The other part though is that I have a hard time getting too concerned about injuries unless they show signs that something's wrong. Like, definitely, take her to the doctor, but I'm not going to freak out or worry until I know there's a problem, so I don't find it odd if others don't either. "
  },
  {
   "score": 5,
   "id": "dgfsxkk",
   "pid": "t1_dgfnc4v",
   "date": "2017-04-18 14:12:46",
   "depth": 5,
   "text": "honestly that's a good thing. being able to stay calm and keep a cool head is one of the most important parts of first aid"
  },
  {
   "score": 17,
   "id": "dgfw9au",
   "pid": "t1_dgfsxkk",
   "date": "2017-04-18 15:16:42",
   "depth": 6,
   "text": "But telling the patient to go and get the ball is frowned upon."
  },
  {
   "score": 2,
   "id": "dgfx36g",
   "pid": "t1_dgfw9au",
   "date": "2017-04-18 15:33:41",
   "depth": 7,
   "text": "I just imagined a doctor throwing a ball out the window and telling the patient to go get it in order to check if he was okay or not x)"
  },
  {
   "score": 30,
   "id": "dgferip",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:01:48",
   "depth": 0,
   "text": "Ah, I'd been looking forward to another episode of 'Animu human and monster girls, what do they know? do they know things? Let’s find out!'..."
  },
  {
   "score": 28,
   "id": "dgffgeb",
   "pid": "t1_dgferip",
   "date": "2017-04-18 10:14:14",
   "depth": 1,
   "text": "That's still somehow less of a mouthful than the actual title"
  },
  {
   "score": 58,
   "id": "dgfg1jk",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:24:31",
   "depth": 0,
   "text": "Weaponizing cute little girls?\n\n[What a crime](#manly-tears)\n\nMan this episode really brought the show to a whole new level for me. The dialogue has some nice quips but it just feels so...*normal* I guess? \n\nI'll admit that the massage scene with the afterglow was out-of-place but I found the exchange beforehand between Willem and Chtholly to be absolutely adorable.\n\nLike when Chtolly asked to kiss him as her final request was just-\n\n[](#akyuusqueel)\n\nI'm really enjoying the ride so far as someone who entered the show blind. Probably the show I look forward to the most each week among the 30 airing shows I'm watching now."
  },
  {
   "score": 6,
   "id": "dgfg40w",
   "pid": "t1_dgfg1jk",
   "date": "2017-04-18 10:25:45",
   "depth": 1,
   "text": "> I'll admit that the massage scene with the afterglow was out-of-place but I found the exchange beforehand between Willem and Chtholly to be absolutely adorable.\n\nYeah it kinda put a damper on what was otherwise a great scene between the two of them.\n\nAlso went in blind and really enjoying it so far...just scared on how dark they'll take it!"
  },
  {
   "score": 16,
   "id": "dgflwdr",
   "pid": "t1_dgfg1jk",
   "date": "2017-04-18 12:09:07",
   "depth": 1,
   "text": "I feel like it would have been fine if the moan was excluded. Just kind of leave it there. The last outburst was overkill and ruined it."
  },
  {
   "score": 20,
   "id": "dgfpgrz",
   "pid": "t1_dgfg1jk",
   "date": "2017-04-18 13:12:36",
   "depth": 1,
   "text": "> Weaponizing cute little girls?\n\nBlack bullet flashbacks"
  },
  {
   "score": 13,
   "id": "dgg4zk1",
   "pid": "t1_dgfpgrz",
   "date": "2017-04-18 18:12:27",
   "depth": 2,
   "text": "I hope this one can be better than Black Bullet."
  },
  {
   "score": 29,
   "id": "dgfda6b",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:35:44",
   "depth": 0,
   "text": "This show definitely came out of no where and really has exceeded my expectations, after watching the first episode I went and started reading the Light Novel, and so far it has been extremely accurate with minor dialogue changes to push the plot forward. Otherwise a decent episode and and a surprisingly welcome show this season. I highly recommend you read the source material though, I've read through 2 volumes and it has been absolutely beautiful to read."
  },
  {
   "score": 1,
   "id": "dghw43i",
   "pid": "t1_dgfda6b",
   "date": "2017-04-19 18:38:46",
   "depth": 1,
   "text": "When you finish volume 3-5, I recommend watching, or re-watching, something like Noucome. \n\nEdit* Like immediately after"
  },
  {
   "score": 1,
   "id": "dgic402",
   "pid": "t1_dghw43i",
   "date": "2017-04-20 03:05:01",
   "depth": 2,
   "text": ";_; Now I can't stop thinking about all the awful possibilities that are in front of me. (Also at V2)  \n  \nEdit: Although I would guess that the 1st episode intro already spoiled me."
  },
  {
   "score": 26,
   "id": "dgfgss2",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:37:56",
   "depth": 0,
   "text": "When they tell you best girl is going to die in 5 days, as well as a flashback to another girl who probably died in the past, this anime looks like a full on tragedy train :("
  },
  {
   "score": 2,
   "id": "dghw958",
   "pid": "t1_dgfgss2",
   "date": "2017-04-19 18:41:36",
   "depth": 1,
   "text": "I stand by my earlier recommendation on the first episode page to save a fun series to watch after every episode of this. \n"
  },
  {
   "score": 2,
   "id": "dgicnoo",
   "pid": "t1_dghw958",
   "date": "2017-04-20 03:31:48",
   "depth": 2,
   "text": "Why the heck is love tyrant on Thursday, I need it now."
  },
  {
   "score": 51,
   "id": "dgfdctl",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:37:03",
   "depth": 0,
   "text": "Jeebus, that went dark fast. Just seeing kids give no fucks about the lives of their fellow leprechauns is just plain disturbing. Is it natural to them that they know that their only purpose is to die?Or is that something taught to them as early as possible?\n\nAnyway nice set up so far. Also I'm sure not a lot of people are fans of what happened there in the end between Kutori and Willem but I like it and thought it was cute."
  },
  {
   "score": 27,
   "id": "dgfefwk",
   "pid": "t1_dgfdctl",
   "date": "2017-04-18 09:56:08",
   "depth": 1,
   "text": "-raises hand- yeah, not a fan of that \"massage.\" The \"kiss\" was cute though."
  },
  {
   "score": 11,
   "id": "dgfi5en",
   "pid": "t1_dgfefwk",
   "date": "2017-04-18 11:01:42",
   "depth": 2,
   "text": "when she was mad that he didn't want to kiss her she really felt like a 15 yo girl. Made the massage more disturbing though."
  },
  {
   "score": 47,
   "id": "dgfghl7",
   "pid": "t1_dgfefwk",
   "date": "2017-04-18 10:32:25",
   "depth": 2,
   "text": "The massage scene in the book is not nearly as suggestive as the scene in the anime. It was supposed to be painful at first, then ticklish, then relaxing. Also, during the scene, the narration describes the actual logic and history behind the message, not Kutori squirming about."
  },
  {
   "score": 2,
   "id": "dggftso",
   "pid": "t1_dgfghl7",
   "date": "2017-04-18 22:08:59",
   "depth": 3,
   "text": "I feel like I watched a different scene from some of the people  here because \n\n> painful at first, then ticklish, then relaxing\n\nis exactly what I saw from the massage, although most of the relaxation part came from the afterglow.\n\nAnd the anime did explain why he was giving her massage, not sure how much more of an explanation was needed. Venenum is outputted when using dugs, and putting too much out is harmful to your life span. One such side affect is muscle fever."
  },
  {
   "score": 8,
   "id": "dgfh7u0",
   "pid": "t1_dgfghl7",
   "date": "2017-04-18 10:45:17",
   "depth": 3,
   "text": "That sounds much more my cup of tea. And fits with what I've experienced of massages a lot better (it's a pet peeve of mine that so many stories have massages as being better than sex - you wouldn't believe how many stories I read where a guy is able to get and maintain a harem purely because he gives good massages). "
  },
  {
   "score": 16,
   "id": "dgfxu06",
   "pid": "t1_dgfh7u0",
   "date": "2017-04-18 15:49:13",
   "depth": 4,
   "text": "Well, sex essentially is very *localized* massage..."
  },
  {
   "score": 61,
   "id": "dgfgux4",
   "pid": "t1_dgfghl7",
   "date": "2017-04-18 10:38:59",
   "depth": 3,
   "text": "it felt like she got anal tbh"
  },
  {
   "score": 23,
   "id": "dgfiv0j",
   "pid": "t1_dgfgux4",
   "date": "2017-04-18 11:14:26",
   "depth": 4,
   "text": "No that's [this](http://sukasuka-anime.com/chara/lillia.html#c_list_block_0002) character. "
  },
  {
   "score": 11,
   "id": "dgfwdg5",
   "pid": "t1_dgfiv0j",
   "date": "2017-04-18 15:19:05",
   "depth": 5,
   "text": "Oh dear.  What an unfortunate name."
  },
  {
   "score": 5,
   "id": "dgiau51",
   "pid": "t1_dgfwdg5",
   "date": "2017-04-20 01:57:27",
   "depth": 6,
   "text": "It will be so nice to hear her name being spoken in a stern context.\n\n\"I am the one that will destroy you! Remember the name while you burn in hell.\" *Jumps to big monster* *Charges* \"RIRIA!\" *Finishing Move* \"ASSPLAY!!!!!!!!\""
  },
  {
   "score": 44,
   "id": "dgfh9h5",
   "pid": "t1_dgfgux4",
   "date": "2017-04-18 10:46:06",
   "depth": 4,
   "text": "There is nothing to prove otherwise. "
  },
  {
   "score": 88,
   "id": "dgfejnp",
   "pid": "t1_dgfdctl",
   "date": "2017-04-18 09:57:56",
   "depth": 1,
   "text": ">I'm sure not a lot of people are fans of what happened there in the end between Kutori and Willem\n\n[Yeah that was, uh...](http://i.imgur.com/j1F9bFv.gif) (NSFW)"
  },
  {
   "score": 8,
   "id": "dgg662h",
   "pid": "t1_dgfejnp",
   "date": "2017-04-18 18:34:42",
   "depth": 2,
   "text": "BITE THE PILLOW IM GOING IN"
  },
  {
   "score": 18,
   "id": "dgfjwf3",
   "pid": "t1_dgfejnp",
   "date": "2017-04-18 11:33:01",
   "depth": 2,
   "text": "Kimochi!!"
  },
  {
   "score": 10,
   "id": "dgfu2lj",
   "pid": "t1_dgfjwf3",
   "date": "2017-04-18 14:33:19",
   "depth": 3,
   "text": "Iku iku!"
  },
  {
   "score": 34,
   "id": "dgffste",
   "pid": "t1_dgfejnp",
   "date": "2017-04-18 10:20:21",
   "depth": 2,
   "text": "[](#head-tilt)"
  },
  {
   "score": 19,
   "id": "dgfgwda",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:39:42",
   "depth": 0,
   "text": "I really need to learn how to make puddin.\n\nAlso that massage scene"
  },
  {
   "score": 7,
   "id": "dggic05",
   "pid": "t1_dgfgwda",
   "date": "2017-04-18 23:37:22",
   "depth": 1,
   "text": "I learnt how to make Flan back in the day I worked at a Catholic school, it's pretty much a tradition here. \n\nThere is a very simple and easy to follow recipe in the most recent season of PreCure, I mean if you want to watch cute girls doing cute stuff and baking pastries you are killing two birds with one stone.\n\nDon't be afraid, it can be worse than the one time [4chan did it](https://img.fireden.net/a/image/1486/94/1486941587256.jpg), the anon doing it got better, but seriously it's still hilarious to [remember it](https://img.fireden.net/a/image/1486/95/1486956789312.jpg).\n\nThe key to get good at something is trying to do it in the first place and having a blast doing it."
  },
  {
   "score": 13,
   "id": "dgfi38k",
   "pid": "t1_dgfgwda",
   "date": "2017-04-18 11:00:39",
   "depth": 1,
   "text": "Indeed, food is one of the few things that transcend waifus."
  },
  {
   "score": 3,
   "id": "dggqel9",
   "pid": "t1_dgfi38k",
   "date": "2017-04-19 05:24:55",
   "depth": 2,
   "text": "let me introduce you to [Koufuku Graffiti](https://myanimelist.net/anime/24629/Koufuku_Graffiti)   "
  },
  {
   "score": 5,
   "id": "dgfledu",
   "pid": "t1_dgfi38k",
   "date": "2017-04-18 12:00:03",
   "depth": 2,
   "text": "How about Waifoods?"
  },
  {
   "score": 16,
   "id": "dgfh7t4",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:45:16",
   "depth": 0,
   "text": "As a LN reader, this episode captures really well the dynamics and atmosphere of the original works. A delicate mix of peaceful sweet SoL and somber bitterness of the girls' fate as weapons meant to perish in battle.\n\n"
  },
  {
   "score": 15,
   "id": "dgfiw8k",
   "pid": "t3_663wur",
   "date": "2017-04-18 11:15:02",
   "depth": 0,
   "text": "I really appreciate how the MC is designed not to really stand out in any manner but neither is he boring in any way. Usually in anime you either get a completely bland and useless MC, or someone with at least a quirk or two."
  },
  {
   "score": 24,
   "id": "dgfy0gw",
   "pid": "t1_dgfiw8k",
   "date": "2017-04-18 15:53:04",
   "depth": 1,
   "text": "And then you get Deku."
  },
  {
   "score": 5,
   "id": "dggq3jc",
   "pid": "t1_dgfy0gw",
   "date": "2017-04-19 05:16:06",
   "depth": 2,
   "text": "What you did there, I see it."
  },
  {
   "score": 15,
   "id": "dgfoo0h",
   "pid": "t3_663wur",
   "date": "2017-04-18 12:58:27",
   "depth": 0,
   "text": "I noticed since ep 1 that the animation and OST is exceptional. Is this a famous LN? I saw zero 3D, even during crowds scene in ep 1. One 3D moment in this ep but it's the ship."
  },
  {
   "score": 3,
   "id": "dggidmg",
   "pid": "t1_dgfoo0h",
   "date": "2017-04-18 23:39:06",
   "depth": 1,
   "text": "It is indeed a famous LN by an author who's well known for his top tier writing. The way he writes is just beautiful. "
  },
  {
   "score": 7,
   "id": "dgglf2a",
   "pid": "t1_dgfoo0h",
   "date": "2017-04-19 02:01:37",
   "depth": 1,
   "text": "Not an LN reader, but considering the LN has a very high score on MAL (and its sequel is even higher), then yes. Also Crunchyroll advertised this show as Re:Zero's rival in terms of popularity in Japan so there's that.\n\nEdit: It seems even the manga has a score of 9.15 on MAL."
  },
  {
   "score": 14,
   "id": "dgg13mx",
   "pid": "t3_663wur",
   "date": "2017-04-18 16:57:48",
   "depth": 0,
   "text": "I fucking love Ithea.\n\nAlso... Uh... I could have done without that massage scene..."
  },
  {
   "score": 44,
   "id": "dgffmz7",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:17:29",
   "depth": 0,
   "text": "Outside that massage scene I pretty much enjoyed the whole thing. We got answers, [kids being adorable](http://i.imgur.com/udzYO4c.jpg) and troll [being](http://i.imgur.com/94KWijz.jpg) [best](http://i.imgur.com/wYyIEia.jpg) once again.\n\nStill can't shake the Black Bullet vibes from this though..."
  },
  {
   "score": 1,
   "id": "dgi6zy2",
   "pid": "t1_dgffmz7",
   "date": "2017-04-19 23:03:58",
   "depth": 1,
   "text": "The taste of a liar"
  },
  {
   "score": 25,
   "id": "dgfh5lq",
   "pid": "t1_dgffmz7",
   "date": "2017-04-18 10:44:09",
   "depth": 1,
   "text": "> Still can't shake the Black Bullet vibes from this though...\n\nSame.  I can only hope that it's better than Black Bullet ended up being, though."
  },
  {
   "score": 43,
   "id": "dgfhbpz",
   "pid": "t1_dgfh5lq",
   "date": "2017-04-18 10:47:13",
   "depth": 2,
   "text": "Low bar lol"
  },
  {
   "score": 8,
   "id": "dgfiwpq",
   "pid": "t1_dgfhbpz",
   "date": "2017-04-18 11:15:17",
   "depth": 3,
   "text": "Agreed, though BB did have it's moments. "
  },
  {
   "score": 10,
   "id": "dgftj9x",
   "pid": "t1_dgfiwpq",
   "date": "2017-04-18 14:23:16",
   "depth": 4,
   "text": "Like the opening and... the ending."
  },
  {
   "score": 17,
   "id": "dgftvtx",
   "pid": "t1_dgftj9x",
   "date": "2017-04-18 14:29:49",
   "depth": 5,
   "text": "[BB Spoilers](/s \"People gave it shit but using a railgun to fire his fist was hilarious.\")"
  },
  {
   "score": 12,
   "id": "dgfhrvr",
   "pid": "t1_dgfhbpz",
   "date": "2017-04-18 10:55:08",
   "depth": 3,
   "text": "I've watched enough anime with good ideas that ends up being awful that I've heavily tempered my expectations."
  },
  {
   "score": 19,
   "id": "dgfwgm2",
   "pid": "t1_dgffmz7",
   "date": "2017-04-18 15:20:54",
   "depth": 1,
   "text": "I'm not quite sure why the kids seem so concerned about being eaten there, but are then shown to have no regard for their lives later."
  },
  {
   "score": 7,
   "id": "dgfxlut",
   "pid": "t1_dgfwgm2",
   "date": "2017-04-18 15:44:30",
   "depth": 2,
   "text": "That is a very good point!"
  },
  {
   "score": 21,
   "id": "dgg2ccb",
   "pid": "t1_dgfwgm2",
   "date": "2017-04-18 17:21:50",
   "depth": 2,
   "text": "The girls still want to play.  I think they treat death more like a bedtime."
  },
  {
   "score": 11,
   "id": "dgffr61",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:19:32",
   "depth": 0,
   "text": "I wanted to watch this but my friend who read the LN told me not to cause he knew I was taking depression meds. But I wanna second opinion, will this get really dark later on? Or is it more similar to gunslinger girl (More melancholic than depressing)?"
  },
  {
   "score": 5,
   "id": "dgfgwlk",
   "pid": "t1_dgffr61",
   "date": "2017-04-18 10:39:49",
   "depth": 1,
   "text": "I wouldn't say it's actually depressing. It's sad in the usual sense of the word when people talk about movies/books, as in sad things happen to some characters. It doesn't deal with truly dark themes like depression, etc."
  },
  {
   "score": 5,
   "id": "dgfgctd",
   "pid": "t1_dgffr61",
   "date": "2017-04-18 10:30:01",
   "depth": 1,
   "text": "[Spoilers](/s \"It will get dark. It's really good though.\")\n\n"
  },
  {
   "score": -5,
   "id": "dgflx7n",
   "pid": "t1_dgfgctd",
   "date": "2017-04-18 12:09:32",
   "depth": 2,
   "text": "[**really now?**](#smugshinobu)"
  },
  {
   "score": 1,
   "id": "dghwb27",
   "pid": "t1_dgflx7n",
   "date": "2017-04-19 18:42:39",
   "depth": 3,
   "text": "You think you understand. You don't understand. \n"
  },
  {
   "score": 13,
   "id": "dgfgdlx",
   "pid": "t1_dgffr61",
   "date": "2017-04-18 10:30:25",
   "depth": 1,
   "text": "[A review with no spoilers](/s \"It will become very heart wrenching and thoroughly depressing with a hint of melancholy. It contains both grief and agony, but lovable characters. If you are unstable emotionally or on a depressant pill, I'd recommend you either brace yourself with spoilers, brace yourself in general, or just not watch till you are ready for it. This will become very beautiful and depressing very quickly as it seems it is heading towards the end of Volume 3/4. But overall, one of my favorite light novels to read as tingles my emotions and imaginations.\")"
  },
  {
   "score": 1,
   "id": "dgg4x6n",
   "pid": "t1_dgfgdlx",
   "date": "2017-04-18 18:11:12",
   "depth": 2,
   "text": "Would u mind writing a spoiler version of what u said?"
  },
  {
   "score": 1,
   "id": "dgii63c",
   "pid": "t1_dgg4x6n",
   "date": "2017-04-20 06:27:26",
   "depth": 3,
   "text": "[Not a spoiler, but just in case](/s \"So I want you to think this before you read this semi-world spoiler: \n\"Is this an illusion, a dream created by the survivors?\"\n\"Are the skies the freedom that all life seek, or is it vast darkness below that harbors the hope life needs?\"\n\"Why are the characters named in such a way, the history of the weapons, the stories and knowledge that the scavengers possess, the past stories from 500 years ago, and what are leprechauns?\"\nNow.... As you are thinking, you may proceed to read this semi-spoiler.\")\n\n[Semi-exposition spoiler](/s \"As you watch, I recommend 100% that you pay attention to the environment they are living in and the stories of the past in correlation with the current events. You realize that the leprechauns are actually dead spirits... So whether they are alive and breathing or dead as they live their dream out is up to the reader/watcher. The author strings along this idea of life and death that continues to torment ones mind; the world in between life and death. Whether what they are doing is prolonging the inevitable and/or whether their life currently is but a dream they created themselves, the characters hold on to a hope. Overall, ephemeral existences that can disappear (doesn't necessarily mean death) at anytime called leprechauns, and a story of a fragile and broke quasi-brave that can turn into dust at any moment. Fragile hearts, memories, and a ephemeral-like world. The islands are playing on a scale of life and death. If you watch and pay attention, below is darkness while the sky is hope. But the author plays with this with the stories of the scavengers who sacrifices their life for riches and adventures towards vast darkness called land, in which they assume holds knowledge for a hope of a future while the skies are a vast endless cage for them.\")\n\n[a bit of a spoiler on Ctholly...not really](/s \"Ctholly knowing the fact that she had out-lived her life as a weapon, as a brave, struggles to hold on until the promise she made with the broken quasi-brave is fulfilled. 3 tasks, 3 promises, and a bitter end. She doesn't die per se, she faded away after making a deal.\")"
  },
  {
   "score": 1,
   "id": "dggmd2b",
   "pid": "t1_dgg4x6n",
   "date": "2017-04-19 02:50:15",
   "depth": 3,
   "text": " ~~testing cuz im shit with spiler formatting~~\nill try to give an example, but im not a super good story teller and i recommend reading or watching the story. its a wild ride. \n [seriously super spoilerific](/s \"the show tends to string along the life and death of characters. if you find your self one who gets attached to characters lives you will feel stress wondering if they are alive or not. ill give the example of what happens with ctholly. super spoiler ahead. the novel constantly strings her life and death along, constantly 'killing' and reviving her before finally killing her off and then teasing ways to bring her back and then reminding us of the how violently she died. all the while her existence is a mixture of happiness, suffering and unrequited love.\")"
  },
  {
   "score": 1,
   "id": "dgfuaul",
   "pid": "t1_dgfgdlx",
   "date": "2017-04-18 14:37:42",
   "depth": 2,
   "text": ">as it seems to be heading towards the end of Volume 4/5.\n\nYou can tell just from these two episodes? I heard there's only 5 volumes in the series so how slow are the LNs if you can already tell we're going to get through at least 90% of the story?"
  },
  {
   "score": 6,
   "id": "dgg65tx",
   "pid": "t1_dgfuaul",
   "date": "2017-04-18 18:34:34",
   "depth": 3,
   "text": "Someone else in the thread mentioned that this episode covered pages 86-168 of the first novel (specifically peaceshot from Mori who is a subber) and seemed to think they might just pull it off. That said, the way it seemed to be phrased seemed to imply a lot of cuts and edits in order to make the whole thing fit.\n\nThen again, LNs - despite having \"novel\" in there - are not exactly long-form prose."
  },
  {
   "score": 26,
   "id": "dgfd860",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:34:44",
   "depth": 0,
   "text": "Really liking this one thus far, has done a nice job of sprinkling in bits of the MC's past without going to far making it just a boring monologue."
  },
  {
   "score": 10,
   "id": "dgft36c",
   "pid": "t3_663wur",
   "date": "2017-04-18 14:15:23",
   "depth": 0,
   "text": "citing Essay-kun known as **Mitrospeed** (u/Mitrospeed ?)\n\nAh I loved pretty much everything about this episode.\n\nThis here establishes some of the series's **strongest points**, the melancholic atmosphere and sadness slowly creeping up as you're faced with an impending doom. We were shown the bright side of the facility, the energy of children in their most innocent and careless time within their lives, well maybe a little bit too careless as we learn eventually.\n\nThe sole existence of these kids is to be soldiers and eventually sacrificial pawns when the enemy is too overbearing to handle with regular measures. They seem to be aware of this fact but it also seems that the lack of a parental figure who can teach them the importance of life and your own self being left a tremendous hole in their sense of self preservation. The way they brought this across differs a little from the novels as Almita had her arm pierced by a twig while here she fell head on from a cliff. I guess **having your head hurt which is a vital body part** brings the message across in a more clear way.\n\nAnyways, this and many other things serve as means to bring across this feeling of sadness behind this so happy facade that is children just enjoying themselves and it seems Willem is all to aware of that too.\n\nCan we talk about Willem for a moment cause oh boy, it's like a breath of fresh air for me. He's *not embarrassed* every minute or so because he is surrounded by multiple girls, he brushes of the suggestive advances of Naigrat ( yes I'll call her that now :P ), he **stays collected** and professional but can also be shaken by stuff he didn't expect yet he does not weigh on it for too long so it would become exaggerated. To me he feels like a **father figure** to most of the girls, someone who has seen a lot in his life and can't be swayed easily but has moment of familiarity and eases up when he is reminded of his family.\n\nThe ending dialogue between Willem and Kutori ( which is supported by a humming version of Always in my heart...soooo goood ) drops a bomb on us as we realize that the older those girls get the more aware they become of the importance of their own life. They eventually **don't want to die in some sort of last resort**, heck they *don't want to die **at all** but they can't help it. Kutori knows that and instead focuses on making as many experiences as she can get which comes right back to what she said in episode 1. She was satisfied with the experiences she had in the city and could move on now but she still has things she wishes to do before she has to end her own life.\n\nWell and about that ending scene. It was some sort of acupuncture treatment cause Kutori accumulated too much Venom in her muscles which leads to a feverish state and muscles cramps. Willem who seems to have used these weapons and venom before knows how to treat this and he went right at it while staying professional. He didn't throw a fit because he's touching a girl, he didn't make the scene suggestive, he maintained the state of the weaponry, as harsh as that sounds :P "
  },
  {
   "score": 10,
   "id": "dgfu9uq",
   "pid": "t3_663wur",
   "date": "2017-04-18 14:37:11",
   "depth": 0,
   "text": "'' *Seeing cute girl doing cute shit* ''\n\nAaaah, that's cute.\n\n'' *Seeing cute girl bleed and nearly dying but dont care enough* ''\n\nAh, that's dark.\n\n'' * Blue-Hair girl saying that she will die in 5 days * '' \n\nThat's sad :(\n\n'' * massage scene* '' \n\nO_o\n\n"
  },
  {
   "score": 10,
   "id": "dgfu8sg",
   "pid": "t3_663wur",
   "date": "2017-04-18 14:36:36",
   "depth": 0,
   "text": "[TFW even inhuman beings who don't value their own lives are afraid of you](http://i.imgur.com/ZCddyHv.jpg)"
  },
  {
   "score": 15,
   "id": "dgfgfrz",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:31:30",
   "depth": 0,
   "text": "This is fucking me up a little already. Kotori herself is sure that she's gonna die and she finally found someone with whom she can share her pain. That was a sad scene. \n\nAlso the scene with the kid falling down and no one coming to her aid. Even she doesn't care about being hurt, this is fucked up. They know they need to function as weapons and therefore don't fear death. \n\nWillem's a really good character, he's melancholic and this situation is clearly reminding him of his whole past. He was involved in something like before in some way seeing the flashback. In general, nice on them revealing only little by little of his past."
  },
  {
   "score": 1,
   "id": "dghwh88",
   "pid": "t1_dgfgfrz",
   "date": "2017-04-19 18:45:59",
   "depth": 1,
   "text": "It should be explained next episode. The first book really just set up the lore for the world. Books 2-5 are where the meat really lie. \n"
  },
  {
   "score": 18,
   "id": "dgfijy3",
   "pid": "t1_dgfgfrz",
   "date": "2017-04-18 11:08:55",
   "depth": 1,
   "text": "> This is fucking me up a little already. Kotori herself is sure that she's gonna die and she finally found someone with whom she can share her pain\n\n[](#schemingsaten)\n\n\nI'm thinking the fact that she feels attached to Will, should make her think about her suicide attack more cautiosly. Will already said that the power of the explotion is inversly proportional to how much do these girls care for their own lives. So Kutori's suicide attack should be less powerful now, hence a less logical solution.\n\n\n"
  },
  {
   "score": 11,
   "id": "dgfp4mi",
   "pid": "t1_dgfijy3",
   "date": "2017-04-18 13:06:40",
   "depth": 2,
   "text": "I thought so too, but absolutely nothing in what she said or did is hinting at such a change of heart. She said [she wants fond memories](https://i.imgur.com/5zQqM2A.jpg) and [to leave a mark](https://i.imgur.com/JZcFXs4.jpg) but doesn't even indirectly calls it her duty or a mere possibility.\n\nFrom [what Nygglatho said,](https://i.imgur.com/yO9E75M.jpg) it looks like it's as impossible for them to fear than as it is for us to fly. Though the OP shows Chtolly crying, so hopefully I am wrong ?"
  },
  {
   "score": 5,
   "id": "dggiume",
   "pid": "t1_dgfp4mi",
   "date": "2017-04-18 23:58:56",
   "depth": 3,
   "text": "I wouldn't say it's impossible for them to fear, it's just that they've been raised in isolation in the facility to have no real concept of fear of death. Chtolly seems like she's seen more of the world (skipped out to see other islands after missions?) as seen from the first episode, so maybe she's beginning to develop more of an attachment to staying alive than would be normal."
  },
  {
   "score": 9,
   "id": "dgfhcs0",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:47:43",
   "depth": 0,
   "text": "Jesus, this took one hell of a dark turn.\n\nThose little girls don't fear death? Welp, I know now that i'm going to be depressed as fuck."
  },
  {
   "score": 8,
   "id": "dgfk5ns",
   "pid": "t3_663wur",
   "date": "2017-04-18 11:37:43",
   "depth": 0,
   "text": "It is nice to have an MC who does not lose his shit when dealing with girls"
  },
  {
   "score": 8,
   "id": "dgfxet8",
   "pid": "t3_663wur",
   "date": "2017-04-18 15:40:24",
   "depth": 0,
   "text": "That last scene was lookin good, love the BGM and them BAM! they threw in that massage scene which really ruined the moment for me. However I'll stick around because it looks very promising, I just hope there is no more scenes like that."
  },
  {
   "score": 7,
   "id": "dgfyab7",
   "pid": "t3_663wur",
   "date": "2017-04-18 15:58:53",
   "depth": 0,
   "text": "Why do feel strangely cheated that Ithea isn't actually a cat girl and the 'ears' are tufts of hair?"
  },
  {
   "score": 9,
   "id": "dgg5hmf",
   "pid": "t1_dgfyab7",
   "date": "2017-04-18 18:22:03",
   "depth": 1,
   "text": "And how does she still wiggle them?"
  },
  {
   "score": 5,
   "id": "dgg6jc4",
   "pid": "t1_dgg5hmf",
   "date": "2017-04-18 18:41:31",
   "depth": 2,
   "text": "Magic. "
  },
  {
   "score": 6,
   "id": "dggw8tn",
   "pid": "t1_dgg6jc4",
   "date": "2017-04-19 07:35:34",
   "depth": 3,
   "text": "All [Fake catgirls](http://www.youtube.com/watch?v=5iILWOIrCHY&t=1m10s) have that inate ability to move their hair like real catgirls ears."
  },
  {
   "score": 5,
   "id": "dgfeuri",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:03:27",
   "depth": 0,
   "text": "What.... what... she's going to kill herself?! There's gotta be a way to save her... \n\nAlso the one girl just falling off the cliff and then not giving a fuck was kinda sad. These poor girls just living a life where they know they will die....\n\nAlso Ithea with the pretend cat ears. I got so excited seeing her initially, then felt let down when they showed her hair being done."
  },
  {
   "score": 1,
   "id": "dghwjq5",
   "pid": "t1_dgfeuri",
   "date": "2017-04-19 18:47:18",
   "depth": 1,
   "text": "Hahaha. haha. ha. ha..... ha.... *sighs*\n"
  },
  {
   "score": 4,
   "id": "dgfq2wh",
   "pid": "t3_663wur",
   "date": "2017-04-18 13:23:07",
   "depth": 0,
   "text": "The set-up in this show has been top-notch.  We had already been told that all of the girls in the warehouse were weapons, which was already disturbing in itself but this episode upped it another level.  Displayed perfectly with injured kid.    These kids clearly enjoy living, they love cake and they love playing ball games.  The girls are also cautious when approaching Wilhiem, worrying the wrong move will impact their fun times in the warehouse.  But the girls have no concern for their own well-being and don’t seem to care if their life is in danger. Something is wrong and doesn’t mesh well.  That’s what disturbed Willhem the most and disturbs me the most.\n\nI’m also loving all the characters, especially the two new older leprechauns.\n"
  },
  {
   "score": 4,
   "id": "dggi1ea",
   "pid": "t3_663wur",
   "date": "2017-04-18 23:25:34",
   "depth": 0,
   "text": "Man, I know it was a one-off insert song for the first episode, but I really do wish that Scarborough Fair was the OP song. The actual one isn't bad, but lacks the kind of hauntingly beautiful melancholy that fits the overall theme of the show."
  },
  {
   "score": 4,
   "id": "dgfpeln",
   "pid": "t3_663wur",
   "date": "2017-04-18 13:11:33",
   "depth": 0,
   "text": "Ithea best \"catgirl\"?"
  },
  {
   "score": 5,
   "id": "dgg5irh",
   "pid": "t3_663wur",
   "date": "2017-04-18 18:22:39",
   "depth": 0,
   "text": "Did anyone else expect that behind those locked doors the troll would show MC rows upon rows of fetuses floating in tubes?\n\nWhat's a catgirl doing with all the defeatureds? Best girl for now, in any case.\n\nWhy have the little children play near a dangerous cliff side like that? I know they're \"disposable\" in battle, but it probably costs a bit to raise them to fighting power, does it not?\n\nIf the 17 beasts are still around, that means the fairies have been failing to kill them and just sacrificing their lives for nothing? Or do they just act as decoys or something so the beasts will not eat the nearby beastmen? Or are there 17 beast *types*, and many of each type, like a bunch of temeres, etc?\n\n\"Buy me when I'm selling myself short! It's the basic rule for shopping smart.\" - loved this one"
  },
  {
   "score": 4,
   "id": "dgg8zzx",
   "pid": "t1_dgg5irh",
   "date": "2017-04-18 19:28:21",
   "depth": 1,
   "text": "There are 17 types. I believe some of them are unique, but most seem to be more of a species, with multiple individuals."
  },
  {
   "score": 1,
   "id": "dgg9mfx",
   "pid": "t1_dgg8zzx",
   "date": "2017-04-18 19:40:36",
   "depth": 2,
   "text": "That makes sense then, thanks!"
  },
  {
   "score": 8,
   "id": "dgganjw",
   "pid": "t1_dgg5irh",
   "date": "2017-04-18 20:01:42",
   "depth": 1,
   "text": "> \"Buy me when I'm selling myself short! It's the basic rule for shopping smart.\" - loved this one\n\nI also loved this line. Very smart comeback."
  },
  {
   "score": 5,
   "id": "dggmeei",
   "pid": "t3_663wur",
   "date": "2017-04-19 02:52:14",
   "depth": 0,
   "text": "People complain about the massage, and all I think of is how I would love him to give me a massage as well"
  },
  {
   "score": 3,
   "id": "dgfkioo",
   "pid": "t3_663wur",
   "date": "2017-04-18 11:44:07",
   "depth": 0,
   "text": "As someone who wasn't really sold by the first episode, I've got to admit I really enjoyed this one. A lot of development of the characters and a more in-depth look about what the show's all about, as well as what seems to be a lot of set-up for what's to come. I really don't know if I'm ready for the show to drop all of the suffering it seems to be teasing just yet though... \n\n[Think of the children](#yuitears)"
  },
  {
   "score": 3,
   "id": "dgfn1um",
   "pid": "t3_663wur",
   "date": "2017-04-18 12:29:37",
   "depth": 0,
   "text": "That was not 25 minutes! WHAT..."
  },
  {
   "score": 3,
   "id": "dgfekow",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:58:26",
   "depth": 0,
   "text": "This show keeps being excellent. Last week, I said that it was probably my favorite Spring 2017 anime, and I still think so. However, I'm also kind of afraid of continuing to watch. It seems like it could easily turn very dark, and those kids are so cute I feel like I'd fall into unholy rage if anything happened to them."
  },
  {
   "score": 6,
   "id": "dgflwo5",
   "pid": "t3_663wur",
   "date": "2017-04-18 12:09:15",
   "depth": 0,
   "text": "#HOLY SHIT THAT OP\n\n[](#hajimepout)\n\nOn one hand I'm really liking the series. It seems to have a similar tone to Mahou Tsukai no Yome (which I'm patiently waiting for the adaptation) but I'm really disliking a lot of the typical light novel elements. Ithnea is annoying, and the fanservice is rather offputting and oddly placed at times. I hope it doesn't continue to be a big deal, because if it does I'll end up liking this show less than I want to.\n\nOverall though, the premise is sweet so I hope this goes somewhere. That OP looks crazy spoilery though, is it?\n\n"
  },
  {
   "score": 2,
   "id": "dgfg9mz",
   "pid": "t3_663wur",
   "date": "2017-04-18 10:28:30",
   "depth": 0,
   "text": "Very interesting world so far, especially with the flashbacks.\n\nSuch a weird mixture of cute and tragic. These girls are going to kill me :("
  },
  {
   "score": 1,
   "id": "dggj52u",
   "pid": "t1_dgfg9mz",
   "date": "2017-04-19 00:11:40",
   "depth": 1,
   "text": "I think you mean they'll kill themselves, and therefore you (and me as well)"
  },
  {
   "score": 2,
   "id": "dgfizaj",
   "pid": "t3_663wur",
   "date": "2017-04-18 11:16:34",
   "depth": 0,
   "text": "i was expecting her to go full Iroha and reject him"
  },
  {
   "score": 2,
   "id": "dgfl4tf",
   "pid": "t3_663wur",
   "date": "2017-04-18 11:55:19",
   "depth": 0,
   "text": "Im loving this anime. Im really hoping that something cliche happens and Ctholly doesnt end up dying... my heart couldnt take it, even if we've only known her for 48 precious minutes. "
  },
  {
   "score": 2,
   "id": "dgfnapy",
   "pid": "t3_663wur",
   "date": "2017-04-18 12:34:07",
   "depth": 0,
   "text": "Beginning of Ep 1: Well this looks cute\n\nEnd of Ep2: And they shall know no fear\n\nThis is definitely an unkind world. Looking forward to the next episode."
  },
  {
   "score": 2,
   "id": "dgfqmds",
   "pid": "t3_663wur",
   "date": "2017-04-18 13:32:32",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 0,
   "id": "dgfqqve",
   "pid": "t1_dgfqmds",
   "date": "2017-04-18 13:34:49",
   "depth": 1,
   "text": "May I ask how old you are? I'm 30+, but I can't find anything worth watching the next episode for.\n\nEveryone seems to love it."
  },
  {
   "score": 2,
   "id": "dgfsa3m",
   "pid": "t1_dgfqqve",
   "date": "2017-04-18 14:01:27",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 3,
   "id": "dgfsu6e",
   "pid": "t1_dgfsa3m",
   "date": "2017-04-18 14:11:03",
   "depth": 3,
   "text": "Wut, this season is one of the best ever for me. DanMachi Gaiden (first one was great), Re:Creators, Shingeki no Bahamut:VS, Attack on Titan S2, Boku no Hero Academia S2, Gundam Thunderbolt S2.\n\nAnd Samurai Jack. :P"
  },
  {
   "score": 2,
   "id": "dgfr1nr",
   "pid": "t3_663wur",
   "date": "2017-04-18 13:40:08",
   "depth": 0,
   "text": "How old is Willem? Cause the his flashbacks pretty much imply that he's lived a really long time. "
  },
  {
   "score": 1,
   "id": "dgg1g8r",
   "pid": "t1_dgfr1nr",
   "date": "2017-04-18 17:04:49",
   "depth": 1,
   "text": "The show's website says he is 18, but he was alive when humanity was wiped out 500 years ago. He got frozen somehow and awakened in the present. This is all stated in the show's synopsis."
  },
  {
   "score": 1,
   "id": "dgry05o",
   "pid": "t1_dgfr1nr",
   "date": "2017-04-26 07:38:09",
   "depth": 1,
   "text": "18 but was frozen by a beast for a more than 500 years, just revived a couple of years ago (or shorter than that).   Before his stasis he lived in an orphanage and was the older kid there so he took care of the youger children and they called him \"father\" as a nickname, but was not their actual dad."
  },
  {
   "score": 2,
   "id": "dgfscl2",
   "pid": "t3_663wur",
   "date": "2017-04-18 14:02:41",
   "depth": 0,
   "text": "Im sort of surprised, I really didnt expect to like Ctholly so much. "
  },
  {
   "score": 2,
   "id": "dgfzwe8",
   "pid": "t3_663wur",
   "date": "2017-04-18 16:32:55",
   "depth": 0,
   "text": "I really cant wait to learn more about everything.  This world is really interesting and it reminds me a lot of other post apoc fantasy shows (which i liked).  So i want to know more about that.  Hopefull ythey touch on that soon.  \n\nI liked MC-kuns reaction to seeing the weapons, but i feel like him knowing all thier names should be a big red flag for everyone.  arnt those military secret weapons that no one should know about?  In the ending flashback we see him with 2 girls using the 2 faries swords and he also has 2 of the swords on his back, that didnt seem to be in the armory... so where is his swords then...  I like this setup though and look foward to where it goes.  \n\nEveryone has been saying how this is a lot like Black Bullet (which i agree, but it isnt a bad thing).  I like how the situation is similiar too.  MC-kun is a lot like those girls, a holy sword user, so im guessing hes going to choose to fight with them in 5 days and try to change fate.  Rentaro in Black Bullet was the same, he was also a tool to fight the monsters and fought with the girls to try to change thier fate.  Its a nice parallel.  \n\nWe shall see where it goes from here!  \n\n[](#meguminthumbsup)"
  },
  {
   "score": 1,
   "id": "dggmnp2",
   "pid": "t1_dgfzwe8",
   "date": "2017-04-19 03:05:26",
   "depth": 1,
   "text": "> arnt those military secret weapons that no one should know about?\n\nTheir names aren't secrets, and their existence is well known.\n\n> MC-kun is a lot like those girls, a holy sword user, so im guessing hes going to choose to fight with them in 5 days and try to change fate.\n\nHe's not at all like them. [LN spoilers](/s \"He comes from a (relatively) normal human background, despite the requirement to use the holy swords being that destiny literally hates you (Chtholly's sword in particular; it's the strongest) and can't really fight due to the aftereffects of a curse that left him petrified for 500 years. A little bit of training with Chtholly (will probably happen next ep) nearly kills him. Furthermore, the purpose of the Holy Swords wasn't to kill Beasts, it was to kill what are essentially the Gods, as they regard humans as a mistake and tried to wipe them out on multiple occasions.\")\n\nThere are absolutely key differences between SukaSuka and Black Bullet, but most of them delve into spoiler territory (I've tagged basically everything that hasn't been mentioned in the anime yet but there are fundamental differences between them)."
  },
  {
   "score": 2,
   "id": "dgg6d7p",
   "pid": "t3_663wur",
   "date": "2017-04-18 18:38:15",
   "depth": 0,
   "text": "I was thinking, the girls get's stronger cause they don't care about their lives, but if Chtholly falls in love with MC, didn't she get weaker in battle because she's going to care more about her life, wanting to be with someone she loves? \n\nThat's pretty messed up, I think the MC is going to crush her heart to avoid that from happening. The romance is just inversely proportional with the combat part. \n\nI'm prepared already for some fked up things in the future.\n\nAll in all a fine show until now, looking forward to how things goes."
  },
  {
   "score": 1,
   "id": "dggjz59",
   "pid": "t1_dgg6d7p",
   "date": "2017-04-19 00:50:06",
   "depth": 1,
   "text": "Or that selfless sacrifice brings out the biggest potential"
  },
  {
   "score": 2,
   "id": "dgfw61w",
   "pid": "t3_663wur",
   "date": "2017-04-18 15:14:51",
   "depth": 0,
   "text": "Welp.\n\nFirst episode was interesting but now we really got to exposition galore, pointless death flags up the wazoo and TOTALLY NOT A SEX SCENE WITH A 15 YEAR OLD GIRL I SWEAR.\n\nI guess this is my stop, thankfully there are plenty of good shows left this season."
  },
  {
   "score": 11,
   "id": "dgfz9iq",
   "pid": "t1_dgfw61w",
   "date": "2017-04-18 16:19:31",
   "depth": 1,
   "text": "> death flags\n\nThat's not a death flag. If there is one good thing that came out of Taboo Tattoo, [it's the lesson on what death flags are](https://streamable.com/jw1z). Someone plainly acknowledging they are about to die isn't a death flag."
  },
  {
   "score": 1,
   "id": "dgga4xh",
   "pid": "t1_dgfz9iq",
   "date": "2017-04-18 19:50:59",
   "depth": 2,
   "text": "\\>5 days left to live\n\n\\>still alive up to final episode"
  },
  {
   "score": 2,
   "id": "dgfd1w8",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:31:46",
   "depth": 0,
   "text": "Much more interesting ep than last week, still not all that engaged in anything that's happening though and certainly not at all when it comes to the majority of the cast based purely on their introductions and the little bit of detail they've been given. At least not outside of the MC, he's solid so far.\n\nActually would rather the story be purely about these flashbacks we're getting, they seem much more interesting."
  },
  {
   "score": 1,
   "id": "dgfgtca",
   "pid": "t1_dgfd1w8",
   "date": "2017-04-18 10:38:12",
   "depth": 1,
   "text": "The past will gradually become more important as the story progresses :) The flashbacks were actually always my favorite part too."
  },
  {
   "score": 1,
   "id": "dgfe6lf",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:51:39",
   "depth": 0,
   "text": "What do all of these questions mean? "
  },
  {
   "score": 1,
   "id": "dgfn26l",
   "pid": "t3_663wur",
   "date": "2017-04-18 12:29:47",
   "depth": 0,
   "text": "should i be feeling peaceful or depressed"
  },
  {
   "score": 1,
   "id": "dgfo8wr",
   "pid": "t3_663wur",
   "date": "2017-04-18 12:51:05",
   "depth": 0,
   "text": "Can a LN reader please tell me Willem's age? I want to ship him with Chtolly but I don't want to go to jail as well."
  },
  {
   "score": 1,
   "id": "dgfv6bm",
   "pid": "t1_dgfo8wr",
   "date": "2017-04-18 14:54:46",
   "depth": 1,
   "text": "http://sukasuka-anime.com/chara/willem.html#c_list_block_0002"
  },
  {
   "score": 3,
   "id": "dgglth4",
   "pid": "t1_dgfo8wr",
   "date": "2017-04-19 02:22:15",
   "depth": 1,
   "text": "The summary basically puts him at ~18, or ~518, depending on how you count it. He was petrified for 500 years."
  },
  {
   "score": 5,
   "id": "dgfxssw",
   "pid": "t1_dgfo8wr",
   "date": "2017-04-18 15:48:32",
   "depth": 1,
   "text": "Not an LN reader, but according to the show's site he's 18, which is good because I was thinking he was like mid 20s"
  },
  {
   "score": 1,
   "id": "dgfp2ss",
   "pid": "t3_663wur",
   "date": "2017-04-18 13:05:46",
   "depth": 0,
   "text": "I always seem to have a great interest in fantasy settings with named legendary swords, so far i am loving this show so much, i'm glad it's appearing to get a full adaptation, i want to read spoilers so bad but i feel like it would sour the experience of watching it start to finish, so anyone that's read the LN's can you tell me if the ending is a good ending?(as in one that doesn't leave you feeling like you shouldn't have invested time into it)"
  },
  {
   "score": 1,
   "id": "dgjvnsl",
   "pid": "t1_dgfp2ss",
   "date": "2017-04-20 23:43:52",
   "depth": 1,
   "text": "Someone died, but all of them, regardless of dead or alive,  accomplished what they desired to do from the beginning of the story. So, for me it's a meaningful ending and I truely cherish the whole ride. "
  },
  {
   "score": 1,
   "id": "dgfr0ls",
   "pid": "t3_663wur",
   "date": "2017-04-18 13:39:36",
   "depth": 0,
   "text": "They... don't care if they die? That's pretty fucked."
  },
  {
   "score": 1,
   "id": "dgfvhqy",
   "pid": "t3_663wur",
   "date": "2017-04-18 15:01:09",
   "depth": 0,
   "text": "Excellent episode, I am liking where the series is going so far.I think we are going to be in for quite a bit of suffering though so I hope the payoff is worth it."
  },
  {
   "score": 1,
   "id": "dgfxk0z",
   "pid": "t3_663wur",
   "date": "2017-04-18 15:43:26",
   "depth": 0,
   "text": "Much better episode. Heavy on the exposition, but at least it was meaningful. They should've taken some of the info and scenes from this episode and mixed it into the first one. Would've grabbed my attention more quickly. But I'm still not attached to any single character. They all seem pretty generic or uninteresting so far. I like the kids as group, but it's not hard to make kids likable. Maybe my feelings will change when bitches start exploding. Though I'm guessing Chtholly's power or even ability to explode will be mitigated by her crush on Willem."
  },
  {
   "score": 1,
   "id": "dgg1bl5",
   "pid": "t3_663wur",
   "date": "2017-04-18 17:02:17",
   "depth": 0,
   "text": "This show is so cute..."
  },
  {
   "score": 1,
   "id": "dgg1id3",
   "pid": "t3_663wur",
   "date": "2017-04-18 17:05:58",
   "depth": 0,
   "text": "Why is [next ep's title](http://imgur.com/Qb2CFnY) translated like that? Ain't even close."
  },
  {
   "score": 6,
   "id": "dgg2g0f",
   "pid": "t1_dgg1id3",
   "date": "2017-04-18 17:23:50",
   "depth": 1,
   "text": "The chapters in the book all have a Japanese name and a completely unrelated (and sometimes ridiculous) English name. I don't know why. The episode titles come from the chapter titles."
  },
  {
   "score": 2,
   "id": "dghj00l",
   "pid": "t1_dgg2g0f",
   "date": "2017-04-19 14:10:47",
   "depth": 2,
   "text": "Re:Creators is doing the same thing, and Aldnoah.Zero did it too."
  },
  {
   "score": 1,
   "id": "dgg1t9k",
   "pid": "t3_663wur",
   "date": "2017-04-18 17:11:49",
   "depth": 0,
   "text": "This name, holy shit... Trying to remember all of this is a pain in the ass."
  },
  {
   "score": 1,
   "id": "dgg1vnv",
   "pid": "t3_663wur",
   "date": "2017-04-18 17:13:07",
   "depth": 0,
   "text": "Might be my favorite from this season. The dialogue is just so good, the way characters act is just so casual and fitting. This second episode definitely topped the already great first episode and shows even more potential this show has.\n\nIm definitely staying"
  },
  {
   "score": 1,
   "id": "dgg379b",
   "pid": "t3_663wur",
   "date": "2017-04-18 17:38:31",
   "depth": 0,
   "text": "Lol evil little twerps "
  },
  {
   "score": 1,
   "id": "dgg4hlb",
   "pid": "t3_663wur",
   "date": "2017-04-18 18:02:50",
   "depth": 0,
   "text": "This is too cute. Tragedy sensors at maximum. Time to batten down the hatches."
  },
  {
   "score": 1,
   "id": "dggq3ig",
   "pid": "t1_dgg4hlb",
   "date": "2017-04-19 05:16:05",
   "depth": 1,
   "text": "dive dive dive into deep emotional connections with every character!"
  },
  {
   "score": 1,
   "id": "dgg4pnp",
   "pid": "t3_663wur",
   "date": "2017-04-18 18:07:11",
   "depth": 0,
   "text": "Really hope this doesn't need a tragedy tag in the future... :("
  },
  {
   "score": 1,
   "id": "dggbglh",
   "pid": "t3_663wur",
   "date": "2017-04-18 20:19:10",
   "depth": 0,
   "text": "I'm not ready for a bunch of children to die"
  },
  {
   "score": 1,
   "id": "dggepi8",
   "pid": "t1_dggbglh",
   "date": "2017-04-18 21:36:43",
   "depth": 1,
   "text": "The last anime in which I've seen a bunch of children die at once was in Black Bullet. I'm ready...not."
  },
  {
   "score": 1,
   "id": "dggf79e",
   "pid": "t3_663wur",
   "date": "2017-04-18 21:50:10",
   "depth": 0,
   "text": "So the lolis will become a weapon to surpass Metal Gear?!"
  },
  {
   "score": 1,
   "id": "dggiw3s",
   "pid": "t3_663wur",
   "date": "2017-04-19 00:00:42",
   "depth": 0,
   "text": "Will there eventually be some kind of explanation for why they only use girls as weapons? It seems like it won't matter that much to the plot but it's going to bother me if there isn't at least some attempt to explain it."
  },
  {
   "score": 2,
   "id": "dggmo4i",
   "pid": "t1_dggiw3s",
   "date": "2017-04-19 03:05:59",
   "depth": 1,
   "text": "They don't explicitly say it here but in the same LN chapters animated mention only girl leprechauns exist."
  },
  {
   "score": 1,
   "id": "dggtfnv",
   "pid": "t1_dggmo4i",
   "date": "2017-04-19 06:38:57",
   "depth": 2,
   "text": "That makes enough sense then, thanks."
  },
  {
   "score": 1,
   "id": "dggns4p",
   "pid": "t3_663wur",
   "date": "2017-04-19 03:56:45",
   "depth": 0,
   "text": "I don't know if I can bear to keep watching, not because it's bad, but because I might not be able to handle the feels."
  },
  {
   "score": 1,
   "id": "dggtuvf",
   "pid": "t3_663wur",
   "date": "2017-04-19 06:47:56",
   "depth": 0,
   "text": "They're really managing to hit all the right notes with the tone of this show.\n\nThe scene where Willem went to pick up the girls from the military was poignant and well done. It perfectly encapsulated the relationship between frontline soldiers going off to war and the ones waiting for them at home behind the lines. While it was a relief to see them returning safely, Willem is obviously not going to get his hopes up as he knows that the next time they return, it may well be in a casket. Being the welcoming party for someone who may or may not be returning home alive is not a pleasant job.\n\nThe little heart-to-heart between him and Ithea on the way back was also pretty nice. Simple and to the point with neither of them really hiding anything about what they are or what they know. It helped a lot for moving her character a bit further past the playful energetic archetype.\n\nAlso, apparently we've had the technology for making catgirls all along. Who knew you could do so much with a comb?"
  },
  {
   "score": 1,
   "id": "dgha1ug",
   "pid": "t3_663wur",
   "date": "2017-04-19 11:36:35",
   "depth": 0,
   "text": "This show is gonna fucking kill me, dude..."
  },
  {
   "score": 1,
   "id": "dgho6rm",
   "pid": "t3_663wur",
   "date": "2017-04-19 15:54:29",
   "depth": 0,
   "text": "Can someone tell me what the title of the anime translates to in english?"
  },
  {
   "score": 1,
   "id": "dghygo7",
   "pid": "t1_dgho6rm",
   "date": "2017-04-19 19:25:40",
   "depth": 1,
   "text": "\"WorldEnd: What do you do at the end of the world? Are you busy? Will you save us?\" \n\nVia the intro theme's translation from this episode."
  },
  {
   "score": 3,
   "id": "dgi9ira",
   "pid": "t1_dghygo7",
   "date": "2017-04-20 00:51:03",
   "depth": 2,
   "text": "ITs actually double meaning and a pun because the same title could as well translate as \"What are you doing this weekend? Are you busy? Could you help me out?\""
  },
  {
   "score": 1,
   "id": "dgi9ap5",
   "pid": "t3_663wur",
   "date": "2017-04-20 00:40:22",
   "depth": 0,
   "text": "After all the comments about the light novels, I actually want to buy and read them (in English), but don't know where to do so. Amazon turns up nothing, cd japan I could only find a listing for volume 3 (sold out, also looked like it is in Japanese).  \nI thought I saw someone here say that the first four volumes are translated and released. Is this not the case?"
  },
  {
   "score": 1,
   "id": "dgxpgxo",
   "pid": "t1_dgi9ap5",
   "date": "2017-04-29 22:06:22",
   "depth": 1,
   "text": "you can read them here if u want\nhttp://www.novelupdates.com/series/shuumatsu-nani-shitemasu-ka-isogashii-desu-ka-sukutte-moratte-ii-desu-ka/"
  },
  {
   "score": 1,
   "id": "dgrybmb",
   "pid": "t1_dgi9ap5",
   "date": "2017-04-26 07:44:07",
   "depth": 1,
   "text": "They're pretty recent and not currently translated outside Japan.  You have to wait (maybe for a long time, if ever) or sail the seven seas and get a fan translated  PDF or Epub (I think they're already up to volume 4 out of of 5)."
  },
  {
   "score": 1,
   "id": "dgldk6l",
   "pid": "t3_663wur",
   "date": "2017-04-21 22:30:25",
   "depth": 0,
   "text": "We're only two episodes in but I really hope this gets as many seasons as it needs to finish the story. This show has everything I could want. Action, interesting backstory, cute kids, a romance that I can get on board with from the start."
  },
  {
   "score": 1,
   "id": "dhyr3z3",
   "pid": "t3_663wur",
   "date": "2017-05-23 22:17:32",
   "depth": 0,
   "text": "Dumb question I'm sure, but is there like a Prequel to this or something? I feel like I'm missing out on an entire Story here."
  },
  {
   "score": 1,
   "id": "dgg7dc8",
   "pid": "t3_663wur",
   "date": "2017-04-18 18:57:27",
   "depth": 0,
   "text": "This show could do without the romantic harem shit. It's got a strong story going for it. Feels out of place and unnecessary. "
  },
  {
   "score": 6,
   "id": "dggw2pm",
   "pid": "t1_dgg7dc8",
   "date": "2017-04-19 07:32:15",
   "depth": 1,
   "text": "Hmmm... It's not an Harem. Only Chtholly seems to like the MC, Nephren didn't show any resemblance of romantic feelings towards him and Ithea was only teasing him. I mean, there's one that literally wants to eat him, but yeah... she also doesn't seem to have romantic feelings toward him.\n\n"
  },
  {
   "score": 1,
   "id": "dgi7ne9",
   "pid": "t1_dggw2pm",
   "date": "2017-04-19 23:29:32",
   "depth": 2,
   "text": "What about the girl standing outside the bedroom of the final scene?"
  },
  {
   "score": 3,
   "id": "dgief9a",
   "pid": "t1_dgi7ne9",
   "date": "2017-04-20 04:43:42",
   "depth": 3,
   "text": "She standing outside of the bedroom to hear the conversation doesn't mean that she is in love with him. Since the other girl doesn't seem to have much time to live, she could be hearing the conversation because of that.\nReally don't think that this show will turn into harem...  even if some of the characters end up having romantic feelings towards the MC."
  },
  {
   "score": 7,
   "id": "dggjysx",
   "pid": "t1_dgg7dc8",
   "date": "2017-04-19 00:49:39",
   "depth": 1,
   "text": "What harem?"
  },
  {
   "score": 0,
   "id": "dggolyl",
   "pid": "t1_dggjysx",
   "date": "2017-04-19 04:28:07",
   "depth": 2,
   "text": "The three girls being teased as MCs love interests. "
  },
  {
   "score": 5,
   "id": "dggp6aj",
   "pid": "t1_dggolyl",
   "date": "2017-04-19 04:47:28",
   "depth": 3,
   "text": "which 3"
  },
  {
   "score": 1,
   "id": "dggku74",
   "pid": "t3_663wur",
   "date": "2017-04-19 01:32:17",
   "depth": 0,
   "text": "I can't help but feel that this should've been the a later episode or at least the third one. The mood shift regarding the little ones were okay but Chtholly's feelings are developing a bit too fast. I think that both could've gotten more impact if they were built up more regardless of their predictability.\n\n**EDIT:** grammar"
  },
  {
   "score": 2,
   "id": "dggvohf",
   "pid": "t1_dggku74",
   "date": "2017-04-19 07:24:38",
   "depth": 1,
   "text": "Agree. The mood shift of the characters is happening too quickly. I don't mind the way that Chtholly feels about the MC, neither do mind the fact that the kids started liking the MC so quickly, since they are a special condition, but the way that the MC feels towards them was really rushed. One more episode would make it better imo.\n\nThat said, I'm really liking this series."
  },
  {
   "score": 2,
   "id": "dggzn06",
   "pid": "t1_dggvohf",
   "date": "2017-04-19 08:36:01",
   "depth": 2,
   "text": "MC is trying to recapture the good old days with those as proxies, not that absurd of an concept"
  },
  {
   "score": 2,
   "id": "dgh1nm2",
   "pid": "t1_dggzn06",
   "date": "2017-04-19 09:11:02",
   "depth": 3,
   "text": "I don't think that is absurd and I quite like the idea, but that doesn't change the fact that it was a rushed shift of mood on the MC part.\n\nI think that it's rushed because he just met these girls last episode and he caring so much for them on this episode feels like it's moving too fast. Even if it has a reason behind it. (It has a specific scene that bothered me. Though It could be just a bad choice of words or bad translations). \n\n"
  },
  {
   "score": 5,
   "id": "dggme52",
   "pid": "t1_dggku74",
   "date": "2017-04-19 02:51:52",
   "depth": 1,
   "text": "she's dying and is latching on the one with the most affection toward, not that absurd"
  },
  {
   "score": 1,
   "id": "dggnaxb",
   "pid": "t1_dggme52",
   "date": "2017-04-19 03:36:28",
   "depth": 2,
   "text": "It's not that I think that it's unbelievable but that the emotional connection hasn't sunken in yet for me--almost similar with his realization of the kids being weapons. As it seems like Willem's already from an orphanage, I can accept it a bit more that he looked at the kids similarly to those with him in the past so his shock that they truly are weapons was genuine, but I think that showing him in disbelief first after being told by Chtholly about the truth and reassuring himself that the kids are normal would have more weight to it. "
  },
  {
   "score": 1,
   "id": "dgh17ol",
   "pid": "t3_663wur",
   "date": "2017-04-19 09:03:20",
   "depth": 0,
   "text": "I really like this show a lot, but it feels like a 6/10 show with a 10/10 premise."
  },
  {
   "score": 1,
   "id": "dgib2sw",
   "pid": "t3_663wur",
   "date": "2017-04-20 02:10:11",
   "depth": 0,
   "text": "This and Re:Creators are definitely my favorite 2 this season. (Already reading the novel of this as well)"
  },
  {
   "score": 0,
   "id": "dgfd0ax",
   "pid": "t3_663wur",
   "date": "2017-04-18 09:30:59",
   "depth": 0,
   "text": "Still waiting for subs.\n\nEDIT: Oops, didn't see. "
  },
  {
   "score": 1,
   "id": "dgfd35k",
   "pid": "t1_dgfd0ax",
   "date": "2017-04-18 09:32:21",
   "depth": 1,
   "text": "They have been out for a while now."
  },
  {
   "score": 0,
   "id": "dgg9ezz",
   "pid": "t3_663wur",
   "date": "2017-04-18 19:36:26",
   "depth": 0,
   "text": "Had to switch from speakers to headphones when it was getting near that \"certain\" scene. Was hoping they would do the \"deed\" but disappointingly they didn't... "
  },
  {
   "score": -1,
   "id": "dgfi8wi",
   "pid": "t3_663wur",
   "date": "2017-04-18 11:03:27",
   "depth": 0,
   "text": "oh god suicide bomber loli heaven. with 15 yo hotties and hungry milf to boot."
  },
  {
   "score": -2,
   "id": "dgfqizm",
   "pid": "t3_663wur",
   "date": "2017-04-18 13:30:55",
   "depth": 0,
   "text": "Harem..........."
  },
  {
   "score": -12,
   "id": "dgflcoc",
   "pid": "t3_663wur",
   "date": "2017-04-18 11:59:11",
   "depth": 0,
   "text": "> Weapons that burn out their lives  \n\n[that's it?](#annoyedmayaka)\n\nThe wolf girl - Ithea, needs to SHUT THE FUCK UP. Making fun of your own tropes is not self deprecating comedy, it's shitty meta commentary in world. I had the exact same problem with ep 1 post credits scene.  \n\nAlso, Willem is a military officer *and* a veteran of war. He's rightfully not phased by this revelation. Also, we were told that the fairies have no self-preservation instincts. Why does Ctholly care about her end days? And if she cares so much, why wouldn't Willem slap her for even thinking like that for her own good?\n\nAside from the somewhat dry presentation that's neither comfy enough, nor ominous, nor really dramatic. Ctholly's pleas for \"feel sad for me\" fall on deaf ears. \n\nI'm sorry, I'm basically spoiled by a [better show](http://i.imgur.com/TMtNdAA.jpg). I'll [have to put you down SukaSuka](https://www.youtube.com/watch?v=OExgESguspo&list=PL7B00CB142B7CF45A&index=14). (not dropping it btw)"
  },
  {
   "score": 2,
   "id": "dgfzjq7",
   "pid": "t1_dgflcoc",
   "date": "2017-04-18 16:25:31",
   "depth": 1,
   "text": "> Why does Ctholly care about her end days?\n\nThis is explained in the LN. The lack of self preservation instincts is strongest when the fairies are young. As they grow older, they become more normal in a sense."
  },
  {
   "score": 2,
   "id": "dghd2pb",
   "pid": "t1_dgfzjq7",
   "date": "2017-04-19 12:28:43",
   "depth": 2,
   "text": "[Spoiler?](/s \"Also, the senpai that 'gave' her the silver brooch\")"
  },
  {
   "score": 5,
   "id": "dgfrdom",
   "pid": "t1_dgflcoc",
   "date": "2017-04-18 13:46:07",
   "depth": 1,
   "text": "> The wolf girl - Ithea, needs to SHUT THE FUCK UP. Making fun of your own tropes is not self deprecating comedy, it's shitty meta commentary in world. I had the exact same problem with ep 1 post credits scene. \n\nIt's not really supposed to be a commentary on LN tropes. She just reads a ton of trashy romance novels, which is why she seems to communicate almost entirely in shitty romance cliches. It's explained in the LN that they don't really get to leave the island at all outside of military business, so most of their knowledge of the outside world comes from just books and stuff from the mansion.\n\nA lot of exposition was cut form the anime, which in most cases isn't really necessary at all but in this case I think it can definitely make a lot of people view her a lot less charitably lol (and even ignoring that I can see why her dialogue would still still come off as pretty grating). But even if the execution doesn't work it's not really that odd for a teenager, there are plenty of teenage girls who can't help but constantly compare their lives to twilight or w/e."
  },
  {
   "score": 5,
   "id": "dgfo5g3",
   "pid": "t1_dgflcoc",
   "date": "2017-04-18 12:49:22",
   "depth": 1,
   "text": "> Also, we were told that the fairies have no self-preservation instincts. Why does Ctholly care about her end days? And if she cares so much, why wouldn't Willem slap her for even thinking like that for her own good?\n\nBecause they are not a hivemind who went through the same experiences and have exactly the same personality? Because Willem cares about her due to his past that he is seeing again in the girls since he started working in the \"warehouse\"?"
  },
  {
   "score": -2,
   "id": "dgfojuj",
   "pid": "t1_dgfo5g3",
   "date": "2017-04-18 12:56:22",
   "depth": 2,
   "text": "> Because they are not a hivemind who went through the same experiences and have exactly the same personality? \n\nNo, but they have the same instict - self-preservation is irrelevant, therefore why should one give shit about my life ending? The script backtracks on its own statement so Ctholly can make a plea for sympathy. This is what I call backpedaling.  \n\n> Because Willem cares about her due to his past that he is seeing again in the girls since he started working in the \"warehouse\"?\n\nThat just reinforces my statement that Willem should slap her and talk her down *hard*. He's a war veteran, he values life more than any of the fairies could understand."
  },
  {
   "score": 1,
   "id": "dghcydl",
   "pid": "t1_dgfojuj",
   "date": "2017-04-19 12:26:43",
   "depth": 3,
   "text": "Just because they should doesn't mean they're gonna do it. You say he should slap her as if he has to slap her. People have varying personalities, not everyone is gonna slap someone just because they care about their own end days"
  },
  {
   "score": 5,
   "id": "dgfp71a",
   "pid": "t1_dgfojuj",
   "date": "2017-04-18 13:07:50",
   "depth": 3,
   "text": "She doesn't want to preserve her life, she wants attention and affection from Willem. And of course, Leprechauns imitate humans, meaning along the way she can find a reason to live.\n\nHe wouldn't slap Almaria or Lillia. He [also](/s \"isn't in position to talk about to talk down people when it comes to self-sacrifices.\")"
  },
  {
   "score": 0,
   "id": "dgfputx",
   "pid": "t1_dgfp71a",
   "date": "2017-04-18 13:19:18",
   "depth": 4,
   "text": "I'm willing to forgive the scene if they build up on it. But for what it is now, it falls flat on its face and is a cause for concern."
  },
  {
   "score": 5,
   "id": "dgfqnf4",
   "pid": "t1_dgfputx",
   "date": "2017-04-18 13:33:05",
   "depth": 5,
   "text": "Stuff doesn't need to be built up in chronological order or given any kind of deeper meaning beforehand, you know that narratives don't need to be made in a linear fashion and that you can use this drama as a build-up for something later, feel free to care about the two of them as much as the show allowed you to up to this point. You just want some reason to shit on this show and your opinion about it probably won't improve because you already set your mind that everything it's going to develop is shit."
  },
  {
   "score": 17,
   "id": "dgfm14k",
   "pid": "t1_dgflcoc",
   "date": "2017-04-18 12:11:29",
   "depth": 1,
   "text": "> I'm sorry, I'm basically spoiled by a better show. I'll have to put you down SukaSuka. (not dropping it btw)\n\nStop bringing irrelevant shows into the discussion every single time just because you want to shill them."
  },
  {
   "score": -8,
   "id": "dgfmdhi",
   "pid": "t1_dgfm14k",
   "date": "2017-04-18 12:17:35",
   "depth": 2,
   "text": "SukaSuka is about weaponized lolis  \n\nGunslinger Girl is about weaponized lolis\n\n\\> irrelevant\n\n[](#annoyedkirito)"
  }
 ]
}