{
 "score": 709,
 "id": "6fmpf1",
 "num_comments": 300,
 "date": "2017-06-06 09:01:18",
 "comments": [
  {
   "score": 229,
   "id": "dijbp5p",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:08:11",
   "depth": 0,
   "text": "Bloody hell, that's a heavy reveal to so casually drop in the first five minutes of an episode like that..."
  },
  {
   "score": 3,
   "id": "dijhhfn",
   "pid": "t1_dijbp5p",
   "date": "2017-06-06 10:49:20",
   "depth": 1,
   "text": "what was revealed? didn't quite get it..."
  },
  {
   "score": 30,
   "id": "dijjx75",
   "pid": "t1_dijhhfn",
   "date": "2017-06-06 11:32:01",
   "depth": 2,
   "text": "Ithea became her past self. Basically she went through what Chtholly is going through but completely lost herself. The new Ithea was only able to act like her because of the diary she left behind. "
  },
  {
   "score": 7,
   "id": "dijk2ok",
   "pid": "t1_dijjx75",
   "date": "2017-06-06 11:34:43",
   "depth": 3,
   "text": "isn't that potentially hundreds of years old? if it's spirit necromancy and stuff..."
  },
  {
   "score": 14,
   "id": "dijlev8",
   "pid": "t1_dijk2ok",
   "date": "2017-06-06 11:57:41",
   "depth": 4,
   "text": "Probably months or years old at most, she grew up with the other fairies and she, so her memory loss came from a time starting from being active as a fairy soldier, given her age it should've happened three years before at most considering it happened in of her very first battles."
  },
  {
   "score": 5,
   "id": "dijosbw",
   "pid": "t1_dijlev8",
   "date": "2017-06-06 12:55:54",
   "depth": 5,
   "text": "I thought that was the process that every fairy went through, that suddenly they wake up one day as a young fairy, and that unlike the others, she had a diary from her past life. But now i realize that all the fairies probably start as babies anyways, so that couldn't be it."
  },
  {
   "score": 66,
   "id": "dijimez",
   "pid": "t1_dijhhfn",
   "date": "2017-06-06 11:09:09",
   "depth": 2,
   "text": "Ithea is already not the original Ithea. "
  },
  {
   "score": 3,
   "id": "dijj12q",
   "pid": "t1_dijimez",
   "date": "2017-06-06 11:16:29",
   "depth": 3,
   "text": "and what are the implications of that?"
  },
  {
   "score": 69,
   "id": "dijjjxq",
   "pid": "t1_dijj12q",
   "date": "2017-06-06 11:25:36",
   "depth": 4,
   "text": "There is no implication. it just kind of prepares the audiences that Ctholly can and probably will reach that point of complete loss of her own personality and memory eventually. \n\nIt's just a very surprising reveal because we thought Ctholly was the only person going through the personality disintegration at the moment, and never thought that it already happened (and the process is already completed) to one of the current weapon user."
  },
  {
   "score": 1,
   "id": "dijpj3p",
   "pid": "t1_dijjjxq",
   "date": "2017-06-06 13:09:01",
   "depth": 5,
   "text": "Perhaps it happen with the Den mother, too\n"
  },
  {
   "score": 5,
   "id": "dijjqeu",
   "pid": "t1_dijjjxq",
   "date": "2017-06-06 11:28:43",
   "depth": 5,
   "text": "but they don't die if they lose their memories?"
  },
  {
   "score": 1,
   "id": "dikrgut",
   "pid": "t1_dijjqeu",
   "date": "2017-06-07 06:09:42",
   "depth": 6,
   "text": "It looks like the souls they used to create the leprechauns is emerging and overwriting the fairies personality.  So I'm kinda curious if Ithea remembers everything about who she use to be before she 'died'.  Could she be contemporary to William?\n"
  },
  {
   "score": 3,
   "id": "dik9fny",
   "pid": "t1_dijjqeu",
   "date": "2017-06-06 19:56:08",
   "depth": 6,
   "text": "It's like your memories and personality are slowly but surely replaced by those of another. By the end, you are basically a completely different person."
  },
  {
   "score": 17,
   "id": "dijk56s",
   "pid": "t1_dijjqeu",
   "date": "2017-06-06 11:35:56",
   "depth": 6,
   "text": "That was kind of the point of that reveal. Some of us might think that once they lose their personality they might die or ends up being a vegetable or something. Except it wasn't like that at all for Ithea. She started over as a new person with a new soul in the same body, and she realized this because there are very detailed diaries of the original Ithea, and she basically mimicked who the original Ithea is based on those information so no one will find out. "
  },
  {
   "score": 7,
   "id": "dijx8cl",
   "pid": "t1_dijk56s",
   "date": "2017-06-06 15:33:39",
   "depth": 7,
   "text": "[removed]"
  },
  {
   "score": 3,
   "id": "dikj1io",
   "pid": "t1_dijx8cl",
   "date": "2017-06-07 00:59:44",
   "depth": 8,
   "text": "This comment has been removed.\n\n- This comment has been reported as containing untagged spoilers. Please review for any tags you may have missed and reply to this message to have your post re-approved.\n\n  Self and link posts should be properly spoiler-tagged and should include the name(s) of the show(s) referenced in the title. Self posts may opt to tag spoilers in the self post instead. (Using the same format as comment spoilers below)\n\n  Comments should use `[spoiler source](/s \"spoiler-chan died\")` to protect spoilers. Spoiler source should, at a minimum, contain the relevant source of the spoiler (e.g. One Piece episode 200, or if it's from a different medium, LN/Manga/VN). Spoiler source is only required in the first of any set of spoilers for the same source and is not required in a discussion thread while discussing that thread's series.\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 3,
   "id": "dik4qtt",
   "pid": "t1_dijx8cl",
   "date": "2017-06-06 18:13:10",
   "depth": 8,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dik6ben",
   "pid": "t1_dik4qtt",
   "date": "2017-06-06 18:47:08",
   "depth": 9,
   "text": "~~please mark the entire reincarnation part with spoiler~~\n\n"
  },
  {
   "score": 1,
   "id": "dik6gxx",
   "pid": "t1_dik6ben",
   "date": "2017-06-06 18:50:26",
   "depth": 1,
   "text": "The parts that aren't marked aren't spoilers though. They were revealed in the middle of episode 6, just in lesser detail."
  },
  {
   "score": 1,
   "id": "dik6mb2",
   "pid": "t1_dik6gxx",
   "date": "2017-06-06 18:53:42",
   "depth": 2,
   "text": "nvm i misread my own thing"
  },
  {
   "score": 1,
   "id": "dik5i68",
   "pid": "t1_dik4qtt",
   "date": "2017-06-06 18:29:30",
   "depth": 9,
   "text": "Isn't that a bit of a spoiler?"
  },
  {
   "score": 1,
   "id": "dik5poo",
   "pid": "t1_dik5i68",
   "date": "2017-06-06 18:34:04",
   "depth": 1,
   "text": "Woops, forgot to put spoiler tags on a few parts, thanks! Besides part with how it involves [Spoiler](/s \"Elq Harkstein\"), the truth behind the Leprechauns isn't anymore. It was explained in the episode Willem met Souwong again, though in lesser detail."
  },
  {
   "score": 2,
   "id": "dik6c2w",
   "pid": "t1_dik5poo",
   "date": "2017-06-06 18:47:32",
   "depth": 2,
   "text": "Those parts that you have finally marked are very serious spoilers. And they rely on information from LN volumes 4-5, which anime most likely won't even cover.  \nI think that it would be better to remove them from your quote completely. If someone wants to get this info, then he can just read the document himself. Or better, read the novel translation."
  },
  {
   "score": 42,
   "id": "dijk0c2",
   "pid": "t1_dijjqeu",
   "date": "2017-06-06 11:33:33",
   "depth": 6,
   "text": "The body doesn't die, but the mind isn't the same"
  },
  {
   "score": 5,
   "id": "dijk3l3",
   "pid": "t1_dijk0c2",
   "date": "2017-06-06 11:35:08",
   "depth": 7,
   "text": "so they just die if they kamikaze in battle?"
  },
  {
   "score": 25,
   "id": "dijkgew",
   "pid": "t1_dijk3l3",
   "date": "2017-06-06 11:41:20",
   "depth": 8,
   "text": "Not really sure what you mean, but yeah I'd think the body would be destroyed if they \"open the fairy gate\" \n\nBut at the same time I would say that they die if their mind dies."
  },
  {
   "score": 10,
   "id": "dijllo3",
   "pid": "t1_dijkgew",
   "date": "2017-06-06 12:00:53",
   "depth": 9,
   "text": "Yep, it's explained during the first few episodes that the body vanishes in the gigantic explosion that said ability triggers. Only their weapon remains and is given to the next fairy that is able to wield it."
  },
  {
   "score": 2,
   "id": "diluo5v",
   "pid": "t1_dijbp5p",
   "date": "2017-06-07 18:31:55",
   "depth": 1,
   "text": "What was the reveal that was so big?"
  },
  {
   "score": 4,
   "id": "din7qpn",
   "pid": "t1_diluo5v",
   "date": "2017-06-08 13:44:00",
   "depth": 2,
   "text": "Something similar to the thing that is happening to Chtholly happened to Ithea some time (probably a few years?) before the start of the show. \n\nShe went into a coma but she didn't recover, and effectively died. The Ithea 2.0 currently walking around the place is the 'pre-incarnated' soul that the original Ithea was created with. It woke up in her body, and decided to continue living Ithea's life using Ithea's diaries to imitate her personality and pass off as memories.\n\nThey didn't really go into all the implications of that, but it's a bleak and horrible thing to happen to both the original Ithea and her replacement."
  },
  {
   "score": 14,
   "id": "dijd16h",
   "pid": "t1_dijbp5p",
   "date": "2017-06-06 09:31:57",
   "depth": 1,
   "text": "Caught me of guard but also happened so fast I wonder if it even matters, hope it comes up again later."
  },
  {
   "score": -2,
   "id": "dijkwon",
   "pid": "t1_dijd16h",
   "date": "2017-06-06 11:49:04",
   "depth": 2,
   "text": "^^*off"
  },
  {
   "score": 45,
   "id": "dijkkkt",
   "pid": "t1_dijd16h",
   "date": "2017-06-06 11:43:20",
   "depth": 2,
   "text": "Not sure if Ithea's face when she started tearing up meant that she was happy or sad that Chtholly didn't ask more about her actual personality. We'll see."
  },
  {
   "score": 8,
   "id": "dijpz4e",
   "pid": "t1_dijkkkt",
   "date": "2017-06-06 13:16:49",
   "depth": 3,
   "text": "Can be both at the same time."
  },
  {
   "score": 39,
   "id": "dijqztc",
   "pid": "t1_dijkkkt",
   "date": "2017-06-06 13:35:05",
   "depth": 3,
   "text": "i interpreted that as Ithea was happy she was accepted."
  },
  {
   "score": 14,
   "id": "dijvog3",
   "pid": "t1_dijqztc",
   "date": "2017-06-06 15:02:18",
   "depth": 4,
   "text": "Ithea just revealed to her best friend that she pretended to be the former Ithea all the time and Chtholly says it's alright, meaning she should just continue to pretend like that? I don't know, I'd be pretty hurt after such a statement since it looked like Chtholly doesn't have the slightest interest in the 'real' Ithea.\n\nNot exactly a healthy approach to life either."
  },
  {
   "score": 24,
   "id": "dijwz5d",
   "pid": "t1_dijvog3",
   "date": "2017-06-06 15:28:25",
   "depth": 5,
   "text": "Well, I mean how long ago did this happen to Ithea? Because she's been friends with Chtholly this whole time. Denying her would be like saying since you aren't who you said you were, our friendship till now means nothing."
  },
  {
   "score": 23,
   "id": "dik4zl8",
   "pid": "t1_dijwz5d",
   "date": "2017-06-06 18:18:22",
   "depth": 6,
   "text": "Exactly. That's how I interpreted Ithea's tears. She's spent all this time wondering how she'd be treated by her friends if they knew, and her friend accepts her without hesitation."
  },
  {
   "score": 8,
   "id": "dik5cr5",
   "pid": "t1_dik4zl8",
   "date": "2017-06-06 18:26:15",
   "depth": 7,
   "text": "This is how I interpreted it, because it's likely Ithea held this fear that if her friends knew she wasn't *really* Ithea, then she'd be rejected.\n\nOf course it's always possible that Ithea holds some attachment to get past and could be hurt by Ctholly's remark, but I doubt it."
  },
  {
   "score": 11,
   "id": "dik1bfw",
   "pid": "t1_dijbp5p",
   "date": "2017-06-06 16:59:35",
   "depth": 1,
   "text": "Reminds me of a certain recent reveal from Attack on Titan - though that was a foreshadowed reveal many people guessed even without being spoiled, but its delivery was even more matter-of-fact than this.\n\nSucks for Ithea 2.0 (or would that be pre-Ithea?), having to live her life pretending to be someone else, and nobody ever finding out about the real her."
  },
  {
   "score": 56,
   "id": "dijcz83",
   "pid": "t1_dijbp5p",
   "date": "2017-06-06 09:30:56",
   "depth": 1,
   "text": "While I can appreciate Chtholly's compassion in not prying into Ithea's past life, god DAMN I wish she had at least asked a few questions! Like, wouldn't she maybe have some more useful information??"
  },
  {
   "score": 2,
   "id": "dik9q50",
   "pid": "t1_dijcz83",
   "date": "2017-06-06 20:03:04",
   "depth": 2,
   "text": "i doubt that scene could have been handled better"
  },
  {
   "score": 26,
   "id": "dijx5j2",
   "pid": "t1_dijcz83",
   "date": "2017-06-06 15:32:03",
   "depth": 2,
   "text": "Well, Ithea *did* just say to forget about the \"red-haired girl\" and her past life, so maybe talking about Ithea's past life isn't the best idea, lest Chtholly start wondering about hers. \n\nAlthough, given that there's only *three episodes left*, still I'd hope that they revisit it just once..."
  },
  {
   "score": 108,
   "id": "dijdmj7",
   "pid": "t1_dijbp5p",
   "date": "2017-06-06 09:42:26",
   "depth": 1,
   "text": "and just dropping it like that fits Ithea's character perfectly"
  },
  {
   "score": 53,
   "id": "dijqomq",
   "pid": "t1_dijdmj7",
   "date": "2017-06-06 13:29:30",
   "depth": 2,
   "text": "She dropped it so casually I was like, \"am I supposed to know this already? Does everyone else know this about her?\""
  },
  {
   "score": 20,
   "id": "dijyybc",
   "pid": "t1_dijqomq",
   "date": "2017-06-06 16:09:08",
   "depth": 3,
   "text": "It's not the first time this show drops something big (like the origin of the leprechauns) but doesn't make any drama out of it because nothing can be done. It kinda strengthens the effect even more..."
  },
  {
   "score": 0,
   "id": "dik7pjy",
   "pid": "t1_dijyybc",
   "date": "2017-06-06 19:17:45",
   "depth": 4,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dikfxoo",
   "pid": "t1_dik7pjy",
   "date": "2017-06-06 22:57:51",
   "depth": 5,
   "text": "This comment has been removed.\n\n- Untagged or improperly tagged spoilers are not allowed.\nObviously intentional or excessively repeated violations of this rule will result in a ban.\n\n  Self and link posts should be properly spoiler-tagged and should include the name(s) of the show(s) referenced in the title. Self posts may opt to tag spoilers in the self post instead. (Using the same format as comment spoilers below)\n\n  Comments should use `[spoiler source](/s \"spoiler-chan died\")` to protect spoilers. Spoiler source should, at a minimum, contain the relevant source of the spoiler (e.g. One Piece episode 200, or if it's from a different medium, LN/Manga/VN). Spoiler source is only required in the first of any set of spoilers for the same source and is not required in a discussion thread while discussing that thread's series.\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 30,
   "id": "dijzdds",
   "pid": "t1_dijyybc",
   "date": "2017-06-06 16:18:08",
   "depth": 4,
   "text": "Thats part of the reason I love this series so much. No characters exclaiming \"NANI??\" or \"Eh?? at every big reveal. It's just casual about it. "
  },
  {
   "score": 17,
   "id": "dik2yrd",
   "pid": "t1_dijzdds",
   "date": "2017-06-06 17:34:44",
   "depth": 5,
   "text": "That's why I love it too. The main cast is so level headed compared to most shows and it contains virtually no character cliches. They react in a very realistic manner in a variety of ways to every situation."
  },
  {
   "score": 30,
   "id": "dik31p7",
   "pid": "t1_dik2yrd",
   "date": "2017-06-06 17:36:28",
   "depth": 6,
   "text": "It's called maturity. I've heard rumors of its existence. "
  },
  {
   "score": 5,
   "id": "dikgnp9",
   "pid": "t1_dik31p7",
   "date": "2017-06-06 23:23:42",
   "depth": 7,
   "text": "Well there's nothing like watching the rise and fall of civilizations to give you a sense of perspective."
  },
  {
   "score": 17,
   "id": "dijrh7n",
   "pid": "t1_dijqomq",
   "date": "2017-06-06 13:43:41",
   "depth": 3,
   "text": "while the LN gave a bit more of foreshadowing regarding this, but overall nope. "
  },
  {
   "score": 14,
   "id": "dijtszk",
   "pid": "t1_dijrh7n",
   "date": "2017-06-06 14:26:25",
   "depth": 4,
   "text": "> while the LN gave a bit more of foreshadowing regarding this\n\nThere's plenty of visual foreshadowing to that in Ithea's behavior in anime."
  },
  {
   "score": 29,
   "id": "dijucst",
   "pid": "t1_dijtszk",
   "date": "2017-06-06 14:36:48",
   "depth": 5,
   "text": "yes, however, the LN [did more](/s \"during the battle with the Timere, Ithea pulled Chtholly back when she first had the signs of disintegration, and explained what would happen to Chtholly if she was to continue using venenum.\")"
  },
  {
   "score": 1,
   "id": "dimzo5t",
   "pid": "t1_dijucst",
   "date": "2017-06-08 11:22:57",
   "depth": 6,
   "text": "[ ](/s \"Didn't Kutori also catch a glimpse of red in Aiseia's eyes in that tent ?\")"
  },
  {
   "score": 1,
   "id": "dim8fbp",
   "pid": "t1_dijucst",
   "date": "2017-06-08 00:11:31",
   "depth": 6,
   "text": "Sorry but the 5º volumen of the LN, has 3 chapters??"
  },
  {
   "score": 2,
   "id": "dimyrep",
   "pid": "t1_dim8fbp",
   "date": "2017-06-08 11:07:18",
   "depth": 7,
   "text": "Each volume of the original LN is divided into 5 chapters. Chapters 1 and 5 are short, they are usually used as a prologue, epilogue, or flashback. Chapters 2-4 are long, they are divided into sub-chapters and each sub-chapter has its own name.\n\nCurrently, about half of the volume 5 is translated."
  },
  {
   "score": 1,
   "id": "diqd364",
   "pid": "t1_dimyrep",
   "date": "2017-06-10 14:43:34",
   "depth": 8,
   "text": "Geniusss, do you know if the LN is on work to finish the translate?"
  },
  {
   "score": 2,
   "id": "diqfpiq",
   "pid": "t1_diqd364",
   "date": "2017-06-10 15:46:47",
   "depth": 9,
   "text": "Yes, translator has said previously that he will finish this LN. Considering the speed with which first half of the vol 5 was translated, it will probably be finished in about one and a half month."
  },
  {
   "score": 13,
   "id": "dik1d4q",
   "pid": "t1_dijucst",
   "date": "2017-06-06 17:00:36",
   "depth": 6,
   "text": "That could easily have been more or less common knowledge among those who know about Fairies."
  },
  {
   "score": 9,
   "id": "dik9ads",
   "pid": "t1_dik1d4q",
   "date": "2017-06-06 19:52:46",
   "depth": 7,
   "text": "Depending on how many generations they've gone through over the centuries, I'm honestly surprised that this is not a well-documented phenomenon by this point."
  },
  {
   "score": 3,
   "id": "dikrdf8",
   "pid": "t1_dik9ads",
   "date": "2017-06-07 06:07:25",
   "depth": 8,
   "text": "I have a feeling that the military has some way to measure this or knows the rate of decay, then sends the fairy to open the gate and die before it happens.  Now that may mean that they are being kind instead of putting them through the experience, or it may mean that they know its preventable but don't want the fairies to think they can have a life beyond blowing themselves up.\n"
  },
  {
   "score": 10,
   "id": "dik9ywm",
   "pid": "t1_dik9ads",
   "date": "2017-06-06 20:08:55",
   "depth": 8,
   "text": "It might be well documented, but the fairies themselves may only find out if someone decides to tell them.  So I'd've thought that Ithea might have been told by the troll at some point, or maybe another fairy who was told her."
  },
  {
   "score": 87,
   "id": "dijbnv6",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:07:32",
   "depth": 0,
   "text": "Ok, some anime original stuff, this is a surprise\n\nThe entire party scene is anime original\n\n[Tiat, Lakhesh, Pannibal, and Collon](http://imgur.com/0sN0aUg)\n\n[Tiat in formal dress](http://imgur.com/RFkaKpq) (Fixed)\n\n[Ren in... something really cute](http://imgur.com/kA1lp0i)\n\n[Ithea, she's cute too](http://imgur.com/A1b9XIh)\n\n[Last but not least, Chtholly in Wedding Dress](http://imgur.com/t7kL26j)\n\n[Smile that needs to be protected](http://imgur.com/5d2HC8x)\n\n[Bonus: Nygglatho's death stare](http://imgur.com/0QUpPBR)\n\nAlso, small scene after ED, don't miss it.\n\n***\n\nEpisodes 7-9 covered chapters 1-2 in vol3 of LN, with some changes in the order of events, most likely to accomodate anime original part, as well as reinforcing the notion that this is Chtholly's story.\n\nWe have another version of \"Always in My Heart\" theme, it feels more festive and uses oboe/clarinet. Also a new insert song titled \"I call you\", playing just before the ending.\n\nI would say they did a really good job of it. However, judging by the preview and current pacing, we are probably not going to get to vol4&5 of LN.\n\nThe next episode should get us back on track with the final chapters of Vol.3, I expect the anime to take 2 more episodes to draw this out.\n\nEpisode 11 title will most likely be [guessing](/s \"The Happiest Girl in the World\")"
  },
  {
   "score": 1,
   "id": "dimfyus",
   "pid": "t1_dijbnv6",
   "date": "2017-06-08 05:16:53",
   "depth": 1,
   "text": "Oh my god, I did not make the connection that it was a wedding dress. I am *so* sad right now."
  },
  {
   "score": 1,
   "id": "dikhek4",
   "pid": "t1_dijbnv6",
   "date": "2017-06-06 23:52:10",
   "depth": 1,
   "text": "Any idea on when the prologues are being slipped in? I wanna see it animated.  :("
  },
  {
   "score": 1,
   "id": "dika1cr",
   "pid": "t1_dijbnv6",
   "date": "2017-06-06 20:10:35",
   "depth": 1,
   "text": "> Tiat, Lakhesh, Pannibal, and Collon\n\nTiat's scarf doesn't fit. It's TY instead of TI, and in a different arrangement. Didn't notice until now but it kinda bugs me. "
  },
  {
   "score": 1,
   "id": "dijtoi8",
   "pid": "t1_dijbnv6",
   "date": "2017-06-06 14:24:03",
   "depth": 1,
   "text": "I am only at page 174 (Chapter 4) of the fourth volume so I miss some important things for now, but \n\n[spoiler 4. vol](/s \"Isn't it possible to adapt the whole first three chapters of the book with the easy trick: what you tell 5 times in the book, can be shown once in the anime or can be shown in a compilation. What I want to say is, that the beginning of the book tells us how is life was back then and why the world is not his own dream. The first point is easily worked out with a compilation, the second point can be explained to the viewer with one single example.\")\n\nNow I miss the last 90 pages, which could be so full of information, that one episode isn't enough but normally they can adapt 2 chapter in one episode. \n\nOnly some thoughts, would be nice, if you don't spoil in your answer."
  },
  {
   "score": 3,
   "id": "dijuveh",
   "pid": "t1_dijtoi8",
   "date": "2017-06-06 14:46:37",
   "depth": 2,
   "text": "[book4 spoiler A](/s \"I take it that you are suggesting to have a montage of a sort for the early parts of book 4. While it can work, it would really sell the characters short. Almaria is much too important to be glossed over in a montage\")\n\nAs for the last 90 pages [not really spoilers, nothing on plot at least](/s \"this is the key moment of book 4. I would say it needs at least one full episode, on top of build ups from the first part of book 4, for it to deliver the proper effect\")\n\nFinish reading book 4 and you would probably change your mind."
  },
  {
   "score": 1,
   "id": "dijeyvm",
   "pid": "t1_dijbnv6",
   "date": "2017-06-06 10:05:47",
   "depth": 1,
   "text": "Fuckkk why couldnt we just get more episodes and finish the story... "
  },
  {
   "score": 3,
   "id": "dijcoay",
   "pid": "t1_dijbnv6",
   "date": "2017-06-06 09:25:32",
   "depth": 1,
   "text": "> Tiat in formal dress\n\n~~Nope, still the four girls :P~~"
  },
  {
   "score": 2,
   "id": "dijd7do",
   "pid": "t1_dijcoay",
   "date": "2017-06-06 09:35:01",
   "depth": 2,
   "text": "fixed, ty for catching it"
  },
  {
   "score": 3,
   "id": "dijldhb",
   "pid": "t1_dijbnv6",
   "date": "2017-06-06 11:57:02",
   "depth": 1,
   "text": "> I would say they did a really good job of it. However, judging by the preview and current pacing, we are probably not going to get to vol4&5 of LN.\n\nYeah they've been really doing extremely well adapting everything to this point, I heard this series is only going to be 12 episodes, which, if that's the case unfortunately we won't be getting an adaption of Volume 4&5 yet. I was really hoping for a Volume 4 adaption but it's better off if it'll be ending this quickly. I will certainly be hoping for a S2 if it plays out this way though!"
  },
  {
   "score": 10,
   "id": "dijc1ul",
   "pid": "t1_dijbnv6",
   "date": "2017-06-06 09:14:30",
   "depth": 1,
   "text": "[spoiler](/s \"not sure how im going to like not getting volume 4 as it was probably my favorite volume, I wondered how they were going to drag out the ending of volume 3 and here it is. There isnt even much left besides that last bit, I dont get why theyd tease all the extra bits of the story aswell if we werent getting volume 4\")"
  },
  {
   "score": 1,
   "id": "dijfdgv",
   "pid": "t1_dijc1ul",
   "date": "2017-06-06 10:12:55",
   "depth": 2,
   "text": "Maybe they're angling for a second series?"
  },
  {
   "score": 5,
   "id": "dijsr7r",
   "pid": "t1_dijfdgv",
   "date": "2017-06-06 14:06:42",
   "depth": 3,
   "text": "If we get a *second series*, it was planned from the start. That would mean SukaSuka was a split cour adaptation and explain away some adaptation choices that the LN readers have pointed out.\n\nIf the *second season* hinges on how this one performs... Well, to say it bluntly, I don't think we will get that."
  },
  {
   "score": 13,
   "id": "dijfizz",
   "pid": "t1_dijfdgv",
   "date": "2017-06-06 10:15:37",
   "depth": 3,
   "text": "I doubt it, the first series wasnt that well received and whereas I could see the last 2 volumes being made into their own series I dont think it would happen, If they would have finished up to volume 4 I could have seen 5 as an ova and if they ever did do a second season they could animate sukamoka"
  },
  {
   "score": 8,
   "id": "dijfs9i",
   "pid": "t1_dijfizz",
   "date": "2017-06-06 10:20:08",
   "depth": 4,
   "text": "Really? I mean, sure, S2 of My Hero Academia and Attack on Titan dominated most people's attention, but this series has ended up in the top 5 of every spring ranking I've seen. "
  },
  {
   "score": 1,
   "id": "dijfwfl",
   "pid": "t1_dijfs9i",
   "date": "2017-06-06 10:22:08",
   "depth": 5,
   "text": "We will see in the future, it all hinges on how much money the people make off of it. "
  },
  {
   "score": 1,
   "id": "dijg6sx",
   "pid": "t1_dijfwfl",
   "date": "2017-06-06 10:27:05",
   "depth": 6,
   "text": "Honestly, I'm terrible at keeping track of that since most merchandising happens outside the US.\n"
  },
  {
   "score": 7,
   "id": "dijgpsk",
   "pid": "t1_dijfs9i",
   "date": "2017-06-06 10:36:12",
   "depth": 5,
   "text": "Both of those manga are best sellers in Japan and even in the West. And their animes were big hits as well,  pretty much everywhere. The same wouldn't be true for Suka Suka unfortunately. Neither the anime nor the light novel series is a hit in Japan as far as I know."
  },
  {
   "score": 10,
   "id": "dijdhlc",
   "pid": "t1_dijc1ul",
   "date": "2017-06-06 09:40:01",
   "depth": 2,
   "text": "Vol4 is my personal favourite, and if they started out to only adapt 3 volumes, they should've fleshed out vol1-2 a bit more instead of extending vol3.\n\nIt's unfortunate, but I don't suppose we will see vol4 animate this season. [spoiler-ish discussion](/s \"As well done as the opening scene in episode 1 was, the final scene of Vol.4 completely blows it out of the water.\")"
  },
  {
   "score": 1,
   "id": "dis2poa",
   "pid": "t1_dijdhlc",
   "date": "2017-06-11 19:30:47",
   "depth": 3,
   "text": "May I ask, in a spoiler tag, what are some of the big events that happen in V4 that make it your favorite?"
  },
  {
   "score": 1,
   "id": "dis358h",
   "pid": "t1_dis2poa",
   "date": "2017-06-11 19:40:34",
   "depth": 4,
   "text": "not sure if you've read the novels and is just curious about what I think about it, or you would actually want to know what happened, so I will keep it short here.\n\n[in short](/s \"it features willem's past, it goes into the lore of the world. my most favourite scene is the one at the end.\")\n\nspeaking of which, i should probably re-gather my thoughts and write the thoughts part on my lore/spoiler document..."
  },
  {
   "score": 1,
   "id": "dis3m8q",
   "pid": "t1_dis358h",
   "date": "2017-06-11 19:51:38",
   "depth": 5,
   "text": "Mostly just curiosity. Thank you!"
  },
  {
   "score": 2,
   "id": "dijf9x4",
   "pid": "t1_dijdhlc",
   "date": "2017-06-06 10:11:12",
   "depth": 3,
   "text": "At least it was in the OP...we can enjoy that. "
  },
  {
   "score": 7,
   "id": "dijdte6",
   "pid": "t1_dijdhlc",
   "date": "2017-06-06 09:45:43",
   "depth": 3,
   "text": "[ye](/s \"if they were just animating to 3 they should have given 1-3 like 4 episodes each because volume 3 doesnt have enough substance in it to drag out for 3 more episodes the sudden change of pacing is annoying\")\n"
  },
  {
   "score": 1,
   "id": "dijepc4",
   "pid": "t1_dijdte6",
   "date": "2017-06-06 10:01:03",
   "depth": 4,
   "text": "Yes. I agree as well. They could have divided it the way you said and made this into a really good adaptation,  while this way it is only a fine adaptation at best."
  },
  {
   "score": 6,
   "id": "dijf0ag",
   "pid": "t1_dijepc4",
   "date": "2017-06-06 10:06:26",
   "depth": 5,
   "text": "I do wish it was a longer adaptation so each volume could have gotten fleshed out. I feel it would have been a great anime if it was longer. But as a LN reader I can't help but feel disappointed."
  },
  {
   "score": 2,
   "id": "dijfco1",
   "pid": "t1_dijf0ag",
   "date": "2017-06-06 10:12:32",
   "depth": 6,
   "text": "Yeah,  I understand what you mean. Feels worse when you consider that it probably won't get another season cause the anime adaptation was mostly advertisement for the light novels and probably the sequel/spin-off series. I want to believe this will become so big that they will adapt the last two volumes into another season,  but that isn't gonna happen is it? :("
  },
  {
   "score": 1,
   "id": "dijfl6q",
   "pid": "t1_dijfco1",
   "date": "2017-06-06 10:16:40",
   "depth": 7,
   "text": "Very doubtful, if they had actually fully adapted it they could have done a 2nd season with the 2nd series sukamoka but I dont see that as a possibility seeing as the last 2 volumes probably wont be animated"
  },
  {
   "score": 1,
   "id": "dijfvqz",
   "pid": "t1_dijfl6q",
   "date": "2017-06-06 10:21:49",
   "depth": 8,
   "text": "This is the way it works. Most anime are just advertisement for the source material and they are never meant to get a full adaptation. As a LN reader myself I know that there is nothing worse than hearing your favorites series will get an adaptation and then having those hopes crushed when you find out it won't be a full adaptation. (Or when the adaptation is too damn rushed so it just fucks up the source material)"
  },
  {
   "score": 2,
   "id": "dijfyx3",
   "pid": "t1_dijfvqz",
   "date": "2017-06-06 10:23:19",
   "depth": 9,
   "text": "Yep, in terms of this anime its a bit of both."
  },
  {
   "score": 1,
   "id": "dijguqx",
   "pid": "t1_dijfyx3",
   "date": "2017-06-06 10:38:33",
   "depth": 1,
   "text": "And I feel like the anime will get an original ending and crush our almost non-existent hope that it may get a second season."
  },
  {
   "score": 1,
   "id": "dijh5s1",
   "pid": "t1_dijguqx",
   "date": "2017-06-06 10:43:52",
   "depth": 2,
   "text": "[inb4](/s \"they completely flip the ending and make it a happy ending\")"
  },
  {
   "score": 1,
   "id": "dik9n57",
   "pid": "t1_dijh5s1",
   "date": "2017-06-06 20:01:02",
   "depth": 3,
   "text": "Fuuka 2.0, am I right?"
  },
  {
   "score": 1,
   "id": "dijhehw",
   "pid": "t1_dijh5s1",
   "date": "2017-06-06 10:47:58",
   "depth": 3,
   "text": "[Like hell they will] (/s \"This is the last series that can have a happy ending. So It would be pretty hilarious\")"
  },
  {
   "score": 1,
   "id": "dijhnjc",
   "pid": "t1_dijhehw",
   "date": "2017-06-06 10:52:18",
   "depth": 4,
   "text": "[lol right](/s \"that would be so annoying considering all of the buildup to make it as depressing as possible\")"
  },
  {
   "score": 13,
   "id": "dijdddd",
   "pid": "t1_dijbnv6",
   "date": "2017-06-06 09:37:59",
   "depth": 1,
   "text": "> Bonus: Nygglatho's death stare\n\nCutest of them all <3"
  },
  {
   "score": 65,
   "id": "dijj3vt",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:17:51",
   "depth": 0,
   "text": "Jesus, that huge reveal at the first 5 minutes as if it's nothing. No wonder Ithea sometimes talks as if she's older than she is. I'm also impressed on how she kept the act for so long.\n\n[And of course Chtholly's gift looks like a wedding dress.](http://i.imgur.com/ayUPEKy.png) If that's not a death flag I don't know what is."
  },
  {
   "score": 33,
   "id": "dijlngr",
   "pid": "t1_dijj3vt",
   "date": "2017-06-06 12:01:45",
   "depth": 1,
   "text": "At least it's not a red wedding dress."
  },
  {
   "score": 6,
   "id": "dik5z2m",
   "pid": "t1_dijlngr",
   "date": "2017-06-06 18:39:44",
   "depth": 2,
   "text": "No but the wedding might be red. "
  },
  {
   "score": 43,
   "id": "dijxd99",
   "pid": "t1_dijlngr",
   "date": "2017-06-06 15:36:27",
   "depth": 2,
   "text": "> red\n\n> > wedding\n\n[](#sadholo)\n"
  },
  {
   "score": 30,
   "id": "dijytoe",
   "pid": "t1_dijxd99",
   "date": "2017-06-06 16:06:16",
   "depth": 3,
   "text": "The north remembers"
  },
  {
   "score": 42,
   "id": "dijdh2u",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:39:46",
   "depth": 0,
   "text": "This show is seriously fucking me in the feels."
  },
  {
   "score": 78,
   "id": "dijcmkx",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:24:42",
   "depth": 0,
   "text": "This is gonna have a happy ending, right? RIGHT??????\n\nAt least Ithea seems to be doing okay and... does that mean they can practically revive people in this world?\n\nAlso the scarf thingy is pretty smart but how will Chtholly remember their names in summer? x)\n\n[That face.](http://i.imgur.com/jQ2hONx.jpg)"
  },
  {
   "score": 6,
   "id": "dijz2e5",
   "pid": "t1_dijcmkx",
   "date": "2017-06-06 16:11:37",
   "depth": 1,
   "text": "And [those faces](https://i.imgur.com/8d9GJxB.jpg) as well."
  },
  {
   "score": 4,
   "id": "dijgz8d",
   "pid": "t1_dijcmkx",
   "date": "2017-06-06 10:40:44",
   "depth": 1,
   "text": "Yes, there will be a happy end I just now it. Stand with me and we can make it happen."
  },
  {
   "score": 108,
   "id": "dijdew8",
   "pid": "t1_dijcmkx",
   "date": "2017-06-06 09:38:42",
   "depth": 1,
   "text": "> Also the scarf thingy is pretty smart but how will Chtholly remember their names in summer? x)\n\n_She probably won't be alive come summer_\n\n[](#sadholo)"
  },
  {
   "score": 1,
   "id": "dilz4qm",
   "pid": "t1_dijdew8",
   "date": "2017-06-07 20:02:46",
   "depth": 2,
   "text": "From the looks of the first episode intro, most of them won't be."
  },
  {
   "score": 2,
   "id": "dikccs0",
   "pid": "t1_dijdew8",
   "date": "2017-06-06 21:08:47",
   "depth": 2,
   "text": "You guys need to rewatch episode one again. Like the first main scene in it has a redhead with just a few strands of blue in her hair...."
  },
  {
   "score": 13,
   "id": "dijdxse",
   "pid": "t1_dijdew8",
   "date": "2017-06-06 09:47:51",
   "depth": 2,
   "text": "Come on, at most she is just gonna turn completely like Ithea, right??????????"
  },
  {
   "score": 71,
   "id": "dije6dp",
   "pid": "t1_dijdxse",
   "date": "2017-06-06 09:51:57",
   "depth": 3,
   "text": "That's pretty much the same thing as dying though, that's the point this episode was making. "
  },
  {
   "score": 7,
   "id": "dijew4g",
   "pid": "t1_dije6dp",
   "date": "2017-06-06 10:04:25",
   "depth": 4,
   "text": "She will still need help with the names once she turns, though."
  },
  {
   "score": 30,
   "id": "dijf57s",
   "pid": "t1_dijew4g",
   "date": "2017-06-06 10:08:54",
   "depth": 5,
   "text": "They will probably be entirely new people to her. She probably won't have any memories of them left whatsoever."
  },
  {
   "score": 3,
   "id": "dikgpcs",
   "pid": "t1_dijf57s",
   "date": "2017-06-06 23:25:25",
   "depth": 6,
   "text": "And along with the lack of memories, will come lack of reason to care for them, she wont want to remember who they are. "
  },
  {
   "score": 112,
   "id": "dijczqi",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:31:12",
   "depth": 0,
   "text": "Damn...making everyone monogrammed winter gear so you can tell their names, so clever and depressing at the same time ;~;\n\nHappy we got [troll](http://i.imgur.com/FrB7y7g.png) [being](http://i.imgur.com/5ywnRlo.png) [best](http://i.imgur.com/dJyuWw8.png) [to](http://i.imgur.com/8CgmKJR.png) [ease](http://i.imgur.com/kyJSivH.png) [it](http://i.imgur.com/cowqRQ3.png), she's just always so much fun <3"
  },
  {
   "score": 8,
   "id": "diltm02",
   "pid": "t1_dijczqi",
   "date": "2017-06-07 18:09:53",
   "depth": 1,
   "text": "Man, I didn't even think for a second that was the intention of their scarfs wtf. This is so sad."
  },
  {
   "score": 22,
   "id": "dijzzky",
   "pid": "t1_dijczqi",
   "date": "2017-06-06 16:31:19",
   "depth": 1,
   "text": "I didn't even catch that... Now I'm a new level of depressed..."
  },
  {
   "score": 56,
   "id": "dijlard",
   "pid": "t1_dijczqi",
   "date": "2017-06-06 11:55:45",
   "depth": 1,
   "text": "> troll\n\nShe kinda looks like an older, fully transformed Chtholly...\n\n[](#dejected)"
  },
  {
   "score": 2,
   "id": "dik0s7r",
   "pid": "t1_dijlard",
   "date": "2017-06-06 16:48:15",
   "depth": 2,
   "text": "That'd be fun if it happened :p"
  },
  {
   "score": 24,
   "id": "dijfe6b",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:13:16",
   "depth": 0,
   "text": "So can we all agree that Ctholly x Ithea is best ship now?"
  },
  {
   "score": 2,
   "id": "dijz8qb",
   "pid": "t1_dijfe6b",
   "date": "2017-06-06 16:15:21",
   "depth": 1,
   "text": "I wish, but I try not to ship people who seem to be close to death, for their own good."
  },
  {
   "score": 17,
   "id": "dijrwyy",
   "pid": "t1_dijfe6b",
   "date": "2017-06-06 13:51:24",
   "depth": 1,
   "text": "I wouldnt be against it tbh \n\nbut yuri-ships are cheating "
  },
  {
   "score": 52,
   "id": "dijd40r",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:33:22",
   "depth": 0,
   "text": "*Yes Ctholly embrace the superiority of the red head*.\n\n[But man](#blankblink)\n\nIthea dropping the bomb in the first 5 minutes like its nothing regarding her own prior mental disintegration. Feels like the LN went into depth about this.\n\nOther than that this episode basically showed off Ctholly going literal YOLO and embracing her life despite her memories dissipating. I don't see this ending well at all...\n\nThe last scene in the preview was intriguing; showed off the OG red head from 500 years ago with her struggling in a white background. Huh I'm curious what will happen then and I'm *definitely* curious to see Willem see what's left of his old home considering his tendencies when thinking of the past."
  },
  {
   "score": 1,
   "id": "diqpv8x",
   "pid": "t1_dijd40r",
   "date": "2017-06-10 20:16:11",
   "depth": 1,
   "text": "I think this anime is too short to elaborate on ithea's past, and they just want to focus on ctholly. I never read the LN though, but judging by this anime, I am really interested. Will finish the anime though first, so as to avoid spoilers. I wonder why it's called light novel though. This show is very heavy."
  },
  {
   "score": 4,
   "id": "dijz54y",
   "pid": "t1_dijd40r",
   "date": "2017-06-06 16:13:15",
   "depth": 1,
   "text": "*Or* she can dye her hair, which would make her a red head with requiring her to, huh, die."
  },
  {
   "score": 14,
   "id": "dik3xi0",
   "pid": "t1_dijd40r",
   "date": "2017-06-06 17:55:39",
   "depth": 1,
   "text": "> *Yes Ctholly embrace the superiority of the red head*\n\n[But at what cost...](https://m.imgur.com/bZh8m30?r)"
  },
  {
   "score": 40,
   "id": "dijcgzf",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:21:58",
   "depth": 0,
   "text": "Not sure if this was mentioned in previous threads, but the anime has been confirmed at [12 episodes](http://i.imgur.com/Sa5hw3k.png) and not 13."
  },
  {
   "score": 27,
   "id": "dijidol",
   "pid": "t1_dijcgzf",
   "date": "2017-06-06 11:04:49",
   "depth": 1,
   "text": "As an anime-only watcher, I feel that with 3 episodes more to go either pacing will go out of the window completely or we'll get a very unsatisfactory ending."
  },
  {
   "score": 15,
   "id": "dijm2mu",
   "pid": "t1_dijidol",
   "date": "2017-06-06 12:09:03",
   "depth": 2,
   "text": "It's set to fully adapt the first three volumes, and I believe the ending of the third volume is good enough as an ending."
  },
  {
   "score": 6,
   "id": "dik9ugy",
   "pid": "t1_dijm2mu",
   "date": "2017-06-06 20:05:56",
   "depth": 3,
   "text": "The third volume ending was kind of abrupt and left more questions than answers, at least in my experience. I think it could work but it wouldn't be very satisfying."
  },
  {
   "score": 1,
   "id": "dikjihc",
   "pid": "t1_dik9ugy",
   "date": "2017-06-07 01:20:29",
   "depth": 4,
   "text": "Guess they'll just have to make another season, then"
  },
  {
   "score": 4,
   "id": "diko3r1",
   "pid": "t1_dik9ugy",
   "date": "2017-06-07 04:35:04",
   "depth": 4,
   "text": "Volume 3's ending is an okay ending. The LN author said that the anime is the story of Ctholly, and if so, Vol 3 is a perfect ending"
  },
  {
   "score": 1,
   "id": "dinchye",
   "pid": "t1_diko3r1",
   "date": "2017-06-08 15:13:10",
   "depth": 5,
   "text": "I have to disagree. While it would in fact conclude the story they want to tell, it will leave off on one of the lowest points in the series."
  },
  {
   "score": 1,
   "id": "dinfvqn",
   "pid": "t1_dinchye",
   "date": "2017-06-08 16:22:40",
   "depth": 6,
   "text": "I don't know about the lowest, but from the producer's standpoint, there's no other realistic ending point for the anime\n\n"
  },
  {
   "score": 43,
   "id": "dijfgb7",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:14:18",
   "depth": 0,
   "text": "Chtholly has blue hair and it's turning red! She's [Chariot](https://myanimelist.cdn-dena.com/images/characters/7/286335.jpg)!"
  },
  {
   "score": 42,
   "id": "dijfq46",
   "pid": "t1_dijfgb7",
   "date": "2017-06-06 10:19:03",
   "depth": 1,
   "text": "[Lwa](/s \"Is she going to steal their magic too?\")"
  },
  {
   "score": 16,
   "id": "dijfxze",
   "pid": "t1_dijfq46",
   "date": "2017-06-06 10:22:53",
   "depth": 2,
   "text": "Dunno about that, but Willem's heart is close to be :D"
  },
  {
   "score": 17,
   "id": "diji8gg",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:02:17",
   "depth": 0,
   "text": "http://imgur.com/AdiBPrO"
  },
  {
   "score": 12,
   "id": "dijxeda",
   "pid": "t1_diji8gg",
   "date": "2017-06-06 15:37:05",
   "depth": 1,
   "text": "[MFW](#trynottocry)"
  },
  {
   "score": 7,
   "id": "dik2c5n",
   "pid": "t1_dijxeda",
   "date": "2017-06-06 17:21:14",
   "depth": 2,
   "text": "[Need to find a dry spot.](https://uploads.disquscdn.com/images/cb7ae30794a894a2d5b85d4f81b7f933e52c090243e29f9756f255858f0b8c46.jpg?w=800&h=279)"
  },
  {
   "score": 15,
   "id": "dijgatn",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:29:01",
   "depth": 0,
   "text": "I wasn't ready for that 'reveal' in the ending. Got me offguard and I can almost feel the feels' train hitting me hard... Oh lord I don't know what we'll have to deal in later episodes.  \n  \nI would LOVE an OVA about Ithea. That seems to be a traumatic experience to deal. Fuck, she even fight against the beasts like the \"previous Ithea\".   \n  \nAlso, I need buy the insert songs of this anime."
  },
  {
   "score": 13,
   "id": "dijhbl0",
   "pid": "t1_dijgatn",
   "date": "2017-06-06 10:46:35",
   "depth": 1,
   "text": "[ithea disc (maybe spoiler)?](/s \"its strange because in the LN they never really go to deep into it, its just like in the anime a quick reveal and it never gets brought up after\")"
  },
  {
   "score": 5,
   "id": "dika7jv",
   "pid": "t1_dijhbl0",
   "date": "2017-06-06 20:14:52",
   "depth": 2,
   "text": "I guess that makes sense, right? The series isn't Ithea's story, and since Ithea isn't enthusiastic about sharing her secrets, and Chtholly doesn't want to pry. So there's not an easy way to insert more of it without it being out of place. "
  },
  {
   "score": 12,
   "id": "dijhsmw",
   "pid": "t1_dijhbl0",
   "date": "2017-06-06 10:54:40",
   "depth": 2,
   "text": "That sucks, because it has a lot of potential."
  },
  {
   "score": 12,
   "id": "dijsnm6",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 14:04:50",
   "depth": 0,
   "text": "[Savage Neph <3](http://i.imgur.com/30hAeZz.jpg)\n\nGoddamn, Ithea has gone through some serious stuff ;_; How am I supposed to fit all those girls in my kokoro"
  },
  {
   "score": 1,
   "id": "dima7eh",
   "pid": "t1_dijsnm6",
   "date": "2017-06-08 01:28:22",
   "depth": 1,
   "text": "Can you help me out with why him getting a brush was so funny?  I get that it's a gag gift cause the rest of them got real dressses and stuff, but why a brush?"
  },
  {
   "score": 1,
   "id": "dimcb5t",
   "pid": "t1_dima7eh",
   "date": "2017-06-08 03:05:48",
   "depth": 2,
   "text": "> why a brush?\n\nMaybe because it's something totally insignificant, therefore unfitting for a gift  \nI guess? Not sure tbh ;p"
  },
  {
   "score": 25,
   "id": "dijf9cy",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:10:56",
   "depth": 0,
   "text": "I've already come to accept that generally anime serves as a sort of extended ad for LNs and Manga a lot of the time... but I hate that too. I just want the end of the story, is that too much to ask for?"
  },
  {
   "score": 1,
   "id": "dijlplh",
   "pid": "t1_dijf9cy",
   "date": "2017-06-06 12:02:47",
   "depth": 1,
   "text": "> I just want the end of the story, is that too much to ask for?\n\nSo why not read the original work? Its translation is fairly close to being complete.  \nAlthough, and this is also true for most other novel adaptations, if you are going to read it, then you should start from the beginning rather than where anime left off."
  },
  {
   "score": 3,
   "id": "dikomx9",
   "pid": "t1_dijlplh",
   "date": "2017-06-07 04:52:30",
   "depth": 2,
   "text": "I'm reading the novels to see what wasn't adapted or skipped (i like world building and heard there's plenty in the novels) but i overwhelmingly prefer to see it animated. \n\nI guess it mostly stems from the fact that i don't visualize anything in my mind when reading (can't both read and visualize without a lot of effort) but reading is more like a chore to me, not to mention the pacing is set to the way it should be. I read things fast and feel uncomfortable reading slower for some reason, so it's nice to let them set the right pace. \n\nBesides, pretty flashes and music. Banzai"
  },
  {
   "score": 4,
   "id": "dijsc56",
   "pid": "t1_dijlplh",
   "date": "2017-06-06 13:58:58",
   "depth": 2,
   "text": "I plan on it. I just am really busy sonit would take a while to read it. Plus I have the other series I'm reading the offical releases and i have almost 10 of those...."
  },
  {
   "score": 5,
   "id": "diltqws",
   "pid": "t1_dijf9cy",
   "date": "2017-06-07 18:12:52",
   "depth": 1,
   "text": "It's an amazing medium to bring attention to an amazing story though.\n\nI fell in love with Re:Zero after the anime and I've been reading the LN and web novel translations and it's just sooo good. I hope it gets a second season sometime in the future."
  },
  {
   "score": 1,
   "id": "din0qbk",
   "pid": "t1_diltqws",
   "date": "2017-06-08 11:41:08",
   "depth": 2,
   "text": "I still can't forgive White Fox for not finishing 3rd Arc when they were few minutes away. Stopping before the most important part ..."
  },
  {
   "score": 3,
   "id": "din285g",
   "pid": "t1_din0qbk",
   "date": "2017-06-08 12:06:49",
   "depth": 3,
   "text": "That's because it would have left the anime at a huge cliffhanger and there are no plans for a second season.\n\nThe anime ended at a really good spot, it's better to have this then the lingering question of what happens next without a continued adaptation."
  },
  {
   "score": 1,
   "id": "din4yqm",
   "pid": "t1_din285g",
   "date": "2017-06-08 12:54:34",
   "depth": 4,
   "text": "I disagree, but, well, everyone has their own taste."
  },
  {
   "score": 1,
   "id": "din5fgd",
   "pid": "t1_din4yqm",
   "date": "2017-06-08 13:02:40",
   "depth": 5,
   "text": "I mean, just look at how many people are still salty and waiting for Spice and Wolf Season 3, it would be the same."
  },
  {
   "score": 1,
   "id": "din5r7c",
   "pid": "t1_din5fgd",
   "date": "2017-06-08 13:08:30",
   "depth": 6,
   "text": "I don't think that's bad. And it would promote the original that much more."
  },
  {
   "score": 16,
   "id": "dijlhu5",
   "pid": "t1_dijf9cy",
   "date": "2017-06-06 11:59:06",
   "depth": 1,
   "text": "They just want all your cash, is that too much to ask for?"
  },
  {
   "score": 11,
   "id": "dijcq6b",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:26:26",
   "depth": 0,
   "text": "Did something happen to the animation/art style or am are my eyes just going bad. I'm glad for once we have an MC that's not dense, glad he actually pays attention to her."
  },
  {
   "score": 9,
   "id": "dijk8tv",
   "pid": "t1_dijcq6b",
   "date": "2017-06-06 11:37:41",
   "depth": 1,
   "text": "Apparently Willem's still pretty dense by that world's standards."
  },
  {
   "score": 14,
   "id": "dijdpwl",
   "pid": "t1_dijcq6b",
   "date": "2017-06-06 09:44:02",
   "depth": 1,
   "text": "i felt they stepped the animation quality up from the past few episodes. Though I do feel Willem's face is a bit weird at times."
  },
  {
   "score": 10,
   "id": "dijpzck",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 13:16:55",
   "depth": 0,
   "text": "And I thought Ithea's big reveal was going to be she had a penis..."
  },
  {
   "score": 8,
   "id": "dikj8ih",
   "pid": "t1_dijpzck",
   "date": "2017-06-07 01:08:21",
   "depth": 1,
   "text": "She still might "
  },
  {
   "score": 8,
   "id": "dijr9a3",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 13:39:47",
   "depth": 0,
   "text": "What is the name of the song played towards the end?"
  },
  {
   "score": 6,
   "id": "dikgngw",
   "pid": "t1_dijr9a3",
   "date": "2017-06-06 23:23:28",
   "depth": 1,
   "text": "the english one? accoeding to the credits it's called \"I Call You\""
  },
  {
   "score": 3,
   "id": "diktg7k",
   "pid": "t1_dikgngw",
   "date": "2017-06-07 06:53:09",
   "depth": 2,
   "text": "Thank you! "
  },
  {
   "score": 5,
   "id": "dijl2wg",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:52:00",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 3,
   "id": "dijm36i",
   "pid": "t1_dijl2wg",
   "date": "2017-06-06 12:09:19",
   "depth": 1,
   "text": "But Ithea does not simply \"pretend\" to be that. Ithea sees herself as Ithea and wants to be Ithea despite the other memories she might have. Why should they care about the person Ithea does not want to be?"
  },
  {
   "score": 7,
   "id": "dijdfsx",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:39:09",
   "depth": 0,
   "text": "So I was right with my speculations on the last episode with this episode straight up opening with Ithea giving insight on what happens.\n\n\nThis episode brings up a topic I too often think about. What makes up a person's identity? Is it the body, or what's in it, the memories and the experience that is inside it. Chtholly is losing her memories, and when she wakes up without them, she won't even know who she is, let alone anybody else. She essentially would be reborn into a different person. It's extremely tragic. Even if she learns of the memories through a diary, it is as if reading a novel, and telling the story as your own.\n\n\nIt seems like the next episode or the final episode would return us back to episode one's starting sequence, where the Chtholly we know would be gone. The sword isn't making it in time, and I can't accept that even though she did. I haven't even seen it but I'm already feeling bummed out."
  },
  {
   "score": -1,
   "id": "dikgw69",
   "pid": "t1_dijdfsx",
   "date": "2017-06-06 23:32:40",
   "depth": 1,
   "text": "really not liking you and your magical \"speculations\" (read:spoilers). \n\nSo tired of people \"speculating\" so precisely on reddit that they should have won the lottery 5x over by now, it really makes me not even want to read or participate in the threads I adore, for fear of your magical, precise, \"speculations\".\n\nNext time you feel the urge to \"speculate\" could you tag it with the tag that best fits giving hints of something you've already read/seen/know. aka \"Spoiler\". Thanks."
  },
  {
   "score": 1,
   "id": "dikhmyr",
   "pid": "t1_dikgw69",
   "date": "2017-06-07 00:01:18",
   "depth": 2,
   "text": "I did tag my speculations in the last thread as spoilers, but also stating its a speculation as I haven't read anything beforehand, and I didn't add anything new to that this comment so I don't understand why you're unhappy about my comment this time around. Everything I've commented here has already appeared on screen, if you're talking about the first scene of episode 1. I thought about tagging that but then that has already appeared on screen, so I figured I wouldn't need to. I'll tag anything if there's a certain part you think should be tagged.\n\n\nEdit: Someone even said my speculations could be untagged, but I left it tagged just because of the very reason right here, some people like to do their own speculations and have their idea of the direction of the story untouched. If you have read my comment last week, then it sure isn't my fault for the spoilers as I for sure tagged them. If it was someone else, then I don't see a reason on being upset on my comment this week, which reveals nothing new on the story."
  },
  {
   "score": 3,
   "id": "dijfuzv",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:21:28",
   "depth": 0,
   "text": "So Ithea dropped that massive bomb at the beginning and we know the same thing is happening to Chtholly. So if she lives through her death flags. She will become the original red haired girl again?"
  },
  {
   "score": 1,
   "id": "dik1m7z",
   "pid": "t1_dijfuzv",
   "date": "2017-06-06 17:06:02",
   "depth": 1,
   "text": "Depends on whether or not they get to the sword in time, and if they do whether or not it works as advertised.\n\nBut we know she gets a full head of red hair, which doesn't bode too well for the current Chtholly...."
  },
  {
   "score": 6,
   "id": "dijkc1t",
   "pid": "t1_dijfuzv",
   "date": "2017-06-06 11:39:12",
   "depth": 1,
   "text": "There's no telling. Encroachment occurs differently for everyone. In Ithea's case, there wasn't even a change in appearance, so the two shouldn't be compared."
  },
  {
   "score": 1,
   "id": "dijn1ia",
   "pid": "t1_dijkc1t",
   "date": "2017-06-06 12:25:38",
   "depth": 2,
   "text": "That is true but Ithea implied that whoever her past life was is now back. And from what is happening to chtholly I'm kind of assuming the same. The hair color switch i dont know why though"
  },
  {
   "score": 5,
   "id": "dijhb2g",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:46:21",
   "depth": 0,
   "text": "So, I suppose in Ithea's case, she has no fear of getting her memories erased due to encroachment, or could it still happen to her again?"
  },
  {
   "score": 1,
   "id": "dik1rk1",
   "pid": "t1_dijhb2g",
   "date": "2017-06-06 17:09:09",
   "depth": 1,
   "text": "Well, unless the real Ithea decides to come back with a vengeance, I don't think there's anyone else left who could replace her.  Assuming reincarnation doesn't occur \"naturally\" in this universe anyway."
  },
  {
   "score": 4,
   "id": "dijm6rv",
   "pid": "t1_dijhb2g",
   "date": "2017-06-06 12:11:02",
   "depth": 1,
   "text": "She already had her memories erased but she rejects what she learned about who she was made from  and clings to the memories she lost essentially clinging to being Ithea. \n"
  },
  {
   "score": 11,
   "id": "dik1q4x",
   "pid": "t1_dijm6rv",
   "date": "2017-06-06 17:08:20",
   "depth": 2,
   "text": "I don't think that's how it works.  She's taken on the role of being Ithea, but herself she still remembers who she was in the previous life."
  },
  {
   "score": 1,
   "id": "dikf168",
   "pid": "t1_dik1q4x",
   "date": "2017-06-06 22:27:45",
   "depth": 3,
   "text": "Remembering who she was does not mean she wants to be that. That is why she is shaken and grateful that Ctholly does not show interest in her \"ghost self\". She WANTS to be Ithea and she wants to reject the self she found. "
  },
  {
   "score": 1,
   "id": "dikff8t",
   "pid": "t1_dikf168",
   "date": "2017-06-06 22:40:21",
   "depth": 4,
   "text": "Perhaps it's less about not wanting to be her old self, but more about not wanting to remember everything she lost."
  },
  {
   "score": 2,
   "id": "dikkvcg",
   "pid": "t1_dikff8t",
   "date": "2017-06-07 02:23:10",
   "depth": 5,
   "text": "She remembers everything from her ghost self life. She simply choses her life as Ithea over that because she identifies as Ithea despite having that whole other set of memories and personality. "
  },
  {
   "score": 2,
   "id": "dikh7h6",
   "pid": "t1_dikff8t",
   "date": "2017-06-06 23:44:25",
   "depth": 5,
   "text": "she does remember everything she's lost, but she (the new soul) decided (for whatever reason) that it couldn't be helped (i mean its been what 500 years?) and after reading the original's diary, felt it best to tribute her new life (in the original's body) by going on as best as she believes Ithea (the original) would have. \n\nI mean its either that or ditch everyone there and go do something else, quite lonely waking up 500 years in the future though sooo...."
  },
  {
   "score": 8,
   "id": "dikh5nv",
   "pid": "t1_dikf168",
   "date": "2017-06-06 23:42:32",
   "depth": 4,
   "text": "Yeah but not sure you understand what /u/Kalirion is saying. \n\nThe way you first worded it. \"She already had her memories erased but she rejects what she learned about \"\n\nMakes it seem like the ORIGINAL Ithea is the one rejecting what she \"learned\". \n\nWhen in fact from my understanding of things, the ORIGINAL Ithea is essentially DEAD, GONE, and BYE BYE forever. And the soul of the person who has taken over Ithea's body, is attempting to live in the shadows of the Original Ithea, She's basically Cosplaying so hard that everyone believes she's the original. But she has ALL of HER (aka the new soul's) original memories and NONE of the Original Ithea's memories. She has a book and is acting out what she has read. \n\nShe hasn't \"found\" a self, she IS the self, It would be like you waking up in someone else's body, that \"someone else\" didn't find a self, YOU are You, in someone else's body. The new soul is itself, in Ithea's body, choosing to live / cosplay as Ithea so the world is none the wiser. "
  },
  {
   "score": 1,
   "id": "dikkts8",
   "pid": "t1_dikh5nv",
   "date": "2017-06-07 02:21:12",
   "depth": 5,
   "text": "She rejects the identity of the \"ghost self\", she choses to be Ithea, she identifies as Ithea, she wants to be Ithea so why should one label her as not Ithea? She might be different Ithea from previous Ithea that got erased but she is still Ithea because she wants to be Ithea. \n\nThe whole point of it is that even though Ithea woke up as a whole different person with no memories of \"Ithea\" she is still striving to BE Ithea. Its in a way inspiring message towards Ctholy - even if Ctholy loses every memory she ever made, if she does not resign to what is happening to her, if she wishes to she could still rebuild being Ctholy, even if the memories lost will never return."
  },
  {
   "score": 3,
   "id": "diksg3h",
   "pid": "t1_dikkts8",
   "date": "2017-06-07 06:31:50",
   "depth": 6,
   "text": "I feel like something is being fundementally ignored by you some of you guys. \n\nSHE (CTHOLY), the existance of the person known as CTHOLY WILL DIE. WILL BE NO MORE, WILL NOT EXIST. She's not just losing all her memory, its like her soul is being replaced by another. the Ctholy we know up til this moment, will not be anymore. replaced by a complete other soul packed with a life /memories/ mindset of its own. Ctholy as you know her today, will be gone, thus she cannot \"rebuild\" anything she's gone, dead, no more, zero, zinch. \n\nBasically if your mind/soul/memories were to replace me, the me of today would no longer exist, I'd be gone, replaced by you. You can then choose to do whatever the hell you want, in my body, however it will still be YOU doing whatever you want, not me, i'd be gone, replaced. \n\nIf you choose to pretend to be me, you'd have to act 100% because for me, being me comes natural, for you, Its cosplaying, it isn't the same thing, But I promise you have no vested interest in my family/life, etc, so chances are you wouldn't chose to carry on the same way I did, now would you? \n\nIthea (the new soul) is amazing because she DID choose, after being motivated by the diary of the old Ithea she replaced, to carry on, pretending to be the old Ithea. But she is also herself as well, She has her memories of her old life (which is why she is the wisest of the girls there) and she acts the role of Ithea. \n\n\n "
  },
  {
   "score": 1,
   "id": "diktp5u",
   "pid": "t1_diksg3h",
   "date": "2017-06-07 06:58:23",
   "depth": 7,
   "text": "> Basically if your mind/soul/memories were to replace me, the me of today would no longer exist, I'd be gone, replaced by you. You can then choose to do whatever the hell you want, in my body, however it will still be YOU doing whatever you want, not me, i'd be gone, replaced. \n\nThat's matter of philosophy called theseus paradox. If you were to replace every part of yourself would it still be you. \n\nI stand on the side of belief that you are who you identify as. Ithea identifies as Ithea thus even if all of her has replaced the old Ithea she still is Ithea, barring memories. Sure she has memories of the life of her ghost, but its not who she identifies as and its just information to her. "
  },
  {
   "score": 1,
   "id": "diku036",
   "pid": "t1_diktp5u",
   "date": "2017-06-07 07:04:41",
   "depth": 8,
   "text": "so what you're saying is Elvis impersonators are really Elvis? "
  },
  {
   "score": 1,
   "id": "dikv747",
   "pid": "t1_diku036",
   "date": "2017-06-07 07:28:31",
   "depth": 9,
   "text": "Elvis impersonators are not replacing anything in the first place and they are not of identical value so that's a fallacious argument. However if someone were to clone Elvis identically and give him rundown of his life that person would be by all means Elvis if he identified himself as Elvis.  \n\nWhat you are saying on other hand would mean that real life amnesia would make someone a totally different person than before. \nIf we look deeper into psychology, for example -PTSD is known to alter personality traits of a person affected. Does that mean that that person is different now? \nBiologically too every ~17 years our body replaces pretty much entirety of it's own composition with new cells. Does that mean we are someone else? \nOr if we are to go into SF - any sort of teleportation is about disassembling your data into matter and reassembling it - wouldn't that mean that you died and new you is born at the destination?\n\nIts a philosophical issue for a reason. One of biggest ones in regards to identity and individuality and one of the issues that will become more and more relevant as cloning advances and possibility of there being second you increases. \n\nYou believe that the person is completely different because all of it's parts were replaced. The way I see it, the deciding factor is how that person views himself/herself in the first place. \"Ithea\" holds on to being Ithea thus she is Ithea, even if nothing of Ithea remains in \"Ithea\". She still identifies as same identity even most parts of it were lost and she could let go of it and become a different person.  The defining part of  individual identity is about who that person identifies as. "
  },
  {
   "score": 1,
   "id": "dikzh06",
   "pid": "t1_dikv747",
   "date": "2017-06-07 08:46:37",
   "depth": 1,
   "text": "Ahenshihael, I think that we are disagreeing because we view the \"new\" (actually old) soul differently. \n\nThe old soul had a life of its own, the \"ghost\" comes fully with a persona, memories, etc of itself. It would be like you waking up tomorrow in my body. Now you could choose to act as if you were me, but you'd still be just acting, in my body, you would never truly be me. \n\nYour example is broken, a clone has no previous identity. A better example would have been having 1 twin replace the other. But just because you take on the life of someone else (like a elvis impersonator) doesn't mean you are that someone else, you are still you, living as someone else. \n\nI believe that the person is completely different because THEY ARE COMPLETELY DIFFERENT. If you wake up today in my body. You would still know your name, you would still love YOUR parents and not give a shit about mine (who would be strangers to you) and you'd still have YOUR life goals in mind, not my life goals. Now if you choose to attempt to pretend to be me (since you're in my body) from that point on, thats fine, but you never lose WHO YOU ARE. \n\nWhen they go through these changes, its their old soul (the souls of children who died young?) who are resurfacing, it isn't like they are just meta morphing into a new mindset, its a completely foreign persona overtaking them and erasing them from reality.\n\nThe new persona who calls herself Ithea, knows her real name, her real history, and her old life. She chooses to move forward pretending to be Ithea, however she has something Ithea never had, a completely alternative life, wisdom, emotional set, etc. Because she is in essence, a completely different person, acting as Ithea. \n\nYou keep saying \"Ithea lost etc\" she didn't lose anything, Ithea was REPLACED by a soul, that soul then chose to pretend to be Ithea. \n\nCtholy's memories are slowly being eaten away to make room for what is attempting to replace her. Until she is replaced, I agree with you that she is Ctholy. However once Ctholy is replaced by \"Ruby Redhead\" Ctholy would have died, this is why everyone views it as death, because it is. Now Ruby Redhead will be in control of Ctholy's body and Ruby Redhead can do whatever the hell she pleases with it. If Ruby Redhead chooses to take on the shoes of Ctholy, that's not the same person the male lead fell in love with, its someone pretending to be.\n\n\n\n"
  },
  {
   "score": 15,
   "id": "dijkdv3",
   "pid": "t1_dijhb2g",
   "date": "2017-06-06 11:40:08",
   "depth": 1,
   "text": "Her encroachment has already occurred, so there's probably no fear of that anymore. Of course she can still die from overusing venom but that wouldn't affect her memories."
  },
  {
   "score": 5,
   "id": "dijiez9",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:05:27",
   "depth": 0,
   "text": "Wow. That has to be so freaking awful to lose yourself that way. I really hope this has a happy ending.\n\nI always felt that someone who lost all their memories are pretty much dead and have become someone else in the same body, just like Ithea. Damn."
  },
  {
   "score": 3,
   "id": "dijif0h",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:05:28",
   "depth": 0,
   "text": "That reveal at the beginning was pretty unexpected. It was pretty good, a bit out of nowhere but probably the LNs do the proper foreshadowing that the anime isn't able to do. What I expected and didn't get was for Chtholly asking for who Ithea was truly. While I understand why she just accepted what Ithea told her and didn't wan't to know about who Ithea was truly, I think Ithea was carrying such an emotional baggage for trying to act like true Ithea did, and no one would be able to understand what is the pain and panic the degeneration causes the fairies, that now that Chtholly understands that very pain and panic, she wanted to comfort and cheer her up and in the process open herself so she can feel that she has formed a true connection again, and that is ok for her to be herself again. Either way, poor \"Ithea\" :(\n\nThe episode was pretty good and pretty chill, actually. I didn't get why Chtholly was making the scarfs but getting here in the thread I finally understand it. The insert songs are pretty much on point and sell pretty well emotions that Chtholly is feeling all the way through. It is certainly pretty touching, especially since if you think it in a certain way, this can very well be a story of a character dealing with Alzheimer, with the obvious difference that in this world there is actually a cure for it.\n\nOf course, this degeneration and taken over by the old memories of the life that became before the actual one that we've seen this episode open the door for many questions, but since the story in this world has barely started I think there is still no answer to many of them. \n\nOther than that, I'm actually pretty happy to see in the preview that we are going to get a bit more of Lilia next episode :)! yeah yeah, I know that the relationship is about to sink, but honestly while everything is pretty touching, the relationship has failed a bit to make me care more. Maybe is in my blood as a writer :P. But oh well, I'm pretty excited that we finally are going to see more of her next episode, surely in another flashback, but that is best than nothing. "
  },
  {
   "score": 4,
   "id": "dikh068",
   "pid": "t1_dijif0h",
   "date": "2017-06-06 23:36:52",
   "depth": 1,
   "text": "> That reveal at the beginning was pretty unexpected.\n\nYeah it would have been flawless if not for the magical \"speculations\" last week of some redditors. Really losing faith in this site. \n"
  },
  {
   "score": 1,
   "id": "diktm3b",
   "pid": "t1_dikh068",
   "date": "2017-06-07 06:56:34",
   "depth": 2,
   "text": "Seems like someone had the reveal spoiled. Sucks for you ;("
  },
  {
   "score": 5,
   "id": "dik15un",
   "pid": "t1_dijif0h",
   "date": "2017-06-06 16:56:17",
   "depth": 1,
   "text": "> a bit out of nowhere but probably the LNs do the proper foreshadowing that the anime isn't able to do.\n\nYou are correct about this. *Shuumatsu Nani Shitemasu ka?* novel has a lot of foreshadowing in general. I like this quite a bit because it encourages you to be attentive and think while reading. It also shows that the story was properly planned out and many details are there for a reason."
  },
  {
   "score": 1,
   "id": "dik36zn",
   "pid": "t1_dik15un",
   "date": "2017-06-06 17:39:42",
   "depth": 2,
   "text": "I see, well, I'm glad to be correct about this, and it is pretty cool to see that the story shows that it has been planned from the very beginning with much care and attention. \n\nIt is kinda sad that we aren't, it seems, going to be able to even get to vol4, which is truly a shame. If it where on me, I would have liked for it to get to vol5 actually, but we get what we get."
  },
  {
   "score": 5,
   "id": "dikct11",
   "pid": "t1_dik36zn",
   "date": "2017-06-06 21:20:56",
   "depth": 3,
   "text": "Yeah, ideally anime would be 24-26 episodes long and properly adapt all 5 volumes. But this world is as far from ideal as it can get. Even original LN was on a verge of being cancelled after first 2 volumes due to insufficient sales (it was saved by very high reader evaluation and mention in some annual LN top list).\n\nConsidering that anime adaptation is only 12 episodes long, not including volumes 4-5 is a good thing. Trying to cram all 5 volumes into this amount of screen time wouldn't lead to anything good. Even including 4 volumes would make for a very rushed adaptation. Besides, forth volume ends on a huge cliffhanger, it is not a good place to end the anime.\n\nSo all in all, adapting first 3 volumes is fine. And ending of the third volume is fairly suitable to finish the anime, in my opinion. The distribution of screen time is a bit weird, but we will see how it works out after the anime is finished.\n\nAs for getting volumes 4 and 5, you can always read the original (its translation is close to complete). I feel like a broken record for repeating this again and again, but the original LN is very good. If reading books is something you enjoy, or at least not against, then I would highly recommend it."
  },
  {
   "score": 1,
   "id": "dikdh9h",
   "pid": "t1_dikct11",
   "date": "2017-06-06 21:40:34",
   "depth": 4,
   "text": "Does the translation have the images? I would like to see Chantré if possible. The concept in itself is so weird but understandable that I would like to see how she is.\n\nOther than that, I see, didn't know that vol4 ended in a cliffhanger. Knowing that then yeah, the only way to end well the anime is with vol3. Such a pity, but I can see it being for the best."
  },
  {
   "score": 2,
   "id": "dikeak8",
   "pid": "t1_dikdh9h",
   "date": "2017-06-06 22:04:55",
   "depth": 5,
   "text": "Chantré? Are you talking about \"The First Beast\"? If yes, then its name was transliterated as Shiantor in the novel translation.\n\nTranslation does include LN illustrations, if you are reading from the compiled volumes rather than posts at translator's website. But there is no illustration for Shiantor, or at least it wasn't present in the first 4 volumes."
  },
  {
   "score": 1,
   "id": "diktztz",
   "pid": "t1_dikeak8",
   "date": "2017-06-07 07:04:32",
   "depth": 6,
   "text": "Yes, that is the one I have in mind. \n\nReally? well, that kinda sucks. I liked a lot the name \"Chantré\", since for me, as a writer, gave me an interesting image of what the first beast could be and represent. Two of the meanings of the word Chantré that I found are: 1) Song, or someone that sings, and 2) Champion, which is pretty fitting for her actually.\n\nI wonder if Shiantor means the same thing though, but I can't seem to deduce from where that name comes from. I mean, we have for example Timere, which to me seems French, and Aurora, that to me seems English, but, Shiantor? that I don't know.\n\nI see. We will have to wait then to see if vol5 has an illustration. I would still really love to see her concept. I read a bit of her description but I would like to see how she... looks."
  },
  {
   "score": 2,
   "id": "dimsx26",
   "pid": "t1_diktztz",
   "date": "2017-06-08 09:32:41",
   "depth": 7,
   "text": "The \"Shiantor\" doesn't necessarily have any special meaning, it's just a Japanese reading of the name. The novel translation is actually a fan-translation (which is pretty common, relatively few LNs get licensed and officially released in English) and it was started at the beginning of 2016. Official/intended spelling in Latin script wasn't available or known back then, so translator had to rely on original spelling in Japanese for all names. For this reason, most names in LN translation are somewhat different from the variants used in the anime.\n\nBtw, where did you learn about the First Beast? I don't remember it being mentioned in the anime. And where did you see the \"Chantré\" spelling?\n\nIntended names for all Beasts and Carillons (relict swords) seem to be either Latin or from one of the languages that [evolved from Latin](https://en.wikipedia.org/wiki/Romance_languages), which includes French.\n\nTimere is \"fear\" in Latin, Aurora is \"dawn\" in Latin. Another possible and quite likely alternative to Shiantor/Chantré is Chanteuse, which means \"songstress\" in French. Or perhaps Chanteur - \"singer\" in French.  \nChanteuse is the most likely intended spelling because \"la chanteuse\" is an alternative title of one of the chapters in the novel.\n\nAs for the swords: Insania = insanity (Latin), Historia = history (Latin), Desperatio = hopelessness/despair (Latin). Can't find Seniorious, it probably should be Senioris which means \"elder/senior\" in Latin. Can't find the correct form and meaning for Valgulious.\n\nAlso, there was a related discussion in one of the previous topics: https://www.reddit.com/r/anime/comments/6e88aw/spoilers_shuumatsu_nani_shitemasu_ka_isogashii/di8na6s/\n\nAnd as another user has already said, there is also a [manga adaptation](https://www.mangaupdates.com/series.html?id=138616). So even if we don't get an illustration for something in the LN, there is also an option of waiting for it to appear in the manga.  \nThat is, if manga will reach that point. There is always a risk of it being cancelled prematurely. From my limited knowledge, manga series get axed more frequently than LNs."
  },
  {
   "score": 1,
   "id": "din64fo",
   "pid": "t1_dimsx26",
   "date": "2017-06-08 13:15:00",
   "depth": 8,
   "text": "I'm not saying that the name \"Shiantor\", or even \"Chantré\" has a special meaning. I just read about her and I liked the name a lot, it fitted her once I understood the meaning of the name, and gave her an interesting air that I quite haven't seen in another work yet.\n\nThe spelling and the learning were from the guy that in many threads posted a document where he wrote everything that is related to the lore of the LNs. I learned about her there and there is also the spelling \"Chantré\".\n\nI see, I didn't know that everything was derived from Latin or a language evolved from Latin, especially Aurora, didn't know that word had a place in Latin. Regarding the name \"Chanteuse\", I think you might be right, especially if one of the chapters has an alternative name that spells that nme.\n\nEither way, what I liked once I read that document the other user did was how, in an image on my head, that name fitted her, and the image it created in my head. The mystery if you may say, as me, as a writer, I'm very drawn to this kind of images that draw his unique images and takes on fantasy that other people came with. Now that you clarified and given even the most probably right name for her, I may even try giving it my take, with the name \"Chantré\", and see how it cames about with my own ideas... at least for fun :P\n\nAnd yeah, the manga adaptation. I would like for them to get to vol5 and see the image of her, exactly what is she physically, but as you say, they first must get there, and that might be pretty hard... although the show seems to be doing ok right now... unless there are some numbers that disprove what I have read lately of course, but if it is doing fairly ok I think it is reasonably to expect them to get to vol5."
  },
  {
   "score": 2,
   "id": "dind67d",
   "pid": "t1_din64fo",
   "date": "2017-06-08 15:26:32",
   "depth": 9,
   "text": "I've just looked into that lore document and it is choke-full of spoilers. Or perhaps it would be more accurate to say that it is one huge spoiler from the beginning to the end.\n\nReading it before you learn all that stuff from the LN is definitely not a good idea.  \nLore is revealed very gradually in the novel. It is what adds the mystery element to the story. And learning about their world and its past, bit by bit, hugely enhances the experience while reading.\n\nWell, there is no point in crying over spilled milk. And maybe you even knew what you were getting into. But author of that document really should have added a clear and visible warning that it's not something you are supposed to know before delving into the story yourself.\n\n> I see, I didn't know that everything was derived from Latin or a language evolved from Latin\n\nI don't know about everything, what I was talking about are names of Beasts and Carillons.\n\nAnd regarding the manga. I'm not sure if you know this, but 1 LN volume is not equal to 1 manga volume. Typically, it takes 2 manga volumes to do a decent adaptation of 1 LN volume. And if mangaka goes for a very detailed and faithful adaptation, then it can be 3 or even 4 manga volumes per 1 LN volume.  \nSo we would have to wait much longer than manga vol 5, if we want to reach the same point in the story as LN volume 5. Luckily, this is not necessary. Shiantor is mentioned in the epilogue of first LN volume (this scene was not present in the anime). So with any luck, we might get some visuals in first 2-3 volumes of the manga."
  },
  {
   "score": 1,
   "id": "dinhyu5",
   "pid": "t1_dind67d",
   "date": "2017-06-08 17:07:10",
   "depth": 1,
   "text": "I totally understand what you're saying, but sadly, here where I live, I can't get the LNs easily. I could read the fan-translation, but I wanted to first let the anime do some work and see how it comes. Sadly I think the anime isn't actually doing a good job now, and I don't care that much about the relationship of Willem and Chtholly, although I can safely recognize it as a healthy relationship, although, again, I don't care as much.\n\nI didn't realize then, but probably that came into play with my choice of reading the document. I also had some minor spoilers there and there and my writer soul that fires up when he sees something that could be a pretty great idea to write a story about also played a part. I do get enjoyment reading about lore of fictional universes and I think I do care enough now to watch the anime until the end thanks to reading that document, so it was worth it, especially if the anime doesn't get another season, which I can see happening, and thus we won't get to see said lore in full glorious animation. So yeah, as you say, I did knew what I was getting into, especially if some many little interesting things that are in the LN about the world are not displayed in the anime, I just had to know :-)\n\nAlthough I totally understand you and I agree that anyone else should read at least the fan-translation and enjoy the story little by little.\n\nI see, well, I do hope then that the manga adapts from the very beginning with the epilogue. It won't be animated but that can make shine other aspects of the character pretty well."
  },
  {
   "score": 2,
   "id": "dimgioe",
   "pid": "t1_diktztz",
   "date": "2017-06-08 05:31:28",
   "depth": 7,
   "text": "\"Chantré\" and \"Shiantor\"\nThose pronounce same or similar in Japanese way of reading.\n\nAlthough I am not 100% sure because I do not read the vol.4 yet, I think both of you are talking about the same thing. \n\n\nAnd one more option for you .. is to wait Manga adaptation but don't know when it will be (currently it is episode 3 of anime)"
  },
  {
   "score": 1,
   "id": "dimlvqc",
   "pid": "t1_dimgioe",
   "date": "2017-06-08 07:27:52",
   "depth": 8,
   "text": "Well, I did suspect that both names are basically the same for the Japanese, but, for me as the writer I am, Chantré has some kind of charm to it. It is not about how we pronounce it, but how it looks on paper :), and yeah, we are talking about the same thing.\n\nI didn't know that there was a manga adaptation :o maybe my hopes of seeing her are still possible. Thanks for telling me about the adaptation, although it seems that it may take a while, but it will be worth it."
  },
  {
   "score": 5,
   "id": "dijm0k1",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 12:08:06",
   "depth": 0,
   "text": "Has anyone else noticed the mid episode picture of Chtholly has changed from blue and greens outline and butterfly wings to the colors of red and purple.  "
  },
  {
   "score": 4,
   "id": "dikc4kp",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 21:02:48",
   "depth": 0,
   "text": "Can we please get a petition to a season 2 with full exploration on volume 5 haha. I can't live like this."
  },
  {
   "score": 6,
   "id": "dimgdl8",
   "pid": "t1_dikc4kp",
   "date": "2017-06-08 05:27:47",
   "depth": 1,
   "text": "Exactly. That is what needed for Season 2.\nThe BD/DVD sell is miserable. I don't expect that the publisher will invest for Season 2.  \n\n\nBut you can help - send feedback to the LN author or publisher. If they have got numbers of request they can appeal to their boss. I feel that Sukasuka is a kind of the things which is more popular in overseas than that of Japan domestic. If they get numbers of the feedback from overseas they have to reconsider. \n\nNo need to write in Japanese, use your own language. \n\nhttps://twitter.com/sukasuka_anime\n"
  },
  {
   "score": 9,
   "id": "dijh1zl",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:42:02",
   "depth": 0,
   "text": "[A dagger to the heart knowing](/s \"the three who left that day will never return as they were\")"
  },
  {
   "score": 1,
   "id": "dik1j0r",
   "pid": "t1_dijh1zl",
   "date": "2017-06-06 17:04:11",
   "depth": 1,
   "text": "[think of it this way](/s \"we are all constantly dying and being reborn every time a new experience is recorded in the brain\")"
  },
  {
   "score": 1,
   "id": "dj0sioc",
   "pid": "t1_dik1j0r",
   "date": "2017-06-17 02:33:19",
   "depth": 2,
   "text": "This is why memory wiping terrifies me."
  },
  {
   "score": 2,
   "id": "dik2q7f",
   "pid": "t1_dijh1zl",
   "date": "2017-06-06 17:29:35",
   "depth": 1,
   "text": "I'm intrigued by this statement."
  },
  {
   "score": 4,
   "id": "dik5m9t",
   "pid": "t1_dik2q7f",
   "date": "2017-06-06 18:31:59",
   "depth": 2,
   "text": "[Chtholly](/s \"dead after opening gate of elf as seen in ep1\")\n\n[Willem](/s \"turned into a \"dead body\" after corrupted by the undying first beast, \"died\" after battling Leprechauns and the demonstrates how to correctly use the death curse of the Seniorious.\")\n\n[Nephren](/s \"Corrupted by the undying first beast, but as a Leprechauns can never turn into a beast travels to the second island and never return\")\n"
  },
  {
   "score": 1,
   "id": "dioijgb",
   "pid": "t1_dik5m9t",
   "date": "2017-06-09 09:38:13",
   "depth": 3,
   "text": "... I'm not fine with this."
  },
  {
   "score": 8,
   "id": "dik5w3t",
   "pid": "t1_dik5m9t",
   "date": "2017-06-06 18:38:00",
   "depth": 3,
   "text": "Jesus Christ! So their story ends shortly after the anime will end? Like during vol 4? \n\nThis is way darker than I expected."
  },
  {
   "score": 1,
   "id": "dik7mmo",
   "pid": "t1_dik5w3t",
   "date": "2017-06-06 19:15:59",
   "depth": 4,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dim0o5l",
   "pid": "t1_dik7mmo",
   "date": "2017-06-07 20:34:54",
   "depth": 5,
   "text": "This comment has been removed.\n\n- This comment has been reported as containing untagged spoilers. Please review for any tags you may have missed and reply to this message to have your post re-approved.\n\n  Self and link posts should be properly spoiler-tagged and should include the name(s) of the show(s) referenced in the title. Self posts may opt to tag spoilers in the self post instead. (Using the same format as comment spoilers below)\n\n  Comments should use `[spoiler source](/s \"spoiler-chan died\")` to protect spoilers. Spoiler source should, at a minimum, contain the relevant source of the spoiler (e.g. One Piece episode 200, or if it's from a different medium, LN/Manga/VN). Spoiler source is only required in the first of any set of spoilers for the same source and is not required in a discussion thread while discussing that thread's series.\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 2,
   "id": "dik8x9b",
   "pid": "t1_dik7mmo",
   "date": "2017-06-06 19:44:26",
   "depth": 5,
   "text": "I've read all the LNs and I don't know what the fuck this sentence means."
  },
  {
   "score": 1,
   "id": "dik91z1",
   "pid": "t1_dik8x9b",
   "date": "2017-06-06 19:47:22",
   "depth": 6,
   "text": "[wasn't vol4](/s \"about the 500 year old dream ?\")"
  },
  {
   "score": 1,
   "id": "dik9fh9",
   "pid": "t1_dik91z1",
   "date": "2017-06-06 19:56:01",
   "depth": 7,
   "text": "Do you want to stop posting spoilers without tagging them?"
  },
  {
   "score": 1,
   "id": "dik9jgs",
   "pid": "t1_dik9fh9",
   "date": "2017-06-06 19:58:36",
   "depth": 8,
   "text": "was on the phone forgot about it "
  },
  {
   "score": 3,
   "id": "dijdftk",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:39:09",
   "depth": 0,
   "text": "So this episode, while quite a bit of it is anime original, works as nice moment to explore what makes Ctholly tick and her struggle with the ongoing loss of her identity. It helps to strengthen the understanding of the life she leads and clings to as well as what drives her forward. This pretty much makes up for a lot of skipped minor things in previous episodes so far, showcasing Ithea and Ctholly's bond, showcasing more of her thoughts, showcasing how much she changed over the course of the show - after all we started with a girl who foolishly rushed into death and now the very same person is clinging to her life and identity with everything she has. \n\nIts a perfect book-end for the calm slice of life days and experiences, an episode that essentially has the audience see them all off into the surface story as the flashforward from the first episode draws ever closer. \n\nIts quite clear that they are intending to end this with [expectation spoilers](/s \"Either the end of Volume 4 or somewhere even earlier than that. There's absolutely no way to cover Vol5 now\")"
  },
  {
   "score": 9,
   "id": "dijdu2p",
   "pid": "t1_dijdftk",
   "date": "2017-06-06 09:46:03",
   "depth": 1,
   "text": "[ ](/s \"I don't see them even covering vol.4 tbh, maybe they will sprinkle in some lore about Elq and thats it.\")"
  },
  {
   "score": 2,
   "id": "dije91j",
   "pid": "t1_dijdu2p",
   "date": "2017-06-06 09:53:12",
   "depth": 2,
   "text": "Yeah I am struggling to think on how they would EVER get [expectation spoiler](/s \"Whole Vol4 in 2 episodes or so. IDk where they would stop then? End of Vol3 somehow?\")"
  },
  {
   "score": 1,
   "id": "dijewze",
   "pid": "t1_dije91j",
   "date": "2017-06-06 10:04:50",
   "depth": 3,
   "text": "[spoiler disc](/s \"Yeah for real now I dont see how they can do volume4 unless they completely rush it, but im seriously struggling to see how they can drag out vol3 for 3 more episodes unless they keep putting anime original because there really isnt much left besides the actual part where they go on the rescue mission and shit goes down which should only take 1 episode\")"
  },
  {
   "score": 3,
   "id": "dijkc5e",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:39:15",
   "depth": 0,
   "text": "Final OST was just beautiful  \nAm I the only one who found the Christmas tree (don't know what exactly is it) more interesting than Chtolly ?"
  },
  {
   "score": 3,
   "id": "dijojzg",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 12:51:54",
   "depth": 0,
   "text": "It's so sad to look at Ithea and Chtholly in this episode. They both act very cheerful and happy, but we learn that both of them experience the same tragic fate of losing who they are completely."
  },
  {
   "score": 3,
   "id": "diju236",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 14:31:10",
   "depth": 0,
   "text": "Ithea is best girl\n\nalso this can't possibly end well goddamn it I'm not ready"
  },
  {
   "score": 3,
   "id": "dijzplk",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 16:25:19",
   "depth": 0,
   "text": "Well shit... talk about dropping a bomb. She took it rather well suddenly finding out her  friend she grew up with has actually been gone for a long time. I think watching Chtholly slowly vanish like this  is more heart wrenching than if she had just suddenly died."
  },
  {
   "score": 3,
   "id": "dikeetw",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 22:08:28",
   "depth": 0,
   "text": "Everyone talking about Ithea but what really hit me hard was the last part when Kutori talks about how she is so upset over her losing herself and the helpless situation she is in. My gosh the feels T_T"
  },
  {
   "score": 3,
   "id": "dikhit0",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 23:56:45",
   "depth": 0,
   "text": "This show is basically the anime version of losing your grandparents to Alzheimer's. "
  },
  {
   "score": 2,
   "id": "dijg4y2",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:26:12",
   "depth": 0,
   "text": "Those snowmen... What is it, Higurashi? \n\nRen and Rhantolk look like best bros. I'm looking forward to the next episode and interactions between those two."
  },
  {
   "score": 1,
   "id": "dikhahc",
   "pid": "t1_dijg4y2",
   "date": "2017-06-06 23:47:42",
   "depth": 1,
   "text": "What you never troll fest before? \n\nDeck the halls with bones and blood\n\nRawr Rawr Rawr Rawr Rawr, Rawr Rawr Rawr Rawr\n\ntsk the season to crush and thud\n\nRawr Rawr Rawr Rawr Rawr, Rawr Rawr Rawr Rawr\n\n"
  },
  {
   "score": 2,
   "id": "dijoupx",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 12:57:02",
   "depth": 0,
   "text": "This was a damn good episode. This anime will end at volume 3 end of the LN probably judging by the pacing. \n\nI liked the music especially in this episode and animation was also better. \n\nIthea is not actually the real Ithea, oh man. Same will probably happen to Chtolly. "
  },
  {
   "score": 2,
   "id": "dik184o",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 16:57:36",
   "depth": 0,
   "text": "That reveal about Ithea caught me by surprise. Must be lonely as hell, pretending for years to be someone you're not, nobody knowing the truth.\n\nI wonder if Ctholly's improved house-wife skills are leaks from her soul's past life."
  },
  {
   "score": 2,
   "id": "dik9b7j",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 19:53:17",
   "depth": 0,
   "text": "The music just before the ending... Chtholly's monologue... I don't like where this is going."
  },
  {
   "score": 2,
   "id": "dijrhs3",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 13:43:58",
   "depth": 0,
   "text": "Ithea is great. \n\nThis show always pleases me so much with how they *actually say what everyone is thinking*. The honestly and openness with each other is so satisfying. Like, why can't other anime do that? \n\nAlso, is it just me or is the music too quiet in this show? Its a great OST, but I can barely hear it most of the time it seems like. "
  },
  {
   "score": 2,
   "id": "dikx4et",
   "pid": "t1_dijrhs3",
   "date": "2017-06-07 08:04:56",
   "depth": 1,
   "text": "Wanna know what they're thinking? Read the LN. So much detail!!!!"
  },
  {
   "score": 2,
   "id": "dijfe6k",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:13:16",
   "depth": 0,
   "text": "So it seems like the red-haired girl in Ctholly's visions must be a previous version of herself that went through this forgetting process she's going through now; but if so there's nothing yet to explain how the bodies change along with the minds.  Also, if so, then the next version of her will be destined to see this one toward the end of her life.\n\nI could be wild-ass guessing here, though.\n\nIn other news,\n\n[](#makicry)"
  },
  {
   "score": 1,
   "id": "dijgy7n",
   "pid": "t1_dijfe6k",
   "date": "2017-06-06 10:40:14",
   "depth": 1,
   "text": "[red hair girl](/s \"Ctholly holds a fraction of the red girl, here is a question if normal souls can only create an elf the size of a tea pot what makes an elf the size of children \")"
  },
  {
   "score": 6,
   "id": "dijgggu",
   "pid": "t1_dijfe6k",
   "date": "2017-06-06 10:31:45",
   "depth": 1,
   "text": "> So it seems like the red-haired girl in Ctholly's visions must be a previous version of herself that went through this forgetting process she's going through now;\n\nThey already explained that it is most likely the \"past dead child\" whose soul Ctholly is made from.\n\nIthea's story only tells you that Ithea lost her memories and self but managed to came back from the brink of disappearing completely clinging to that identity she lost, having been trying to mimick her own lost personality all this time. ."
  },
  {
   "score": 1,
   "id": "dikzuj8",
   "pid": "t1_dijgggu",
   "date": "2017-06-07 08:53:13",
   "depth": 2,
   "text": "OMG THIS is the misunderstanding -_-. Now I see why we're going back and forth -_-.\n\n>Ithea's story only tells you that Ithea lost her memories and self but managed to came back from the brink of disappearing completely clinging to that identity she lost, having been trying to mimick her own lost personality all this time. \n\nIncorrect, Ithea's personality DIED, the girl, the past dead child's soul/personality that replaced Itheas mind, fully took over, literally replacing the true Ithea. this past dead child then stumbled upon the diary of the true Ithea who she had \"killed\", and upon reading it, decided to live her life as if she was the true Ithea. She knows she isn't, she remembers her life as \"past dead child\" (they show this in the anime, she even says it all) and she is a completely new persona than that of Ithea, who no longer exist. The past dead child is not \"trying to mimic her own lost personality\" she is mimicking the personality of the PREVIOUS person who inhabited that body. \n\nIf Ithea's persona was to come back, it would mean the current mind that is in Ithea's body, would die. "
  },
  {
   "score": 1,
   "id": "dije056",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:49:00",
   "depth": 0,
   "text": "That was a cool episode. It revealed some pretty heavy and major shit, like Ithea's backstory and Chtholly losing her memories, but by the sound of it you'd think they aren't that big of a deal. But it doesn't feel lazy in any way."
  },
  {
   "score": 1,
   "id": "dijh77k",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:44:32",
   "depth": 0,
   "text": "I'm so gonna prepare my pack of tissues for the final episodes. I won't survive this. Might as well book a coffin."
  },
  {
   "score": 1,
   "id": "dijijvv",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:07:52",
   "depth": 0,
   "text": "I feel like the airship the military is building is the one foreshadowed on the first episode oh no..."
  },
  {
   "score": 1,
   "id": "dijjlt6",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:26:30",
   "depth": 0,
   "text": "This was a really sad episode, made me feel like tearing up a little bit."
  },
  {
   "score": 1,
   "id": "dijjrw2",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:29:26",
   "depth": 0,
   "text": "The tragedy train that has been boarding for 8 episodes has finally started to leave the station anime only watchers. Next episode is one I have personally been waiting for since I read it in the LN. Hope they do \"that scene\" justice. "
  },
  {
   "score": 1,
   "id": "dijohea",
   "pid": "t1_dijjrw2",
   "date": "2017-06-06 12:50:39",
   "depth": 1,
   "text": "It probably won't even be next episode, looks like they're milking volume 3 until the end"
  },
  {
   "score": 1,
   "id": "dijjzz6",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:33:22",
   "depth": 0,
   "text": "I just want the ending to be a happy one."
  },
  {
   "score": 1,
   "id": "dijkj2q",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:42:38",
   "depth": 0,
   "text": "Chtolly :((((("
  },
  {
   "score": 1,
   "id": "dijkmid",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:44:15",
   "depth": 0,
   "text": "This series is very heartwarming, to the point that it boils your heart and grills it. That kind of heartwarming. It fucks my feelings every week but I still watch it. \n\nI don't fucking care now 3 more episodes please let me be ready for the feels. I'm already dead inside but this series revives me only to kill me again.\n\n[](#imdone)"
  },
  {
   "score": 1,
   "id": "dijn7br",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 12:28:23",
   "depth": 0,
   "text": "And so the horror begins, the horror of [potatoes!](http://i.imgur.com/qGLGUGb.png)\n\nIf this doesn't have second cour, the last few episodes are going to be crazy, I just hope it doesn't turn into a clusterfuck. Either way, [things are hotting up.](http://i.imgur.com/z9Iz6Zf.png)\n\nIt's always cute seeing the girls in pretty dresses, though I like the look of Troll-fest, those were some metal decorations.  "
  },
  {
   "score": 1,
   "id": "dijsaaf",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 13:58:02",
   "depth": 0,
   "text": "I forgot why do their memories disappear and someone from past life returns? Can anyone remind?"
  },
  {
   "score": 5,
   "id": "diju48v",
   "pid": "t1_dijsaaf",
   "date": "2017-06-06 14:32:18",
   "depth": 1,
   "text": "From what was already said and what Suwong said before: Leprechauns are made via necromancy from souls of young dead children who were too young to understand they are dead. Encroachment eventually means Leprechaun's personality, mind, memories, etc, are erased completely and the identity of the dead child upon whom they are based resurfacing. "
  },
  {
   "score": 1,
   "id": "dijta5i",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 14:16:33",
   "depth": 0,
   "text": "I just get sadder and sadder with every episode.  Not sure what I'm supposed to feel anymore. "
  },
  {
   "score": 1,
   "id": "dijvdai",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 14:56:13",
   "depth": 0,
   "text": "can someone help jog my memory on the pendant that Chtholly leaves on the desk? I know it's something she wears all the time and was chasing the cat that stole it at the beginning but I don't remember if they explained some kind of importance to it and if she had even forgotten that. "
  },
  {
   "score": 3,
   "id": "dijxb55",
   "pid": "t1_dijvdai",
   "date": "2017-06-06 15:35:14",
   "depth": 1,
   "text": "I don't remember this being explained in the anime, but [in the novel](/s \"this pendant is something like a heirloom that Chtholly received from an older fairy. They were fairly close and Chtholly viewed her as a role model, if I remember correctly.\")"
  },
  {
   "score": 1,
   "id": "dikbvz7",
   "pid": "t1_dijxb55",
   "date": "2017-06-06 20:56:32",
   "depth": 2,
   "text": "It was shown in the anime, but in a different way than the LN. It was essentially the same tho."
  },
  {
   "score": 1,
   "id": "dik5po7",
   "pid": "t1_dijxb55",
   "date": "2017-06-06 18:34:04",
   "depth": 2,
   "text": "thanks"
  },
  {
   "score": 4,
   "id": "dijx2rp",
   "pid": "t1_dijvdai",
   "date": "2017-06-06 15:30:30",
   "depth": 1,
   "text": "If memory serves there was a brief scene where what looks like a fairy women gives it to to her before her final mission."
  },
  {
   "score": 1,
   "id": "dik5q1y",
   "pid": "t1_dijx2rp",
   "date": "2017-06-06 18:34:18",
   "depth": 2,
   "text": "thanks, that rings a bell now that you mention it"
  },
  {
   "score": 8,
   "id": "dijxmyd",
   "pid": "t1_dijvdai",
   "date": "2017-06-06 15:42:00",
   "depth": 1,
   "text": "A fairy she looked up to gave it to her when going off on a mission from which she never returned. IT was already shown in first half of the show."
  },
  {
   "score": 1,
   "id": "dik5q3p",
   "pid": "t1_dijxmyd",
   "date": "2017-06-06 18:34:20",
   "depth": 2,
   "text": "thanks, that rings a bell now that you mention it"
  },
  {
   "score": 1,
   "id": "dijx3hf",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 15:30:54",
   "depth": 0,
   "text": "So why didn't Ithea's hair change color?"
  },
  {
   "score": 2,
   "id": "dil5ex9",
   "pid": "t1_dijx3hf",
   "date": "2017-06-07 10:31:00",
   "depth": 1,
   "text": "Thisis fantasy. Nothing good comes out of over thinking this"
  },
  {
   "score": 5,
   "id": "dijxlg7",
   "pid": "t1_dijx3hf",
   "date": "2017-06-06 15:41:06",
   "depth": 1,
   "text": "Ctholly's hair is changing color because the girl Elq seems to have red hair. One can only guess that Ithea's \"basis\" had same hair color as Ithea."
  },
  {
   "score": 1,
   "id": "dipfieu",
   "pid": "t1_dijxlg7",
   "date": "2017-06-09 21:14:01",
   "depth": 2,
   "text": "But Ithea is still a fairy. Chtholly's biological form is changing back to human. Just a theory. I really need to read the LN now."
  },
  {
   "score": 1,
   "id": "dipk6kl",
   "pid": "t1_dipfieu",
   "date": "2017-06-09 23:59:31",
   "depth": 3,
   "text": "They did not say she is turning into a human. She is simply \"no longer a fairy\". There's no confirmation on Ithea or whether Ithea was ever tested either. "
  },
  {
   "score": 1,
   "id": "dijyz8x",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 16:09:40",
   "depth": 0,
   "text": "this was a really good episode it delved much deeper into cthollys thoughts about mental disintegration than even the LN.  Ren was also adorable  "
  },
  {
   "score": 1,
   "id": "dik13ik",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 16:54:52",
   "depth": 0,
   "text": "I'm still pretty unsure about this series. \n\nThis show is kind of against my norm. I'm not a huge fan of magical girls. I'm not really sure what keeps me watching to be honest. I'm too far to stop now though"
  },
  {
   "score": 1,
   "id": "dik9ay6",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 19:53:07",
   "depth": 0,
   "text": "So, what's the verdict on suka suka? Should I pick it up? The description falls a bit flat...?"
  },
  {
   "score": 1,
   "id": "dik9r7e",
   "pid": "t1_dik9ay6",
   "date": "2017-06-06 20:03:48",
   "depth": 1,
   "text": "It's pretty good, a little disappointing as a reader knowing we won't get a full adaptation but it's decent so far"
  },
  {
   "score": 1,
   "id": "dikf2xs",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 22:29:16",
   "depth": 0,
   "text": "The OST for this is so beautiful. When can I get it?"
  },
  {
   "score": 1,
   "id": "dimfw0x",
   "pid": "t1_dikf2xs",
   "date": "2017-06-08 05:14:42",
   "depth": 1,
   "text": "OST will be released in 7/12. https://www.amazon.co.jp/dp/B06Y5SY754"
  },
  {
   "score": 1,
   "id": "dikimsa",
   "pid": "t3_6fmpf1",
   "date": "2017-06-07 00:42:15",
   "depth": 0,
   "text": "Is it just me or there's something between [these two?](https://puu.sh/wdbGo.jpg). Now I'm a lot interested in their relationship."
  },
  {
   "score": 1,
   "id": "dikjyhv",
   "pid": "t3_6fmpf1",
   "date": "2017-06-07 01:41:08",
   "depth": 0,
   "text": "Man this ep.  \n\nThis show needs to ccontinue after this season... i want more of it...  \n\nThe character building and world building is amazing.  Its just so well done.  \n\nSo 1 fairy already broke and has been hiding it.  I wonder though... is she still a fairy?  i mean didnt she fight recently?  doesnt changing mean she wouldnt be able to use the weapons?  \n\nThey keep putting it off but i just really want to see Willem's reaction to seeing the stuff from his old home...  it might not be much of a reaction but i feel like its going to be a big thing for him to get past.  I mean after he woke up 500 years later he wanted to just live in the gutter and waste away, the fairies gave him a new lease on life, but he still has all those memories of his old life and old family...  im justw aiting for him to dig through the relics and find... a cake tin... for baking buttercake...  rip.  \n\n[](#juice1)"
  },
  {
   "score": 1,
   "id": "dikle3i",
   "pid": "t3_6fmpf1",
   "date": "2017-06-07 02:46:33",
   "depth": 0,
   "text": "what was that brown turd he was given as a gift?   \nthis damn episode is making me think pretty hard about life and getting old, and i'm not even 30 yet (but fuck i'm getting close...) and it's probably going to weigh on some near future decisions, like buying a house. do I look for a nice house in town, or do i say fuck it and get some property out of town and build the shop I want so I can build racecars... "
  },
  {
   "score": 3,
   "id": "dimgl8i",
   "pid": "t1_dikle3i",
   "date": "2017-06-08 05:33:18",
   "depth": 1,
   "text": ">what was that brown turd he was given as a gift?\n\nThat's TAWASHI. Scrub brush or scrubber. It means you got a consolation prize. Well, that's Japanese context - let's see what is like in US context - it's something like, you are a rude waiter in a bad restaurant and you got a one cent as a tip from the customer. Might not a good explanation, sorry."
  },
  {
   "score": 1,
   "id": "dimhdee",
   "pid": "t1_dimgl8i",
   "date": "2017-06-08 05:53:08",
   "depth": 2,
   "text": "Kinda makes sense. Obligatory gift but it ain't even store bought chocolate "
  },
  {
   "score": 1,
   "id": "dikyuxi",
   "pid": "t3_6fmpf1",
   "date": "2017-06-07 08:36:00",
   "depth": 0,
   "text": "WHOS READY ALL ABOARD THE FEELS TRAIN NEXT STOP MY FLOOD GATES "
  },
  {
   "score": 1,
   "id": "dilunon",
   "pid": "t3_6fmpf1",
   "date": "2017-06-07 18:31:39",
   "depth": 0,
   "text": "Can someone please just explain to me why her hair is changing color and why she is losing her memories? Please!"
  },
  {
   "score": 1,
   "id": "dim59pu",
   "pid": "t1_dilunon",
   "date": "2017-06-07 22:23:18",
   "depth": 1,
   "text": "Mine corruption ever since the battle with the 6th beast"
  },
  {
   "score": 1,
   "id": "dimdzm5",
   "pid": "t1_dim59pu",
   "date": "2017-06-08 04:13:05",
   "depth": 2,
   "text": "who is the red haired girl?"
  },
  {
   "score": 1,
   "id": "dilvow5",
   "pid": "t3_6fmpf1",
   "date": "2017-06-07 18:52:28",
   "depth": 0,
   "text": "Is this series complete in LN form?  Does it have a happy ending?  Who or what is elq?"
  },
  {
   "score": 1,
   "id": "dilyvs8",
   "pid": "t3_6fmpf1",
   "date": "2017-06-07 19:57:16",
   "depth": 0,
   "text": "Everything is happy\n\n>Waiting for the other shoe to drop\n\n>>Waiting for the other shoe to drop\n\n>>>Waiting for the other shoe to drop\n\n\"I've forgotten half of what I knew about all of you.\"\n\nTHERE IT IS!"
  },
  {
   "score": 1,
   "id": "dis1kus",
   "pid": "t3_6fmpf1",
   "date": "2017-06-11 19:05:02",
   "depth": 0,
   "text": "All the prominent characters in this story are well developed, but Chtholly is still a tier above. Her inner monologues really made the episode. I consider her to be the protagonist since it is her story which the viewers will strongly empathize with and feel a personal impact."
  },
  {
   "score": 0,
   "id": "dijl9hz",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 11:55:09",
   "depth": 0,
   "text": "Except for the Ithea reveal things it's just like a filler episode , that's how i felt it but next episode gonna hold a bunch of reveal according to the trailer at the end "
  },
  {
   "score": 1,
   "id": "dijobow",
   "pid": "t1_dijl9hz",
   "date": "2017-06-06 12:47:58",
   "depth": 1,
   "text": "Sucks we probably won't get volume4 and 5 animated"
  },
  {
   "score": -8,
   "id": "dijhhzy",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 10:49:36",
   "depth": 0,
   "text": "felt like a filler ep for the most part."
  },
  {
   "score": -1,
   "id": "dijhodw",
   "pid": "t1_dijhhzy",
   "date": "2017-06-06 10:52:42",
   "depth": 1,
   "text": "seems like the next couple will be aswell"
  },
  {
   "score": 4,
   "id": "dijl7se",
   "pid": "t1_dijhhzy",
   "date": "2017-06-06 11:54:21",
   "depth": 1,
   "text": "This episode actually sets up for the ending of Volume 3 which is pretty dang amazing. Even within the first few minutes we get some huge info bombs that are really building up towards a whole bunch of various things. I won't go into much detail but this was far from a filler episode!"
  },
  {
   "score": -7,
   "id": "dijw3w6",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 15:10:51",
   "depth": 0,
   "text": "Clitoris is so boring."
  },
  {
   "score": 8,
   "id": "dijy8ns",
   "pid": "t1_dijw3w6",
   "date": "2017-06-06 15:54:17",
   "depth": 1,
   "text": "[](#morethanonewaifu)"
  },
  {
   "score": -4,
   "id": "dijdgi7",
   "pid": "t3_6fmpf1",
   "date": "2017-06-06 09:39:29",
   "depth": 0,
   "text": "Idk if its just me but I'm really not a fan of anime original, all they're doing is dragging out volume 3 even more"
  },
  {
   "score": 1,
   "id": "dijdotp",
   "pid": "t1_dijdgi7",
   "date": "2017-06-06 09:43:32",
   "depth": 1,
   "text": "I'd rather have them do this than try to rush through Volume 4 in just  a few episodes."
  },
  {
   "score": 6,
   "id": "dijflrr",
   "pid": "t1_dijdgi7",
   "date": "2017-06-06 10:16:58",
   "depth": 1,
   "text": "I saw this as this title's rendition of the, \"We don't really have the funding or the time to do a big all-out thing for all 12 episodes, so, let's make on a filler... Ya know, beach resort, fan service, the whole shebang!\"\n\nOnly, this series is far too depressing for all that... So, it's a small winter festival, and a bunch of character development."
  },
  {
   "score": 1,
   "id": "dijftof",
   "pid": "t1_dijflrr",
   "date": "2017-06-06 10:20:51",
   "depth": 2,
   "text": "It's still annoying knowing where the anime will actually end off  [sp](/s \"I fully expect the ending to piss off a lot of people who havent read the LN\")"
  }
 ]
}