{
 "score": 840,
 "id": "6a6b63",
 "num_comments": 334,
 "date": "2017-05-09 09:01:28",
 "comments": [
  {
   "score": 183,
   "id": "dhc5hab",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:38:38",
   "depth": 0,
   "text": "I'm surprised there's no mention here of Ctholly having hallucinations or visions with that accompanied eye distortion. Throwing up some huge flags that her and Willem's romance is doomed to me. Not going to lie I'm going to be a little salty if that happens as I'm rooting for them really hard."
  },
  {
   "score": 13,
   "id": "dhc8sm1",
   "pid": "t1_dhc5hab",
   "date": "2017-05-09 11:38:53",
   "depth": 1,
   "text": "damn it people are going to start dying isn't it. "
  },
  {
   "score": 10,
   "id": "dhch378",
   "pid": "t1_dhc8sm1",
   "date": "2017-05-09 14:14:06",
   "depth": 2,
   "text": "We're all riding the roller coaster on this one. "
  },
  {
   "score": 1,
   "id": "dhdfh9z",
   "pid": "t1_dhch378",
   "date": "2017-05-10 06:14:45",
   "depth": 3,
   "text": "I'm not ready for said rollercoaster "
  },
  {
   "score": 85,
   "id": "dhc8c0h",
   "pid": "t1_dhc5hab",
   "date": "2017-05-09 11:30:32",
   "depth": 1,
   "text": "The child voice was creepy af. Reminded me of Akira. "
  },
  {
   "score": 20,
   "id": "dhd6tw3",
   "pid": "t1_dhc8c0h",
   "date": "2017-05-10 00:25:24",
   "depth": 2,
   "text": "Makes it creepier that they used an actual kid to do those parts. "
  },
  {
   "score": 50,
   "id": "dhc72fq",
   "pid": "t1_dhc5hab",
   "date": "2017-05-09 11:07:20",
   "depth": 1,
   "text": "even in op ctholly turn to some evil things with her red eye. wilam gonna save her or some sht"
  },
  {
   "score": 1,
   "id": "dhch3o9",
   "pid": "t1_dhc72fq",
   "date": "2017-05-09 14:14:21",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 5,
   "id": "dhcic6s",
   "pid": "t1_dhch3o9",
   "date": "2017-05-09 14:39:04",
   "depth": 3,
   "text": "The Light Novel series is only 5 volumes. I feel like we'll get a full adaptation. Just based off of some scenes from OP + episode 1 it seems like we'll get into some deep shit."
  },
  {
   "score": 1,
   "id": "dhcp8g0",
   "pid": "t1_dhcic6s",
   "date": "2017-05-09 16:52:49",
   "depth": 4,
   "text": "I sincerely hope so, but that hope is dwindling. "
  },
  {
   "score": 2,
   "id": "dhcxdic",
   "pid": "t1_dhcic6s",
   "date": "2017-05-09 19:38:13",
   "depth": 4,
   "text": "Doubt. We'll get to the end of Volume 4 at the current pace, leaving Volume 5 out. Actually from a story perspective, the LN4 ending just hits in a kinda perfect spot for an anime \"To be continued\" ending..."
  },
  {
   "score": 1,
   "id": "dhcxg9j",
   "pid": "t1_dhcxdic",
   "date": "2017-05-09 19:39:44",
   "depth": 5,
   "text": "That would be pretty damn troll :( just gauging from the 5 episodes we have I feel like a read the light novel ending would be a big disappointment"
  },
  {
   "score": 1,
   "id": "dhcz2uk",
   "pid": "t1_dhcxg9j",
   "date": "2017-05-09 20:13:37",
   "depth": 6,
   "text": "Let me clarify myself: Its a \"To be continued\" after everything that could've gone wrong at that point does so and the show hits rock bottom. Its the perfect point from an incentive point of view for dragging viewers to the LN."
  },
  {
   "score": 4,
   "id": "dhcl3c4",
   "pid": "t1_dhcic6s",
   "date": "2017-05-09 15:29:59",
   "depth": 4,
   "text": "I hope a full adaptation"
  },
  {
   "score": 46,
   "id": "dhc8ub1",
   "pid": "t1_dhc72fq",
   "date": "2017-05-09 11:39:46",
   "depth": 2,
   "text": "They are actually scenes taken from the episodes (aside from today). The reason for that you will see it next week. I grouped them in albums\n[Episode 2](http://imgur.com/a/W0czj),\n[Episode 3](http://imgur.com/a/NAxPJ),\n[Episode 4](http://imgur.com/a/9AugL),\n[Episode 5](http://imgur.com/a/pwQ2L) Today there were some during the episode itself too."
  },
  {
   "score": 7,
   "id": "dhcdhim",
   "pid": "t1_dhc8ub1",
   "date": "2017-05-09 13:07:43",
   "depth": 3,
   "text": "Uh, would love to know what they mean now, I dont mind the spoilers."
  },
  {
   "score": 24,
   "id": "dhckszn",
   "pid": "t1_dhcdhim",
   "date": "2017-05-09 15:24:37",
   "depth": 4,
   "text": "[SukaSuka LN spoilers](/s \"It's a phenomenon called Erosion, that all of the fairies experience if they live long enough, where the personality of their original, the Visitor Elq Harkstein, bleeds into their mind, eventually replacing it entirely. Ithea has already experienced this, and her original personality is gone.\")"
  },
  {
   "score": 1,
   "id": "dhghokx",
   "pid": "t1_dhckszn",
   "date": "2017-05-12 00:54:47",
   "depth": 5,
   "text": "[deleted]"
  },
  {
   "score": 1,
   "id": "dhgwo1g",
   "pid": "t1_dhghokx",
   "date": "2017-05-12 08:32:05",
   "depth": 6,
   "text": "i know of no summaries, only places to read the novels. "
  },
  {
   "score": 1,
   "id": "dhcz0a0",
   "pid": "t1_dhckszn",
   "date": "2017-05-09 20:11:57",
   "depth": 5,
   "text": "What do you mean by their original?"
  },
  {
   "score": 6,
   "id": "dhcz5eh",
   "pid": "t1_dhcz0a0",
   "date": "2017-05-09 20:15:16",
   "depth": 6,
   "text": "It's been stated in the anime (I think) that the Leprechauns appear when a child dies. But the Leprechauns in Regul Aire are very different from the Leprechauns that were around in human times. This is because [SukaSuka LN spoilers](/s \"the being that died to create all of the Leprechauns in Regul Aire is the last Visitor (basically a god) called Elq Harkstein. Slaying Harkstein, who was a child, was what the Braves were trying to do when Willem was petrified. A curse was used postmortem that was supposed to grind her soul up extremely finely, but that failed and merely shattered it. Chtholly, for example, inherited a rather large piece of Elq's soul. This is why her physical appearance changes as a result of the Erosion, unlike Ithea.\")"
  },
  {
   "score": 1,
   "id": "dhczenf",
   "pid": "t1_dhcz5eh",
   "date": "2017-05-09 20:21:20",
   "depth": 7,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dhd6msb",
   "pid": "t1_dhczenf",
   "date": "2017-05-10 00:16:27",
   "depth": 8,
   "text": "This comment has been removed.\n\n- This comment has been reported as containing untagged spoilers. Please review for any tags you may have missed and reply to this message to have your post re-approved.\n\n  Self and link posts should be properly spoiler-tagged and should include the name(s) of the show(s) referenced in the title. Self posts may opt to tag spoilers in the self post instead. (Using the same format as comment spoilers below)\n\n  Comments should use `[spoiler source](/s \"spoiler-chan died\")` to protect spoilers. Spoiler source should, at a minimum, contain the relevant source of the spoiler (e.g. One Piece episode 200, or if it's from a different medium, LN/Manga/VN). Spoiler source is only required in the first of any set of spoilers for the same source and is not required in a discussion thread while discussing that thread's series.\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 3,
   "id": "dhczhrc",
   "pid": "t1_dhczenf",
   "date": "2017-05-09 20:23:29",
   "depth": 8,
   "text": "Basically, yes. Regarding the personality of eroded leprechauns, complete erosion is so rare (since the leprechauns usually blow themselves up before it happens) that it's not adequately studied."
  },
  {
   "score": 1,
   "id": "dhczm11",
   "pid": "t1_dhczhrc",
   "date": "2017-05-09 20:26:19",
   "depth": 9,
   "text": "Got it. Thanks a lot"
  },
  {
   "score": 2,
   "id": "dhckvd2",
   "pid": "t1_dhckszn",
   "date": "2017-05-09 15:25:50",
   "depth": 5,
   "text": "Thanks, that sounds quite interesting."
  },
  {
   "score": 9,
   "id": "dhcosjy",
   "pid": "t1_dhckszn",
   "date": "2017-05-09 16:43:42",
   "depth": 5,
   "text": "[SukaSuka](/s \"So Ctholly is beginning to have these symptoms, is she gonna \"die\" also is her acting clingy at the end, the result of that effect?\")"
  },
  {
   "score": 8,
   "id": "dhcpqgk",
   "pid": "t1_dhcosjy",
   "date": "2017-05-09 17:03:21",
   "depth": 6,
   "text": "Basically. [SukaSuka](/s \"Shortly after the scene from the beginning of the first episode, where the airship is crashing and Chtholly's hair is completely red is right before her personality vanishes.\")"
  },
  {
   "score": 7,
   "id": "dhcq8rt",
   "pid": "t1_dhcpqgk",
   "date": "2017-05-09 17:13:37",
   "depth": 7,
   "text": "Hold up for a moment. [SukaSuka](/s \"Are you saying the beginning was actually the end? So Ctholly's personality never comes back, does she change name or is she still referred as Ctholly? How long do they have to live in order for the symptoms to happen, since Ithea already experienced this?\") "
  },
  {
   "score": 8,
   "id": "dhcr0cr",
   "pid": "t1_dhcq8rt",
   "date": "2017-05-09 17:28:53",
   "depth": 8,
   "text": "[SukaSuka](/s \"That scene in the beginning isn't the end of the entire series; it's the end of the third volume. As of the fifth volume, Chtholly is in a coma, and entered it after using a huge amount of Venom to save Nephren and Willem from the Teimerre. When Erosion sets in (it's a gradual process) varies depending on the person, and is accelerated in Chtholly's case by her overuse of Venom. My personal speculation is that having the \"omen\" dream that lets the fairies use the Kaliyons represents the start of the Erosion.\")"
  },
  {
   "score": 1,
   "id": "dhdj5wn",
   "pid": "t1_dhcr0cr",
   "date": "2017-05-10 07:34:21",
   "depth": 9,
   "text": "So if the beginning scene is at the end of volume 3 will they adapt all 5 volumes or end it a volume 3 ?"
  },
  {
   "score": 1,
   "id": "dhe6dgv",
   "pid": "t1_dhdj5wn",
   "date": "2017-05-10 14:29:24",
   "depth": 1,
   "text": "Given this pacing there will probably be a complete adaptation "
  },
  {
   "score": 1,
   "id": "dhe7lms",
   "pid": "t1_dhe6dgv",
   "date": "2017-05-10 14:52:29",
   "depth": 2,
   "text": "Oh cool because it looks like they want to put that scene as the last episode and when you said it was in volume 3 I thought they wont finish it and end it at volume 3 BTW can you tell me what part we are currently at and how much episode will be needed for each volume."
  },
  {
   "score": 1,
   "id": "dhe7vks",
   "pid": "t1_dhe7lms",
   "date": "2017-05-10 14:57:56",
   "depth": 3,
   "text": "Iirc this episode was covering material at the end of volume 2. The end will probably be rushed though "
  },
  {
   "score": 4,
   "id": "dhcx961",
   "pid": "t1_dhcr0cr",
   "date": "2017-05-09 19:35:45",
   "depth": 9,
   "text": "[SukaSuka LN4-5](/s \"Actually she's not in a comma. She's dead as far as we know from the LN. There's something along the lines of the first time they hold a funeral for a fairy becouse they're meant to vanish into air when they die, but since she turned into a (human?, no one knows for truth) her body doesnt dissapear\")"
  },
  {
   "score": 1,
   "id": "dhd69bc",
   "pid": "t1_dhcx961",
   "date": "2017-05-10 00:00:20",
   "depth": 1,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dhdo7pw",
   "pid": "t1_dhd69bc",
   "date": "2017-05-10 09:07:59",
   "depth": 2,
   "text": "This comment has been removed. Please review for any tags you may have missed and reply to this message to have your post re-approved.\n\nUntagged or improperly tagged spoilers are not allowed.\n\nRepeated violations of this rule will result in a ban.\n\n\n\n---\n^(Have a question or think this removal was an error?) [^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)\n^(Don't know the rules? Read them )[^(here)](/r/anime/wiki/rules)^."
  },
  {
   "score": 2,
   "id": "dhd8ze2",
   "pid": "t1_dhd69bc",
   "date": "2017-05-10 02:12:22",
   "depth": 2,
   "text": "[LN](/s \"Ithea read the original Ithea's diary and tries to replicate her as best as she can\")"
  },
  {
   "score": 1,
   "id": "dhdgsob",
   "pid": "t1_dhd8ze2",
   "date": "2017-05-10 06:44:55",
   "depth": 3,
   "text": "[I don't know what I expected,](/s but that's just harsh and broken. But if Ithea is younger than Chtholly, and Erosion is based on how much Venenum output they have, then why did she lose her memories first? Or did reading the original's diary trigger it to happen?)"
  },
  {
   "score": 2,
   "id": "dhcxrwj",
   "pid": "t1_dhcx961",
   "date": "2017-05-09 19:46:07",
   "depth": 1,
   "text": "[SukaSuka LN](/s \"Yes, Kutori is dead, but Elq's soul is still relatively intact, and is also in Regul Aire. The only way that could be the case is if Elq entered Kutori's body following the death of the Shiantor.\")"
  },
  {
   "score": 2,
   "id": "dhd0sa3",
   "pid": "t1_dhcxrwj",
   "date": "2017-05-09 20:55:55",
   "depth": 2,
   "text": "[SukaSuka](/s \"Well damn and I liked Ctholly, is she the only confirmed kill? Who else also dies?\")"
  },
  {
   "score": 2,
   "id": "dhd12ib",
   "pid": "t1_dhd0sa3",
   "date": "2017-05-09 21:03:26",
   "depth": 3,
   "text": "[SukaSuka](/s \"Nephren can't return to Regul Aire, because she has part of the Shiantor's essence in her and would be treated like one of the Beasts, though I doubt that the other fairies would be able to harm her, since the Shiantor's ability is to turn anything that comes into contact with it to sand. Willem's status is unknown- everyone thinks he's dead, and he partially transformed into the Shiantor, but the person who ran his orphanage showed up and performed a ritual that probably restored his sanity.\")"
  },
  {
   "score": 2,
   "id": "dhd7xix",
   "pid": "t1_dhd12ib",
   "date": "2017-05-10 01:18:09",
   "depth": 4,
   "text": "why did people say ctholly was awaken at the end of ln 5?  Is there any chance that the real Ctholly will be back? I Don't want her to be dead :("
  },
  {
   "score": 2,
   "id": "dhd8wcf",
   "pid": "t1_dhd7xix",
   "date": "2017-05-10 02:07:58",
   "depth": 5,
   "text": "Because [SukaSuka](/s \"Elq Harkstein has taken control of her body. Chtholly, as a person, is effectively dead. Even before that Chtholly had lost all her memories due to the Erosion.\")"
  },
  {
   "score": 2,
   "id": "dhdgub4",
   "pid": "t1_dhd8wcf",
   "date": "2017-05-10 06:45:52",
   "depth": 6,
   "text": "So uh... how did Willem take that? Or did something happen to Willem as well. I mean, part of me is glad that it's rather dark, but part of me just wants to shut off all emotional attachments to any of the characters because I can't stand reading what happens to them ;-;"
  },
  {
   "score": 2,
   "id": "dhe6bmq",
   "pid": "t1_dhdgub4",
   "date": "2017-05-10 14:28:24",
   "depth": 7,
   "text": "Willem doesn't know."
  },
  {
   "score": 2,
   "id": "dhd6f1x",
   "pid": "t1_dhd12ib",
   "date": "2017-05-10 00:07:16",
   "depth": 4,
   "text": "[This is getting so confusing.](/s Is it basically a story where everyone either goes insane or dies because I dont think my heart can take it.)"
  },
  {
   "score": 2,
   "id": "dhd8y0l",
   "pid": "t1_dhd6f1x",
   "date": "2017-05-10 02:10:23",
   "depth": 5,
   "text": "No. [SukaSuka spoilers](/s \"Because Nephren is a leprechaun and not a human, she's able to resist the whole 'kill everything that moves' impulse that the Beasts have, and is quite sane. She just doesn't return to the warehouse because the other leprechauns wouldn't be so understanding, and would likely try to kill her on sight. At least that's her line of thought. As of the second chapter of volume 5, only Chtholly is dead for sure.\")"
  },
  {
   "score": 2,
   "id": "dhdgnpi",
   "pid": "t1_dhd8y0l",
   "date": "2017-05-10 06:41:51",
   "depth": 6,
   "text": "[SukaSuka](/s I mean I'm glad Ren doesn't go insane. But why, oh god why, did they have to kill Chtholly? That's just... cruel.) Also I don't know if my spoiler tags are working properly so please tell me if they aren't."
  },
  {
   "score": 7,
   "id": "dhcuwex",
   "pid": "t1_dhcr0cr",
   "date": "2017-05-09 18:48:09",
   "depth": 9,
   "text": "[SukaSuka](/s \"they deal with the coma in volume 3, by volume 5 ctholly is nolonger in a coma\")\n\n[super duper spoilers](/s \"to quote the ligh novel: In the room behind them was the thing which used to be Kutori. Whether she had been crushed, hacked, pierced, scratched, or perhaps all of them, no would would ever know, but innumerable wounds had mutilated her body to the point where it hardly resembled its original shape. In addition, ruptured joints and tendons, probably the result of her forcing her body to act past its limits, had damaged the body even more than the external wounds.\")\n\nps i always have so much trouble using spoiler comments"
  },
  {
   "score": 3,
   "id": "dhcviv1",
   "pid": "t1_dhcuwex",
   "date": "2017-05-09 19:00:56",
   "depth": 1,
   "text": "However, in the fifth volume [SukaSuka](/s \"Nephren is travelling with one of Elq's companions, who mentions that Elq, who has since taken over Kutori's body, is alive and in Regul Aire.\")"
  },
  {
   "score": 3,
   "id": "dhd5ltj",
   "pid": "t1_dhcuwex",
   "date": "2017-05-09 23:33:43",
   "depth": 1,
   "text": "Oh what the fuck? I don't know whether I should start reading or not. I literally have to prepare myself emotionally each episode just so I don't go brawling on the floor. The fact that this episode was quite lackluster was... disappointing. But fucking hell that's... wait, isn't Chtolly the oldest out of them? So why has Ithea experienced it already?"
  },
  {
   "score": 5,
   "id": "dhd6gyd",
   "pid": "t1_dhd5ltj",
   "date": "2017-05-10 00:09:34",
   "depth": 2,
   "text": "read it, \n\nthis episode was heavily effected by omissions. for instance, William kept feeling malicious vibes coming from the city, limeskin tried to get William to help but he refused so he ordered ctholly to help, knowing that Williams hand would be forced. the super slick way William delt with the bad guys was gimped.  in sum it suffered from being crammed in to short a time span. \n\nthe story has way more surprises beyond the above, also they are fairies, fairies are weird."
  },
  {
   "score": 2,
   "id": "dhdufpk",
   "pid": "t1_dhd6gyd",
   "date": "2017-05-10 10:56:52",
   "depth": 3,
   "text": "Where can I get the LN? Be it legally or illegally? From the info I've gathered until now most places don't ship it to the country I live in and the fan translations have only finished the 1st volume."
  },
  {
   "score": 3,
   "id": "dheopaw",
   "pid": "t1_dhdufpk",
   "date": "2017-05-10 21:10:50",
   "depth": 4,
   "text": "pming link"
  },
  {
   "score": 1,
   "id": "dhgikuv",
   "pid": "t1_dheopaw",
   "date": "2017-05-12 01:37:50",
   "depth": 5,
   "text": "If I'm not too late, could you send me the link too?"
  },
  {
   "score": 1,
   "id": "dhevmp7",
   "pid": "t1_dheopaw",
   "date": "2017-05-11 01:27:08",
   "depth": 5,
   "text": "Yo send me a link too please!"
  },
  {
   "score": 1,
   "id": "dhergar",
   "pid": "t1_dheopaw",
   "date": "2017-05-10 22:32:46",
   "depth": 5,
   "text": "can you send me as well"
  },
  {
   "score": 3,
   "id": "dherqag",
   "pid": "t1_dhergar",
   "date": "2017-05-10 22:42:29",
   "depth": 6,
   "text": "Done"
  },
  {
   "score": 1,
   "id": "dhezb1s",
   "pid": "t1_dherqag",
   "date": "2017-05-11 04:22:23",
   "depth": 7,
   "text": "Would you be right to send me a link too? Cheers mate."
  },
  {
   "score": 4,
   "id": "dhd18tf",
   "pid": "t1_dhcuwex",
   "date": "2017-05-09 21:08:05",
   "depth": 1,
   "text": "Dude, what the FUCK. Maybe I won't read it after all :("
  },
  {
   "score": 2,
   "id": "dhd3qk8",
   "pid": "t1_dhd18tf",
   "date": "2017-05-09 22:24:39",
   "depth": 2,
   "text": "do it, its good"
  },
  {
   "score": 229,
   "id": "dhc2sw4",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:50:16",
   "depth": 0,
   "text": "Let's just face it... all the girls in this show are best girls.\n\nIt's like K-on but they are suicidal weapons instead of jolly highschool band."
  },
  {
   "score": 76,
   "id": "dhc6deq",
   "pid": "t1_dhc2sw4",
   "date": "2017-05-09 10:54:34",
   "depth": 1,
   "text": ">It's like K-on but they are suicidal weapons instead of jolly highschool band.\n\nNever have I ever seen a comparison of suicidal weapons with a jolly high school band with regards to girls..."
  },
  {
   "score": 23,
   "id": "dhc6q2j",
   "pid": "t1_dhc6deq",
   "date": "2017-05-09 11:00:55",
   "depth": 2,
   "text": "First time for everything, I guess\n\n[](#teehee)"
  },
  {
   "score": 4,
   "id": "dhcl5m1",
   "pid": "t1_dhc6q2j",
   "date": "2017-05-09 15:31:10",
   "depth": 3,
   "text": "like they say, Japan studios can do anything and make it work... except making official, easy-access western airing maybe."
  },
  {
   "score": 54,
   "id": "dhc9azx",
   "pid": "t1_dhc2sw4",
   "date": "2017-05-09 11:48:18",
   "depth": 1,
   "text": "Imagine if every time you couldn't satisfy enough audience or get enough money from your concerts, one of your band member will die."
  },
  {
   "score": 1,
   "id": "dhda8lt",
   "pid": "t1_dhc9azx",
   "date": "2017-05-10 03:17:01",
   "depth": 2,
   "text": "I don't know why, but it sounds so...Danganronpa-ish."
  },
  {
   "score": 9,
   "id": "dhcs2lh",
   "pid": "t1_dhc9azx",
   "date": "2017-05-09 17:50:17",
   "depth": 2,
   "text": "This should be a plot to an anime. I'd actually probably watch it."
  },
  {
   "score": 1,
   "id": "dhhruck",
   "pid": "t1_dhcs2lh",
   "date": "2017-05-12 19:30:15",
   "depth": 3,
   "text": "Does Macross count?"
  },
  {
   "score": 9,
   "id": "dhcxeyb",
   "pid": "t1_dhcs2lh",
   "date": "2017-05-09 19:39:00",
   "depth": 3,
   "text": "Dont worry. You're doing so."
  },
  {
   "score": 17,
   "id": "dhccrge",
   "pid": "t1_dhc9azx",
   "date": "2017-05-09 12:54:36",
   "depth": 2,
   "text": "[Somebody, somewhere](#shitposting)"
  },
  {
   "score": 38,
   "id": "dhc9wn0",
   "pid": "t1_dhc9azx",
   "date": "2017-05-09 11:59:17",
   "depth": 2,
   "text": "[**Please stop**](#scaredmio\n)"
  },
  {
   "score": 85,
   "id": "dhc324i",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:54:52",
   "depth": 0,
   "text": "[I like this shot. I like how they're both eye-level to each other but standing at a different height. That was cool.](http://i.imgur.com/73mHEAR.jpg)\n\nI also tried writing down different times where a good song was playing in the background... it ended up being the entire episode. 7:30, 9:15, 11:00, 16:00, 21:45 were all just excellent, it's really nailing these slow wistful pieces.\n\nOther than that, though, not feeling this episode, which I really hate to admit... it felt like it went on pretty long without saying much. They already did the whole world-building with exploring the town and seeing the different places and the movies they're associated with, this was just a repeat of it. It'd be fine as a simple \"calm before the storm\" episode which it seems to be, but it's already kinda done that.\n\nI dunno, hopefully I'll just look back at this episode as the one standout mediocre point and it'll quickly bounce back."
  },
  {
   "score": 1,
   "id": "dhc5sbe",
   "pid": "t1_dhc324i",
   "date": "2017-05-09 10:44:06",
   "depth": 1,
   "text": ">I also tried writing down different times where a good song was playing in the background... it ended up being the entire episode. 7:30, 9:15, 11:00, 16:00, 21:45 were all just excellent, it's really nailing these slow wistful pieces.\n\nThanks for the reminder that I need to focus on the OST more often. It's too easy to ignore the OST when you're reading and looking at the visuals. "
  },
  {
   "score": 3,
   "id": "dhc8q5v",
   "pid": "t1_dhc324i",
   "date": "2017-05-09 11:37:41",
   "depth": 1,
   "text": "Any idea what the song was when he was saying that she brought him a little happiness?"
  },
  {
   "score": 1,
   "id": "dhc8wwm",
   "pid": "t1_dhc8q5v",
   "date": "2017-05-09 11:41:09",
   "depth": 2,
   "text": "I wouldn't know, the OST hasn't been released yet."
  },
  {
   "score": 1,
   "id": "dhd5po0",
   "pid": "t1_dhc8wwm",
   "date": "2017-05-09 23:37:57",
   "depth": 3,
   "text": "Sounds like... is it Always in my heart? but extremely slowed down version. Maybe a piano version of it."
  },
  {
   "score": 28,
   "id": "dhc8ccl",
   "pid": "t1_dhc324i",
   "date": "2017-05-09 11:30:43",
   "depth": 1,
   "text": "I feel like we did have some important information, in addition to the \"calm before the storm\" feeling.\n\nChtholly's visions, for one thing. The local politics, though I'm not sure it will play a role. The military's take on their fights is important, however, because we see that the girls don't act differently when they're with Lizardbro than when they go back home. And of course, Willem's will to fight and Chtholly's wish that he would stop and let her handle it."
  },
  {
   "score": 152,
   "id": "dhc1jos",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:27:13",
   "depth": 0,
   "text": "This week Willem goes face to face with Don Fluffles. "
  },
  {
   "score": 8,
   "id": "dhc86ey",
   "pid": "t1_dhc1jos",
   "date": "2017-05-09 11:27:43",
   "depth": 1,
   "text": "And next week he's having a face to face with Hohenheim ?"
  },
  {
   "score": 40,
   "id": "dhc8he8",
   "pid": "t1_dhc1jos",
   "date": "2017-05-09 11:33:14",
   "depth": 1,
   "text": "Where is Tiffany when you need him."
  },
  {
   "score": 16,
   "id": "dhciqsd",
   "pid": "t1_dhc8he8",
   "date": "2017-05-09 14:47:09",
   "depth": 2,
   "text": "\"Hey T-Dog, what is up in this his-ouse?\""
  },
  {
   "score": 9,
   "id": "dhd35pi",
   "pid": "t1_dhciqsd",
   "date": "2017-05-09 22:05:28",
   "depth": 3,
   "text": "God, Asuna attempting to interact with Tiffany is hilarious."
  },
  {
   "score": 190,
   "id": "dhc5ww5",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:46:20",
   "depth": 0,
   "text": "[Was this the best part of the episode? Yes.](http://i.imgur.com/hMIRE5N.gifv)"
  },
  {
   "score": 8,
   "id": "dhcdv1s",
   "pid": "t1_dhc5ww5",
   "date": "2017-05-09 13:14:35",
   "depth": 1,
   "text": "Pac-Man is the best character."
  },
  {
   "score": 14,
   "id": "dhchhru",
   "pid": "t1_dhc5ww5",
   "date": "2017-05-09 14:22:00",
   "depth": 1,
   "text": "Thanks for that. My first reaction was to [screencap it](http://i.imgur.com/BH3heDD.jpg) as well, adding some useful context to the filename \"what the fuck is going on here pacman thumbs up\".\n\nThat said, I'm not sure if it's my *absolute* favorite moment from this episode, [\"dogpout.jpg\"](http://i.imgur.com/xktT05A.jpg) is a close contender."
  },
  {
   "score": -1,
   "id": "dhd5nnx",
   "pid": "t1_dhchhru",
   "date": "2017-05-09 23:35:46",
   "depth": 2,
   "text": "I found the bitch extremely annoying. I don't even know why they had the entire things with her. Were they trying to give us a breather before people start dying?"
  },
  {
   "score": 37,
   "id": "dhc7w4n",
   "pid": "t1_dhc5ww5",
   "date": "2017-05-09 11:22:24",
   "depth": 1,
   "text": "If only comment faces weren't doomed."
  },
  {
   "score": 4,
   "id": "dhjorzw",
   "pid": "t1_dhc7w4n",
   "date": "2017-05-14 08:54:18",
   "depth": 2,
   "text": "https://www.reddit.com/r/modnews/comments/6auyq9/reddit_is_procss/\n\n:D\n\nThey decided not to do it after all! "
  },
  {
   "score": 21,
   "id": "dhca9bd",
   "pid": "t1_dhc7w4n",
   "date": "2017-05-09 12:05:57",
   "depth": 2,
   "text": "This would confuse so many people who haven't seen this show. Actually, scratch that, it still confuses me. What the fuck is that thing?"
  },
  {
   "score": 33,
   "id": "dhcbur9",
   "pid": "t1_dhca9bd",
   "date": "2017-05-09 12:38:17",
   "depth": 3,
   "text": "pacman"
  },
  {
   "score": 136,
   "id": "dhca90i",
   "pid": "t1_dhc5ww5",
   "date": "2017-05-09 12:05:48",
   "depth": 1,
   "text": "I was wondering why nobody was addressing the fact that Pac-Man randomly showed up."
  },
  {
   "score": 3,
   "id": "dhdrff9",
   "pid": "t1_dhca90i",
   "date": "2017-05-10 10:04:18",
   "depth": 2,
   "text": "I'm guessing he's a type of golem or something."
  },
  {
   "score": 4,
   "id": "dhdyezd",
   "pid": "t1_dhca90i",
   "date": "2017-05-10 12:07:03",
   "depth": 2,
   "text": "Or why rams are selling ram meat."
  },
  {
   "score": 14,
   "id": "dhceffe",
   "pid": "t1_dhca90i",
   "date": "2017-05-09 13:24:48",
   "depth": 2,
   "text": "Who better to cook than one who lives to eat?"
  },
  {
   "score": 34,
   "id": "dhcb6sx",
   "pid": "t1_dhca90i",
   "date": "2017-05-09 12:22:47",
   "depth": 2,
   "text": "He was there on episode 1, in the middle of the montage, he's the one behind it all!"
  },
  {
   "score": 184,
   "id": "dhc3r7v",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:07:41",
   "depth": 0,
   "text": "I'm not a furry, but my dick is confused..."
  },
  {
   "score": 28,
   "id": "dhc43m3",
   "pid": "t1_dhc3r7v",
   "date": "2017-05-09 10:13:56",
   "depth": 1,
   "text": "Accept you for what you are bro. "
  },
  {
   "score": 17,
   "id": "dhc4vyz",
   "pid": "t1_dhc3r7v",
   "date": "2017-05-09 10:28:04",
   "depth": 1,
   "text": "*EMBRACE YOUR INNER DEGENERACY*"
  },
  {
   "score": 128,
   "id": "dhc5ohr",
   "pid": "t1_dhc3r7v",
   "date": "2017-05-09 10:42:12",
   "depth": 1,
   "text": "biggest boobs I've ever seen on a dog."
  },
  {
   "score": 1,
   "id": "dhcdtmn",
   "pid": "t1_dhc5ohr",
   "date": "2017-05-09 13:13:51",
   "depth": 2,
   "text": "Clearly (and probably thankfully) you've never been on a furry art site."
  },
  {
   "score": 6,
   "id": "dhca422",
   "pid": "t1_dhc5ohr",
   "date": "2017-05-09 12:03:10",
   "depth": 2,
   "text": "You must have not seen One Piece."
  },
  {
   "score": 21,
   "id": "dhcejnr",
   "pid": "t1_dhc5ohr",
   "date": "2017-05-09 13:26:53",
   "depth": 2,
   "text": "I don't believe before this moment I've ever wondered what boobs would feel like with a layer of fur on them\n\n^\\(Though ^it ^would ^definitely ^ruin ^how ^they ^feel ^on ^the ^tongue, ^ew)"
  },
  {
   "score": 5,
   "id": "dhclotd",
   "pid": "t1_dhcejnr",
   "date": "2017-05-09 15:41:18",
   "depth": 3,
   "text": "animal tits have... less fur. I mean you can look at real fur animals like your dog or cat."
  },
  {
   "score": 5,
   "id": "dhdg0dn",
   "pid": "t1_dhclotd",
   "date": "2017-05-10 06:27:14",
   "depth": 4,
   "text": "Just googled \"dog boobs.\" I encourage others to do the same. Go to google images."
  },
  {
   "score": 9,
   "id": "dhcufhu",
   "pid": "t1_dhclotd",
   "date": "2017-05-09 18:38:31",
   "depth": 4,
   "text": "Come on man, no one here is that desperate. ^^^I ^^^hope"
  },
  {
   "score": 3,
   "id": "dhdae0l",
   "pid": "t1_dhcufhu",
   "date": "2017-05-10 03:24:19",
   "depth": 5,
   "text": "[Relevant](http://imgur.com/OBnCWnP/)"
  },
  {
   "score": 7,
   "id": "dhd0lbc",
   "pid": "t1_dhcejnr",
   "date": "2017-05-09 20:50:50",
   "depth": 3,
   "text": "just go to your local convention and reach under the nearest male otaku's shirt"
  },
  {
   "score": 74,
   "id": "dhcenst",
   "pid": "t1_dhcejnr",
   "date": "2017-05-09 13:28:57",
   "depth": 3,
   "text": "oh look mister not-weeb here who knows what boobs feel like."
  },
  {
   "score": 6,
   "id": "dhcuuj8",
   "pid": "t1_dhcenst",
   "date": "2017-05-09 18:47:04",
   "depth": 4,
   "text": "Read this with a 1930s gangster accent and laughed for a solid 15 seconds. "
  },
  {
   "score": 24,
   "id": "dhclg87",
   "pid": "t1_dhcenst",
   "date": "2017-05-09 15:36:43",
   "depth": 4,
   "text": "It could be his own man boobies\n\nYou never know"
  },
  {
   "score": 71,
   "id": "dhc6e5b",
   "pid": "t1_dhc5ohr",
   "date": "2017-05-09 10:54:55",
   "depth": 2,
   "text": "Well, guess asking her to \"show me those puppies\" won't sound so degenerate as it always does."
  },
  {
   "score": 24,
   "id": "dhc9vmc",
   "pid": "t1_dhc6e5b",
   "date": "2017-05-09 11:58:46",
   "depth": 3,
   "text": "She did say touching her stomach was the most insulting place, so perhaps everywhere else is fine."
  },
  {
   "score": 4,
   "id": "dhd3bl9",
   "pid": "t1_dhc9vmc",
   "date": "2017-05-09 22:10:48",
   "depth": 4,
   "text": "Canines have eight or ten, so he probably got a handful of boobs."
  },
  {
   "score": 8,
   "id": "dhclltp",
   "pid": "t1_dhc9vmc",
   "date": "2017-05-09 15:39:43",
   "depth": 4,
   "text": "I wonder if irl furries who suits up find bellyrubbing offensive."
  },
  {
   "score": 7,
   "id": "dhdfw08",
   "pid": "t1_dhclltp",
   "date": "2017-05-10 06:24:28",
   "depth": 5,
   "text": "To be fair, I'm pretty sure you'll still manage to offend someone who's not a furry by bellyrubbing them"
  },
  {
   "score": 1,
   "id": "dhhuoel",
   "pid": "t1_dhdfw08",
   "date": "2017-05-12 20:46:48",
   "depth": 6,
   "text": "Fair enough"
  },
  {
   "score": 1,
   "id": "dhels4f",
   "pid": "t1_dhdfw08",
   "date": "2017-05-10 19:56:54",
   "depth": 6,
   "text": "What if they are obese?"
  },
  {
   "score": 94,
   "id": "dhc21h9",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:36:19",
   "depth": 0,
   "text": "[That confession](http://i.imgur.com/qJzfMVc.png), can't say I saw it coming like that...makes that ending scene feel more powerful even though it felt a bit random.\n\nGonna miss wolf girl, she was pretty fun!"
  },
  {
   "score": 1,
   "id": "dhdrkv3",
   "pid": "t1_dhc21h9",
   "date": "2017-05-10 10:06:58",
   "depth": 1,
   "text": "I still can't figure out if that was an out loud confession or just in her mind.  She's not the type to actually say something like that without turning beet-red and passing out, plus her mouth wasn't moving.  I think his shocked face was more about seeing her as a beautiful woman for the first time."
  },
  {
   "score": 1,
   "id": "dhdrmxd",
   "pid": "t1_dhdrkv3",
   "date": "2017-05-10 10:07:57",
   "depth": 2,
   "text": ">  I think his shocked face was more about seeing her as a beautiful woman for the first time.\n\nHmmm I was on the fence too but it was his reaction that made me think she actually said it."
  },
  {
   "score": 6,
   "id": "dhd3637",
   "pid": "t1_dhc21h9",
   "date": "2017-05-09 22:05:48",
   "depth": 1,
   "text": "Are they going to kill off our MC?  Because he's basically a walking deathflag atm."
  },
  {
   "score": 16,
   "id": "dhdadp2",
   "pid": "t1_dhd3637",
   "date": "2017-05-10 03:23:55",
   "depth": 2,
   "text": "All the girls are walking deathflags."
  },
  {
   "score": 15,
   "id": "dhdrnhu",
   "pid": "t1_dhdadp2",
   "date": "2017-05-10 10:08:14",
   "depth": 3,
   "text": "The biggest one was \"Well, you're a Fairy Soldier now, I'm sure you'll be able to come back here again.\""
  },
  {
   "score": 9,
   "id": "dhhs3w7",
   "pid": "t1_dhdrnhu",
   "date": "2017-05-12 19:36:51",
   "depth": 4,
   "text": "oh fuck everything"
  },
  {
   "score": 66,
   "id": "dhc4l7e",
   "pid": "t1_dhc21h9",
   "date": "2017-05-09 10:22:43",
   "depth": 1,
   "text": "The only random thing about this episode was Ctholly's reaction to him leaving at the end. It was a bit much out of nowhere."
  },
  {
   "score": 1,
   "id": "dhd2xvz",
   "pid": "t1_dhc4l7e",
   "date": "2017-05-09 21:58:33",
   "depth": 2,
   "text": "Not really out of nowhere; she has been relying on the promise of coming home alive (for his.. pancakes, was it?) to combat feelings of guilt about not suiciding into the enemy like every fairy before her. Makes sense that she would feels kinda overwhelmed if he in turn did not fulfill his end of the promise."
  },
  {
   "score": 4,
   "id": "dhcj5so",
   "pid": "t1_dhc4l7e",
   "date": "2017-05-09 14:54:48",
   "depth": 2,
   "text": "Remember she could tell that he wanted to fight earlier. Got a feeling that he made a certain face (off camera) or expression when that name was said and Ctholly noticed. Well that was the vibe I was getting from that scene. "
  },
  {
   "score": 106,
   "id": "dhc5yqc",
   "pid": "t1_dhc4l7e",
   "date": "2017-05-09 10:47:13",
   "depth": 2,
   "text": "> The only random thing about this episode was Ctholly's reaction to him leaving at the end.\n\nShe acted exactly like an emotionally unstable teenager who just went further than ever before in regards of romance would act. Nothing too out of nowhere. "
  },
  {
   "score": 57,
   "id": "dhc8pdp",
   "pid": "t1_dhc5yqc",
   "date": "2017-05-09 11:37:17",
   "depth": 3,
   "text": "It depends on how you look at that scene... and I am still confused as well. Based on the convo between Willeim and bunny guy, it didn't seem like it was that serious.... ok, obviously the guy sounds super important, but it sounded like he just wants to talk with Willheim, but not to a point that you think Willeim might no longer return to the kids afterward. But Ctholy's reaction felt as if Willeim might disappear and never come back.... so now I am very confused, and not sure if Ctholly was overreacting a bit or it was a reasonable reaction because this guy is like a huge shot that can determine the fate of where Willeim will go in the future (and somehow Ctholly also knows this guy is such a big shot?). Like what's the deal here?"
  },
  {
   "score": 1,
   "id": "dhdi50z",
   "pid": "t1_dhc8pdp",
   "date": "2017-05-10 07:13:32",
   "depth": 4,
   "text": "She really wanted her butter cake.\n\nserved on his chest.\n"
  },
  {
   "score": 5,
   "id": "dhcfe9i",
   "pid": "t1_dhc8pdp",
   "date": "2017-05-09 13:42:19",
   "depth": 4,
   "text": "Nothing she did beforehand led up to that reaction which makes it odd. If Wil had told her he'd stay with her forever or something it might have made sense but it was really strange.          \n\nAlot about this episode was strange."
  },
  {
   "score": 11,
   "id": "dhcbzgu",
   "pid": "t1_dhc8pdp",
   "date": "2017-05-09 12:40:29",
   "depth": 4,
   "text": "To me it seems like the anime adaption here left out some information that might have more clearly conveyed Cthollys reaction in the manga.\n\nBut that's just an assumption."
  },
  {
   "score": 8,
   "id": "dhcq8wv",
   "pid": "t1_dhc8pdp",
   "date": "2017-05-09 17:13:43",
   "depth": 4,
   "text": "How did it not seem like it was serious? Willeim literally said that he can't return home with them after hearing that name. When has he ever put something above the kids? "
  },
  {
   "score": 8,
   "id": "dhcvmm9",
   "pid": "t1_dhcq8wv",
   "date": "2017-05-09 19:03:06",
   "depth": 5,
   "text": "Well just hearing a name doesn't mean he's going to be fighting or he's going to be in danger.\n\nI got the impression he was about to hear about someone from his past and Bunny-kun was an exposition-officer.\n\nBut I didn't jump to the conclusion \"oh, Willem's off to fight and die in the war now\"."
  },
  {
   "score": 21,
   "id": "dhcbmbl",
   "pid": "t1_dhc8pdp",
   "date": "2017-05-09 12:34:14",
   "depth": 4,
   "text": "Yeah it's almost like Ctholly knew who that particular person was (which I don't think she does) and acted like Willheim was going to be taken away to somewhere or something for a long period of time. I felt like I missed something on that scene and felt confused."
  },
  {
   "score": 70,
   "id": "dhc2epw",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:43:02",
   "depth": 0,
   "text": "Liked a lot how they adapted this part. *her* voice sounds scaary. Can't believe it's a 7yo seiyuu.\nHow things got resolved with the Order of Annihilation was more interesting and fun. Not to mention the changes to Willem's dialogue at the end. He came across like a douche in the novel. While here it was a proper \"see you later\" I almost teared up at [this scene](http://i.imgur.com/ddwLJry.png) :') Let's not forget the punch's noise on the bunny's face at the end."
  },
  {
   "score": 2,
   "id": "dhc6rjy",
   "pid": "t1_dhc2epw",
   "date": "2017-05-09 11:01:41",
   "depth": 1,
   "text": "Are there only LNs or is there a manga I can read? I'd prefer reading a manga instead of a LN if it exists tbh."
  },
  {
   "score": 1,
   "id": "dhcmtas",
   "pid": "t1_dhc6rjy",
   "date": "2017-05-09 16:03:21",
   "depth": 2,
   "text": "There is no manga for it translated. http://www.novelupdates.com/series/shuumatsu-nani-shitemasu-ka-isogashii-desu-ka-sukutte-moratte-ii-desu-ka/\n\nIs the light novel link, they are almost finished translating all of it. It will most likely be a full adaptation to anime anyways though. "
  },
  {
   "score": 1,
   "id": "dhdab6u",
   "pid": "t1_dhcmtas",
   "date": "2017-05-10 03:20:35",
   "depth": 3,
   "text": ">It will most likely be a full adaptation to anime anyways though.\n\nReally? How many novels are there, and where are we at now? Will the remaining episodes be enough to reach the end without rushing?"
  },
  {
   "score": 1,
   "id": "dhdnw4p",
   "pid": "t1_dhdab6u",
   "date": "2017-05-10 09:02:09",
   "depth": 4,
   "text": "It's only 5 volumes. Most shows do 4 volumes, so fitting in 5 is doable. I can't imagine they would only adapt 4/5 novels"
  },
  {
   "score": 1,
   "id": "dhee9u7",
   "pid": "t1_dhdnw4p",
   "date": "2017-05-10 17:16:31",
   "depth": 5,
   "text": "Nice to know."
  },
  {
   "score": 4,
   "id": "dhc8228",
   "pid": "t1_dhc6rjy",
   "date": "2017-05-09 11:25:29",
   "depth": 2,
   "text": "[It does exist](https://myanimelist.net/manga/98964/Shuumatsu_Nani_Shitemasu_ka_Isogashii_desu_ka_Sukutte_Moratte_Ii_desu_ka) but I haven't read it, don't think it's even translated. I suggest to only read the LNs"
  },
  {
   "score": 1,
   "id": "dhcjuw9",
   "pid": "t1_dhc8228",
   "date": "2017-05-09 15:07:19",
   "depth": 3,
   "text": "How is the translation quality?"
  },
  {
   "score": 1,
   "id": "dhd5ft0",
   "pid": "t1_dhcjuw9",
   "date": "2017-05-09 23:26:59",
   "depth": 4,
   "text": "I think it's good"
  },
  {
   "score": 4,
   "id": "dhc7lg8",
   "pid": "t1_dhc6rjy",
   "date": "2017-05-09 11:17:02",
   "depth": 2,
   "text": "There is a light novel translation, it's in the middle of the last novel right now. "
  },
  {
   "score": 4,
   "id": "dhc4wvf",
   "pid": "t1_dhc2epw",
   "date": "2017-05-09 10:28:31",
   "depth": 1,
   "text": "I feel like if this adaptation had two cour it could've done so much more things to the detail of the book... I cant help but ask people to read the LNs at this point... While the adaptation is good, the LNs were even better.... The whole scene with Order of annihilation showed  a more friendly/open to dialogue willem and the explanation from chtolly gave in to a way more overpowered look while also revealing how much she was closely paying attention to him..."
  },
  {
   "score": 21,
   "id": "dhc5w9r",
   "pid": "t1_dhc4wvf",
   "date": "2017-05-09 10:46:03",
   "depth": 2,
   "text": "I think people are aware that the source material is almost always better. At least for me, it's part of the reason why I'm enjoying this adaption so much! I'm not expecting a 1:1 adaption, I know they can't animate all, but so far I like what they choose to animate and how (for the most part) this episode especially, for the reasons I wrote above."
  },
  {
   "score": 34,
   "id": "dhce4xm",
   "pid": "t1_dhc2epw",
   "date": "2017-05-09 13:19:35",
   "depth": 1,
   "text": ">Liked a lot how they adapted this part. her voice sounds scaary. Can't believe it's a 7yo seiyuu.\n\nDo you mean the voice during the hallucinations? Because I thought that was incredibly impressive."
  },
  {
   "score": 20,
   "id": "dhcedlm",
   "pid": "t1_dhce4xm",
   "date": "2017-05-09 13:23:52",
   "depth": 2,
   "text": "Yes that, I wasn't expecting it either the second time, and her laughter..waay too creepy (in a good way)."
  },
  {
   "score": 33,
   "id": "dhc6w7q",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 11:04:07",
   "depth": 0,
   "text": "when that dog girl burst in I asked the same question as the characters at the same time....\n\nthe dog girl is odd in the face forward shots... it just seems to be missing something because her long face just kinda collapses....[I love her pout](http://i.imgur.com/uO5BjtK.png), but it also demonstrates what I was talking about a bit too. \n\nI love how unimpressed Ithea and Ren were with the annihilation knights appearance. \n\nWhy do I feel like we just had a 4 kids dubbing scene with that bang bang bit?\n\n[Those shadows!](http://i.imgur.com/n90iqmH.png) I don't like that. I DON'T LIKE THAT! It's not foreshadowing, right? It's just them being lazy with the shadows, right?! I am almost crying right now damn it!\n\nHe believe's he's going to die from whatever he has to do right now... That look away as he said he promised to come back seemed like he was lying to try and make Chtholly feel better...."
  },
  {
   "score": 5,
   "id": "dhep0lf",
   "pid": "t1_dhc6w7q",
   "date": "2017-05-10 21:19:37",
   "depth": 1,
   "text": "I haven't seen such invisible guns since Doraemon and the 4kids version of Yugioh."
  },
  {
   "score": 11,
   "id": "dhc9yfk",
   "pid": "t1_dhc6w7q",
   "date": "2017-05-09 12:00:14",
   "depth": 1,
   "text": "It really seems like their just being lazy with the shadows. "
  },
  {
   "score": 4,
   "id": "dhd5u9e",
   "pid": "t1_dhc9yfk",
   "date": "2017-05-09 23:43:03",
   "depth": 2,
   "text": "Might be foreshadowing. After all, this is a dark show. But yeah, the drawings were rather lazy this show. Ren looked like she was smudged with crayons. "
  },
  {
   "score": 57,
   "id": "dhc3i4x",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:02:57",
   "depth": 0,
   "text": "The pacing of this show is super off. So basically another thing it shares with Black Bullet.\n\nConfession out of nowhere but it still made sense. Ctholy basically tells him to stop getting into fights and putting himself into dangerous situations because she can fight for him now and she loves him. Super cute and I'm happy that it went this way instead of a harem route.\n\nI wish they would slow down a bit and focus more on the inner monologues of characters so it feels less rushed."
  },
  {
   "score": 15,
   "id": "dhd0vyi",
   "pid": "t1_dhc3i4x",
   "date": "2017-05-09 20:58:37",
   "depth": 1,
   "text": "This was my complaint too. The rushed confession, MC being completely against helping Phyr and then 180'd immediately into a conflict - where of course he's an unstoppable machine, talking about how much he has changed since he met the girls but nowhere in the series do we see any change in character, Chtholly acting like Willem has taught her everything she knows... in three days, the confession out of nowhere with no meaningful buildup, the overreaction when he decides to go... meet someone? Like, his emotions and the name drop are supposed to build tension and intrigue, but it really just falls flat since the name doesn't have any meaningful connotation to the viewer. As far as I know, he's going to meet some military officer. And the only other military officers we have met have all been pretty cool dudes so why am I supposed to be worried?\n\nIt all just felt like there were details between each scene that were left out. There just isn't enough of each character to make me care when the big, emotional scenes show up. Instead of relying on character development or letting us into the lives of the character, it seems like they are just going to go the bland \"happy, cheerful events contrasting with \"dark\", negative events\" (and moe) to keep people caring."
  },
  {
   "score": 2,
   "id": "dhdibf3",
   "pid": "t1_dhd0vyi",
   "date": "2017-05-10 07:17:14",
   "depth": 2,
   "text": "Well the situation seems to fit the rushed confession.  Chtholly is a weapon that expected to die at a moments notice whenever the order came down.  For one of the leprecauns to suddenly find a reason to hang onto living isnt hard to accept that shes going to feel strongly very easily.  This is very much a wartime footing where every moment could be your last.  Not to mention shes still a teenager emotionally.  Not like a girl needs a reason to fall in love with a hot guy who treats her nicely and nothing else to go on.\n"
  },
  {
   "score": 10,
   "id": "dhcoofp",
   "pid": "t1_dhc3i4x",
   "date": "2017-05-09 16:41:19",
   "depth": 1,
   "text": "Even the main events are a bit odd. We saw them spar for about 5 minuets once, and suddenly she knows everything about how he fights and is a perfect student? Its all a bit... odd to me."
  },
  {
   "score": 17,
   "id": "dhcymtl",
   "pid": "t1_dhcoofp",
   "date": "2017-05-09 20:03:30",
   "depth": 2,
   "text": "He taught her throughout episode three, which wasn't shown but there was about a month until the battle on Island 15 where they trained"
  },
  {
   "score": 1,
   "id": "dhi4y9p",
   "pid": "t1_dhcymtl",
   "date": "2017-05-13 04:38:25",
   "depth": 3,
   "text": "But the anime says in episode 2 the battle is taking place 5 days from then. So did they change the timeframe in the anime? Edit: This guy was completely wrong, I read the light novel, it states it was only 5 days from when he arrived to when she went to battle. "
  },
  {
   "score": 1,
   "id": "dhezik8",
   "pid": "t1_dhcymtl",
   "date": "2017-05-11 04:30:06",
   "depth": 3,
   "text": "Why does it feel like that there is a ton of stuff the anime glossed over; so much so that I have no idea whats going on with the plot. This guy becomes a babysitter but then there is this girl and he trains her I think and she goes off and there is this interlude in this random city and he gets crazy emotional for some reason and then they end up back in the city and now he can shoot coins?? And how is he in the military and why does he seem so accustomed to it didnt he just wake up from a 500 year freeze? Shouldnt this guy be like WTF FUTURE every 5 min?"
  },
  {
   "score": 26,
   "id": "dhc4zl4",
   "pid": "t1_dhc3i4x",
   "date": "2017-05-09 10:29:54",
   "depth": 1,
   "text": "I'd recommend reading the LNs then. They simply dont have enough time to show everything in 12 episodes, so they're trimming everything down.... which while i disagree with, its better than nothing."
  },
  {
   "score": 26,
   "id": "dhc3bne",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:59:39",
   "depth": 0,
   "text": "Well this was a beautiful episode yet again.\n\nJust to be sure tho, when Chtolly ran past him in the end, did she *tell* him \"I do love you after all\" or did she just think that?"
  },
  {
   "score": 8,
   "id": "dhcf7qu",
   "pid": "t1_dhc3bne",
   "date": "2017-05-09 13:38:57",
   "depth": 1,
   "text": "I had to go back and pay close attention to her mouth movement, but yeah it is there"
  },
  {
   "score": 37,
   "id": "dhc498q",
   "pid": "t1_dhc3bne",
   "date": "2017-05-09 10:16:46",
   "depth": 1,
   "text": "She told him"
  },
  {
   "score": 3,
   "id": "dhjozxp",
   "pid": "t1_dhc498q",
   "date": "2017-05-14 08:59:29",
   "depth": 2,
   "text": "Holy Shit!"
  },
  {
   "score": 27,
   "id": "dhcfvs8",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 13:51:13",
   "depth": 0,
   "text": "[\"We're going to take her hostage!\"](http://i.imgur.com/ohDKCIO.jpg)"
  },
  {
   "score": 42,
   "id": "dhc3rk4",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:07:51",
   "depth": 0,
   "text": "This episode was a mixed bag to me.\n\nI didn't like the cinematography in the encounter between the [Faeries and the weird tentacle monster](http://imgur.com/hYLjrqj.jpg). It was too peppy, too bright. It doesn't go well with the dark grim theme the show has been portraying so far.\n\nThat being said, lets move on to what I did like.\n\nThe good ol' [use the guy as a seat](http://imgur.com/VxJSUio.jpg) used in Minami-ke & GJ-bu \n\n[It's not that I like you Baaaka](http://imgur.com/Vr7s0Dk.jpg), but keep hanging out with me please.\n\n[You can't have your characters announce how they feel](http://imgur.com/EZ7vtGj.jpg), [that makes me feel angry](https://www.youtube.com/watch?v=sFBhR4QcBtE)\n\nShouldn't you be out [chasing ghosts in a maze](http://imgur.com/VBQJSQQ.jpg) or something?\n\nWillheim is being called a [lolicon](http://imgur.com/a/HN2vm)\n\n[](#lolipolice)\n\n\nLets see if we move on back to the grim atmosphere in the next episode.\n"
  },
  {
   "score": 0,
   "id": "dhc4md2",
   "pid": "t1_dhc3rk4",
   "date": "2017-05-09 10:23:19",
   "depth": 1,
   "text": "The show had a grim atmosphere?  \nEp 4 was for the emotional climax, not to have an overarching, ominous mood."
  },
  {
   "score": 5,
   "id": "dhde0ok",
   "pid": "t1_dhc4md2",
   "date": "2017-05-10 05:36:51",
   "depth": 2,
   "text": "if what /u/Bikebag is not enough I'd like to remind you that they essentially turn small fairy girls and genetically modify them to turn into soldiers\n\nmove along, nothing grim to see here"
  },
  {
   "score": 6,
   "id": "dhd5svv",
   "pid": "t1_dhc4md2",
   "date": "2017-05-09 23:41:30",
   "depth": 2,
   "text": "I wished it was a bit more darker."
  },
  {
   "score": 6,
   "id": "dhc4v87",
   "pid": "t1_dhc4md2",
   "date": "2017-05-09 10:27:41",
   "depth": 2,
   "text": "> The show had a grim atmosphere?\n\n[](#smugpoint)"
  },
  {
   "score": 12,
   "id": "dhccooq",
   "pid": "t1_dhc4md2",
   "date": "2017-05-09 12:53:11",
   "depth": 2,
   "text": "Did you forget how they describe themselves as disposable and are willing to employ suicide bombing to stop world destruction? Kinda grim, nah?"
  },
  {
   "score": -1,
   "id": "dhccvie",
   "pid": "t1_dhccooq",
   "date": "2017-05-09 12:56:38",
   "depth": 3,
   "text": "[Is it now?](#naziloli)"
  },
  {
   "score": 21,
   "id": "dhc92j9",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 11:44:00",
   "depth": 0,
   "text": "I really really liked the scene where Ctholly did a tiny psychoanalysis on Willem. It makes their relationship much more meaningful knowing that Ctholly isn't just some hormone filled girl who just wants attention and fall in love because she may die any moment. It's great that they are showing how she actually understands who Willem is and what he is thinking and feeling deep down, that he really wants to fight, hopefully in place of the girls, and he probably hates himself a lot for not being able to fight and feels very guilty for still being alive."
  },
  {
   "score": 59,
   "id": "dhc2j8j",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:45:20",
   "depth": 0,
   "text": "Guess im a furry now....sigh"
  },
  {
   "score": 8,
   "id": "dhce2rm",
   "pid": "t1_dhc2j8j",
   "date": "2017-05-09 13:18:29",
   "depth": 1,
   "text": "You're already an anime fan, so it's just one more level of degeneracy. Or maybe it's the same level."
  },
  {
   "score": 30,
   "id": "dhcezms",
   "pid": "t1_dhce2rm",
   "date": "2017-05-09 13:34:56",
   "depth": 2,
   "text": "[Please consult the chart](https://web.archive.org/web/20161015202101/http://brunching.com/images/geekchart.pdf)"
  },
  {
   "score": 11,
   "id": "dhcmp0v",
   "pid": "t1_dhcezms",
   "date": "2017-05-09 16:00:59",
   "depth": 3,
   "text": "The \"pokemon fan over the age of 6\" fucked me harder then siblings in GoT. Made my day."
  },
  {
   "score": 8,
   "id": "dhcc2lb",
   "pid": "t1_dhc2j8j",
   "date": "2017-05-09 12:42:06",
   "depth": 1,
   "text": ">Implying that wasn't before"
  },
  {
   "score": 11,
   "id": "dhc6dza",
   "pid": "t1_dhc2j8j",
   "date": "2017-05-09 10:54:50",
   "depth": 1,
   "text": "Ain't nothing wrong with that...I think?"
  },
  {
   "score": 14,
   "id": "dhch0oa",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 14:12:41",
   "depth": 0,
   "text": "I wasn't feeling super impressed with the sightseeing last episode because it seemed that every landmark was just some movie set piece and not actually part of the city's history, but I fucking love the grave of a famous con-man from 200 years ago with the engraving \"Here lies an honest man\". It's just so unique and it obviously has its own story behind it that's completely different from what we're watching. That's what makes a city feel truly historied. I hope we see more of Corna di Luce."
  },
  {
   "score": 32,
   "id": "dhc1idx",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:26:33",
   "depth": 0,
   "text": "[Dafuq is that thing???](http://i.imgur.com/lxoppvI.png)\n\n[The voice in these scenes](http://i.imgur.com/ijr6uCG.png) really worked and made it creepy .-.\n\n[I wonder how many people threw themselves down the stairs before they put the signs...](http://i.imgur.com/GpbmeRz.png)\n\n[And that is some strenght Willem have to be able to shoot coins that far and hurt people with them!](http://i.imgur.com/moNf3t2.png)\n\nOh and Phyra's VA sounded so familiar yet [she has only had two other roles before and i didn't watch those shows...](http://anidb.net/perl-bin/animedb.pl?show=creator&creatorid=46819)"
  },
  {
   "score": 2,
   "id": "dhdez8t",
   "pid": "t1_dhc1idx",
   "date": "2017-05-10 06:02:32",
   "depth": 1,
   "text": "I was thinking the very same thing about Phyra's VA. I'm watching the other two shows she's currently in but they're bit characters so I wouldn't have realized. It's cool that her mother is also part of this show as the Troll!"
  },
  {
   "score": 6,
   "id": "dhcowbg",
   "pid": "t1_dhc1idx",
   "date": "2017-05-09 16:45:51",
   "depth": 1,
   "text": "Since nobody commented on that part of your post yet I will.\n\nI swear i have hear Phyra's VA somewhere before, but like you said she has almost no other roles which is very bizarre. I consider myself pretty good at recognizing VA's so i'm truly at a loss here. Either she sounds just like somebody else (who for some reason i can't seem to recognize) or it's just that i heard her somewhere that she isn't credited for on sites like myanimelist and aniDB."
  },
  {
   "score": 1,
   "id": "dhhshtw",
   "pid": "t1_dhcowbg",
   "date": "2017-05-12 19:45:57",
   "depth": 2,
   "text": "A little bit late, but I heard a significant amount of \"HanaKana\" in her voice. I don't exactly have discerning ears though when it comes to seiyuus.\n\n\nEDIT: I think I might be getting actors confused."
  },
  {
   "score": 3,
   "id": "dhd3yv8",
   "pid": "t1_dhcowbg",
   "date": "2017-05-09 22:32:30",
   "depth": 2,
   "text": "Trivia: she's the daughter of \"forever 17\" Inoue Kikuko (voice of Sanae from Clannad)"
  },
  {
   "score": 1,
   "id": "dhdcyz6",
   "pid": "t1_dhd3yv8",
   "date": "2017-05-10 05:05:05",
   "depth": 3,
   "text": "Ye i found that out aswell :), but she doesn't really sound like her mother ( who voices the troll lady in sukasuka aswell :D )"
  },
  {
   "score": 19,
   "id": "dhc7usg",
   "pid": "t1_dhc1idx",
   "date": "2017-05-09 11:21:44",
   "depth": 1,
   "text": "\"Défense de dégringoler\" actually sounds kinda poetic, not something you'd read on a real life warning sign. Very fitting for that town.\n\n> And that is some strenght Willem have to be able to shoot coins that far and hurt people with them!\n\nhttps://i.imgur.com/G12W9DS.png"
  },
  {
   "score": 5,
   "id": "dhcv3jh",
   "pid": "t1_dhc7usg",
   "date": "2017-05-09 18:52:12",
   "depth": 2,
   "text": "I loved how they wrote all those signs in french! Quite fitting when you remember that french is often associated with romance. "
  },
  {
   "score": 45,
   "id": "dhc700s",
   "pid": "t1_dhc1idx",
   "date": "2017-05-09 11:06:07",
   "depth": 1,
   "text": ">Dafuq is that thing???\n\nPacman obviously."
  },
  {
   "score": 8,
   "id": "dhc7mcp",
   "pid": "t1_dhc700s",
   "date": "2017-05-09 11:17:28",
   "depth": 2,
   "text": "That's Chef, to you, ya nonce."
  },
  {
   "score": 10,
   "id": "dhce71f",
   "pid": "t1_dhc7mcp",
   "date": "2017-05-09 13:20:38",
   "depth": 3,
   "text": "> Chef Pac-man, obviously\n\nFixed."
  },
  {
   "score": 1,
   "id": "dhd3ixv",
   "pid": "t1_dhce71f",
   "date": "2017-05-09 22:17:32",
   "depth": 4,
   "text": "Master Chef Pac-Man."
  },
  {
   "score": 27,
   "id": "dhc1xpd",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:34:22",
   "depth": 0,
   "text": "Well, I knew Ctholly was the best girl this season, but she doesn't even [beat around the bush.](http://i.imgur.com/tz9UVgZ.png) Give the other girls a chance!"
  },
  {
   "score": 15,
   "id": "dhc2bc5",
   "pid": "t1_dhc1xpd",
   "date": "2017-05-09 09:41:18",
   "depth": 1,
   "text": "Straight up said it...she surprised me since she's been quick to be embarrassed and that timing was a bit out of nowhere...do wonder how he feels about her and [how much of a lolicon is he really?](http://i.imgur.com/Wib3G8x.png)"
  },
  {
   "score": 4,
   "id": "dhcf0to",
   "pid": "t1_dhc2bc5",
   "date": "2017-05-09 13:35:31",
   "depth": 2,
   "text": "> how much of a lolicon is he really?\n\nhow old is Willem again, 19 maybe ??? I would refer to females older than him more as (young) women instead of just girls"
  },
  {
   "score": 2,
   "id": "dhd31kc",
   "pid": "t1_dhcf0to",
   "date": "2017-05-09 22:01:46",
   "depth": 3,
   "text": "Isn't he like over 500 years old?"
  },
  {
   "score": 0,
   "id": "dhd5whr",
   "pid": "t1_dhd31kc",
   "date": "2017-05-09 23:45:32",
   "depth": 4,
   "text": "Not physically. Mentally, I have no idea."
  },
  {
   "score": 3,
   "id": "dhdg8yr",
   "pid": "t1_dhd31kc",
   "date": "2017-05-10 06:32:39",
   "depth": 4,
   "text": "Great, so his target range is basically anything that moves."
  },
  {
   "score": 3,
   "id": "dhc8qo8",
   "pid": "t1_dhc2bc5",
   "date": "2017-05-09 11:37:56",
   "depth": 2,
   "text": "I wouldn't have a problem with it, but I seriously doubt that he sees her as more than a child to protect. It can very well change later, though.\n\nHe did explain that having a \"family\" makes him *a little bit happy*, so I think he just wants to protect that place and the girls."
  },
  {
   "score": 28,
   "id": "dhca2j5",
   "pid": "t1_dhc2bc5",
   "date": "2017-05-09 12:02:23",
   "depth": 2,
   "text": "Less of a lolicon than the average viewer of the show."
  },
  {
   "score": 25,
   "id": "dhc4oze",
   "pid": "t1_dhc2bc5",
   "date": "2017-05-09 10:24:36",
   "depth": 2,
   "text": "> how much of a lolicon is he really?\n\nConsidering Ithea is mostly just delivering friendly teasing to him with romance genre tropes, most likely not much at all. "
  },
  {
   "score": 4,
   "id": "dhc2ijx",
   "pid": "t1_dhc1xpd",
   "date": "2017-05-09 09:45:00",
   "depth": 1,
   "text": "Nah man that's how you lose at the end of the day; Ctholly knows what she's doing and she ain't letting anyone else lay claim to a unique prize."
  },
  {
   "score": 10,
   "id": "dhcdxez",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 13:15:48",
   "depth": 0,
   "text": "Man, I think that dog girl is the cutest dog girl I've seen since Animal Crossing's Isabelle. Japan makes good animal-people."
  },
  {
   "score": 2,
   "id": "djl6n51",
   "pid": "t1_dhcdxez",
   "date": "2017-06-29 20:08:14",
   "depth": 1,
   "text": "e...ed...waard"
  },
  {
   "score": 8,
   "id": "dhc4mq4",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:23:30",
   "depth": 0,
   "text": "Man Ren is so adorable.... haha she's literally like the perfect daughter for William i think :)\n\nCtholly's confession was a bit out of nowhere but i can still get it. but cause it happened like that i can only imagine sadness awaits us with the red thing happening to her........."
  },
  {
   "score": 2,
   "id": "dhtjzkg",
   "pid": "t1_dhc4mq4",
   "date": "2017-05-20 13:03:09",
   "depth": 1,
   "text": "Indeed, Ren is just the cutest. (Which is a hard earned title in this show)"
  },
  {
   "score": 17,
   "id": "dhc949s",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 11:44:53",
   "depth": 0,
   "text": "Pretty cute episode... Even got a confession... And an unexpected separation... I'm starting to run out of space to place all those flags. [Especially this one. Went pretty well the last time, huh ?](https://imgur.com/a/0A4gS)\n\nBut jokes aside, I like how Willem turns away when making his promise. He doesn't like the feeling of déjà-vu, but doesn't want to hurt Chtholly by staying silent because of superstition either.\n\nI also like that he punched the rabbit guy."
  },
  {
   "score": 2,
   "id": "dhihveu",
   "pid": "t1_dhc949s",
   "date": "2017-05-13 10:46:43",
   "depth": 1,
   "text": "Honestly, I didn't even realize that he averted his eyes when he made that promise until now.\n\nHoly shit."
  },
  {
   "score": 7,
   "id": "dhc3a7e",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:58:55",
   "depth": 0,
   "text": "Sooo uuuh I was just wondering who slapped who at the end. Are slap endings the new hip thing nowadays? \n\nHighly relevant: https://youtu.be/D6Z2RhnqwI0"
  },
  {
   "score": 1,
   "id": "dhttrz2",
   "pid": "t1_dhc3a7e",
   "date": "2017-05-20 17:13:50",
   "depth": 1,
   "text": "damn you for linking that , it got me really angry for no reason"
  },
  {
   "score": 22,
   "id": "dhc4qx6",
   "pid": "t1_dhc3a7e",
   "date": "2017-05-09 10:25:34",
   "depth": 1,
   "text": "> Sooo uuuh I was just wondering who slapped who at the end.\n\nIts pretty clear that Willem slapped the annoying Bunny for his comments. Actually going by the sound that felt more like a punch rather than slap. "
  },
  {
   "score": 10,
   "id": "dhdii78",
   "pid": "t1_dhc4qx6",
   "date": "2017-05-10 07:21:05",
   "depth": 2,
   "text": "I was confused....he asks bunny guy to look after the girls...then the girls are sailing away and bunny guy is still on the dock with Willem.  You had one job bunny....."
  },
  {
   "score": 7,
   "id": "dhcagl9",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 12:09:38",
   "depth": 0,
   "text": "I enjoyed the episode, but I'm confused as to why Ctholly was so dramatic at the end? Like Willem gets asked to talk to a guy and says \"I'm not really feeling like it\", and then the guy mentions a name that's obviously someone important to Willem so he agrees to talk, but then Ctholly freaks out for some reason? Like he's just going to talk to someone. Was something lost in translation, or am I just missing something?"
  },
  {
   "score": 4,
   "id": "dhcccc3",
   "pid": "t1_dhcagl9",
   "date": "2017-05-09 12:47:04",
   "depth": 1,
   "text": "> but then Ctholly freaks out for some reason? Like he's just going to talk to someone.\n\nCtholly  is not exactly the most stable person around and she is still a child/teenager. AND she just took first major step in relationships that she has ever taken. it is perfectly in character for her to be clingy and overtly worried."
  },
  {
   "score": 9,
   "id": "dhcd95u",
   "pid": "t1_dhcccc3",
   "date": "2017-05-09 13:03:30",
   "depth": 2,
   "text": "It's so *abrupt* though. Like if she's clingy and gets worried easy, fine, whatever, but it went from \"pretty chill but kinda confused\" to \"holy shit if you talk to that person you're gonna die\" really goddamn fast."
  },
  {
   "score": 4,
   "id": "dhce76u",
   "pid": "t1_dhcagl9",
   "date": "2017-05-09 13:20:43",
   "depth": 1,
   "text": "[LN spoiler](/s \"she wants to spend more time with him because the encroachment is happening rapidly\")"
  },
  {
   "score": 1,
   "id": "dhco14i",
   "pid": "t1_dhce76u",
   "date": "2017-05-09 16:28:08",
   "depth": 2,
   "text": "I've been on and off with the anime and know nothing on LN [Shuu LN Spoiler](/s \"What is encroachment?\") PM if its going to be long and just PM for LN translate link please"
  },
  {
   "score": 2,
   "id": "dhd0qe2",
   "pid": "t1_dhco14i",
   "date": "2017-05-09 20:54:32",
   "depth": 3,
   "text": "[Sukasuka Ln spoiler](/s \"Encroachment is what happens to fairies when they use up venom.  They lose their memories, then disappear. \n Without spoiling too much more about why it happens, even though she survived the battle, she is basically at the end of her life\")"
  },
  {
   "score": 3,
   "id": "dhdak5j",
   "pid": "t1_dhd0qe2",
   "date": "2017-05-10 03:32:28",
   "depth": 4,
   "text": "Knowing this now makes the scene a whole lot more understandable."
  },
  {
   "score": 8,
   "id": "dhcd36i",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 13:00:27",
   "depth": 0,
   "text": "Willem is just so grown up. He says what he feels, he isn't afraid to show his more devious side, he doesn't completely break down when girls crack jokes at him. He's just such a refreshing character after watching so many animes with 12 year old protagonists."
  },
  {
   "score": 7,
   "id": "dhc4416",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:14:09",
   "depth": 0,
   "text": "As someone who hasn't read the LN's this episode is good, but felt way too fast."
  },
  {
   "score": 1,
   "id": "dhezl3k",
   "pid": "t1_dhc4416",
   "date": "2017-05-11 04:32:39",
   "depth": 1,
   "text": "I literally have no idea why half the stuff that happens in this show is happening."
  },
  {
   "score": 3,
   "id": "dhc2hgl",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:44:26",
   "depth": 0,
   "text": "[A CONFESSION!?](http://i.imgur.com/w57qAwn.png)\n\nAnd of course Willem had to be called in after that. I assume that person must be a human from his past? This can be easily answered by looking at the MAL cast list but I'd rather not spoil myself. \n\nAs for the rest of the episode it was a pretty chill one. Love Willem's trick of using supersonic coins to attack the ambushers. Reminded me of Kaname from YuYU Hakusho. [Also nice to see Polt having so much screentime here compared to Monster Musume :3](http://i.imgur.com/TFPKYlf.png)\n\n\n[Can I just ask why is PacMan selling Shawarmas?](http://i.imgur.com/1sMWvqK.png) "
  },
  {
   "score": 1,
   "id": "dhceacf",
   "pid": "t1_dhc2hgl",
   "date": "2017-05-09 13:22:14",
   "depth": 1,
   "text": "While it's a horizontal spit rather than vertical, that's gyro meat. Very different from shawarma."
  },
  {
   "score": 6,
   "id": "dhc749y",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 11:08:15",
   "depth": 0,
   "text": "ok... they changed quite a few things from the LN here.\n\nI didn't expect them to show the battle scene this episode, I guess it sort of made sense from an adaptation standpoint. But boy, that 'red scene with voices' was exceptionally well done, its an atmosphere that only the anime can pull off. If you got some inexplicable chills from that, that's what they were going for, I would say it was done better than in LN.\n\nThe main conflict of this episode was the annhilation knights. A lot of things was changed from the LN here, and thus the pacing was rather off. But they managed to convey the main point here:\n\nDeep down, Willem still wanted to fight, so he can die and join his friends and families of the past. But thankfully, Ctholly and the other fairies are here, he has a home that he can return to.\n\nAnd then, ofc, cue the ending of this episode. Now the girls have fufilled their promise to live and return, Willem was stopped from returning home with them. It would be obvious but still [ ](/s \"brace yourself for the feel trains\")\n\n...and yes, for those who somehow recognizes my username, I am still working on that [lore&spoiler document](https://docs.google.com/document/d/1NpJFH2Z6xoOc48FqWH3zNiP7E_31edhtPRcpzhikbgs/edit?usp=sharing), the past week has been quite hectic for me between moving and starting summer courses, I can't promise when but I will finish it.\n\nNext week's episode should conclude the events of vol2 of LN. At this rate it seems we are getting 4volumes of adaptation, and perhaps vol5 for OVA? I don't see them dragging out vol3 to fit the remaining 6-7 episodes, nor cramming vol4 and 5 into 3-4 episode at the end, especially with the LN author as script writer.\n\nAlso next week I will do an outline of what was different and what exposition was cut from vol2, as I did in the episode 3 [thread](https://www.reddit.com/r/anime/comments/67hhu1/spoilers_shuumatsu_nani_shitemasu_ka_isogashii/dgqooex/) which covered vol1.\n\nOn a sidenote, I can't wait for the next episode\n\n[LN spoiler](/s \"Souwong and Willem's interaction will be great, and there will most likely be the first heartbreaking scene too\")\n\nEdit: As great as Ctholly is, Nephren is best girl. Fight me."
  },
  {
   "score": 1,
   "id": "dhevjko",
   "pid": "t1_dhc749y",
   "date": "2017-05-11 01:22:44",
   "depth": 1,
   "text": "Thanks for the lore document. I know you are still working on it but I'm curious about a few things. Do we know what happened to Elq Harkstein and why the emnetwiht were driven to extinction? It seems like they achieved victory in their battle, the three Poteaux were defeated and Elq Harkstein was a defenseless child. I'm guessing that in the end the braves were unsuccessful, the curse ended, some of the emnetwihts reverted back to beasts and wiped out the rest of the emnetwihts. Also, how did the other races come about?"
  },
  {
   "score": 1,
   "id": "dhf26k8",
   "pid": "t1_dhevjko",
   "date": "2017-05-11 05:51:04",
   "depth": 2,
   "text": "The first question will be answered as I finish writing the document, as for the second, it was something that was never explained in the books"
  },
  {
   "score": 1,
   "id": "dhd7zyj",
   "pid": "t1_dhc749y",
   "date": "2017-05-10 01:21:32",
   "depth": 1,
   "text": "[WRONG](http://imgur.com/9XnHkPR)\nLizard bro is best grill\nF*** you. Fight me."
  },
  {
   "score": 1,
   "id": "dhd6680",
   "pid": "t1_dhc749y",
   "date": "2017-05-09 23:56:39",
   "depth": 1,
   "text": "So who wins?"
  },
  {
   "score": 1,
   "id": "dhd6302",
   "pid": "t1_dhc749y",
   "date": "2017-05-09 23:52:53",
   "depth": 1,
   "text": "Who the hell is Souwong? Dont mind spoilers"
  },
  {
   "score": 1,
   "id": "dhd93r0",
   "pid": "t1_dhd6302",
   "date": "2017-05-10 02:18:34",
   "depth": 2,
   "text": "[LN Spoiler](/s \"Souwong is Willem's friend from the time when he was still a Brave\")"
  },
  {
   "score": 3,
   "id": "dhc1vy6",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:33:27",
   "depth": 0,
   "text": "[Shuu](/s \"When she admitted her love\") [](#akyuusqueel) "
  },
  {
   "score": 5,
   "id": "dhcwamq",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 19:16:26",
   "depth": 0,
   "text": "Willem pretending to be Mistborn, eh?   \nOr at least a Coinshot. "
  },
  {
   "score": 3,
   "id": "dhc2brq",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:41:31",
   "depth": 0,
   "text": "Poor Holo-bot doesn't have it but [here's the Episode 4 discussion](https://www.reddit.com/r/anime/comments/68u5rm/spoilers_shuumatsu_nani_shitemasu_ka_isogashii/) to future people.\n\nGotta say this has been a weird episode. Felt weird to me with the pacing.\n\nWe start off with a recap of the battle while Nephren sits on Willem's lap cause...\n\nThen we go on a giant tour of the city while Ctholly is starting those early stages of that red thing that clearly isn't good news based off the OP. We did learn that Willem does still hold a pretty strong desire for battle again although it's more like fighting just so he can go to where his older family and comrades-in-arms are at. And then we learned something clearly important to Willem with the mention of Kandel.  \n\nAbsolutely adored the Willem x Ctholly dialogue in those last couple of scenes. It's just super cute.\n\n[We got a nice **confessional reveal**](#feelsgoodman)\n\nGee wiz this is a nice season for romance fans. Even the romance subplots seem to be moving well.\n\nI dunno if it was more of a monologue on Ctholly's part or it was the real deal (honestly with how the show presents it I'm thinking the former but I have garbage interpretation skills) but either way super cute.\n\nThe mention of Souwong Kandel clearly got to Willem enough to make him change his mind about coming along. Is it some code name? An old comrade? Some project? Whatever it was it was clearly enough to make Willem ditch a teary Ctholly so *it must have been rather big*. \n\nAnd gee wiz if it weren't for the first scene of the first episode which seemingly shows what happens in the future, I would have pointed out all the damn death flags with all the *I'll return* and *you brought me a little happiness*.\n\nKind of makes me wish they didn't have that first scene cause it would have made these moments a bit more *umph* to me but we're not even halfway through so we'll see what happens next.\n\nI can't really grasp at what this show is trying to do but I'm certainly enjoying each episode quite a bit. \n\nOh and those gollems are weirdly adorable. So simple but they look so eager to do it to where I get a stupid smile when I see those things in action."
  },
  {
   "score": 3,
   "id": "dhc6z84",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 11:05:42",
   "depth": 0,
   "text": "[Pac Man is that you ?!?!](http://i.imgur.com/lxoppvI.png)"
  },
  {
   "score": 3,
   "id": "dhc98br",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 11:46:58",
   "depth": 0,
   "text": "This show is giving me mixed feelings. The story has a good premise and the characters are likable. I like how it seems that it'll take a tragic route but seems to take it's time to develop the relationships and take time to do little SoL segments with worldbuilding included.\n\nBut I can't shake that feeling that this series is awfully rushed, there's lots of scenes where it seems I should feel bad for the characters because something big happened, but I simply can't. I was like that last week when Willem met the girls after so long and now with the farewell between him and Chtolly. \n\n"
  },
  {
   "score": 0,
   "id": "dhcfo2b",
   "pid": "t1_dhc98br",
   "date": "2017-05-09 13:47:16",
   "depth": 1,
   "text": "As someone who has read the original, I can confirm that this anime series is very rushed indeed. They are skipping a lot of details and the pace is way faster than it is in the novel. Two things that suffer the most are world building and characterization. Atmosphere/mood and impact of dramatic moments are also weaker.\n\nDon't get me wrong, this is still a good anime in my opinion. And it's not a bad adaptation either. It is simply not possible to show everything when they have only 12 episodes to work with. But it's kind of frustrating to see something great and unique turn into something that's \"just good\".\n\nAnyhow, if you're not averse to reading, then I strongly suggest to check the original LN. It's being fan-translated currently and 4 out of 5 volumes are already available in English."
  },
  {
   "score": 1,
   "id": "dhctxlr",
   "pid": "t1_dhcfo2b",
   "date": "2017-05-09 18:28:12",
   "depth": 2,
   "text": "Should I start the LNs this weekend, or wait for the anime to finish ?"
  },
  {
   "score": 1,
   "id": "dhdvj2b",
   "pid": "t1_dhctxlr",
   "date": "2017-05-10 11:15:48",
   "depth": 3,
   "text": "Why are you asking me this? The answer fully depends on your own preferences.\n\nThe first question you need to ask yourself is: do you like reading books/novels? If you don't enjoy that kind of stuff, then it may be hard for you to get into the LN, regardless of how good it is (you should still give it a chance, though). On the other hand, if you like reading, then I would definitely recommend you to go for it.\n\nMy personal opinion is that it's better to read the novel first, this will allow you to enjoy it to the fullest. But you point of view may be different, so I can't say what is the best choice for you."
  },
  {
   "score": 5,
   "id": "dhcprvw",
   "pid": "t1_dhcfo2b",
   "date": "2017-05-09 17:04:09",
   "depth": 2,
   "text": "I see, it's a bit sad that my hunch was right but I don't really blame the anime, it's quite good for what it is and I appreciate that.\n\nThanks, I'll read the LN as soon as I can because I'm really intrigued by this series and I want to see it's world and characters fully fleshed out."
  },
  {
   "score": 3,
   "id": "dhd1lru",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 21:18:00",
   "depth": 0,
   "text": "did she think the confession or say it?"
  },
  {
   "score": 1,
   "id": "dhd3is4",
   "pid": "t1_dhd1lru",
   "date": "2017-05-09 22:17:23",
   "depth": 1,
   "text": "Her lips moved so she did say it. "
  },
  {
   "score": 0,
   "id": "dhd9gil",
   "pid": "t1_dhd3is4",
   "date": "2017-05-10 02:37:06",
   "depth": 2,
   "text": "You might want to rewatch it again; it's her monologue."
  },
  {
   "score": 0,
   "id": "dhdbphd",
   "pid": "t1_dhd9gil",
   "date": "2017-05-10 04:21:08",
   "depth": 3,
   "text": "Her lips moved. She did say it him. \n\nAgain, the [LN](/s \"Outright states she said it to him\")"
  },
  {
   "score": 0,
   "id": "dhdc3su",
   "pid": "t1_dhdbphd",
   "date": "2017-05-10 04:35:53",
   "depth": 4,
   "text": "See it for yourself here, I edited it out for you https://streamable.com/lt5ga\n\nAlso, I would like to point out that this is the anime adaptation. As such, things that happened in LN may or may not be adapted in the anime. Things may be different in the anime than the LN itself. Take last episode for example, Ctholly slapping Wilhem scene. I'm sure that didn't happen in the LN. So please do not take the LN as evidence that it (this monologue scene) happened."
  },
  {
   "score": 1,
   "id": "dhdfagm",
   "pid": "t1_dhdc3su",
   "date": "2017-05-10 06:10:11",
   "depth": 5,
   "text": "I don't need to \"see it for myself\" when I know what I saw and can recognize the directing technique to increase the dramatic value of a line being said. \n\n> Take last episode for example, Ctholly slapping Wilhem scene. I'm sure that didn't happen in the LN\n\nThat's incorrect. It did happen there in exact same way."
  },
  {
   "score": 0,
   "id": "dhdt5z5",
   "pid": "t1_dhdfagm",
   "date": "2017-05-10 10:34:56",
   "depth": 6,
   "text": "> Her lips moved so she did say it.\n\nAnd I showed you the video that totally invalidate your statement, yet you still think you're in the right here... Jesus."
  },
  {
   "score": 1,
   "id": "dhdzc42",
   "pid": "t1_dhdt5z5",
   "date": "2017-05-10 12:23:20",
   "depth": 7,
   "text": "> And I showed you the video that totally invalidate your statement, yet you still think you're in the right here...\n\nA dramatic effect of the actual dialogue being off sync with visuals is common in cinematography. We saw her say it we saw him react to it and we heard what she said. \n\nYou are arguing for sake of arguing. This is reaching the Bakemonogatari  \"he walked her home gently!\" argument's level of ridiculousness. "
  },
  {
   "score": 1,
   "id": "dhe0cgo",
   "pid": "t1_dhdzc42",
   "date": "2017-05-10 12:40:20",
   "depth": 8,
   "text": "Dude lmao you said her lips moved therefore she said it. Video clearly shows her lips weren't moving, suggesting it being a monologue more than she actually said it. The only thing that supports your argument is the LN source, which is not evident enough as things get altered in anime adaptation. \n\nEdit: at this point I'm just gonna agree to disagree. Not gonna reply any further than this. Good day."
  },
  {
   "score": 2,
   "id": "dhc2bcb",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:41:18",
   "depth": 0,
   "text": "[](#squee)"
  },
  {
   "score": 2,
   "id": "dhc4ihw",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:21:21",
   "depth": 0,
   "text": "Tsundere Dog Girl is the Best Girl. Great design and great personality. Easily stole the whole episode.\n\nNow since that is out of the way, the episode   is a nice transition between the despair of las tweek and next portion of the story, at the same time  opening up a window into the town's customs, lore and politics, giving us some very nice and needed worldbuilding. \n\nWe start off with Willem being absolutely adamant on not interfering in anything and taking up a stance that people with right motives can't use violence because it is never good. Now that is nice idealistic stance but it is not always true, especially when one's rights are in question - when people come at you for being different you won't be able to reason with them or talk things through. Although it makes sense that Willem would have a very flawed pacifistic outlook towards life, because his whole species was destroyed due to war. And he is clearly using it as an excuse because of his own inability to do really do anything and and because he does not want to get people around him into even more  trouble. \n\nAlas in the end, Willem does get a chance to actually be useful and to actually do something that matters, which is EXTREMELY important in terms of his development. If last episode was about Willem's innability to be of any use and his struggle and horrifying despair stemming from that, this episode offered him some cathartic ability to actually do things, even if on smaller scale. Sure some things were handled differently and in more agressive fashion here, but I actually like it more here than in the novel because here Willem actually got a chance to vent his frustrations a little and do what he really wanted to do. The final scene with Ctholly and Willem dialogue also was handled a bit better than in the novel and Willem came out as a better person here and it fit nicely into the theme through the episode\n\nOverall a good strong episode can't wait for next week. "
  },
  {
   "score": 0,
   "id": "dhd65j7",
   "pid": "t1_dhc4ihw",
   "date": "2017-05-09 23:55:51",
   "depth": 1,
   "text": "Really? I felt like the Phrya was kind of nonsensical useless gap breather. I wished they gave us more interactions with Ren, Chtholly, and Ithea. "
  },
  {
   "score": 2,
   "id": "dhch399",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 14:14:08",
   "depth": 0,
   "text": "So this is [meta-spoiler](/s \"madoka and/or FF10\"), huh?"
  },
  {
   "score": 2,
   "id": "dhck95c",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 15:14:24",
   "depth": 0,
   "text": "There's something in the design of the anthropomorphic animal characters that reminds me of old kid's shows like 'Around the World With Willy Fog' and 'Dogtanian and the Three Muskehounds.' Especially the disturbingly cute dog girl and the edgy cat guy, though maybe they just influenced the character designers, since those series were done by Nippon Animation way back when.\n\nAnyway we got more cuteness, a confession and the revelation that the Willem is a railgun."
  },
  {
   "score": 1,
   "id": "dhd36up",
   "pid": "t1_dhck95c",
   "date": "2017-05-09 22:06:28",
   "depth": 1,
   "text": "Might be all the victorian-esque clothing they're wearing."
  },
  {
   "score": 2,
   "id": "dhfbf3w",
   "pid": "t1_dhck95c",
   "date": "2017-05-11 08:59:07",
   "depth": 1,
   "text": "The design reminded me personally of characters from the Solatorobo games."
  },
  {
   "score": 2,
   "id": "dhd04rs",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 20:38:57",
   "depth": 0,
   "text": "I really liked the design on the Annihilation Knights. Good episode of all sorts of feelings :)"
  },
  {
   "score": 2,
   "id": "dhd445f",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 22:37:36",
   "depth": 0,
   "text": "I find it funny how some comments​ here are completely downplaying the importance of the mental corruption. Yeah sure, slice of Life fun right?"
  },
  {
   "score": 1,
   "id": "dhdlyl7",
   "pid": "t1_dhd445f",
   "date": "2017-05-10 08:27:09",
   "depth": 1,
   "text": "an orphanage of cute living weapons [with](/s \"decay state if they live longer?\") yeah sure... a whole cake slice of life."
  },
  {
   "score": 1,
   "id": "dhd74ei",
   "pid": "t1_dhd445f",
   "date": "2017-05-10 00:39:00",
   "depth": 1,
   "text": "yeah its extremely downplayed so far, its super important in the ln"
  },
  {
   "score": 2,
   "id": "dhcdjgm",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 13:08:41",
   "depth": 0,
   "text": "These people certainly are not acting like they just lost an inhabited island and they have no idea how to defeat the new monster without killing themselves.\n\n\nInstead have a leisurely sight-seeing tour through the town, solve a local conflict and part ways under mysterious circumstances.  Not that I don't like the interactions that Chtolly and Wilhiem have but I definitely feel there could have been a better way to go about it.\n\n\nSide note:  I wonder about Tiat and her new status as a soldier.  I kinda want to see her stradle from playing with her friends and training with Chtolly and the others."
  },
  {
   "score": 3,
   "id": "dhd3lkn",
   "pid": "t1_dhcdjgm",
   "date": "2017-05-09 22:20:01",
   "depth": 1,
   "text": "> These people certainly are not acting like they just lost an inhabited island and they have no idea how to defeat the new monster without killing themselves.\n> \n> \n> \n> Instead have a leisurely sight-seeing tour through the town, solve a local conflict and part ways under mysterious circumstances. Not that I don't like the interactions that Chtolly and Wilhiem have but I definitely feel there could have been a better way to go about it.\n\nYou mean except for the fact that Ctholly is clearly freaking out and blaming herself for most of episode and is very emotionally unstable?\n\nPeople tend to indulge in escapism to deal with their issues. That's what people do. "
  },
  {
   "score": 1,
   "id": "dhddsvq",
   "pid": "t1_dhd3lkn",
   "date": "2017-05-10 05:30:39",
   "depth": 2,
   "text": "> These people certainly are not acting like they just lost an inhabited island and they have no idea how to defeat the new monster without killing themselves.\n\nI'd say it's intentional. You can take it at face value, or read between the lines - civilisation at a brink of extincion, getting hyped over romances, shrugging off a catastophe. Broken people everywhere. That's how I see it. "
  },
  {
   "score": 5,
   "id": "dhcduis",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 13:14:18",
   "depth": 0,
   "text": "Directing was off this episode. I don't know why. The \"fight\" against that flower thing was lame, didn't look gruesome and omnious like the build up suggested. The furry subplot might be relevant later but seems kinda unnessary in a 1 to 2 cours adaptation. I would rather have focused on the real matters. And the emotionals scenes fell kinda flat because we're lacking information.\n\nI want to keep watching because I like the characers but next episode better pull its shit together."
  },
  {
   "score": 1,
   "id": "dhd6m5m",
   "pid": "t1_dhcduis",
   "date": "2017-05-10 00:15:47",
   "depth": 1,
   "text": "I felt pretty afraid of the monsters in the previous episodes, since we weren't given any hint of what they were like. I can name another (mecha) series where the enemy creatures weren't shown until very far in, and it was horrific. It's rather underwhelming the way they did it in this show, it would've been better to keep it a mystery so our imagination can run wild.\n\nI still enjoy the show though, I can forgive it since the show may not really be about the monsters."
  },
  {
   "score": 1,
   "id": "dhcpens",
   "pid": "t1_dhcduis",
   "date": "2017-05-09 16:56:27",
   "depth": 1,
   "text": "I share the same opinion."
  },
  {
   "score": 4,
   "id": "dhcojs5",
   "pid": "t1_dhcduis",
   "date": "2017-05-09 16:38:41",
   "depth": 1,
   "text": "If they would have shown the whole 5 day fight it would have been a lot more scary, that beast regenerates or splits every time it dies thats why ctholly said this is number 217 or whatever, because they have killed it that many times."
  },
  {
   "score": 2,
   "id": "dhd4c3h",
   "pid": "t1_dhcojs5",
   "date": "2017-05-09 22:45:20",
   "depth": 2,
   "text": "Wait you mean some people didn't pick up on that?"
  },
  {
   "score": 2,
   "id": "dhd6yol",
   "pid": "t1_dhd4c3h",
   "date": "2017-05-10 00:31:36",
   "depth": 3,
   "text": "Yeah I saw some people say that "
  },
  {
   "score": 5,
   "id": "dhc4aho",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:17:23",
   "depth": 0,
   "text": "This series has been super disappointing to me so far. I was hoping for family drama - given the premise, it would have been very interesting and unique if it had put all that war and politics to the backdrop and focused on the kids in the orphanage. That would have been just about the most conceptually perfect story to me.\n\nInstead it's more a half-baked romance. I wouldn't even mind so much if Chtholly and Willem had any chemistry. Nope, just a standard tsundere relationship.\n\nThe \"worldbuilding\" was crap. Just naming places and movies isn't worldbuilding. I don't know if the adaptation tried to pack in all these little facts from the light novel, but the worldbuilding would have been far better if it'd focused on one thing or one setting. Instead the whole episode is a cluster of ideas that all end up generic because they're so poorly explored.\n\nThe fantasy genre can offer so much better than this. That massage scene in Ep 2 or so was the first red flag for me, and it's been downhill so far. I'm not judging anyone who's enjoying this, just my one cent."
  },
  {
   "score": 6,
   "id": "dhcpug7",
   "pid": "t1_dhc4aho",
   "date": "2017-05-09 17:05:37",
   "depth": 1,
   "text": "Yeah, I pretty much agree with your points. I think this show could have explored more those points and not sold for the same thing we watch in anime day after day."
  },
  {
   "score": 3,
   "id": "dhc34j3",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:56:06",
   "depth": 0,
   "text": "Yeah, this was the worst episode so far. Really not sure why they have to put in the slice of life/comedy bits again. If stuff was skipped for that then i'm quite baffled. \n\nLast scene was good again. Also Chtolly sees some weird shit, that was quite creepy.\n\n"
  },
  {
   "score": 1,
   "id": "dhc8jhu",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 11:34:17",
   "depth": 0,
   "text": "this felt like a really rushed episode from a ln reader standpoint, they changed a lot of dialogue as well"
  },
  {
   "score": 1,
   "id": "dhc95bp",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 11:45:25",
   "depth": 0,
   "text": "Look at all the death flags in this anime."
  },
  {
   "score": 1,
   "id": "dhcavgo",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 12:17:05",
   "depth": 0,
   "text": "im gonna be honest that confession is propably one of my favorites"
  },
  {
   "score": 1,
   "id": "dhcbcmu",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 12:25:44",
   "depth": 0,
   "text": "oh god, that ending was so death flag.... please don't"
  },
  {
   "score": 1,
   "id": "dhcc7lk",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 12:44:39",
   "depth": 0,
   "text": "That confession got me off guard. Damn. I love this show.  \nCan't wait to understand Chtolly hallucinations, who is the one who Buronny told about to Willem and when Lizardbro will have more screentime."
  },
  {
   "score": 1,
   "id": "dhceilw",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 13:26:20",
   "depth": 0,
   "text": "The pacing is really good, someone who has read the LN may correct me, but I don't feel any kind of forced transitions happening between scenes.\n\nI'm loving this show so far, will defo buy the Novel when Yen Press or something else licences it. If they do. Please do. Shame Amazon (and somewhat Akashic Records) are keeping it from getting the spotlight while it's airing, although I'm quite sure many will check it once it's finished (and the rating probably skyrockets), considering it's a full series adapted (not counting the sequel, I guess)."
  },
  {
   "score": 1,
   "id": "dhcfte6",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 13:50:00",
   "depth": 0,
   "text": "I can't shake the feeling this is all going to end in suffering.\n\nProbably why I enjoy it so much, tbh."
  },
  {
   "score": 1,
   "id": "dhciv74",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 14:49:33",
   "depth": 0,
   "text": "These cliffhanger!!!"
  },
  {
   "score": 1,
   "id": "dhcj80y",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 14:55:53",
   "depth": 0,
   "text": "I think it's bullshit that this episode didn't have him in a wheelchair after he used that super speed in the last one. I thought he couldn't use his powers without fucking himself."
  },
  {
   "score": 3,
   "id": "dhcofsq",
   "pid": "t1_dhcj80y",
   "date": "2017-05-09 16:36:25",
   "depth": 1,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dhdi4yx",
   "pid": "t1_dhcofsq",
   "date": "2017-05-10 07:13:30",
   "depth": 2,
   "text": "This comment has been removed. Please review for any tags you may have missed and reply to this message to have your post re-approved.\n\nUntagged or improperly tagged spoilers are not allowed.\n\nRepeated violations of this rule will result in a ban.\n\n\n\n---\n^(Have a question or think this removal was an error?) [^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)\n^(Don't know the rules? Read them )[^(here)](/r/anime/wiki/rules)^."
  },
  {
   "score": 1,
   "id": "dhcjojb",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 15:04:04",
   "depth": 0,
   "text": "Haven't caught up quite yet but started last night and caught up. Will watch this tonight but I had a question.\n\nWith some of the names, notably ctholly, and some of the general themes of the show such as the fairies and leprechauns I'm getting the sense that there's a cultures lore putting some inspiration in the nomenclature of some things...\n\nAnyone else getting the sense of some old Gaelic themes going on here? Or am I just not seeing it/ looking too deep?"
  },
  {
   "score": 1,
   "id": "dhclbyd",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 15:34:29",
   "depth": 0,
   "text": "Im liking the PTSD in the MC.  As someone who was a tool for destruction in the past and fought a world ending monster to the death while presumably his comrades bit the dust until only he was left, dieing, only to turn to stone and wake up 500 years later and find out the world was wiped out after he \"died\", he should be under a good amount of stress.  The little flashbacks and mentions of his past life are great.  In a weird way it reminds me of Ken from Kuromukuro.  I hope we get to see more of his past, and for everyone to really understand what he went through.  (i dont think the girls know the full extent of what happened in the past, just that he knows a lot about thier weapons, though Chtulu does know he was one of them in the past, hence her \"you dont have to fight anymore, we will do it for you\" speech.)  \n\nIm loving this show and its one i very much look forward to each week.  \n\n[](#meguminthumbsup)"
  },
  {
   "score": 1,
   "id": "dhcom6e",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 16:40:03",
   "depth": 0,
   "text": "So, are we getting 12 or 24 episodes of this? Its nice, but really doesnt feel like we're going anywhere fast, and if they suddenly start stuff happening out of the blue could feel really cheesy. Other than that though again a pretty good episode, its definitely the slow  burner of the season for me though."
  },
  {
   "score": 1,
   "id": "dhcupkm",
   "pid": "t1_dhcom6e",
   "date": "2017-05-09 18:44:11",
   "depth": 1,
   "text": "Unfortunately its 12 episodes, and were about an episode away from being done with volume 2, 3 more volumes to go unless they do volume 5 in ova form. "
  },
  {
   "score": 1,
   "id": "dhcso5r",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 18:02:17",
   "depth": 0,
   "text": "Can someone spoil me on who the ultimate bad guy boss his and who or what that \"new\" monster was?  I get the feeling the monsters are controlled by something or someone intelligent on the ground and its not just some random attacks.  Who is the real bad guy?"
  },
  {
   "score": 2,
   "id": "dhcungt",
   "pid": "t1_dhcso5r",
   "date": "2017-05-09 18:43:02",
   "depth": 1,
   "text": "[major ln spoilers](/s \"so far im up to vol 5 waiting for the rest of vol 5 to be translated but in volume 4 when willem goes into the dreamworld of his time period we learn that there was a group called true world that opposed the way things worked and wanted to create a new world by wiping out everything, they put some weird curse on people that put them into a coma after having a strange dream of a vast and empty world, willem and the reader pretty much figure out that all of the beasts were actually humans at one point and true world was responsible for the annihilation of everything on the ground. Sorry for shit explanation\")"
  },
  {
   "score": 1,
   "id": "dhcufb3",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 18:38:25",
   "depth": 0,
   "text": "what kind of dialect does ithea use?"
  },
  {
   "score": 2,
   "id": "dhcyhhp",
   "pid": "t1_dhcufb3",
   "date": "2017-05-09 20:00:10",
   "depth": 1,
   "text": "Not really a dialect per se- she has some verbal tics though. It makes her sound more informal than some of the other characters."
  },
  {
   "score": 1,
   "id": "dhcusfe",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 18:45:52",
   "depth": 0,
   "text": "So many flags have been raised that even [this guy](http://www.anime-planet.com/images/characters/souta-hatate-59360.jpg?t=1397773416) can't help anymore..."
  },
  {
   "score": 1,
   "id": "dhd3bhl",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 22:10:42",
   "depth": 0,
   "text": "On the one hand I think this anime is going clearly into the direction of a chrono crusade type ending, yet it is clearly set up to give MC some sort of second chance, to get some sort of personal happy end he didn't have the first time.\n\nHe reminds me a bit of [John Reese](http://personofinterest.wikia.com/wiki/John_Reese), and I think the same thing might ultimately happen to both characters."
  },
  {
   "score": 1,
   "id": "dhd53jx",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 23:13:33",
   "depth": 0,
   "text": "I know he was/is some kind of special warrior but knocking people on their ass with coins was kind of weird. It seems like you would need a ridiculous amount of strength to generate that much force especially the long distance shot. I know it doesn't matter in terms of the overall plot but it's still an odd choice for how the situation would be resolved. Unless he has some kind of projectile magic but that didn't seem to be the case."
  },
  {
   "score": 2,
   "id": "dhd7x9h",
   "pid": "t1_dhd53jx",
   "date": "2017-05-10 01:17:47",
   "depth": 1,
   "text": "We already saw that Willem can be quite powerful but Willem's problem is that his body can't handle anything he could technically do. He is pretty only healthy just enough to not keel over and die from just existing. If he tried to fight(ex: how he sparred with Ctholly) his body would not be able to take it. \n\nMeanwhile even the most sick person can flick a coin or throw something. Just in this case Willem applied to that simple idea something the rest of his body can't handle. Essentially allowing him both to do something more active and not to overwork his frail and broken body. "
  },
  {
   "score": 1,
   "id": "dhd89pp",
   "pid": "t3_6a6b63",
   "date": "2017-05-10 01:35:14",
   "depth": 0,
   "text": "Someone please spoil me and let me know if there's at least a kiss before seemingly inevitable tragedy :( "
  },
  {
   "score": 3,
   "id": "dhdqm9h",
   "pid": "t1_dhd89pp",
   "date": "2017-05-10 09:50:18",
   "depth": 1,
   "text": "[major LN spoiler](/s \"he kisses her while shes in a coma before the beginning scene in ep1 I could spoil more if you want but you would hate me for it\")\n"
  },
  {
   "score": 1,
   "id": "dhdrb2l",
   "pid": "t1_dhdqm9h",
   "date": "2017-05-10 10:02:10",
   "depth": 2,
   "text": "Omg ;_: Please do, I gotta brace my feels"
  },
  {
   "score": 1,
   "id": "dhddlxh",
   "pid": "t3_6a6b63",
   "date": "2017-05-10 05:25:04",
   "depth": 0,
   "text": "The suffering starts from here. "
  },
  {
   "score": 1,
   "id": "dhddxl7",
   "pid": "t3_6a6b63",
   "date": "2017-05-10 05:34:25",
   "depth": 0,
   "text": "Nephren best girl. Kuudere done right (at last!). A proof that one can bring to life a character with very composed personality without making it an apathetic doll. "
  },
  {
   "score": 1,
   "id": "dhdhe2w",
   "pid": "t3_6a6b63",
   "date": "2017-05-10 06:57:50",
   "depth": 0,
   "text": "When did this become Evangelion-lite?"
  },
  {
   "score": 1,
   "id": "dhdrakr",
   "pid": "t3_6a6b63",
   "date": "2017-05-10 10:01:56",
   "depth": 0,
   "text": "\"I don't want to accept anything but the stuff I can't accept\" - huh?\n\nI'm surprised there were no special effects shown for the finger gun.\n\nWhile last episode's slap was well deserved, this one's was anything but. And how did he come to touch her belly again?\n\nSo did she actually confess out loud? His face seems to imply it, but her mouth was shut the whole time, so maybe he was just surprised by her sudden beauty or something?\n\nDid MC punch bunny at the end there, or what else was that sound?\n\nFake Cat Ears is still my favorite character. And this was probably my favorite episode of the show by far."
  },
  {
   "score": 1,
   "id": "dhdwxh4",
   "pid": "t1_dhdrakr",
   "date": "2017-05-10 11:40:44",
   "depth": 1,
   "text": "[he touched her belly in the previous episode when they bumped into each other](https://i.gyazo.com/0f02d24b7ed6a48c4eb2a592659dd458.png)"
  },
  {
   "score": 1,
   "id": "dhe1kzx",
   "pid": "t1_dhdwxh4",
   "date": "2017-05-10 13:02:07",
   "depth": 2,
   "text": "Ah, he caught her to keep her from falling, right?"
  },
  {
   "score": 1,
   "id": "dhe30kj",
   "pid": "t1_dhe1kzx",
   "date": "2017-05-10 13:27:39",
   "depth": 3,
   "text": "Yeah but she apparently still took offense to it"
  },
  {
   "score": 2,
   "id": "dhe3759",
   "pid": "t1_dhe30kj",
   "date": "2017-05-10 13:30:47",
   "depth": 4,
   "text": "Well, I guess for her race it's like catching a human woman by her nipples or something?"
  },
  {
   "score": 2,
   "id": "dhdrhf7",
   "pid": "t1_dhdrakr",
   "date": "2017-05-10 10:05:17",
   "depth": 1,
   "text": "> So did she actually confess out loud? His face seems to imply it, but her mouth was shut the whole time, so maybe he was just surprised by her sudden beauty or something?\n\nThere's no doubt that she did. She most likely said it when her head was turned to side.\n\n> Did MC punch bunny at the end there,\n\nYes."
  },
  {
   "score": 1,
   "id": "dhdwhah",
   "pid": "t3_6a6b63",
   "date": "2017-05-10 11:32:41",
   "depth": 0,
   "text": "[DONER KEBAB](https://www.youtube.com/watch?v=eAqL3krHbzY)"
  },
  {
   "score": 1,
   "id": "dhdx1xw",
   "pid": "t1_dhdwhah",
   "date": "2017-05-10 11:42:55",
   "depth": 1,
   "text": "remove"
  },
  {
   "score": 1,
   "id": "dhgi2bh",
   "pid": "t3_6a6b63",
   "date": "2017-05-12 01:13:08",
   "depth": 0,
   "text": "I have a feeling everything is about to go horribly wrong. Why can't we have a nice feelgood anime set in this mildly apocalyptic world instead?"
  },
  {
   "score": 1,
   "id": "dhhwxfp",
   "pid": "t3_6a6b63",
   "date": "2017-05-12 21:59:05",
   "depth": 0,
   "text": "Here I was, thinking that this will not burn my emotional hype train straight to hell. Guess I was wrong"
  },
  {
   "score": 1,
   "id": "diw6al8",
   "pid": "t3_6a6b63",
   "date": "2017-06-14 07:52:10",
   "depth": 0,
   "text": "Um Can someone message me the ending in the LN? I just want to know how it ended. "
  },
  {
   "score": -3,
   "id": "dhc1wki",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 09:33:47",
   "depth": 0,
   "text": "Ayayayy, they messed up this entire episode. A shit ton of meaningful dialogue and monologue erased too. Ah well, can't expect much out of LN adaptations I guess. Hopefully they get this back on track next ep. *Set this right, Ebon Candle!*"
  },
  {
   "score": -1,
   "id": "dhc2b48",
   "pid": "t1_dhc1wki",
   "date": "2017-05-09 09:41:12",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 2,
   "id": "dhc36h8",
   "pid": "t1_dhc2b48",
   "date": "2017-05-09 09:57:03",
   "depth": 2,
   "text": "Yeah its a shame they are rushing it so fast and skipping important details. I feels less attached to the characters when watching anime than reading novel which a thought would be opposite."
  },
  {
   "score": 1,
   "id": "dhcpjlu",
   "pid": "t1_dhc1wki",
   "date": "2017-05-09 16:59:22",
   "depth": 1,
   "text": "this episode has pacing issues, yes."
  },
  {
   "score": 1,
   "id": "dhc4nw8",
   "pid": "t1_dhc1wki",
   "date": "2017-05-09 10:24:03",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 4,
   "id": "dhc5yba",
   "pid": "t1_dhc4nw8",
   "date": "2017-05-09 10:47:01",
   "depth": 2,
   "text": "What they removed\n> [LN Spoiler](/s \"They really glossed over the whole battle scene during the beginning, removing dialogue between Ithea/Aiseia and Chtholly/Kutori explaining what's happening to Chtholly. They also removed some explanation of the battle, why they lost, and what Chtholly did during the battle (she destroyed and sank the entire island with the power of seniolis, but pushed herself closer to 'death' by using so much venom). During the Corna de Luce half, they removed a bunch of dialog explaining the politics and justifications of the Annihilation gang\")\n> \n\nWho the guy at the end was\n> [Minor LN Spoiler](/s \"Suwon Candel, a friend of Willem's who helped found Regula Aire. He's the guy in the statue from the last episode, and he's also the young kid with the giant white rob shown during one of the flashbacks. Willem calls out to him as he's dying and getting petrified too\")\n> \n> [Very Major LN Spoiler](/s \"Suwon Candel, a teenage mage who fought with the braves during the final battle with visitor elq harkenstein (the visitor girl that Ctholly is being transformed into) , friend of Willem and Lillia/Leila, and the Great Sage of Regula Aire. He founded and guided the floating nation for the past 500 years, but he's no longer human. He created Regula Aire in the old human Empire's image, and he also created the fairies/leprechauns. He and ebon candle want to take back the earth with Willem's help (he's the last person alive who can maintain dug weapons).\")\n> \n\n"
  },
  {
   "score": 1,
   "id": "dhd70s2",
   "pid": "t1_dhc5yba",
   "date": "2017-05-10 00:34:20",
   "depth": 3,
   "text": "can you please pm me about how the floating Island exist? is it already exist even before beasts are existed? or it's a man made island? and how the furry human created? "
  },
  {
   "score": 2,
   "id": "dhd7olr",
   "pid": "t1_dhd70s2",
   "date": "2017-05-10 01:06:07",
   "depth": 4,
   "text": "It's all going to be explained in the next episode\n\n[LN Spoiler](/s \"Someone created a giant talsiman (same thing the dug weapons are made of), that magically makes all the islands float. All the beings on Regul Aire came from the land, before it was destroyed from the beasts. \")\n\n"
  },
  {
   "score": 1,
   "id": "dhd704f",
   "pid": "t1_dhc5yba",
   "date": "2017-05-10 00:33:29",
   "depth": 3,
   "text": "can you please pm me about how the floating Island exist? is it already exist even before beasts are existed? or it's a man made island? and how the furry human created? "
  },
  {
   "score": 12,
   "id": "dhc6kgu",
   "pid": "t1_dhc5yba",
   "date": "2017-05-09 10:58:07",
   "depth": 3,
   "text": "They didn't remove it (yet) if you look at the preview for ep6 you can see that next week they will animate the fight, introduced at the start of ep5, as well as the 1st chapter of vol2 which got skipped last week. And that will most likely explain the things you wrote about."
  },
  {
   "score": 1,
   "id": "dhc7b6q",
   "pid": "t1_dhc6kgu",
   "date": "2017-05-09 11:11:50",
   "depth": 4,
   "text": "Whoops, I guess I missed that part of the preview. You're right then, they didn't remove anything that was super important for the plot, except for some happy character development."
  },
  {
   "score": 1,
   "id": "dhch7f1",
   "pid": "t1_dhc7b6q",
   "date": "2017-05-09 14:16:21",
   "depth": 5,
   "text": "I think they're doing a good job with reordering some of the scenes. It's not really better/worse, but they're going with a particular mood progression that I think I am enjoying more. "
  },
  {
   "score": 2,
   "id": "dhc2fmk",
   "pid": "t1_dhc1wki",
   "date": "2017-05-09 09:43:29",
   "depth": 1,
   "text": "Ah, if it was a poor adaptation then that would make sense; I kinda struggled to grasp why the episode was so slice-of-life-y again when it felt like it was just re-iterating points like the movie scenes. That's unfortunate."
  },
  {
   "score": 5,
   "id": "dhc7e14",
   "pid": "t1_dhc1wki",
   "date": "2017-05-09 11:13:17",
   "depth": 1,
   "text": "Despite all the changes to minor things just to fit everything in, therefor butchering the pacing a bit, I would say they got the main point of this episode/chapter right. that being of Willem still wanted to fight and die, but he has a new home here with the fairies now."
  },
  {
   "score": 24,
   "id": "dhc4mj5",
   "pid": "t1_dhc1wki",
   "date": "2017-05-09 10:23:24",
   "depth": 1,
   "text": ">  A shit ton of meaningful dialogue and monologue erased too\n\nThey did not skip anything important. They actually ADDED additional world-building and they fixed some of scenes from LN for the better(ex: Ctholly's and Willem's conversation at the end)"
  },
  {
   "score": 5,
   "id": "dhc76lf",
   "pid": "t1_dhc4mj5",
   "date": "2017-05-09 11:09:28",
   "depth": 2,
   "text": "They skipped the dialogue Willem had with the rebels, which highlighted Kutori's remark \"you wanted to fight, didn't you?\" Effectively distorted the the conversation with Kutori at the end, casually waving aside Willem's unresolved desire to remain in the battlefield.\n\nThere was a motif in the LN. \"Do you like this town?\" - Willem asked both Phyl and the rebels, and I think that's a very important theme in the story. One ought to protect not out of a distorted sense of justice but simply out of love and adoration.\n"
  },
  {
   "score": 11,
   "id": "dhc7qmk",
   "pid": "t1_dhc76lf",
   "date": "2017-05-09 11:19:41",
   "depth": 3,
   "text": "> They skipped the dialogue Willem had with the rebels, which highlighted Kutori's remark \"you wanted to fight, didn't you?\"\n\nIt was obvious by him fighting and by his story last episode. \n\n> There was a motif in the LN. \"Do you like this town?\" - Willem asked both Phyl and the rebels, and I think that's a very important theme in the story. One ought to protect not out of a distorted sense of justice but simply out of love and adoration.\n\nMost likely author(since she is in charge of adaptation) realized hos silly it is to try to put biggots on same level as other people. There's nothing redeemable about their side or goals. It is VERY clear that the rebels dont like the town or what it represents. It does not make sense to ask that and actually having Willem relieve his frustrations and do something is a welcome change. \n\nThe message that Willem chose to participate this way due to the whole do you like this town still carries across due to conversation Dog Girl and Tiat had during the restaurant scene and Willem's reaction to it. "
  },
  {
   "score": 0,
   "id": "dhfch5y",
   "pid": "t3_6a6b63",
   "date": "2017-05-11 09:18:28",
   "depth": 0,
   "text": "Too bad..  I needed to read spoilers here to appreciate the episode more.\n\nPacing was way off."
  },
  {
   "score": -11,
   "id": "dhc5ub6",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 10:45:05",
   "depth": 0,
   "text": "pretty lame ep like usual. really considering dropping this. the plot is going nowhere."
  },
  {
   "score": 1,
   "id": "dhd05bw",
   "pid": "t1_dhc5ub6",
   "date": "2017-05-09 20:39:21",
   "depth": 1,
   "text": "life is short. If you're not having fun drop it."
  },
  {
   "score": -1,
   "id": "dhcn794",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 16:11:14",
   "depth": 0,
   "text": "can anybody gimme a rundown so far? should i pick up this show?"
  },
  {
   "score": -6,
   "id": "dhc8ggq",
   "pid": "t3_6a6b63",
   "date": "2017-05-09 11:32:45",
   "depth": 0,
   "text": "finally some fighting action in the beginning after 5 episodes. "
  },
  {
   "score": 10,
   "id": "dhc996e",
   "pid": "t1_dhc8ggq",
   "date": "2017-05-09 11:47:24",
   "depth": 1,
   "text": "> fighting\n\nIf you are still expecting action scenes from this show five episodes in then you are watching a wrong show. \n\nThis is not an action show.\n"
  }
 ]
}