{
 "score": 907,
 "id": "66w5q4",
 "num_comments": 427,
 "date": "2017-04-22 07:15:02",
 "comments": [
  {
   "score": 365,
   "id": "dglxn1h",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:34:40",
   "depth": 0,
   "text": "[THAT MOMENT WHEN THE HYPE TRAIN IS DERAILED](http://imgur.com/vJODKAC)"
  },
  {
   "score": 2,
   "id": "dgmvzdx",
   "pid": "t1_dglxn1h",
   "date": "2017-04-23 01:27:09",
   "depth": 1,
   "text": "I didn't get it. Why did nothing happen in that scene?"
  },
  {
   "score": 2,
   "id": "dgn2so0",
   "pid": "t1_dgmvzdx",
   "date": "2017-04-23 06:40:04",
   "depth": 2,
   "text": "Selesia was comfirming whether Marine the illustrator's change in her character design affect her power, but didn't work"
  },
  {
   "score": 80,
   "id": "dglyic3",
   "pid": "t1_dglxn1h",
   "date": "2017-04-22 10:53:51",
   "depth": 1,
   "text": "I'm not a big fan of how this series uses its music but found that scene hilarious."
  },
  {
   "score": 1,
   "id": "dgmv7h6",
   "pid": "t1_dglyic3",
   "date": "2017-04-23 00:49:11",
   "depth": 2,
   "text": "Kinda agree but sawano does what sawano wants.\n\nhttps://youtu.be/MB44gKGiQQc"
  },
  {
   "score": 1,
   "id": "dgmz45o",
   "pid": "t1_dgmv7h6",
   "date": "2017-04-23 04:12:35",
   "depth": 3,
   "text": "Yeah this just feels _way_ over done for me..."
  },
  {
   "score": 7,
   "id": "dgml2nt",
   "pid": "t1_dglyic3",
   "date": "2017-04-22 19:37:59",
   "depth": 2,
   "text": "I agree, I always though that music should be used to direct the audiences mood. The hype music is getting played way too much for how little action we're getting."
  },
  {
   "score": 1,
   "id": "dguua3c",
   "pid": "t1_dgml2nt",
   "date": "2017-04-27 21:23:18",
   "depth": 3,
   "text": "They are protagonist of stories colliding together, they are basically representing hype trains with each action they do, so the music goes acording to that."
  },
  {
   "score": 153,
   "id": "dgm0ll3",
   "pid": "t1_dglyic3",
   "date": "2017-04-22 11:39:59",
   "depth": 2,
   "text": "Could you elaborate on what you mean? How does this show use its music? So far I loved it, especially the scene with fakedoka's \ncrushing realization last episode. I played it over and over again. What do you dislike and how should it be the music used in your opinion? I am genuinely curious."
  },
  {
   "score": 8,
   "id": "dgm182g",
   "pid": "t1_dgm0ll3",
   "date": "2017-04-22 11:54:24",
   "depth": 3,
   "text": "Don't you find it's a bit over the top? Not always if course but usually when the OST with lyrics kicks in it's way too epic for how normal a scene is. I enjoyed how they jokingly used it in this episode but in the previous ones they've been using it for any normal battle when it feels more like a final boss theme.\n\n"
  },
  {
   "score": 3,
   "id": "dgmyvk7",
   "pid": "t1_dgm182g",
   "date": "2017-04-23 04:00:32",
   "depth": 4,
   "text": "Yeah not sure why you got downvoted. I love sawano hype music but only when it's used well. Putting it in for every fight, especially when it's not warranted really makes the fight look awkward."
  },
  {
   "score": 6,
   "id": "dgm66t7",
   "pid": "t1_dgm182g",
   "date": "2017-04-22 13:46:28",
   "depth": 4,
   "text": "Isn't that just because we are used to OST with lyrics being used in big fights, it's not a rule that it has to be that way. I really liked how music was used in fight between Mamika and Selesia, and then stopped for effect before Mamika slams her into ground."
  },
  {
   "score": 1,
   "id": "dgnd2im",
   "pid": "t1_dgm66t7",
   "date": "2017-04-23 10:46:56",
   "depth": 5,
   "text": "Indeed, just because it's not done that way in most animes doesn't mean Sawano's doing it badly. Imo, those other animes are lacking, this is the better way to do it in my eyes."
  },
  {
   "score": 1,
   "id": "dgndb51",
   "pid": "t1_dgnd2im",
   "date": "2017-04-23 10:52:01",
   "depth": 6,
   "text": "I think what's better is a case-by-case situation, but one is not the better than other by default and here I think it's done pretty good."
  },
  {
   "score": 4,
   "id": "dgm6f6w",
   "pid": "t1_dgm66t7",
   "date": "2017-04-22 13:51:26",
   "depth": 5,
   "text": "Even without the lyrics the music is still overly hyped. I had the same issue for a scene in 3-gatsu with no lyrics. \n\nAlso even if you say we're used to lyrical OSTs used for big fights then there's a reason why we are, because it works. "
  },
  {
   "score": 14,
   "id": "dgm1irm",
   "pid": "t1_dgm182g",
   "date": "2017-04-22 12:01:12",
   "depth": 4,
   "text": "This is a common theme in any anime soundtrack made by Hiroyuki Sawano.\n\nThey. Are. LOUD. And they steal the show. They distract from the scene, instead of complementing it. See the sountracks in Attack on Titan, Kabaneri, and some others. I think gigguk mentioned this  in his review of Kabaneri too.\n\nI prefer Yokoyama Masaru (Your Lie in April) or Yuki Kajiura (SAO)'s style of writing music for anime."
  },
  {
   "score": 1,
   "id": "dgmfhu8",
   "pid": "t1_dgm1irm",
   "date": "2017-04-22 17:20:58",
   "depth": 5,
   "text": "> They. Are. LOUD. And they steal the show. They distract from the scene, instead of complementing it.\n\nThat is exactly my problem with Sawano's music. It is great when it is subtle and well placed (see Gundam Unicorn), otherwise it just stands out way too much."
  },
  {
   "score": 2,
   "id": "dgmkgt4",
   "pid": "t1_dgmfhu8",
   "date": "2017-04-22 19:23:49",
   "depth": 6,
   "text": "His work in Unicorn was probably his greatest yet.           \nMaybe the fact that it's a film series helps."
  },
  {
   "score": 1,
   "id": "dlqd99y",
   "pid": "t1_dgm1irm",
   "date": "2017-08-16 18:39:46",
   "depth": 5,
   "text": "I suppose it really depends on how you weight music, or visuals, or voice acting, or the writing, on how a scene feels.\n\nI don't particularly care about voice acting or visuals, but music is something that will heavily resonate with me.\n\nI can't remember the lines from scenes I would consider epic, but I always remember the music."
  },
  {
   "score": 1,
   "id": "dgmowo1",
   "pid": "t1_dgm1irm",
   "date": "2017-04-22 21:11:50",
   "depth": 5,
   "text": "Then there's unicorn. God the soundtrack fits so perfectly "
  },
  {
   "score": 4,
   "id": "dgm8msw",
   "pid": "t1_dgm1irm",
   "date": "2017-04-22 14:39:53",
   "depth": 5,
   "text": "> They. Are. LOUD. And they steal the show. They distract from the scene, instead of complementing it.\n\nIt was *really* obnoxious in Aldnoah.Zero. Especially in season 2 when the same song was reused about 4 or 5 times."
  },
  {
   "score": 4,
   "id": "dgm1kvj",
   "pid": "t1_dgm1irm",
   "date": "2017-04-22 12:02:32",
   "depth": 5,
   "text": "> They distract from the scene, instead of complementing it\n\nYeah I've never been a fan of visuals or OST that end up doing that for me personally :/"
  },
  {
   "score": 10,
   "id": "dgmdo8z",
   "pid": "t1_dgm1irm",
   "date": "2017-04-22 16:36:43",
   "depth": 5,
   "text": "In a way it reminds me of Hans Zimmer. It's mellow until it hits a critical moment and hits you with horns blasting at max volume, I think it really adds to how epic a scene feels, notable in movies like Inception and Interstellar."
  },
  {
   "score": 12,
   "id": "dgm6taj",
   "pid": "t1_dgm1irm",
   "date": "2017-04-22 13:59:59",
   "depth": 5,
   "text": "I find that his music compliments most of his works (especially AoT and A:Z)\n\nIt was a little overboard for that first fight here, but it suited the last one perfectly."
  },
  {
   "score": 49,
   "id": "dgm1ztm",
   "pid": "t1_dgm182g",
   "date": "2017-04-22 12:12:06",
   "depth": 4,
   "text": "I see what you mean. The main battle theme does feel too epic \nto be used for every fight. But as CheesewithWhine states, that is Sawano. His epicness hits hard and makes for AMAZING scenes, as in episode 2. His music drives home the feeling of the scene, danger, duty, fear, and even the aura and individual quirkiness of the characters. But it can detract at times, especially when he uses lyrics for almost every song. Overall I love that hard hitting music, but can I understand what you are saying."
  },
  {
   "score": 9,
   "id": "dgm2tso",
   "pid": "t1_dgm1ztm",
   "date": "2017-04-22 12:31:02",
   "depth": 5,
   "text": "> His music drives home the feeling of the scene, danger, duty, fear, and even the aura and individual quirkiness of the characters.\n\nBut the first episode and the last one they were used in fights that barely had any of that. They were with characters we didn't know and almost no sense of fear or danger..."
  },
  {
   "score": 10,
   "id": "dgm3q03",
   "pid": "t1_dgm2tso",
   "date": "2017-04-22 12:51:12",
   "depth": 6,
   "text": "hmm...I see your point. We barely know the characters at all. So the issue might not be with the how the music is used, but the music itself trying to carry emotions that just are not there?"
  },
  {
   "score": 7,
   "id": "dgm3rbp",
   "pid": "t1_dgm3q03",
   "date": "2017-04-22 12:52:03",
   "depth": 7,
   "text": "Pretty much, like if the same music was used later on with more stakes on the line I'd be all for it! "
  },
  {
   "score": 1,
   "id": "dgm44ql",
   "pid": "t1_dgm3rbp",
   "date": "2017-04-22 13:00:22",
   "depth": 8,
   "text": "Nice. Thanks for the great discussion! It really helps me better understand what I love and dislike about shows, music, and how they work and don't together."
  },
  {
   "score": 72,
   "id": "dgm1eyh",
   "pid": "t1_dgm182g",
   "date": "2017-04-22 11:58:45",
   "depth": 4,
   "text": "I almost feel like it's doing it on purpose to be as anime as possible with it's delivery. Though I feel like I'm not entirely sure what's trying to be meta and what's just poorly handled. "
  },
  {
   "score": 132,
   "id": "dgm4zzs",
   "pid": "t1_dglyic3",
   "date": "2017-04-22 13:19:57",
   "depth": 2,
   "text": "Can't believe they used Sawano's over-the-top music for comedic effect that actually worked.\n\nThere is a god after all."
  },
  {
   "score": 234,
   "id": "dgm1bs6",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:56:43",
   "depth": 0,
   "text": "I still want to see the characters react to finding their own doujinshis."
  },
  {
   "score": 2,
   "id": "dgmi2df",
   "pid": "t1_dgm1bs6",
   "date": "2017-04-22 18:24:35",
   "depth": 1,
   "text": "What do you think that book was that MC wouldn't let them look at it?"
  },
  {
   "score": 1,
   "id": "dgqzlr9",
   "pid": "t1_dgmi2df",
   "date": "2017-04-25 15:30:41",
   "depth": 2,
   "text": "the book that has the MC of the world of the character with the military costume. she said his/her name at the end of the ep. Setsuna i think."
  },
  {
   "score": 4,
   "id": "dgmi9eh",
   "pid": "t1_dgm1bs6",
   "date": "2017-04-22 18:29:31",
   "depth": 1,
   "text": "[Ship Happens](https://www.youtube.com/watch?v=nCeFbK-WEVE) "
  },
  {
   "score": 57,
   "id": "dgmgabn",
   "pid": "t1_dgm1bs6",
   "date": "2017-04-22 17:40:28",
   "depth": 1,
   "text": "Agreed. I need it to be Mamika (because she's so pure and would freak out if she saw one) and Meteora (just to see her deadpan reaction and logical assessment of it. Can't you just see her calmy reacting to seeing herself violated by an orc?)."
  },
  {
   "score": 45,
   "id": "dgmvkgl",
   "pid": "t1_dgmgabn",
   "date": "2017-04-23 01:06:21",
   "depth": 2,
   "text": "If Mamika read a doujinshi of herself that would break her already fragile mind, convince her that this world is evil, and proceed to rain death and destruction on everyone.\n\nMeteora would probably blush a bit and say that there are people from this world who desire her and this is the only way they can achieve this form of pleasure with her. But she'll definitely call them perverts after seeing this."
  },
  {
   "score": 100,
   "id": "dgm5i2d",
   "pid": "t1_dgm1bs6",
   "date": "2017-04-22 13:31:16",
   "depth": 1,
   "text": "We still have 19 episodes left, don't lose hope!"
  },
  {
   "score": 115,
   "id": "dgm5x51",
   "pid": "t1_dgm5i2d",
   "date": "2017-04-22 13:40:32",
   "depth": 2,
   "text": "wait what it's 22 eps?\n\nlet's go baby"
  },
  {
   "score": 40,
   "id": "dgm63kw",
   "pid": "t1_dgm5x51",
   "date": "2017-04-22 13:44:30",
   "depth": 3,
   "text": "At least according to MAL."
  },
  {
   "score": 194,
   "id": "dglynav",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:56:39",
   "depth": 0,
   "text": "If Selesia came from the anime, and doesn't know the plot about the next book, it makes sense that the drawing didn't work, right?\n\nThat aside, this episode did a good job illustrating the rrlationship and feelings of the created and creators toward eachother."
  },
  {
   "score": 1,
   "id": "dh83mno",
   "pid": "t1_dglynav",
   "date": "2017-05-06 16:48:49",
   "depth": 1,
   "text": "No, it didn't work because they need to put it online for the fans to see. If they love it, she will be able to use it."
  },
  {
   "score": 1,
   "id": "dgmfih3",
   "pid": "t1_dglynav",
   "date": "2017-04-22 17:21:23",
   "depth": 1,
   "text": "I tought about something after Selesia got spoiled about her own future and when Souta said that she came from the anime.\n\nThey tried changing the source material, but since Selesia comes from the anime version, wouldn't it mean that they need to change the anime script instead of the novel? Also, i'm guessing that the changes need to be published as official material so that they take effect."
  },
  {
   "score": 27,
   "id": "dgmi535",
   "pid": "t1_dglynav",
   "date": "2017-04-22 18:26:26",
   "depth": 1,
   "text": "> If Selesia came from the anime, and doesn't know the plot about the next book, it makes sense that the drawing didn't work, right?\n\nIt's not necessarily that she \"came from the anime.\" As they said, she might just \"come from the most well-known information.\" Presumably, the anime is what's more well-known, but it's possible that there are general things about her from the LNs that have been distributed even among anime-only fans. (For instance, if Kirito - SAO - were to appear in that world, he might not have any idea what Alicization means or entails, but he would likely recognize the term as relevant at the very least.)\n\nBut yeah, given that she only knows the most commonly-known information, it's reasonable that nothing that's not commonly-known would make its way into character alterations. "
  },
  {
   "score": 1,
   "id": "dgmw2ry",
   "pid": "t1_dgmi535",
   "date": "2017-04-23 01:32:05",
   "depth": 2,
   "text": "In theory, couldn't Selasia's simply give her a bunch of OP powers and make her invincible in the read world? "
  },
  {
   "score": 11,
   "id": "dgmq459",
   "pid": "t1_dgmi535",
   "date": "2017-04-22 21:45:07",
   "depth": 2,
   "text": "Yeah I just assume that it was the anime because shota was watching the anime when it happened, and that's what they suggested. \nI hope they [and think they will] figure out a way to rewrite the characters, it would introduce a conflict of sorts in how the created want to be written vs how the creators write, considering the created want to live normal lives but that doesn't match what the creators do for a living, and such."
  },
  {
   "score": 16,
   "id": "dgn3ww2",
   "pid": "t1_dgmq459",
   "date": "2017-04-23 07:13:18",
   "depth": 3,
   "text": "We actually saw a bit about that already. Celestia complains to her writer because she's not an overpowered Mary Sue that could do everything. That bit was really amusing. "
  },
  {
   "score": 4,
   "id": "dgn8371",
   "pid": "t1_dgn3ww2",
   "date": "2017-04-23 08:57:49",
   "depth": 4,
   "text": "Right yeah, that part does that. It must suck being a character who has to suffer for the entertainment of others"
  },
  {
   "score": 6,
   "id": "dgn9gjd",
   "pid": "t1_dgn8371",
   "date": "2017-04-23 09:28:25",
   "depth": 5,
   "text": "Totally. \n\nWe do need more of those moments, though. Celestia's reaction to the spoilers was a missed opportunity for this. Her reaction was way too *reader-like*. I mean, Celestia's reaction should have more emotion to it than just an \"Eh~~~!\""
  },
  {
   "score": 2,
   "id": "dgn9jyy",
   "pid": "t1_dgn9gjd",
   "date": "2017-04-23 09:30:35",
   "depth": 6,
   "text": "yeah they coulda put more grief and stuff into that scene cause her life is just a pre written story with which she has no control, but I'm sure they'll get to that."
  },
  {
   "score": 101,
   "id": "dglz8sa",
   "pid": "t1_dglynav",
   "date": "2017-04-22 11:09:37",
   "depth": 1,
   "text": "yeah, that also annoyed me. First, they say that she obviously won't know things that didn't happen in the anime yet, then they try to add things to the source material to change her."
  },
  {
   "score": 1,
   "id": "dh8fnty",
   "pid": "t1_dglz8sa",
   "date": "2017-05-06 22:16:15",
   "depth": 2,
   "text": "It was worth a try though, they obviously don't know if it would work or not, so why not test it out? Furthermore, they just found out that Selestia's version is the one from the anime when her author was already writing."
  },
  {
   "score": 7,
   "id": "dgn51v2",
   "pid": "t1_dglz8sa",
   "date": "2017-04-23 07:44:19",
   "depth": 2,
   "text": "They said they are doing a \"revision\" meaning they are adding a skill she already knows. Aka. Change her past.\n\n"
  },
  {
   "score": 23,
   "id": "dgm4oem",
   "pid": "t1_dglz8sa",
   "date": "2017-04-22 13:12:43",
   "depth": 2,
   "text": "Well they didn't even really add it to the source material, they just drafted something, it wasn't officially added/published, so theres that.\n\nThey were just trying something, they were already half way through might as well finish it"
  },
  {
   "score": 45,
   "id": "dgm3r0h",
   "pid": "t1_dglz8sa",
   "date": "2017-04-22 12:51:51",
   "depth": 2,
   "text": "They would just have to place the new sidestory properly in her timeline, before or during the events of the anime, to fix this issue. Although, it's not clear what happens to details that are in the LN but omitted in the anime or anime-original. They could have checked that."
  },
  {
   "score": 2,
   "id": "dgn3q0d",
   "pid": "t1_dgm3r0h",
   "date": "2017-04-23 07:07:50",
   "depth": 3,
   "text": "This is something that I was also wondering about. I hope they explain how different versions of a \"story\" that have had varying details changed affect the created's world, character, etc."
  },
  {
   "score": 30,
   "id": "dgmt1mq",
   "pid": "t1_dgm3r0h",
   "date": "2017-04-22 23:17:00",
   "depth": 3,
   "text": "They could have asked her for a memory from a time period the author hasn't written about or developed. In fact probably only a few dozen days of her life have been fleshed out and put into the story.\nSo it would be interesting to know if she has memories of events that aren't in the source material. "
  },
  {
   "score": 121,
   "id": "dglys0w",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:59:23",
   "depth": 0,
   "text": "Can someone please explain to me how the hell the people translating this series managed to take one of the in-universe fictional stories that has an *english title* and change it to something *completely different*? How do they get \"Exclusive Underground\" out of the characters *very clearly* saying \"Underground Dark Night\"?"
  },
  {
   "score": 30,
   "id": "dgmfz54",
   "pid": "t1_dglys0w",
   "date": "2017-04-22 17:32:37",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 25,
   "id": "dgml84s",
   "pid": "t1_dgmfz54",
   "date": "2017-04-22 19:41:26",
   "depth": 2,
   "text": "ive been thinking that it would be hilarious for say an American who is a native English speaker, to be a character who is in one of those trapped in a videogame manga/anime/lightnovel. \n\nhis class uses magic, and the magic language is supposed to be english, but its actually ingrish. if he says \"cast fireball\" nothing happens he has to say it as \"casuto farebaru\" or whatever. it would be best if this drove him mad. "
  },
  {
   "score": 40,
   "id": "dgmua1a",
   "pid": "t1_dglys0w",
   "date": "2017-04-23 00:06:42",
   "depth": 1,
   "text": ">Amazon grabbing every show\n\n>doesn't have proper translation\n\nThey did this shit with Shingeki no Bahamut too. In the anime Baccus says that only Gods can grant Bounty Hunter Bracelets but the Amazon subs says \"Only Gods can WEAR Bounty Hunter Bracelets\". And they wonder why people won't pay for their service.\n"
  },
  {
   "score": 55,
   "id": "dgmij1b",
   "pid": "t1_dglys0w",
   "date": "2017-04-22 18:36:14",
   "depth": 1,
   "text": "IDK. Last week they translated \"nee-san\" as \"little girl.\""
  },
  {
   "score": 32,
   "id": "dgmj8w2",
   "pid": "t1_dgmij1b",
   "date": "2017-04-22 18:53:58",
   "depth": 2,
   "text": "That's pretty bad, but at least it's not as bad as when Crunchyroll's subs of Nogizaka Haruka no Himitsu Purezza translated \"onii-chan\" as \"cute boy\"."
  },
  {
   "score": 5,
   "id": "dgmqu23",
   "pid": "t1_dgmj8w2",
   "date": "2017-04-22 22:05:43",
   "depth": 3,
   "text": "I'm just surprised to see that show mentioned anywhere. I watched it on a whim and haven't met anyone else who has seen it since."
  },
  {
   "score": 177,
   "id": "dglyxp7",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:02:48",
   "depth": 0,
   "text": "One detail I loved is when Selesia mentioned that she can smell more in this world. That adds up because in a novel/anime, smell is the sense that is usually least relevant to a scene/narrative. Also loved how the music and animation picked up as she prepped her attack only for it to all lead to nothing."
  },
  {
   "score": 3,
   "id": "dgmoxsh",
   "pid": "t1_dglyxp7",
   "date": "2017-04-22 21:12:41",
   "depth": 1,
   "text": "I'd bet all my donuts later on in the series this move will come back at just the critical time. "
  },
  {
   "score": 22,
   "id": "dgqnbc9",
   "pid": "t1_dglyxp7",
   "date": "2017-04-25 11:42:52",
   "depth": 1,
   "text": "I'd love to see a Game of Thrones character come to the real world and comment on how everything is tasteless and nothing seems to dribble down their chin.\n\n/r/asoiaf "
  },
  {
   "score": 74,
   "id": "dgmi0aa",
   "pid": "t1_dglyxp7",
   "date": "2017-04-22 18:23:10",
   "depth": 1,
   "text": "-nods- Hearing this line made me really think \"I need to include the sense of smell (and taste really) into my stories more.\""
  },
  {
   "score": 14,
   "id": "dguuajk",
   "pid": "t1_dgmi0aa",
   "date": "2017-04-27 21:23:37",
   "depth": 2,
   "text": "Go all GRRM on your food descriptions.\n\nMan I hope no GRRM characters come to life or this is gonna get real depressing real quick."
  },
  {
   "score": 1,
   "id": "dgv6bbz",
   "pid": "t1_dguuajk",
   "date": "2017-04-28 06:52:37",
   "depth": 3,
   "text": "GRRM?"
  },
  {
   "score": 4,
   "id": "dgv6d8o",
   "pid": "t1_dgv6bbz",
   "date": "2017-04-28 06:53:43",
   "depth": 4,
   "text": "George R.R. Martin, author of *A Game of Thrones, Windhaven, Tuf Voyaging, etc.*"
  },
  {
   "score": 1,
   "id": "dgv73c6",
   "pid": "t1_dgv6d8o",
   "date": "2017-04-28 07:08:27",
   "depth": 5,
   "text": "Ah."
  },
  {
   "score": 238,
   "id": "dglt488",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 08:51:14",
   "depth": 0,
   "text": "The interaction between Selesia & her Creator was short yet effective. Can't state enough how refreshing it is for them to be taking this existential crisis so calmly...I mean, they're spoiling their own MC! This concept is awesome.\n\n- So the character that rescued Mamika looks kinda like *Saber* but she's *riding* a horse and has a *lance*. I shall now call her Sander.\n\n- Illustrator-chan a cute. And now Best Girl, by offering Selesia & Meteora a place to stay. Wonder how this will affect MC-kun since they're carrying the show instead of him...\n\n- Got some more insight into ~~Nobu~~ Chuuni-chan at the end there. So it seems she's fueled by some revenge plot. Can't wait to learn more.\n\nThis show is either gonna be the best of the season or crash horribly. But I'm loving it so much right now."
  },
  {
   "score": 0,
   "id": "dgma4lm",
   "pid": "t1_dglt488",
   "date": "2017-04-22 15:13:33",
   "depth": 1,
   "text": "> Sander\n\nShould have been president."
  },
  {
   "score": 1,
   "id": "dgn5sn6",
   "pid": "t1_dglt488",
   "date": "2017-04-23 08:03:23",
   "depth": 1,
   "text": "> Sander\n\n[Manly](https://i.ytimg.com/vi/JzLggG1llio/maxresdefault.jpg)"
  },
  {
   "score": 3,
   "id": "dgm4ypy",
   "pid": "t1_dglt488",
   "date": "2017-04-22 13:19:07",
   "depth": 1,
   "text": "Pls no \"Sander\" name. Since its a really common boys name inn Scandinavia (My name is Sander). It's also used inn English even with \"Belt Sander\". I dont think she would sand anything tho."
  },
  {
   "score": 1,
   "id": "dgn42lj",
   "pid": "t1_dgm4ypy",
   "date": "2017-04-23 07:17:45",
   "depth": 2,
   "text": "Not just Scandinavia. I cringed reading my first name."
  },
  {
   "score": 5,
   "id": "dgm8z2b",
   "pid": "t1_dglt488",
   "date": "2017-04-22 14:47:25",
   "depth": 1,
   "text": "After the ending I am almost 100% sure that the MC dude at some point spawn a creation into the world. In ep 1 Selesia is about to look in a file he assumedly drew but he snatched it beforehand and the fact that he 'used to draw', should be pretty big hints. Maybe the character that was banished from the world?"
  },
  {
   "score": 2,
   "id": "dgndnvi",
   "pid": "t1_dgm8z2b",
   "date": "2017-04-23 10:59:34",
   "depth": 2,
   "text": "Well, Nobu is also a character of his, isn't she ? (Either he already created her world and that's the file he was hiding, or those were some sketches that will in future turn into the work where she is a character)"
  },
  {
   "score": 1,
   "id": "dgndtog",
   "pid": "t1_dgndnvi",
   "date": "2017-04-23 11:02:56",
   "depth": 3,
   "text": "He already saw her though and didn't react in any particular way. The other option would fucks up the time continuum in my head."
  },
  {
   "score": 1,
   "id": "dgndw4i",
   "pid": "t1_dgndtog",
   "date": "2017-04-23 11:04:20",
   "depth": 4,
   "text": "That's why I thought that he will just do so in the future. But he might have some early sketches or something that might bear some resemblance ... or maybe he does have that friend of hers sketched."
  },
  {
   "score": 4,
   "id": "dgm2qni",
   "pid": "t1_dglt488",
   "date": "2017-04-22 12:29:00",
   "depth": 1,
   "text": "So the main dude does have a connection with Gunpuku (Nobu). This is turning pretty interesting yes. I mean, the way Gunpuku was talking about made it look like it is indeed some kind of revenge plot, but maybe it is for her friend that died, not her creator, neither a person of the world of the Gods, but another character that was with her in her story. \n\nWho knows, maybe her friend is the one that crossed first to the world of the Gods, and then commited suicide thanks to an existential crisis... Or maybe that boy killed her in his story while throwing a tantrum because reason. \n\nIt is indeed pretty interesting to watch."
  },
  {
   "score": 2,
   "id": "dgo9tll",
   "pid": "t1_dgm2qni",
   "date": "2017-04-23 23:31:46",
   "depth": 2,
   "text": "> urning pretty interestin\n\nMy thoughts is that Soto created the world when he was drawing, and when he stopped the world ceased to exist. He created both, or one of the two and they blame him for giving up his art. "
  },
  {
   "score": 2,
   "id": "dgoilbb",
   "pid": "t1_dgo9tll",
   "date": "2017-04-24 05:55:00",
   "depth": 3,
   "text": "I think it is something along these lines. I feel though that maybe the world does continue to exist once it is created. \n\nNow, this posits a interesting question, since if Gunpuku is indeed alive but her creator/Souta isn't recognized as much as Selesia's, for example, then the requirements for changing or upgrading the characters can't be that said changes are known to the general public and accepted as canon. I mean, if it was the case, then Gunpuku should be a character well known, but nowhere we see her in the advertisements placements, neither in other places. "
  },
  {
   "score": 3,
   "id": "dgm2jhe",
   "pid": "t1_dglt488",
   "date": "2017-04-22 12:24:23",
   "depth": 1,
   "text": "> Illustrator-chan a cute. And now Best Girl\n\nYes, yes indeed. "
  },
  {
   "score": 3,
   "id": "dgndgg7",
   "pid": "t1_dgm2jhe",
   "date": "2017-04-23 10:55:13",
   "depth": 2,
   "text": "For now I'd say 2nd to Meteora, but we will see."
  },
  {
   "score": 1,
   "id": "dgnfdk3",
   "pid": "t1_dgndgg7",
   "date": "2017-04-23 11:36:10",
   "depth": 3,
   "text": "Cone-chan lacks glasses, the subtle thiccness, and the super comfy look of Illustrator-chan. \n\nMy god, I think Marine is even wearing leggings under her skirt. \n\nI tried to google cone shaped trashcans for Meteora, but there simply weren't any right side up. \n\n<3\n\nedit: Since I couldn't find one, I made my own. I present to you, [Traffic Cone-chan](http://i.imgur.com/R0wmIVT.jpg)."
  },
  {
   "score": 23,
   "id": "dglyt6e",
   "pid": "t1_dglt488",
   "date": "2017-04-22 11:00:03",
   "depth": 1,
   "text": "> they're spoiling their own MC!\n\nWelp, we need to go for an anime-original adaptation now..."
  },
  {
   "score": 102,
   "id": "dglw382",
   "pid": "t1_dglt488",
   "date": "2017-04-22 10:00:28",
   "depth": 1,
   "text": ">So the character that rescued Mamika looks kinda like Saber but she's riding a horse and has a lance. I shall now call her Sander.\n\n[A Lancer version of Saibah/Artoria](http://fategrandorder.wikia.com/wiki/Artoria_Pendragon_\\(Lancer\\)) was added in the Fate phone game. She uses a lance and rides a horse that can kinda fly. My favorite nickname for her is Lartoria.\n\nAs far as I can tell, so far we have:\n\n* Selesia: Saber, but would have explicitly been more powerful summoned as a Rider\n\n* Meteora: Caster, no other class fits\n\n* Alicetelia: Lancer, using the precedence of mounted lance wielders still being Lancers instead of Riders\n\n* Military Uniform Chuuni: Archer, she's pretty much Gilgamesh + Nobu, and continues the classic tradition of Archers launching waves of swords at people. She also fills the Gilgamesh role of OP antagonist who at least acts like she knows more than everyone else\n\n* Yuuya: Berserker, though probably with a low rank of Mad Enhancement, like E-Rank maybe\n\n* Mamika: This ones hard because we already have a Caster which is where Magical Girls would normally fit in, she doesn't really fit any of the extra classes either, I could see an argument for Archer though, and just assume that Military Chuuni is like Gil in S/N and doesn't count towards the base class count"
  },
  {
   "score": 1,
   "id": "dguuc1s",
   "pid": "t1_dglw382",
   "date": "2017-04-27 21:24:41",
   "depth": 2,
   "text": "> A Lancer version of Saibah/Artoria was added in the Fate phone game.\n\nIt makes me super sad that the more powerfull she is the less clothes she wears, because the full armor looks BADASS."
  },
  {
   "score": 6,
   "id": "dglwu0q",
   "pid": "t1_dglw382",
   "date": "2017-04-22 10:16:48",
   "depth": 2,
   "text": "Ahhh F/GO...I should get back into that game.\n\nThat's a nice comparison list. The old guy (who hasn't appeared yet) might end up being Assassin-like and the Mecha pilot is clearly a Rider as well. I'd just repeat Class & make Mamika a Caster too...which begs the question, will they both survive?"
  },
  {
   "score": 7,
   "id": "dglxsxq",
   "pid": "t1_dglwu0q",
   "date": "2017-04-22 10:38:20",
   "depth": 3,
   "text": "Once you have tasted the salt of the gacha you can never go back. \n\nThe upcoming event is a Fate/Extra CCC collab with a BB welfare. "
  },
  {
   "score": 27,
   "id": "dglxrsy",
   "pid": "t1_dglwu0q",
   "date": "2017-04-22 10:37:38",
   "depth": 3,
   "text": "Don't get back into it, they're going to bring it over in English! (Sadly you **cannot** transfer saves from the Japanese version)"
  },
  {
   "score": 3,
   "id": "dglz2e4",
   "pid": "t1_dglxrsy",
   "date": "2017-04-22 11:05:41",
   "depth": 4,
   "text": "Do you know when? Also proof if i may ask?"
  },
  {
   "score": 7,
   "id": "dglzang",
   "pid": "t1_dglz2e4",
   "date": "2017-04-22 11:10:45",
   "depth": 5,
   "text": "Here ya go https://www.youtube.com/watch?v=WMx3LY-ZMXs"
  },
  {
   "score": 1,
   "id": "dgml5y9",
   "pid": "t1_dglzang",
   "date": "2017-04-22 19:40:05",
   "depth": 6,
   "text": "Greeat, thanks!"
  },
  {
   "score": 16,
   "id": "dglza41",
   "pid": "t1_dglz2e4",
   "date": "2017-04-22 11:10:25",
   "depth": 5,
   "text": "Here's the official site [http://fate-go.us/](http://fate-go.us/)\n\nOne thing to note, is that like the Chinese server, it will begin at the \"start\" and only release events and servants that the original server has already gone through/released over time. Good and bad from that in my opinion. I think they do it at an accelerated pace though, so it should catch up to the Japanese server eventually.\n"
  },
  {
   "score": 2,
   "id": "dgm4iw8",
   "pid": "t1_dglza41",
   "date": "2017-04-22 13:09:09",
   "depth": 6,
   "text": "You can have a website, but have it never released... like PSO2!! "
  },
  {
   "score": 1,
   "id": "dgmedrq",
   "pid": "t1_dgm4iw8",
   "date": "2017-04-22 16:53:36",
   "depth": 7,
   "text": ">PSO2\n\n>western release\n\n>Sega why"
  },
  {
   "score": 2,
   "id": "dgml6ji",
   "pid": "t1_dglza41",
   "date": "2017-04-22 19:40:27",
   "depth": 6,
   "text": "Thanks! Can't wait to play it!"
  },
  {
   "score": 6,
   "id": "dgmhfl9",
   "pid": "t1_dglza41",
   "date": "2017-04-22 18:08:57",
   "depth": 6,
   "text": "Holy shit the completionists are going to die if they plan on going in hot to catch up to the Japanese version. That or they'll have to water down the amount of grinding needed to complete an event."
  },
  {
   "score": 6,
   "id": "dgm1g4z",
   "pid": "t1_dglw382",
   "date": "2017-04-22 11:59:30",
   "depth": 2,
   "text": "Yuuya reminds me of Kintoki, with the shades and outfit. "
  },
  {
   "score": 33,
   "id": "dgm1ayx",
   "pid": "t1_dglw382",
   "date": "2017-04-22 11:56:13",
   "depth": 2,
   "text": "\n1. Celestia: Saber\n2. Meteora: Caster (Caster Gilgamesh)\n3. Yuuya: Berserker / Stand user\n4. Mamika: Kaleid Liner\n5. Alicetelia: Lancer (FGO Lancer Arturia)\n6. Mecha pilot: Rider\n7. Detective jiji: Archer\n8. Masked schoolgirl: Assassin\n9. Military uniform princess: Archer/Nyobu ( from previous war)"
  },
  {
   "score": 152,
   "id": "dgltrzc",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 09:07:09",
   "depth": 0,
   "text": "[This guy has one hell of a waist](http://i.imgur.com/nwnrcmg.jpg)\n\n[Also Ying-Yang](http://i.imgur.com/HstizFr.png)"
  },
  {
   "score": 2,
   "id": "dguuitx",
   "pid": "t1_dgltrzc",
   "date": "2017-04-27 21:29:33",
   "depth": 1,
   "text": "> This guy has one hell of a waist\n\nWell of course, didn't you see his persona?"
  },
  {
   "score": 6,
   "id": "dgm9hrr",
   "pid": "t1_dgltrzc",
   "date": "2017-04-22 14:59:03",
   "depth": 1,
   "text": ">Ying-Yang\n\nGATTAI DA!!!"
  },
  {
   "score": 1,
   "id": "dgne21f",
   "pid": "t1_dgm9hrr",
   "date": "2017-04-23 11:07:46",
   "depth": 2,
   "text": "I ship it.  \nOr maybe him with Meteora ? Hmmmm."
  },
  {
   "score": 68,
   "id": "dgm175t",
   "pid": "t1_dgltrzc",
   "date": "2017-04-22 11:53:49",
   "depth": 1,
   "text": "He looks like a Code Geass or Cowboy Bebop character.\n\nSunrise with the top-notch character designs :)"
  },
  {
   "score": 19,
   "id": "dgmp77v",
   "pid": "t1_dgm175t",
   "date": "2017-04-22 21:20:04",
   "depth": 2,
   "text": ">Sunrise with the top-notch character designs :)\n\nCowboy Bebop: Sunrise\n\nCode Geass: ~~Sunrise~~ Clamp\n\nRe Creators: Troyca\n\nYou made it sound like it was made by sunrise. I guess you really like sunrise, so I don't blame you."
  },
  {
   "score": 14,
   "id": "dgms2hd",
   "pid": "t1_dgmp77v",
   "date": "2017-04-22 22:42:22",
   "depth": 3,
   "text": "Code Geass character designs were actually done by Clamp though"
  },
  {
   "score": 1,
   "id": "dguujft",
   "pid": "t1_dgms2hd",
   "date": "2017-04-27 21:30:02",
   "depth": 4,
   "text": "Well that explains the legs."
  },
  {
   "score": 3,
   "id": "dgms75u",
   "pid": "t1_dgms2hd",
   "date": "2017-04-22 22:46:43",
   "depth": 4,
   "text": "Okay, thanks.\n\nI'll change it, but it makes his comment even more awkward now."
  },
  {
   "score": 56,
   "id": "dgm2w62",
   "pid": "t1_dgltrzc",
   "date": "2017-04-22 12:32:30",
   "depth": 1,
   "text": "> Also Ying-Yang\n\nGood catch. I didn't notice that at all!"
  },
  {
   "score": 137,
   "id": "dglxlwq",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:33:59",
   "depth": 0,
   "text": "Wait... So if popularity determine whether the character will materialize in the real world, how come my waifu isn't materialized yet?!? /s\n\ninb4 someone say my waifu is trash"
  },
  {
   "score": 1,
   "id": "dgm9n7b",
   "pid": "t1_dglxlwq",
   "date": "2017-04-22 15:02:31",
   "depth": 1,
   "text": "Because she needs to leave an impression and your waifu is generic trash that's easily forgetable."
  },
  {
   "score": 13,
   "id": "dglzctc",
   "pid": "t1_dglxlwq",
   "date": "2017-04-22 11:12:02",
   "depth": 1,
   "text": "It's not like being trash prevents her from being popular."
  },
  {
   "score": 0,
   "id": "dgm9wwa",
   "pid": "t1_dglzctc",
   "date": "2017-04-22 15:08:39",
   "depth": 2,
   "text": "explains kurisu."
  },
  {
   "score": 27,
   "id": "dglz9dz",
   "pid": "t1_dglxlwq",
   "date": "2017-04-22 11:09:59",
   "depth": 1,
   "text": "clearly you need to fap to her more."
  },
  {
   "score": 1,
   "id": "di7rkd1",
   "pid": "t1_dglz9dz",
   "date": "2017-05-29 22:23:11",
   "depth": 2,
   "text": "I'm JUST ONE MAN "
  },
  {
   "score": 144,
   "id": "dglz0ct",
   "pid": "t1_dglxlwq",
   "date": "2017-04-22 11:04:26",
   "depth": 1,
   "text": "it's because your waifu is trash"
  },
  {
   "score": 86,
   "id": "dgm1c7h",
   "pid": "t1_dglz0ct",
   "date": "2017-04-22 11:56:59",
   "depth": 2,
   "text": "[U wot m8](http://i.imgur.com/hq9PzDy.gif)"
  },
  {
   "score": 1,
   "id": "dgmostk",
   "pid": "t1_dgm1c7h",
   "date": "2017-04-22 21:08:49",
   "depth": 3,
   "text": "What was the actual context of this scene, I forgot"
  },
  {
   "score": 2,
   "id": "dgov36c",
   "pid": "t1_dgmostk",
   "date": "2017-04-24 10:07:01",
   "depth": 4,
   "text": "[Love Live](/s \"I'm pretty sure it was when Honoka said she wanted to leave the group.\")"
  },
  {
   "score": 6,
   "id": "dgmdu0a",
   "pid": "t1_dgm1c7h",
   "date": "2017-04-22 16:40:38",
   "depth": 3,
   "text": "Show?"
  },
  {
   "score": 1,
   "id": "dgmosf7",
   "pid": "t1_dgmdu0a",
   "date": "2017-04-22 21:08:31",
   "depth": 4,
   "text": "Just in case it wasn't obvious, those aren't the real subtitles"
  },
  {
   "score": 12,
   "id": "dgmennz",
   "pid": "t1_dgmdu0a",
   "date": "2017-04-22 17:00:21",
   "depth": 4,
   "text": "Love Live!\n"
  },
  {
   "score": 1,
   "id": "dgmyokc",
   "pid": "t1_dgmennz",
   "date": "2017-04-23 03:50:40",
   "depth": 5,
   "text": "Good job promoting it. Carry on."
  },
  {
   "score": 131,
   "id": "dgluezp",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 09:22:09",
   "depth": 0,
   "text": "That was a pretty chill episode. So I'm guessing for the changes to affect Selesia the changes needs to be published/aired so that the fans will see and accept it as the new reality. I guess rewriting their powers won't be that easy.\n\nThat goof that Ms Illustrator did by accidentally telling Selesia about her future was pretty funny. A bit sad for Selesia since I'm sure those stuff that she mentioned will probably be a big deal, although that begs the question: If they go back to their own world will they retain those memories? Unless the Creators decide to have them retain those I don't think spoiling them would have any affect at all.\n\nAlso looks like Military Uniform Girl knows Souta, I feel like the thories about him being her creator is starting to sound a lot more plausible."
  },
  {
   "score": 1,
   "id": "dgmhwl1",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 18:20:36",
   "depth": 1,
   "text": "I'm inclined to believe they won't change since they were pulled from a certain point in their show, as evidenced by Selesia not knowing what happens in the book. She is who she was at the time and nothing else.\n\nThen again, it seems like a central premise of the show so this might not true. I'd buy it if they put her back into the anime then pulled her out again, but I'm not sure that would produce the same person a la the star trek teleport effect. They've made a consciousness, can't just kill it off now.\n\n¯\\\\\\_(ツ)_/¯\n\nEDIT: Why is reddit dismembering my shrug guy - sorted"
  },
  {
   "score": 2,
   "id": "dgn06vx",
   "pid": "t1_dgmhwl1",
   "date": "2017-04-23 05:03:14",
   "depth": 2,
   "text": "You need to have three slashes for it to work. So type:\n\n    ¯\\\\\\_(ツ)_/¯  \n  \nTo see ¯\\\\\\_(ツ)_/¯  "
  },
  {
   "score": 1,
   "id": "dgnniiu",
   "pid": "t1_dgn06vx",
   "date": "2017-04-23 14:17:42",
   "depth": 3,
   "text": "Thanks!"
  },
  {
   "score": 1,
   "id": "dgmg4wv",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 17:36:40",
   "depth": 1,
   "text": "> So I'm guessing for the changes to affect Selesia the changes needs to be published/aired so that the fans will see and accept it as the new reality\n\nThis was the first thing I assumed after the author giving her the power to use a fire spell didn't work. I wonder if it'd be possible to give the created powers just by doing a short show? Like, instead of trying to add new content onto the existing story, maybe they can just create a short preview of a future OVA showing Selesia being able to use the fire spell."
  },
  {
   "score": 1,
   "id": "dgmw8gu",
   "pid": "t1_dgmg4wv",
   "date": "2017-04-23 01:40:04",
   "depth": 2,
   "text": "If the creator can give her any power he wanted, why not simply make her invincible?"
  },
  {
   "score": 1,
   "id": "dgm75mf",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 14:07:24",
   "depth": 1,
   "text": "I'm pretty sure the artist only had to publish her drawing on some social network and wait a few hours for the effect to works.\n\nObviously the biggest issue here is what the author can do without the company's authorization."
  },
  {
   "score": 2,
   "id": "dgm6dx9",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 13:50:42",
   "depth": 1,
   "text": "I don't think this anime will be about memories and changing storylines (12 Monkey solved any interested I had in that type of stories anyway)."
  },
  {
   "score": 9,
   "id": "dgm1d0m",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 11:57:31",
   "depth": 1,
   "text": "I think the story is a Paradox of the multiverse. In string theory one theory was that our universe is basically a hologram and this applies to the characters worlds. Each a universe projected from our earth (prime).\n\nI think Military Uniform Princess comes from the realm of Pixiv and crossover fanfiction. Her creator Setsuna created her to be someone with the power to travel between different series and worlds (like Kamen rider Decade) She tried to bring this series to public but it was bashed by the industry for being reliant of other creators work and was banished. saddened She committed suicide unknowing that her work resulted in the creation of Military uniform princess(alive). Because she came from cross overs she doesnt have her own world/ home and can only travel between them until she finds our earth prime. Finding out about the world, her fate and her creator she decides to destroy everything.\n\nI think whilst MC's sister wrote the story and the character of Military Uniform Princess. It was the MC himself who drew her/ designed her. Maybe he was young that's why he forgot about his creation or her sister setsuna modified a doodle from her brother into her. I think this is the case since this episode we were introduced to Selestia's drawer. proving that there isn't necessarily only 1 designer/ god for each character.\n\nEdit.: My other theory is more simple. Military Uniform Princess was simply written like that by her creator. Shunned and banished she decided to write a character/ story to channel her inner hate and anger of our world and the industry using one of her brothers designs. But did not know she created Military Uniform Princess (alive) the creator committed suicide. So Military Uniform Princess was designed/ programmed to do what shes doing now."
  },
  {
   "score": 4,
   "id": "dgmljrh",
   "pid": "t1_dgm1d0m",
   "date": "2017-04-22 19:48:58",
   "depth": 2,
   "text": "Onore Decade"
  },
  {
   "score": 4,
   "id": "dgn5mil",
   "pid": "t1_dgmljrh",
   "date": "2017-04-23 07:59:06",
   "depth": 3,
   "text": "**ONORE ~~DECADE~~ DICKEIDOOOOOO!!!!!!**  \nFTFY"
  },
  {
   "score": 5,
   "id": "dglyj7h",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 10:54:23",
   "depth": 1,
   "text": "I was thinking since this Selesia comes from the anime, her character is only up to date with the anime. Maybe if something in the anime changes her, then she'll change too."
  },
  {
   "score": 10,
   "id": "dgm07j0",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 11:31:03",
   "depth": 1,
   "text": ">That was a pretty chill episode. So I'm guessing for the changes to affect Selesia the changes needs to be published/aired so that the fans will see and accept it as the new reality. I guess rewriting their powers won't be that easy.\n\nI'm just imagining them trying to get the internet to come to a unanimous consensus on changing Selesia's powers. Hell would freeze over before we'd agree on anything"
  },
  {
   "score": 12,
   "id": "dgmkdbs",
   "pid": "t1_dgm07j0",
   "date": "2017-04-22 19:21:41",
   "depth": 2,
   "text": "Well if an anime asspulled, usually the worst reaction is \"this is shit, dropped\" or \"she *should* not be able to do this\". Who would say \"this is *false*\"?\n\nYou dislike the change and disagree with it but you subconsciously accept it as fact because hey, the author wrote it, how can it be \"false\"? \n\nMy theory is as long as enough people believe it, even if they hate it, it becomes true. And Word of God is pretty hard to disprove. The hardest part is getting the Word out, past the editors and publishers."
  },
  {
   "score": 3,
   "id": "dgn4dfh",
   "pid": "t1_dgmkdbs",
   "date": "2017-04-23 07:26:08",
   "depth": 3,
   "text": "in the end the Creators aren't exactly just the authors and illustrators, but the collective subconsciousness of the people who watch/read the medium.\n\nI also noticed there was some screens to rankings of some sort, and I feel that it could be related to the suicide at the first episode. IE: Some show bombed so much it slipped down the rankings to below 15 and the author committed suicide over it. This probably sets a baseline as to who gets to the Creator world from what world."
  },
  {
   "score": 13,
   "id": "dgm7ut1",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 14:23:15",
   "depth": 1,
   "text": "I am going to stick with my theory that we are watching an anime as a anime....\n\nI know, weird but hear me out.\n\nIt's very clear that Souta is the creator of Military Uniform Girl, but her refering some other character threw me a bit of a curveball.\n\nMy basic train of thought is that what we are seeing is the finished anime that Souta ends up writing about these events. Souta writing up these events makes Military Uniform Girl become a main character and could make the story popular (covering the 'needs to be popular' requirement). Military Girl brings people to a world where Souta hasn't written her yet in which he gets movitated to write about this.\n\nThis would be basic writing theory for dealing with time travel: For Event B (Military Girl goes to Real World) to happen, Event A (Souta writes about Event B) needs to take place. In order for Event A to happen, Event B needs to take place. And now we have a basic time loop.\n\nNow how do I do the jump from just story to this is a anime about a anime.\n\nIt's pretty much established that popularity needs to be a factor for being able to be send to the real world. Combine that with this likely being a story about Souta using these events to write his own (see time loop), there is a good chance what we are seeing is the finished product that becomes popular in order to enable Event B to be possible.\n\nRegardless of whether this theory turns out to be correct or not, god damn I like this show. There is so much to analyse about writing."
  },
  {
   "score": 9,
   "id": "dgo1ao0",
   "pid": "t1_dgm7ut1",
   "date": "2017-04-23 19:18:46",
   "depth": 2,
   "text": "If we're unsure of the origins of MUP, then there's only one conclusion.\n\nBlack Rock Shooter. Started as a song, given form by a single artist, given life and universe by many creators afterward."
  },
  {
   "score": 19,
   "id": "dglwbvg",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 10:05:34",
   "depth": 1,
   "text": "I bet the finally involves a race against the clock as they try to get a final episode of her show airing which is anime original and gives her some power that she doesn't have in the manga, just so she can use it in a final fight. My prediction would be the power to summon her mech."
  },
  {
   "score": 1,
   "id": "dgoh51j",
   "pid": "t1_dglwbvg",
   "date": "2017-04-24 05:11:22",
   "depth": 2,
   "text": "Hmm, well the moment she arrived was right as the villain \"dispelled\" her mech, so if she gets it back in the next episode, perhaps she'll be able to summon it in the real world?"
  },
  {
   "score": 44,
   "id": "dglz7wv",
   "pid": "t1_dglwbvg",
   "date": "2017-04-22 11:09:05",
   "depth": 2,
   "text": "it'd be a huge fucking shame if they don't bring her mech back."
  },
  {
   "score": 8,
   "id": "dgm1766",
   "pid": "t1_dglz7wv",
   "date": "2017-04-22 11:53:49",
   "depth": 3,
   "text": "Well one of the other characters is from a Mecha anime, it's gonna be an unfair fight if Selesia doesn't get hers."
  },
  {
   "score": 10,
   "id": "dgmcz3l",
   "pid": "t1_dgm1766",
   "date": "2017-04-22 16:19:47",
   "depth": 4,
   "text": "I honestly can't wait to see a big fucking robot appearing out of nowhere"
  },
  {
   "score": 2,
   "id": "dgmlbo1",
   "pid": "t1_dgmcz3l",
   "date": "2017-04-22 19:43:42",
   "depth": 5,
   "text": "I normally don't like mecha anime but this would be so ridiculous and amazing that I really hope this happens."
  },
  {
   "score": 144,
   "id": "dglwbjx",
   "pid": "t1_dgluezp",
   "date": "2017-04-22 10:05:23",
   "depth": 1,
   "text": ">Also looks like Military Uniform Girl knows Souta, I feel like the thories about him being her creator is starting to sound a lot more plausible.\n\nI thought the last scene heavily implied that Military Uniform Girl was created by the girl who committed suicide at the beginning of the show."
  },
  {
   "score": 2,
   "id": "dglxwuz",
   "pid": "t1_dglwbjx",
   "date": "2017-04-22 10:40:46",
   "depth": 2,
   "text": "Both of them I guess? "
  },
  {
   "score": 3,
   "id": "dgnek26",
   "pid": "t1_dglwbjx",
   "date": "2017-04-23 11:18:28",
   "depth": 2,
   "text": "... I really never remember these big scenes at the beginning."
  },
  {
   "score": 8,
   "id": "dgm35pc",
   "pid": "t1_dglwbjx",
   "date": "2017-04-22 12:38:31",
   "depth": 2,
   "text": "I'm starting to think that the girl that committed suicide is probably the author for military princess and Sota who she was friends with drew the character when they were younger."
  },
  {
   "score": 26,
   "id": "dgm2xqj",
   "pid": "t1_dglwbjx",
   "date": "2017-04-22 12:33:29",
   "depth": 2,
   "text": "I see it more like the girl that commited suicide was the first character that crossed worlds, and both that girl and Gunpuku are from a story Souta made but that of course he forgot about (or at least it seems he forgot, maybe he does remember... unless the worlds keep going long after the stories end, which could mean that Gunpuku grew up and Souta doesn't recognizes her thanks to that)."
  },
  {
   "score": 11,
   "id": "dgmqlrl",
   "pid": "t1_dgm2xqj",
   "date": "2017-04-22 21:59:20",
   "depth": 3,
   "text": "I just rewatched episode one and Selesia asked him if he knows who Gun is and he replied with \"I...\" Followed by explosions interrupting the conversation. From what I see, I think he remembers who she is because the girl who died might have been the actual creator in the sense that she created the story for a LN she could be working on and he was just the illustrater she was working with. It would make sense as to why the \"I met Sota\" scene at the end didn't go \"I met my creator\". It's a theory but who knows. "
  },
  {
   "score": 2,
   "id": "dgn4222",
   "pid": "t1_dgmqlrl",
   "date": "2017-04-23 07:17:20",
   "depth": 4,
   "text": "I also think it will go that way. Now, we have 22 episodes of this show, maybe it will pull at least two plot twists that will take the story into an entirely different direction, maybe even having the characters jump between their respective worlds as a team, but most definitively Souta is the artist of Gunpuku."
  },
  {
   "score": 11,
   "id": "dgm3mju",
   "pid": "t1_dgm2xqj",
   "date": "2017-04-22 12:49:09",
   "depth": 3,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dgq22cy",
   "pid": "t1_dgm3mju",
   "date": "2017-04-25 04:29:57",
   "depth": 4,
   "text": "[UBW](/s \"Psst, spoiler tag! That's a pretty big UBW spoiler.\")"
  },
  {
   "score": 1,
   "id": "dgq9ymo",
   "pid": "t1_dgq22cy",
   "date": "2017-04-25 07:44:49",
   "depth": 5,
   "text": "UBW anime is 3 years old and the movie is 7.  Hell, the Fate mobile game doesn't even call home NAMELESS like in other fate works."
  },
  {
   "score": 11,
   "id": "dgm3z4q",
   "pid": "t1_dgm3mju",
   "date": "2017-04-22 12:56:56",
   "depth": 4,
   "text": "Could be. There's also the posibility that Setsuna was Gunpuku's creator, Souta' sister, and that Souta drew Gunpuku, and as Setsuna died Souta forgot everything because he couldn't bare to read the story of her dead sister, and so maybe Gunpuku's world continued, which could in turn make Gunpuku a character that was able to self actualize without the need for her creator or Souta, which, in the end, could explain why Souta doesn't recognizes her.\n\nWell, they surely will pull the string theory excuse and how he is able to somehow pass between worlds thanks to that. "
  },
  {
   "score": 2,
   "id": "dgmepe9",
   "pid": "t1_dgm3z4q",
   "date": "2017-04-22 17:01:29",
   "depth": 5,
   "text": "Or what if someone came up with an anime/manga/whatever where the main character can either go between his world and the creator's world or is sent to his creator's world, and of course the main character would've been Souta thus making him the first character to ever make the jump. The first one could probably only really happen in the middle of an arc in his creator's story though like maybe he somehow forgets about his ability, perhaps even for an extended period of time, and the person that's his mother might be part of the creator's story somehow or even related to him if he realizes what happened, but doesn't want to be directly involved.  The second one would probably happen at the end of the creator's story for whatever reason, and could easily include him having been a person that went to a fantasy world and then came back too, so many ways to explain relatives, but that last case brings up an interesting point: is it then possible to create people doing that?"
  },
  {
   "score": 1,
   "id": "dgmm1ef",
   "pid": "t1_dgmepe9",
   "date": "2017-04-22 20:00:12",
   "depth": 6,
   "text": "Whatever the case, we all know who loses this rigamarole..\n\n*glances back at the giant powder mountain that used to be the fourth wall*"
  },
  {
   "score": 2,
   "id": "dgmey6c",
   "pid": "t1_dgmepe9",
   "date": "2017-04-22 17:07:24",
   "depth": 6,
   "text": "It would be pretty interesting, but I don't think this show will get Evangelion level of complexity. I think they will go for a more simpler take. \n\nIf it comes down to what you just said, then sure, it is pretty amazing they came up with something as complex as that, and I only hope they can execute that pretty well."
  },
  {
   "score": 84,
   "id": "dglz3mj",
   "pid": "t1_dglwbjx",
   "date": "2017-04-22 11:06:26",
   "depth": 2,
   "text": "Yup, and I'm ready to bet that it had something to do with why Souta stopped drawing."
  },
  {
   "score": 1,
   "id": "dh83qim",
   "pid": "t1_dglz3mj",
   "date": "2017-05-06 16:51:30",
   "depth": 3,
   "text": "Because the cat-girl he drew back then was an illustration of the creator of Military Uniform Girl."
  },
  {
   "score": 64,
   "id": "dglzfdf",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:13:33",
   "depth": 0,
   "text": "That Sawano buildup to nothing was amazing. That track was really hype, then to see it just fall flat was hilarious."
  },
  {
   "score": 59,
   "id": "dgm04ju",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:29:07",
   "depth": 0,
   "text": "This keeps getting more meta by the episode. They said that their meeting was fate or destiny, and in a way, it is. The creators of Re:Creators created these characters and manipulated them in such a way that they *would* meet and *would* be relevant to each other. Freaky"
  },
  {
   "score": 1,
   "id": "dgmuxic",
   "pid": "t1_dgm04ju",
   "date": "2017-04-23 00:36:06",
   "depth": 1,
   "text": "If that happened the world would be screwed (Most of us wouldn't survive). "
  },
  {
   "score": 6,
   "id": "dgms6i5",
   "pid": "t1_dgm04ju",
   "date": "2017-04-22 22:46:08",
   "depth": 1,
   "text": "Imagine if the show went even more meta and decided to pull something akin to *Who Framed Roger Rabbit?*. (ie. It goes another level higher in the inception to the \"real\" world, not an anime representation thereof)"
  },
  {
   "score": 69,
   "id": "dgm360k",
   "pid": "t1_dgm04ju",
   "date": "2017-04-22 12:38:42",
   "depth": 1,
   "text": "Then Re:Creators ends up actually being an elaborate ritual to bring these anime characters into the real world, for real.  2017, the year anime was made real.\n\n(or at least, that would be a good plot for the sequel)"
  },
  {
   "score": 3,
   "id": "dgmied1",
   "pid": "t1_dgm360k",
   "date": "2017-04-22 18:32:59",
   "depth": 2,
   "text": "No. Please no. If anime were to become real and I *still* couldn't become a magical girl, I think I'd die."
  },
  {
   "score": 6,
   "id": "dgmkohm",
   "pid": "t1_dgmied1",
   "date": "2017-04-22 19:28:49",
   "depth": 3,
   "text": "You can become a magical girl... from madoka magica.  Urobuchi will author your life personally."
  },
  {
   "score": 26,
   "id": "dgm4sxw",
   "pid": "t1_dgm360k",
   "date": "2017-04-22 13:15:32",
   "depth": 2,
   "text": "The real selestia could already be here, but everyone just assumes shes a cosplayer"
  },
  {
   "score": 31,
   "id": "dgmhrj4",
   "pid": "t1_dgm4sxw",
   "date": "2017-04-22 18:17:10",
   "depth": 3,
   "text": "Considering if she's been here long enough she could already be in this thread shitposting."
  },
  {
   "score": 22,
   "id": "dgmkv47",
   "pid": "t1_dgmhrj4",
   "date": "2017-04-22 19:33:12",
   "depth": 4,
   "text": "Maybe I was Selestia all along..."
  },
  {
   "score": 3,
   "id": "dgmooux",
   "pid": "t1_dgmkv47",
   "date": "2017-04-22 21:05:46",
   "depth": 5,
   "text": "!"
  },
  {
   "score": 20,
   "id": "dgmmh0d",
   "pid": "t1_dgmkv47",
   "date": "2017-04-22 20:09:45",
   "depth": 5,
   "text": "On the internet, nobody knows you're Selestia."
  },
  {
   "score": 55,
   "id": "dgm533u",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 13:21:55",
   "depth": 0,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dgq14kw",
   "pid": "t1_dgm533u",
   "date": "2017-04-25 03:51:59",
   "depth": 1,
   "text": "This comment has been removed.\n\n- Links to or other obvious direction toward pirate, illegal, or unofficial anime content are not allowed. This includes links to unofficial translations/scanlations of light novels, visual novels, and manga, unofficial anime streams, torrent sites, unofficially uploaded full OSTs, and images and video containing watermarks from any of the previously mentioned websites. In addition, proxy services are also forbidden.\n\n  Repeated violations of this rule will result in a ban.\n\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 1,
   "id": "dgoc7u2",
   "pid": "t1_dgm533u",
   "date": "2017-04-24 01:25:02",
   "depth": 1,
   "text": "that argument will always win."
  },
  {
   "score": 1,
   "id": "dgmex8s",
   "pid": "t1_dgm533u",
   "date": "2017-04-22 17:06:46",
   "depth": 1,
   "text": "Asked to be created accidents are not."
  },
  {
   "score": 55,
   "id": "dgmbl5k",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 15:47:06",
   "depth": 0,
   "text": "Right now Meteora is my favorite character.  She has a fantastic grasp of the situation and is very adept at defusing situations.\n\n\nFirst in the diner, when Yuuya wasn't being furthercoming with information (and getting on Selesia's nerves), Meteora saw through the bullshit front and offered to pay for his meal.  Payoff was immediate\n\n\nSecond, when Selesia argues with her creator, Meteora interjects and instantly calms the situation by pointing out Selesia is indeed a well-written character.\n\n\nShe has a quiet presence but is extremely effective when she does speak."
  },
  {
   "score": 1,
   "id": "dgnfbs2",
   "pid": "t1_dgmbl5k",
   "date": "2017-04-23 11:35:08",
   "depth": 1,
   "text": "Her scenes in the ending are a nice contrast to that. Shows more emotions there, it's cute. "
  },
  {
   "score": 3,
   "id": "dgo888m",
   "pid": "t1_dgmbl5k",
   "date": "2017-04-23 22:30:57",
   "depth": 1,
   "text": "I agree, but I also find her being overused to add exposition in this show. Every episode seems to have a few minutes of her speaking in a way that feels like reading paragraphs out of a light novel."
  },
  {
   "score": 16,
   "id": "dgmctjp",
   "pid": "t1_dgmbl5k",
   "date": "2017-04-22 16:16:01",
   "depth": 1,
   "text": "> She has a quiet presence but is extremely effective when she does speak.\n\n[Don't dare compare her to me](#katoupout)"
  },
  {
   "score": 49,
   "id": "dglxj0p",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:32:11",
   "depth": 0,
   "text": "The MC could give Akarin of Yuru Yuri and Kuroko of Kuroko no Basuke a run for their money on protagonists with the least presence, but I think we know what his character arc will look like now:\n\nThe girl who killed herself at the beginning of the show was a talented artist who was close to Souta. Probably his sister. When she died, Souta lost his desire to keep drawing. Military Uniform Girl in the last scene was likely addressing the dead girl, her creator. Judging by the way Souta was staring at glasses girl, this show will probably be about reigniting his passion for art/creation. That's my hope, at least. I'm a sucker for that kind of theme."
  },
  {
   "score": 3,
   "id": "dgrj97p",
   "pid": "t1_dglxj0p",
   "date": "2017-04-25 23:12:38",
   "depth": 1,
   "text": "I get what you're going for, but I'm thinking classmate and childhood friend."
  },
  {
   "score": 40,
   "id": "dgly8y3",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:48:20",
   "depth": 0,
   "text": "I'm a little surprised at how willingly they accept being fictional characters.  You would think that the competing theory of being an independent universe that influences the minds of the \"creators\" would be more appealing.\n\nMy favorite scene this episode was probably illustrator-san inspecting Celesia's clothing.   Illustrator-san was really excited and Celestia seemed to enjoy showing off.  It was cute.  Other than that nothing happened and we didn't really learn anything we didn't already know outside of character revision not being all that straightforward.   \n\nGoing forward it looks like we will have two factions that the future characters will join.  That's a little odd considering how all the characters are shown together in the OP.  I wonder what side the future characters will join?\n\nI'm guessing:  \nMecha Pilot:  Team Souta  \nDetective:  Team Hime  \nOccult Girl:  Team Hime\n\n"
  },
  {
   "score": 1,
   "id": "dgm0xna",
   "pid": "t1_dgly8y3",
   "date": "2017-04-22 11:47:40",
   "depth": 1,
   "text": "didnt purple haired guy talked about guy with a mech bothering him? i think he will be on team hime and we'll get occult girl on souta team instead"
  },
  {
   "score": 5,
   "id": "dgm1tp4",
   "pid": "t1_dgm0xna",
   "date": "2017-04-22 12:08:13",
   "depth": 2,
   "text": "I thought he was talking about his rival from whatever game he came from.."
  },
  {
   "score": 1,
   "id": "dgolje4",
   "pid": "t1_dgm1tp4",
   "date": "2017-04-24 07:06:04",
   "depth": 3,
   "text": "I think he was talking about that detetive ojiisan"
  },
  {
   "score": 1,
   "id": "dgmvqfv",
   "pid": "t1_dgly8y3",
   "date": "2017-04-23 01:14:45",
   "depth": 1,
   "text": "If you were transported to a world where suddenly you see posters and shit of yourself hanging from multistory buildings and everyone who sees you asks for a photograph with your excellent cosplay and shit, you'd probably believe it too."
  },
  {
   "score": 10,
   "id": "dgm8txc",
   "pid": "t1_dgly8y3",
   "date": "2017-04-22 14:44:13",
   "depth": 1,
   "text": "I mean when you think about it, its not weird that they can easily accept that their fictional characters. When thats the reality of things that just gets thrown in your face, you kind of have no choice but to accept it. Its the same for their creators. If your creations were to just pop up in front of you and had this whole supernatural fight in front of them, theres no choice but to believe it."
  },
  {
   "score": 7,
   "id": "dgo847g",
   "pid": "t1_dgm8txc",
   "date": "2017-04-23 22:26:54",
   "depth": 2,
   "text": "I think the point is that they *do* have an alternative choice to accepting it. The other worlds could be their own independent universes, and authors are people who subconsciously observe other worlds and relays it through their stories. So far we have been directed away from this line of thinking due to many of the characters' mindset, but there is no evidence denying it yet."
  },
  {
   "score": 41,
   "id": "dgm2pfp",
   "pid": "t1_dgly8y3",
   "date": "2017-04-22 12:28:14",
   "depth": 1,
   "text": "[If this picture means anything then you're right](https://myanimelist.cdn-dena.com/images/anime/8/85348l.jpg)"
  },
  {
   "score": 8,
   "id": "dgmubpf",
   "pid": "t1_dgm2pfp",
   "date": "2017-04-23 00:08:44",
   "depth": 2,
   "text": "I'm glad that Mecha Pilot is with Souta but kinda disappointed since that means we won't see Selesia's mech vs other guy's mech."
  },
  {
   "score": 10,
   "id": "dgm933y",
   "pid": "t1_dgm2pfp",
   "date": "2017-04-22 14:49:56",
   "depth": 2,
   "text": "Aw, too bad. I wanted occult girl to be on the good guys side. :/"
  },
  {
   "score": 19,
   "id": "dgmsycc",
   "pid": "t1_dgm933y",
   "date": "2017-04-22 23:13:35",
   "depth": 3,
   "text": "I know how you feel. I wanted Detective-ojiisan to be on the good guys. :(\n\nOh well. At least they still look badass. "
  },
  {
   "score": 35,
   "id": "dgm336m",
   "pid": "t1_dgm2pfp",
   "date": "2017-04-22 12:36:56",
   "depth": 2,
   "text": "I guess it's a little weird for the cute magical girl to be on the wrong side while bad-guy boss is on the right side but I guess that makes it more interesting than playing it straight."
  },
  {
   "score": 11,
   "id": "dgm6t69",
   "pid": "t1_dgm336m",
   "date": "2017-04-22 13:59:55",
   "depth": 3,
   "text": "Yuuya fought against Hime, so it makes sense that he would be in the opposite faction."
  },
  {
   "score": 28,
   "id": "dgmiglx",
   "pid": "t1_dgm336m",
   "date": "2017-04-22 18:34:34",
   "depth": 3,
   "text": "I hate to say something bad about magical girls, but a lot of them are kind of really \"believe the first person who talks to them and ignore any possibility of the other side having a point\"-y. So I can totally see this. "
  },
  {
   "score": 26,
   "id": "dgmoqlm",
   "pid": "t1_dgmiglx",
   "date": "2017-04-22 21:07:03",
   "depth": 4,
   "text": "TBF they're just kids"
  },
  {
   "score": 10,
   "id": "dgmv0g3",
   "pid": "t1_dgmoqlm",
   "date": "2017-04-23 00:39:58",
   "depth": 5,
   "text": "Also, most magical girls are pretty dim-witted falling for anything anyone tells them even villains. A much smarter/manipulating villain could easily take advantage of this fact."
  },
  {
   "score": 1,
   "id": "dguuqhp",
   "pid": "t1_dgmv0g3",
   "date": "2017-04-27 21:35:19",
   "depth": 6,
   "text": "That is why she was super shocked when she didn't won after using her final attack.\n\nIs basically like \"But... i beat you, so i now you should undestand that you are wrong, right? ... right!?\""
  },
  {
   "score": 2,
   "id": "dgrtx8a",
   "pid": "t1_dgmv0g3",
   "date": "2017-04-26 06:13:46",
   "depth": 6,
   "text": "This trope was primary reason that the plot of MGRP Limited happened. Newly made magical girls that trusts the first person they meet."
  },
  {
   "score": 11,
   "id": "dgnv8en",
   "pid": "t1_dgmv0g3",
   "date": "2017-04-23 17:02:51",
   "depth": 6,
   "text": "http://i.imgur.com/a7IjDr2.png"
  },
  {
   "score": 5,
   "id": "dgnwupr",
   "pid": "t1_dgnv8en",
   "date": "2017-04-23 17:38:59",
   "depth": 7,
   "text": "Pretty much poor Madoka, she didn't need to go through that. Except in a meta-example I guess we're the ones at fault for ruining her life due to our desire for entertainment. But after seeing the show it would be pretty easy to outsmart Kyubey, if you know his rules."
  },
  {
   "score": 35,
   "id": "dgm1ukc",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 12:08:46",
   "depth": 0,
   "text": "I really like Yuuya. Even though he's the last boss of and rival of his series' mc, they still seem to be real good friends, referring to his rival Syo, thinking what he'll make of this situation. "
  },
  {
   "score": 8,
   "id": "dgohrke",
   "pid": "t1_dgm1ukc",
   "date": "2017-04-24 05:30:57",
   "depth": 1,
   "text": "Yeah, if his \"lasting impressions\" theory is to be believed, he's very much the cool best friend/rival who clashes with the MC over different ideologies. Possibly the final boss after the main threat is dealt with and they can't reconcile their different approaches as to what should happen in the world. \n\nThat would probably mean the rest of the characters are a collection of Best Girls, BAMFs, popular franchise leads, and mysterious/deep/edgy characters."
  },
  {
   "score": 3,
   "id": "dguutvw",
   "pid": "t1_dgohrke",
   "date": "2017-04-27 21:37:52",
   "depth": 2,
   "text": "Somehow there is a history where the old badass guy is the most popular character.\n\ni mean, what the hell with the cast of that show? "
  },
  {
   "score": 38,
   "id": "dgm8ru8",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 14:42:53",
   "depth": 0,
   "text": "I'm predicting that Meteora isn't going to have such a great time meeting her creator(s) on the tour, she kept bringing up the connection between Selesia and her author and she mentioned how she \"hopes such passion was put into her world\". That seems like a big setup for a rude awakening. I wouldn't be surprised if that corporation in charge of her game doesn't really care about it and are just milking it for cash or something. I'm looking forward to seeing how it plays out!"
  },
  {
   "score": 14,
   "id": "dgm99e3",
   "pid": "t1_dgm8ru8",
   "date": "2017-04-22 14:53:46",
   "depth": 1,
   "text": "That would be kinda cool if it was the case however the ending kinda points to her creator being involved in the show and the group. There are 3 cases where this kinda short fat dude shows up who I believe to be her creator. One is on the water slide where he is seated next to Meteora, two is what in looks to be Meteora's game and three is in the beach where he is behind Meteora using the same kind of water tube thing."
  },
  {
   "score": 3,
   "id": "dgma2jk",
   "pid": "t1_dgm99e3",
   "date": "2017-04-22 15:12:13",
   "depth": 2,
   "text": "Ah I've been letting the endings play in the background while I browse reddit so I wasn't paying much attention to the visuals. Hmm I could see it happening where during the tour they find out that the people who worked on the game don't really have a passion for her world, Meteora gets depressed (which then the MC would reaffirm that she has a meaning and cheer her up), and then they run into the one guy who worked on the game that really loves it which gives Meteora hope again (which could be the guy from the ED). Of course I'm just wildly guessing how the story might unfold, the \"character gets depressed at how their world has no meaning\" route seems like such an obvious path that the story could take and I'd be surprised if they didn't use it at some point."
  },
  {
   "score": 2,
   "id": "dgos8dx",
   "pid": "t1_dgma2jk",
   "date": "2017-04-24 09:15:19",
   "depth": 3,
   "text": "Bit late to the party, but I think that, outside of some particular long-running titles like Call of Duty, it isn't really possible for the developers to not have a passion for their own game.\n\nThe ones using games as cash cows are the people at the top that decide whether the game is created at all. But the people actually making it are almost certainly going to have a passion for it."
  },
  {
   "score": 35,
   "id": "dglx2lt",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:22:06",
   "depth": 0,
   "text": "The illustrator spoiling Selesia about the events of the LN was great. So it seems that the anime and LN versions of her are separate, which means we could possibly see some clone weirdness later on. That might be fun."
  },
  {
   "score": 3,
   "id": "dgly2uc",
   "pid": "t1_dglx2lt",
   "date": "2017-04-22 10:44:29",
   "depth": 1,
   "text": "I feel like, the characters are limited on what point of their story they were summoned from"
  },
  {
   "score": 9,
   "id": "dgmcn9o",
   "pid": "t1_dglx2lt",
   "date": "2017-04-22 16:11:53",
   "depth": 1,
   "text": "It'd be interesting for the two versions to meet, with the LN version being really fucked up because of all the **Spoiler Alert** betrayals and deaths they've been through."
  },
  {
   "score": 18,
   "id": "dgm9eo0",
   "pid": "t1_dglx2lt",
   "date": "2017-04-22 14:57:04",
   "depth": 1,
   "text": "LN version, Manga version, Anime version, Anime-remake version, game adaptation... it seems we could end up with multiple versions of the same characters. If being accepted by a large number of people is indeed a factor for the creation of a world, a popular enough doujinshi could probably give rise to its own version also. "
  },
  {
   "score": 14,
   "id": "dgn4int",
   "pid": "t1_dgm9eo0",
   "date": "2017-04-23 07:30:07",
   "depth": 2,
   "text": "man large fandoms like Touhou and KanColle will get weird real quick. And that swimming thing too."
  },
  {
   "score": 1,
   "id": "dguusbv",
   "pid": "t1_dgn4int",
   "date": "2017-04-27 21:36:41",
   "depth": 3,
   "text": "Undertale was already fucked up enough..."
  },
  {
   "score": 39,
   "id": "dglzmyp",
   "pid": "t1_dglx2lt",
   "date": "2017-04-22 11:18:09",
   "depth": 1,
   "text": "\"Nics die ?!\"\n\nMust be pretty hard for her, to be fair. That story is the real world for her, but it's also a fiction where people die for emotional effects. That makes her world kinda cheap."
  },
  {
   "score": 6,
   "id": "dgm9xej",
   "pid": "t1_dglzmyp",
   "date": "2017-04-22 15:08:59",
   "depth": 2,
   "text": "That's why that girl says it's the world of gods. They make those poor characters suffers and die and fight battles for their own enjoyment. What horrible gods they are.\n\nBtw, I like Bahamut a lot more than this anime."
  },
  {
   "score": 24,
   "id": "dglvw2n",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 09:56:02",
   "depth": 0,
   "text": "You can read Hiroe Rei's original story draft for the Re Creators anime here: https://www.sunday-webry.com/events/re_creators_naked/\n\nA new chapter is released everyday, but the draft is all in Japanese. \nAlthough some readers say the anime added more action and softened Celestia's personality.\n"
  },
  {
   "score": 62,
   "id": "dglxz6o",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:42:13",
   "depth": 0,
   "text": "*Not*-Saber rescued *Not*-Madoka on a horse\nand\nMiss Illustrator spoiling their own character.\n\nWe've gone full circle"
  },
  {
   "score": 57,
   "id": "dglrbx2",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 08:07:45",
   "depth": 0,
   "text": "SPOILERS REEEEEEEEEEEEEEEE\n\nAhem.\n\nPurple hair dude seems cool -- outwardly brash and comes off as a bad guy at first, but his actions suggest otherwise. He also seems to have a strong sense of loyalty and gratitude towards those who help him.\n\nThe male MC is as bland and boring as always, but I fully expect to see him create a character and have them materialise in the coming episodes."
  },
  {
   "score": 1,
   "id": "dgm9pt7",
   "pid": "t1_dglrbx2",
   "date": "2017-04-22 15:04:12",
   "depth": 1,
   "text": "Spoilers: the purple hair dude is the last boss, and is rival with the main character, Syo, whom he considers to be his friend.\n\nSounds like a pretty good game."
  },
  {
   "score": 4,
   "id": "dglz9sx",
   "pid": "t1_dglrbx2",
   "date": "2017-04-22 11:10:14",
   "depth": 1,
   "text": "Probably being spoiled about your future would suck... But doesn't she want to save her friends?\n\nAnd what would happen if she was returned to her world with that knowledge? Would she be able to deviate from the story?"
  },
  {
   "score": 17,
   "id": "dgm00xm",
   "pid": "t1_dglrbx2",
   "date": "2017-04-22 11:26:49",
   "depth": 1,
   "text": "Well, an average schoolboy being much more bland than fictional fantasy characters is hardly surprising if you think about it."
  },
  {
   "score": 5,
   "id": "dgmwzet",
   "pid": "t1_dgm00xm",
   "date": "2017-04-23 02:19:47",
   "depth": 2,
   "text": "**THIS**, oh so much.  \nI don't even like Souta much, but I find his blandness justifiable."
  },
  {
   "score": 89,
   "id": "dglrp5o",
   "pid": "t1_dglrbx2",
   "date": "2017-04-22 08:16:57",
   "depth": 1,
   "text": "I don't really see Souta as a \"main character,\" with how little he actually speaks or drives the events of the show. Things are happening around him and but he has little control over any of it."
  },
  {
   "score": 6,
   "id": "dgm0k3a",
   "pid": "t1_dglrp5o",
   "date": "2017-04-22 11:39:01",
   "depth": 2,
   "text": "I have a feeling that his importance will come later to the show, as it was implied by Military Girl at the last minutes of the show. He's probably a Chekov's Gun to the plot"
  },
  {
   "score": 1,
   "id": "dgml1mq",
   "pid": "t1_dgm0k3a",
   "date": "2017-04-22 19:37:20",
   "depth": 3,
   "text": "That variation is the Chekov's Gunman for anybody interested."
  },
  {
   "score": 108,
   "id": "dglsr4c",
   "pid": "t1_dglrp5o",
   "date": "2017-04-22 08:42:33",
   "depth": 2,
   "text": "Right. He straight up says in the first episode that he's just the narrator, the perspective through which we will see the story unfold. The true protagonist of the show is always going to be centered around Selesia and the other fictional characters.\n\nNot sure why people are so wrapped up in what's going on with Sota. Will he have a part to play? Sure. But I'm not expecting for this to really be his story."
  },
  {
   "score": 1,
   "id": "dglttmi",
   "pid": "t1_dglsr4c",
   "date": "2017-04-22 09:08:14",
   "depth": 3,
   "text": "I'm not too annoyed with his blandness yet, but I kinda wished he could be less bland so that he won't just be just a side character in the show that we are somehow forced to follow around. I mean, main characters of stories tend to be interesting characters for a reason (such as because we are reading/watching the character the most). Making a main character that is essentially a side character (that is bland) is kinda pointless in my opinion.\n\nedit: made for clarifications \n\nedit 2: I think the feeling I get from it would be something like watching Naruto, but the MC is Sakura and the protagonist remains to be Naruto "
  },
  {
   "score": 4,
   "id": "dglysew",
   "pid": "t1_dglsr4c",
   "date": "2017-04-22 10:59:37",
   "depth": 3,
   "text": "Yeah I don't know either, I mean it's not like a narrator character is a strange thing. He is not taking the spotlight or anything. \n"
  },
  {
   "score": 44,
   "id": "dglv42u",
   "pid": "t1_dglsr4c",
   "date": "2017-04-22 09:38:20",
   "depth": 3,
   "text": "> But I'm not expecting for this to really be his story.\n\nI disagree. This is very much his story, he just hasn't realized his role yet.\n\nThe end of this episode has the antagonist talking to an absent someone named \"Setsuna\" who was \"banished\" by the Real world and who knew who Souta was. This description lines up with Souta's sister and her suicide with only a tiny amount of creative effort. Once this piece of information is brought to light, I imagine that he'll become more prominent."
  },
  {
   "score": 1,
   "id": "dgmepmj",
   "pid": "t1_dglv42u",
   "date": "2017-04-22 17:01:38",
   "depth": 4,
   "text": "Going by this theory, Souta was probably the illustrator for his sister and that's how he is directly related as a creator."
  },
  {
   "score": 11,
   "id": "dglw9ds",
   "pid": "t1_dglv42u",
   "date": "2017-04-22 10:04:05",
   "depth": 4,
   "text": "The suicide girl was his sister? When?"
  },
  {
   "score": 54,
   "id": "dglwgge",
   "pid": "t1_dglw9ds",
   "date": "2017-04-22 10:08:24",
   "depth": 5,
   "text": "It's heavily implied by the opening narration in E1 and the OP.\n\n\"My dear brother.\" \"I think she was the main character.\" Whole bit is delivered fondly in past tense, immediately after the suicide sequence. Story begins by showing us an unnamed girl jumping in front of a train, and the same girl shows up again in the OP.\n\nEDIT:\nI've edited the above a few times now, and really feel it necessary to go through that particular sequence in the OP again.\n\n* We see Souta holding water in his hands and a sad look on his face. Not only that, the water is draining out of his hands. Symbolic of a loss?\n\n* This fades through to Train-chan sinking through a dark place filled with circles of light. Gives the feeling of it being underwater, thus helping to connect her to the previous shot with Souta.\n\n* Her glasses drift off of her face and jump-cut to the shot of Military Girl. I take this as a symbol of a handing-over of perspective. She sees the suicide as someone else's fault, and handed that along to the character.\n\n* And when Military Girl looks up at the screen, we can see that she's coming from a background of death (literally skulls and bones) before the digital curtain rises and she's shown in the world of the living (plants and flowers)."
  },
  {
   "score": 1,
   "id": "didnxpp",
   "pid": "t1_dglwgge",
   "date": "2017-06-02 13:22:43",
   "depth": 6,
   "text": "That's a very interesting analysis! I never even considered the Meganekko could be his sister, but I wondered what that narration was about.\n\nThe first kanji in Mizushino, their family name (水篠), references water, so the water in the OP might mean something else, too. (The other one references bamboo, which is can be a [symbol](https://en.wikipedia.org/wiki/Bamboo#Symbolism_and_culture) of a uprightness, friendship)."
  },
  {
   "score": 17,
   "id": "dgly2v6",
   "pid": "t1_dglv42u",
   "date": "2017-04-22 10:44:29",
   "depth": 4,
   "text": "I think we're on the same page about a lot of this jazz. All we really disagree on is the degree of Sota's relevancy. Yes, he definitely has a connection to the antagonist and a role to play in all of this.\n\nI just don't believe him to be the star of this show. So a lot of the talk about him being bland is a little too on the nose to serve as any sort of worthwhile critique. He's supposed to be your average citizen. That's the point.\n\nThere are plenty of other characters from fiction with interesting personalities contributing to the show. Enjoy them. The story is going to revolve around them. \n\nSota will have a role, but more often he'll function as a vehicle through which we watch the story unfold. He'll get creators and creations to connect and learn of his own connection to the military antagonist...but ultimately he's here to tell the story of all of the otherworldly occurrences that have happened around him...and maybe even make it into the next hit anime somewhere down the line."
  },
  {
   "score": 1,
   "id": "dgm5i8v",
   "pid": "t1_dgly2v6",
   "date": "2017-04-22 13:31:23",
   "depth": 5,
   "text": "We know stories in which the protagonist is passive and drives the story through other characters, but he is still the protagonist. Whether Sota drives the story with direct action or not is kind of irrelevant to the definition in this day and age.\n\nYes, he proclaims he is just a narrator, but in the same breath says he's doing it for a story that is above all other stories. When you cut through the \"I'm just a fly on the wall\" chuuni bullshit, that translates to him being the main character.\n\nAnother factor to his \"relevancy\" would be Mirokuji's inquiry why it was them that got chosen to be dragged into this world. He concludes they needed to stand out somehow. But to whom? The readership/viewership at large? Or perhaps to a particular reader (Sota), who recognized every character he met off the top of his head immediately? Couple that with the strong possibility Setsuna (suicide girl) is Sota's sister, or someone who was close to him and knew his tastes well, and things start adding up that perhaps he's not just a standin."
  },
  {
   "score": 2,
   "id": "dgm9rlk",
   "pid": "t1_dgly2v6",
   "date": "2017-04-22 15:05:19",
   "depth": 5,
   "text": "The problem with this is history shows otherwise. You could say the same thing about Rock from Black Lagoon. He was a normal, everyday salary-man until he was left for dead in the Southeast Asia ocean. He was mostly just going with the flow in Roanapur until certain events changed him and he became one of the more dangerous people there. Sota's going through a similar experience as Rock did in the first story arc. Eventually he'll \"break\" and take charge of the events surrounding him, no longer willing to a \"character in a story.\" Likely, there'll be some parallel made where he'll start creating again at the same time he takes charge of himself."
  },
  {
   "score": 16,
   "id": "dgm7dzg",
   "pid": "t1_dgly2v6",
   "date": "2017-04-22 14:12:38",
   "depth": 5,
   "text": "I see what you mean. The situation reminds me of [Madoka Magica](/s \"where Madoka really doesn't do anything until the end, and her significance isn't made apparent until very late in the story...\") and at that point the discussion becomes pedantic, as to whether or not a focus of a story must be about the person who drives it."
  },
  {
   "score": 6,
   "id": "dgmfo9e",
   "pid": "t1_dgm7dzg",
   "date": "2017-04-22 17:25:18",
   "depth": 6,
   "text": "Agreed! \n\nPlus, as much as I'm throwing this viewpoint out there, I'm not really looking to die on this hill. We're only three episodes into it. A lot can change between now and end. And this episode did indeed shift some things around a bit.\n\nAll in all, this is more just a first impression of a show that is looking to have several moving parts vying for screen time and my guesstimation on how it will be kept functional. Because the fact that this show is balancing all of these different plot concepts between fiction and reality makes for a good chunk of what is making this show's narrative so enthralling. Plus fights are cool. :P\n\nBut one has to admit the fact that Sota states \"I am just the narrator\" and people question his role is at least a little perplexing. Is it so odd to believe a spade to be a spade? XP"
  },
  {
   "score": 19,
   "id": "dgm1urx",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 12:08:54",
   "depth": 0,
   "text": "I just saw a despairing magical girl being rescued by a female knight and riding away on a magical floating horse into the horizon\n\nThis anime is all I could ever ask for"
  },
  {
   "score": 20,
   "id": "dgml9p6",
   "pid": "t1_dgm1urx",
   "date": "2017-04-22 19:42:24",
   "depth": 1,
   "text": "Don't forget that the horse was making motorcycle sounds."
  },
  {
   "score": 8,
   "id": "dgmx7tc",
   "pid": "t1_dgml9p6",
   "date": "2017-04-23 02:32:04",
   "depth": 2,
   "text": "First we have headless horse turned motorcycle that neighs in Durarara!!, then a horse that goes vroom? I think we've truly gone full circle here..."
  },
  {
   "score": 1,
   "id": "dgn3yfs",
   "pid": "t1_dgmx7tc",
   "date": "2017-04-23 07:14:33",
   "depth": 3,
   "text": "Is this a Ferrari product placement!? :o"
  },
  {
   "score": 16,
   "id": "dgm1ahi",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:55:55",
   "depth": 0,
   "text": "Damn it, they went for the \"main character doesn't want spoilers\" route. I guess she's implicitly assuming her future can't change based on her knowledge, instead of thinking she can avoid being betrayed if she knows who the traitors are, but I hate those sorts of incurious choices. It should be hard to accept that her choices aren't real, and are just products of her creator's imagination... but if she believes in something like fate then maybe that amounts to the same thing.\n\nThe experimentation and interaction between creator and created was great though. Particularly when Souta suggested that ideas have to be canon, or at least known by the populace at large, to change the characters' abilities. Meteora is the smart character of the group but she might not be familiar enough with how fiction and fandoms work to think about this, but it's something any creator or major fan would have thought of immediately; while she was talking I was thinking Souta really ought to contribute exactly that just before he did so. The team needs someone who suggests summoning a flaming sword indoors isn't the safest way to do an experiment though...\n\nI think what I'm hoping from this show the most is interesting commentary on the relationship between stories and the real world, how they affect people, and how stories are constructed, and the anime looks like it's going in that direction, but the pacing is really slow so far. I was expecting a lot more action. I don't know if I prefer this approach or not; it's including a lot of things that interest me, but it's not doing so in an exciting package."
  },
  {
   "score": 2,
   "id": "dgn7w2s",
   "pid": "t1_dgm1ahi",
   "date": "2017-04-23 08:53:28",
   "depth": 1,
   "text": "Or she's just scared to know fate. If she can change fate then there's no point in knowing, because its not fate.\n\nIts merely predictions, not factual.\n\nAs such the Creator never written for them to come to Earth, hence there must be larger powers at play."
  },
  {
   "score": 3,
   "id": "dgne5r2",
   "pid": "t1_dgn7w2s",
   "date": "2017-04-23 11:09:57",
   "depth": 2,
   "text": "> If she can change fate then there's no point in knowing, because its not fate.\n\nDisagree. At the very least, it's information about the default future if she didn't know anything, so knowing that future is at least as good as a [Peggy Sue](http://tvtropes.org/pmwiki/pmwiki.php/Main/PeggySue) fic. With time travel, even though the timeline would diverge based on your actions, the knowledge from the first time around is still useful. Especially if you want to prevent a death or predict a betrayal, knowing what happened the first time around is a good first step. Predictions of an extremely likely future are absolutely worth knowing... if you're not just going to roll over and accept it.\n\nThere are various reasons why one might suspect it won't be useful. But Celestia didn't invoke any of them. She just acted like, say, an anime fan who encountered LN spoilers, instead of someone who had actual agency and stakes within the story."
  },
  {
   "score": 2,
   "id": "dgnqo4h",
   "pid": "t1_dgne5r2",
   "date": "2017-04-23 15:21:15",
   "depth": 3,
   "text": "You are mistaking that time travel and diverging parallel universe exist, when there is no evidence to support it.\n\nAren't you bringing your own fandom into this anime's setting?\n\nThere's no TARDIS here. \n\nHence the pragmatic decision is to figure out the rules first, instead of mucking about with predictions that may or may not be a reality. Plus if fate is written by the creator, and there's only one creator, then there's no escaping it.\n\n"
  },
  {
   "score": 3,
   "id": "dgnsu5e",
   "pid": "t1_dgnqo4h",
   "date": "2017-04-23 16:08:33",
   "depth": 4,
   "text": "What? There's practically zero opportunity cost to learning about the future. Even if they don't know for sure they can change anything, it would take a few minutes to an hour to learn the most important spoilers, and assuming Celestia's literate, a few hours to borrow the LNs if she wants to know in detail. They probably sat around for hours doing nothing while waiting for the writer and illustrator to do their thing so it's not like time is of the essence.\n\nIt's practical to figure out the rules before taking action, but that's not the same as completely rejecting information relevant to your life. I'm not saying that she could definitely change the future, but that she should at least think about it. If people close to her are going to die or betray her, she should *want* to know about it and think that maybe she could do something. Instead, her kneejerk reaction was \"No! Spoilers!\" which is kind of funny but is a completely disappointing reaction for any person to have.\n\nIt's not even clear that Celestia is particularly invested in learning about the rules as opposed to going along with what the smart people in the room are saying anyway. It's not like she actually thought about what you're saying. She just heard spoilers and instinctively rejected it."
  },
  {
   "score": 2,
   "id": "dgo8mvb",
   "pid": "t1_dgnsu5e",
   "date": "2017-04-23 22:45:41",
   "depth": 5,
   "text": "What use is learning fate when you know you can't change it? Nothing. At most you're just making it harder for yourself.\n\nAnd if fate can be changed, then it is not fate. Meaning creators have no power over the created, meaning there's little reason to assume a death or betrayal will be true. What if you expect someone to die based on prophecy, and he didn't? If its a parallel universe, anything can happen with or without intervention. \n\nYou may as well get worked up on Mayan prophecy of world ending in 2012, looking like a fool trying to prevent it.\n\nSo the wise thing is to figure out if its \"fate\" or \"prophecy\" or any other rules. Then you make a decision to know it or not. \n\n"
  },
  {
   "score": 12,
   "id": "dgn5nd9",
   "pid": "t3_66w5q4",
   "date": "2017-04-23 07:59:41",
   "depth": 0,
   "text": "The more I watch it the more I like Yuuya   \n\n* in his story he's villain  \n* honorable  \n* good manners  \n* not infected by power obsession trope  \n* basically does not give a fuck\n\n[coffee - truly an indulgence](http://i.imgur.com/fzsW33o.jpg)"
  },
  {
   "score": 26,
   "id": "dglrnb3",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 08:15:41",
   "depth": 0,
   "text": "Havent seen this yet, may be a few days.\n\nBut the music is sublime, mix in some tasteful vocals and it really elevates the scenes.\n\nAlso loving the reverse SAO/LogHorizon/Overlord theme of it where we are not trapped in their world, they are trapped in ours."
  },
  {
   "score": 72,
   "id": "dglrw32",
   "pid": "t1_dglrnb3",
   "date": "2017-04-22 08:21:42",
   "depth": 1,
   "text": "I can imagine several LN protagonists meeting their fanbase in our world and how the conversations would go\n\n\"MC-kun, Why didn't you man up and bang best girl?\"\n\n\"Where did you get the idea she was into me?\"\n\n\"Dude, She was thirsty as fuck for your D\""
  },
  {
   "score": 3,
   "id": "dgmi6vo",
   "pid": "t1_dglrw32",
   "date": "2017-04-22 18:27:43",
   "depth": 2,
   "text": "This show's been making me consider how my characters would react to meeting me. (My favorite genre is despair, so...) "
  },
  {
   "score": 9,
   "id": "dgmfos4",
   "pid": "t1_dglrw32",
   "date": "2017-04-22 17:25:39",
   "depth": 2,
   "text": "If Raku was here, the Onodera master race would skin him alive."
  },
  {
   "score": 1,
   "id": "dgnjq23",
   "pid": "t1_dgmfos4",
   "date": "2017-04-23 13:04:04",
   "depth": 3,
   "text": "The poor guy finally chooses a girl and yet would still be killed for it. Then again that's every harem guy that's ever existed."
  },
  {
   "score": 9,
   "id": "dgm9u7s",
   "pid": "t1_dglrw32",
   "date": "2017-04-22 15:07:01",
   "depth": 2,
   "text": ">several LN protagonists  \n>MC-kun\n\nNever going to happen because nobody cares about the male lead in LNs"
  },
  {
   "score": 12,
   "id": "dglvyd2",
   "pid": "t1_dglrw32",
   "date": "2017-04-22 09:57:29",
   "depth": 2,
   "text": "Could still happen? There's a panel in the ED where it shows the characters at a cosplay convention."
  },
  {
   "score": 47,
   "id": "dglz6n9",
   "pid": "t1_dglrw32",
   "date": "2017-04-22 11:08:18",
   "depth": 2,
   "text": "And Shinji would get even more depressed with the number of people who tell him to get in the robot for no reason."
  },
  {
   "score": 12,
   "id": "dgm8yve",
   "pid": "t1_dglz6n9",
   "date": "2017-04-22 14:47:18",
   "depth": 3,
   "text": "That would add so many layers of mind-fuck, being Shinji Ikari going to watch \"The End of Evangelion\", specially if he comes from some of the points where he is trying to run away and have him thinking \"I go back to... to that?!\""
  },
  {
   "score": 3,
   "id": "dgmt9du",
   "pid": "t1_dgm8yve",
   "date": "2017-04-22 23:25:08",
   "depth": 4,
   "text": "Escapes from his parents.\n\n\n\nStill told to get into the robot"
  },
  {
   "score": 56,
   "id": "dglu1jh",
   "pid": "t1_dglrw32",
   "date": "2017-04-22 09:13:24",
   "depth": 2,
   "text": "\n\nif ichika from Infinite Stratos got materialized into our world, he would be roasted to hell and he wont even know why."
  },
  {
   "score": 6,
   "id": "dgmc05y",
   "pid": "t1_dglu1jh",
   "date": "2017-04-22 15:56:45",
   "depth": 3,
   "text": "And he'd still get a harem here somehow.."
  },
  {
   "score": 7,
   "id": "dgmuvya",
   "pid": "t1_dgmc05y",
   "date": "2017-04-23 00:34:10",
   "depth": 4,
   "text": "Doubt it real women aren't anything like anime women. Otherwise nice guys would have tons of girls after them. \n\nAlso if Ichika were to accidently fall and grope a real woman in this world he would be arrested for sexual harassment, or he'd be attacked by a bunch of feminists. "
  },
  {
   "score": 3,
   "id": "dgn3qup",
   "pid": "t1_dgmuvya",
   "date": "2017-04-23 07:08:30",
   "depth": 5,
   "text": "You doubt his power"
  },
  {
   "score": 1,
   "id": "dgnjnjg",
   "pid": "t1_dgn3qup",
   "date": "2017-04-23 13:02:43",
   "depth": 6,
   "text": "For someone who's as dense as a black hole (I'm talking about Ichika by the way), yeah I doubt his power. "
  },
  {
   "score": 11,
   "id": "dgm3f6x",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 12:44:23",
   "depth": 0,
   "text": "As odd as it sounds I'm actually glad this episode had less action scenes than the previous one. I'm far more interested in how these fictional characters interact with the real world than seeing them fight. This episode also made me think about something else. How do these fictional worlds account for retcons. Say the author of Selisia's story retconned a part of her backstory in the latest book, would this affect her now in the real world. Then again there attempts to change her by adding new elements in this episode didn't work at all so maybe it is impossible to add new elements now that she is in the real world."
  },
  {
   "score": 2,
   "id": "dgm3pzd",
   "pid": "t1_dgm3f6x",
   "date": "2017-04-22 12:51:12",
   "depth": 1,
   "text": "If we go by the 'impressions' theory this episode introduced it would only work if that retcon becomes the version of her story people become most familiar with. I don't think the light novel version of Selisia is, that's why the anime version came into the real world instead. So for that to happen they would have retcon the anime and have people become more familiar with the retcon version than the old one. Of course as you said it might just be impossible to make changes once they enter the real world. "
  },
  {
   "score": 3,
   "id": "dgm3kfh",
   "pid": "t1_dgm3f6x",
   "date": "2017-04-22 12:47:48",
   "depth": 1,
   "text": "I'm guessing Multiverse theory. One is the RetConned version the other is the regular version. Just like how this Selisia is from the anime and not the novel and thus draws from that continuity which is what I believe is the reason the alteration went wrong."
  },
  {
   "score": 4,
   "id": "dgm3yyr",
   "pid": "t1_dgm3kfh",
   "date": "2017-04-22 12:56:51",
   "depth": 2,
   "text": "I dunno, it's hard to tell if every version of every story or character gets their own world, or is it only the version that leaves the biggest impression on people and the one they become most familiar with that does. "
  },
  {
   "score": 5,
   "id": "dgm6f92",
   "pid": "t1_dgm3yyr",
   "date": "2017-04-22 13:51:28",
   "depth": 3,
   "text": "One reason I am interpreted in how retcons would work is because if the author changes something retroactively it should have always been in continuity regardless of which version of the character we are talking about. It would actually be pretty interesting if later in the story we get to meet light novel Selesia and she begins to talk about elements of her backstory the anime Selisia has no idea about.\n\nOf course a good chunk of that goes away if the impression theory is true. However there are ways of testing this in story. What we saw in episode 3 was the characters writing a short story and making an illustration to go with it. Now this test ultimately failed but what if they got more people to see this story. It actually wouldn't be that difficult, just have have the author post a link to it on his twitter account with the illustration they made. Since this is in universe a very popular anime airing right now this would get a ton of attention from the usual news sites and a lot of people would check it out. It would be very interesting to see if this had any effect."
  },
  {
   "score": 17,
   "id": "dglw4gv",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:01:09",
   "depth": 0,
   "text": "Idk why but Celestia looks so much like Rin from Fate/. They have the same face I feel. \n\nI feel like [this](http://imgur.com/a/PdIO9) line is some foreshadowing and more evidence on the [theory](https://www.reddit.com/r/anime/comments/65jpox/recreators_episode_2_discussion/dgazdy9/) I posted last week. MC is the one who brought them into the world and created the versions of them we see in the show. Which is why the author and illustrator can't change her. Also why she wouldn't be from the newest book since she is from a time when MC still drew. Also that ending with Military Uniform I think pretty much confirms MC created her, probably in the future. "
  },
  {
   "score": 1,
   "id": "dgm8qui",
   "pid": "t1_dglw4gv",
   "date": "2017-04-22 14:42:17",
   "depth": 1,
   "text": "> Idk why but Celestia looks so much like Rin from Fate/. They have the same face I feel. \n\nReminds me more of Akame from Akame ga Kill."
  },
  {
   "score": 5,
   "id": "dgm3h0j",
   "pid": "t1_dglw4gv",
   "date": "2017-04-22 12:45:35",
   "depth": 1,
   "text": "Just a heads-up in case you aren't aware: You can choose between different subtitle-styles on Amazon, which means you can get rid of the extremely ugly textbox."
  },
  {
   "score": 3,
   "id": "dgm4b9f",
   "pid": "t1_dgm3h0j",
   "date": "2017-04-22 13:04:18",
   "depth": 2,
   "text": "Didn't know that thanks!"
  },
  {
   "score": 8,
   "id": "dglxk1b",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:32:49",
   "depth": 0,
   "text": "Hmm some nice world building this week.  \n\nWe find out about Needless-kun (hes a fairly nice guy, shocker), we meet Lance Saber who grabs the loli and runs, and we see our rag tag buncha heroes experment with creation.  It looks like its gonna need more which is good, dont want to resolve that too fast since it seems to be something of importance to them.  \n\nAlso at the end we get a tease at info.  Sword Bitch is talking to the sky about knowing who MC-kun is, and shes talking to who ill guess was Suicide-chan from ep1.  So maybe Suicide-chan was her creator and also MC-kun's sister or something?  \n\nMan they are tossin so much at us and its only ep 3, still 22 more to go.  hngggg.  \n\n[](#juice1)"
  },
  {
   "score": 1,
   "id": "dgpz1wt",
   "pid": "t1_dglxk1b",
   "date": "2017-04-25 02:06:45",
   "depth": 1,
   "text": "This is hilarious"
  },
  {
   "score": 1,
   "id": "dgq0cca",
   "pid": "t1_dgpz1wt",
   "date": "2017-04-25 03:15:08",
   "depth": 2,
   "text": "what is?"
  },
  {
   "score": 8,
   "id": "dglywkz",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:02:07",
   "depth": 0,
   "text": "get spoil your own story , could be a good mindblow ¯\\_(ツ)_/¯"
  },
  {
   "score": 8,
   "id": "dgo9nv0",
   "pid": "t3_66w5q4",
   "date": "2017-04-23 23:25:15",
   "depth": 0,
   "text": "Imagine the fanfic crossover. \n\nUnlimited fanfic works. \n\n\n"
  },
  {
   "score": 7,
   "id": "dgm4ed7",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 13:06:15",
   "depth": 0,
   "text": "I'm betting the magical girl will become quite the unfortunate villain the longer she remains in the \"real world\", as none of the concepts of the real world fit her original world view.\n\nWhich leads me to wonder what would happen once the \"real world\" residents start to see the magical girl as a monster/terrorist. Given that the production team can stop working on the show in light of the incidents the magical girl causes, and that people might start shunning the show she came from. Will she transform into something else, or dissolve out of existence?\n\n---\n\nThoughts on Celejia:\n\n* She's somehow the most mentally balanced character so far even though she's just entered \"our\" reality\". Capable of giving relevant life advice to the normal guy.\n* Keeps on blaming her creator a lot (is she harboring despair somewhere about her life going to hell in her story?) \n"
  },
  {
   "score": 5,
   "id": "dgmv8vx",
   "pid": "t1_dgm4ed7",
   "date": "2017-04-23 00:50:57",
   "depth": 1,
   "text": "Do agree with your thoughts on Mamika she seems to have the most fragile mind of all the fictional characters. If anything she may turn into a blood lusted creature of death and destruction if someone doesn't help her, or she'll be killed later on. "
  },
  {
   "score": 7,
   "id": "dgmier9",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 18:33:16",
   "depth": 0,
   "text": "\"I never asked you to give birth to me!\" I have been waiting for someone to say this.\n\nIn the first episode thread I said that now we could get spoilers straight from a character's mouth if this happened irl but now poor Selesia just got spoiled by her illustrator."
  },
  {
   "score": 7,
   "id": "dgmlupi",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 19:55:59",
   "depth": 0,
   "text": "[Alicetelia](http://i.imgur.com/AF0G4Mx.jpg) looks pretty much identical to [Arianrhod](http://i.imgur.com/Tu1QgCI.png) from [The Legend of Heroes: Ao no Kiseki](http://legendofheroes.wikia.com/wiki/The_Legend_of_Heroes:_Ao_no_Kiseki)."
  },
  {
   "score": 13,
   "id": "dglzeez",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:12:59",
   "depth": 0,
   "text": "because Selesia is from the anime and not from the LN, that's probably why her author/Marine couldn't change her. It has to be changed in the anime."
  },
  {
   "score": 12,
   "id": "dglzkuz",
   "pid": "t1_dglzeez",
   "date": "2017-04-22 11:16:51",
   "depth": 1,
   "text": "Oh if there's an episode where Selesia LN meets Selesia anime it would be downright hilarious"
  },
  {
   "score": 12,
   "id": "dglxl4f",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:33:30",
   "depth": 0,
   "text": "I sense a Civil War coming"
  },
  {
   "score": 6,
   "id": "dgmi7gh",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 18:28:06",
   "depth": 0,
   "text": "Anybody else looking forward to the MC actually being useful, it's like we are watching MC watching shit happen. Never seen a MC more useless in my life. I was going to scratch that out and point out another MC that is more useless, but there is none. Check [MAL](https://myanimelist.net/animelist/IceDrake), and prove me wrong."
  },
  {
   "score": 7,
   "id": "dgn2zeh",
   "pid": "t1_dgmi7gh",
   "date": "2017-04-23 06:45:57",
   "depth": 1,
   "text": "Didn't he say, at the very beginning, that he was just a narator to the story? But I do agree that he should play some important part in the story. "
  },
  {
   "score": 20,
   "id": "dgmiaws",
   "pid": "t1_dgmi7gh",
   "date": "2017-04-22 18:30:35",
   "depth": 1,
   "text": "Is he really in a position to be able to do much when people with superpowers and lot more strength than him start changing the world around him? He's just a high school kid who happens to like anime, LNs, and manga."
  },
  {
   "score": 2,
   "id": "dgmlvf4",
   "pid": "t1_dgmiaws",
   "date": "2017-04-22 19:56:27",
   "depth": 2,
   "text": "\"Appears\", as seen in this episode and episode 1, the military girl seems to know something about him and he is not as simple as he appears."
  },
  {
   "score": 4,
   "id": "dgmslxz",
   "pid": "t1_dgmlvf4",
   "date": "2017-04-22 23:01:09",
   "depth": 3,
   "text": "The theory that he wrote military girls world in the future doesn't seem entirely unlikely."
  },
  {
   "score": 5,
   "id": "dgmu13v",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 23:56:11",
   "depth": 0,
   "text": "They gotta release the written story online, like on reddit or something.\n\nThen release the illustration on pixiv and post it on reddit or something.\n\nThat'll get the ball rolling."
  },
  {
   "score": 1,
   "id": "dgn7yts",
   "pid": "t1_dgmu13v",
   "date": "2017-04-23 08:55:08",
   "depth": 1,
   "text": "If she is from the [anime and not written work](http://i.imgur.com/8S4DPpU.jpg), I have to assume they need to at least animate it or something. Would suck if it had to be to the point where it had to be aired and viewed on TV. Wonder how much that'd cost to test."
  },
  {
   "score": 1,
   "id": "dgn8bwq",
   "pid": "t1_dgn7yts",
   "date": "2017-04-23 09:03:27",
   "depth": 2,
   "text": "If it has to be animated, then fuck.\n\nBut, if just has to be seen by the fans and appreciated as original work from the creators, then it should work!\n\nBut yeah, if it has to be animated then, fuck."
  },
  {
   "score": 18,
   "id": "dglxq2n",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:36:33",
   "depth": 0,
   "text": "[Someone posted with similar Darkness is to the new Lancer character.](https://twitter.com/lmaradiaga86/status/853822559380549633)\n\nPretty funny."
  },
  {
   "score": 2,
   "id": "dgm0ino",
   "pid": "t1_dglxq2n",
   "date": "2017-04-22 11:38:05",
   "depth": 1,
   "text": "Wouldn't it be the other way since the Lancer character has a bit more detail than Darkness? Or is it the fact that I forgot about this particular PCMR joke"
  },
  {
   "score": 1,
   "id": "dgmd0ei",
   "pid": "t1_dgm0ino",
   "date": "2017-04-22 16:20:39",
   "depth": 2,
   "text": ">implying novideo could ever come close to premium AMD graphics"
  },
  {
   "score": 12,
   "id": "dgm9zpp",
   "pid": "t1_dglxq2n",
   "date": "2017-04-22 15:10:23",
   "depth": 1,
   "text": "Oh god can you imagine if Darkness materialized? Or any ecchi anime character?"
  },
  {
   "score": 2,
   "id": "dgmv3rh",
   "pid": "t1_dgm9zpp",
   "date": "2017-04-23 00:44:20",
   "depth": 2,
   "text": "She'd be arrested for disturbing the peace and acting like a pervert. If I know Darkness she'll love being forced into a police car and having to spend a night in a prison cell.\n\nIf it were someone like Issei Hyodo or Rito Yuki they would be arrested for sexual harassment before the first hour."
  },
  {
   "score": 4,
   "id": "dgm1emr",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:58:33",
   "depth": 0,
   "text": "Hmm... the need for the changes to leave a lasting impact and impression on the viewers and target audience as a whole. Kind of like the myth and legend system for Heroic spirits in the Nasuverse then, where different heroes get different classes based on the different events of their lives."
  },
  {
   "score": 5,
   "id": "dgm4yn8",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 13:19:05",
   "depth": 0,
   "text": "I see some disappointed comments but for the moment I'm having a blast with the show.\n\nSo far, my only expectation is for the anime to surprise me once a week. For the moment it has.\n\nI didn't expect the \"Different stories had different rules. Now they share their rules with Earth rules\" last week.\n\nAnd I didn't expect Selesia getting spoiled that much so soon.\n\nI still think it has lots of potential if done right. For the moment it has won me with its meta."
  },
  {
   "score": 5,
   "id": "dgm9ktb",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 15:01:00",
   "depth": 0,
   "text": "the whole \"changing the setting effects the actual person\" thing is way too easy for porn...\n\nnot complaining though( ͡° ͜ʖ ͡°) \n"
  },
  {
   "score": 5,
   "id": "dgmhzc8",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 18:22:30",
   "depth": 0,
   "text": "I love the character interactions in this show. It really makes you think about how different people come from different places and experiences, and how that forms their character as a person.\n\nThat said, I wonder if they're ever going to tackle the issue of adaptation. Anime usually have some slight changes to the source material, and some series even have original storylines (mostly because they caught up to the manga/LN). Would there be two Selesias, or would details from both works affect her cumulatively?"
  },
  {
   "score": 5,
   "id": "dgmrlax",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 22:27:11",
   "depth": 0,
   "text": "Didn't they clarify that Selesia is the version of herself from the anime not the manga? So it only makes sense for her to get her new powers if they are animated not drawn"
  },
  {
   "score": 9,
   "id": "dglvlh6",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 09:49:20",
   "depth": 0,
   "text": "I think Souta kun is gonna be one of the most important guy dat drives the latter half part of the show, because he is already motivated to draw his characters, maybe one of his characters is going to be called into real life. I even suspect dat the military girl is created by Souta (or at least they r having some kind of relationship like this) according to what she said at the end. "
  },
  {
   "score": 7,
   "id": "dglzrui",
   "pid": "t1_dglvlh6",
   "date": "2017-04-22 11:21:09",
   "depth": 1,
   "text": "Sota will return, I think, but I'm pretty sure Military Girl is his sisters creation, not Sota's. "
  },
  {
   "score": 2,
   "id": "dgnvdw4",
   "pid": "t1_dglzrui",
   "date": "2017-04-23 17:06:21",
   "depth": 2,
   "text": "Personal take is that the sister made the story and Sota drew it."
  },
  {
   "score": 4,
   "id": "dglxmd0",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:34:15",
   "depth": 0,
   "text": "Great episode... still not sure if this is going to end up as a Slice of Life anime or not considering the ED."
  },
  {
   "score": 8,
   "id": "dgm9mlv",
   "pid": "t1_dglxmd0",
   "date": "2017-04-22 15:02:08",
   "depth": 1,
   "text": "Seems the anime is going to be 20-something episodes long, I wouldn't mind if we get a couple of SoL episodes between major events, not so much the plot becomes meaningless but to serve to cooldown before building up again."
  },
  {
   "score": 4,
   "id": "dgm7s6g",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 14:21:34",
   "depth": 0,
   "text": "Thank God the Creators weren't allowed to change the descriptions/powers of their Creations, or else everyone would become super overpowered, and the series would become a lot worse"
  },
  {
   "score": 5,
   "id": "dgmtspr",
   "pid": "t1_dgm7s6g",
   "date": "2017-04-22 23:46:24",
   "depth": 1,
   "text": "I'm guessing powerups are coming but changes need to be \"viewed\" by people in order to take effect."
  },
  {
   "score": 12,
   "id": "dglq4bs",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 07:36:02",
   "depth": 0,
   "text": "[removed]"
  },
  {
   "score": 10,
   "id": "dgls1a2",
   "pid": "t1_dglq4bs",
   "date": "2017-04-22 08:25:11",
   "depth": 1,
   "text": "Someone already uploaded a direct screen capture of Amazon's subs to a *certain site*.\n\nAs for the legal release, we're fucked."
  },
  {
   "score": 1,
   "id": "dglstqq",
   "pid": "t1_dgls1a2",
   "date": "2017-04-22 08:44:16",
   "depth": 2,
   "text": "I can't find this certain site.\n\nPm please?"
  },
  {
   "score": 3,
   "id": "dglt4ha",
   "pid": "t1_dglstqq",
   "date": "2017-04-22 08:51:24",
   "depth": 3,
   "text": "It's that one anime torrenting website. Not on any streaming sites."
  },
  {
   "score": 2,
   "id": "dglt6k6",
   "pid": "t1_dglt4ha",
   "date": "2017-04-22 08:52:49",
   "depth": 4,
   "text": "Found it. it was pretty far down the list and the filtered it out on my usual filter."
  },
  {
   "score": 2,
   "id": "dglwred",
   "pid": "t1_dglt6k6",
   "date": "2017-04-22 10:15:09",
   "depth": 5,
   "text": "For the future\n just google  re:creaters episode 3( number of the week) english sub and you find it really easy, this week it was like the second link i tried:D"
  },
  {
   "score": 1,
   "id": "dglxsd1",
   "pid": "t1_dglwred",
   "date": "2017-04-22 10:38:00",
   "depth": 6,
   "text": "For future reference, that is not the issue. There is a delay between the pirated version and the US/Japan only version, hence why NONE of us could've found it."
  },
  {
   "score": 3,
   "id": "dglsthu",
   "pid": "t1_dgls1a2",
   "date": "2017-04-22 08:44:07",
   "depth": 2,
   "text": "Do screencaptures look ok? i haven't watched one."
  },
  {
   "score": 5,
   "id": "dgltafv",
   "pid": "t1_dglsthu",
   "date": "2017-04-22 08:55:23",
   "depth": 3,
   "text": "No."
  },
  {
   "score": 5,
   "id": "dglt30j",
   "pid": "t1_dglsthu",
   "date": "2017-04-22 08:50:25",
   "depth": 3,
   "text": "This one looks good."
  },
  {
   "score": 10,
   "id": "dgltwxm",
   "pid": "t1_dglsthu",
   "date": "2017-04-22 09:10:24",
   "depth": 3,
   "text": "it looks pretty fine tbh."
  },
  {
   "score": 18,
   "id": "dglyx6l",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:02:29",
   "depth": 0,
   "text": "*[I'm not going to make you invincible](http://i.imgur.com/9UW8eka.jpg)*\n\nIf only Kirito & Bell's creator would have said/done that, things would have been more enjoyable. If only...\n\nAnd this is the reason why it's a pain in the butt to join boards and have some knucklehead discuss [spoilers](http://imgur.com/a/lcvKY) from the Manga or LN and ruin the fun for everyone else.\n\n\n*[Force our creator to change our world?](http://i.imgur.com/6Fkmdpp.jpg)* it would be fun to watch Rem meet her creator with knife in hand and question him/her why Subaru just wouldn't love her.\n\n[](#yandereyuno)\n\nI feel sorry for MC-kun, two gorgeous babes leave his room for a better place.\n\nI love how this show came out of nowhere and it's becoming the best show so far in the season.\n\n"
  },
  {
   "score": 1,
   "id": "dgru47w",
   "pid": "t1_dglyx6l",
   "date": "2017-04-26 06:18:20",
   "depth": 1,
   "text": "> If only Kirito's creator would have said/done that, things would have been more enjoyable. If only...\n\n*cough Alicization cough*\n"
  },
  {
   "score": 6,
   "id": "dgmxb9v",
   "pid": "t1_dglyx6l",
   "date": "2017-04-23 02:37:07",
   "depth": 1,
   "text": ">  it would be fun to watch Rem meet her creator with knife in hand and question him/her why Subaru just wouldn't love her.  \n\nIIRC, didn't he write an alternate short story of Subaru x Rem? I think he might point to that instead..."
  },
  {
   "score": 12,
   "id": "dgmeyk5",
   "pid": "t1_dglyx6l",
   "date": "2017-04-22 17:07:38",
   "depth": 1,
   "text": "> If only Kirito & Bell's creator would have said/done that, things would have been more enjoyable. If only...\n\n*cough cough Tatsuya Shiba cough cough*\n"
  },
  {
   "score": 8,
   "id": "dgmqod0",
   "pid": "t1_dgmeyk5",
   "date": "2017-04-22 22:01:31",
   "depth": 2,
   "text": "I'm sorry, do you have a problem with emotionally void magic jesus?"
  },
  {
   "score": 5,
   "id": "dgmu0o2",
   "pid": "t1_dgmqod0",
   "date": "2017-04-22 23:55:41",
   "depth": 3,
   "text": "Maybe.\n\nHe's not a fuckmothering vampire, for one."
  },
  {
   "score": 3,
   "id": "dglz39i",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:06:13",
   "depth": 0,
   "text": "Okay so this episode showed that the process of changing a character is a lot more difficult than the \"creators\" adding something. Setsuna is the new name and someone brought up here that she might be the girl that killed herself which follows through when the military girl said that Souta was *part of the world that banished you*. \n\nThis is theory crafting but I'm guessing Setsuna's death was also the reason Souta has trouble drawing; those two were probably close considering the military girl knows Souta pretty well.\n\n\nI'm curious to see where this show will go since 3 episodes aren't really enough (then again, the 3 episode rule is a guideline and not a parameter to begin with).\n\n "
  },
  {
   "score": 3,
   "id": "dgmm9ui",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 20:05:05",
   "depth": 0,
   "text": "I don’t completely buy that the new power didn’t work because Selesia is from the anime. Just because the anime hasn't caught up with the source material, doesn't mean that the seeds for those future events in the source material aren't in that anime universe or that the anime universe doesn't change to accommodate the new information created when a new LN is released. I don't think Selesia's experience is reliable enough to go on because she's still a character in that world and wouldn't know every thing that's happening in it.\n\nObviously the Creators *can* change the characters and their world. That’s the whole point of the villain’s motivation and this anime would go nowhere if it weren't the case, so I believe it's possible for Selesia to obtain that new power. But just writing the new power wasn't enough and having an illustration along with some context wasn't enough. Of course it wasn't going to be as easy as \"I'm going to give you a new power\" and she could suddenly use it.\n\nI think the key that makes the idea real is the connection to a large number of people like they were saying later on in the episode. They help subconsciously fill in the complex details that make it possible for the fictional world to actually exist. It ties into Meteora’s explanation of recollection when Marine was surprised by stitching in Selesia's clothes. I don't think the Creator's intentions alone are enough, it's the connection with the hearts of the fans that make the fiction real.\n"
  },
  {
   "score": 2,
   "id": "dgluhh8",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 09:23:43",
   "depth": 0,
   "text": "I didn't even notice that it's released early. Thanks. I am watching it right now.  (〃＞＿＜;〃)\n"
  },
  {
   "score": 2,
   "id": "dglz41z",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:06:42",
   "depth": 0,
   "text": "Lancer Arturia kiiitaaaa!"
  },
  {
   "score": 2,
   "id": "dgm0o04",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:41:31",
   "depth": 0,
   "text": "Alright Selesia having her own life spoiled was pretty funny.\n\nI hope we see more of Mamika, she's my favourite so far."
  },
  {
   "score": 2,
   "id": "dgm1sxk",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 12:07:44",
   "depth": 0,
   "text": "I'm kinda disappointed that mahou shoujo got saved... I know it's a part of her character to act like she does and she cannot do anything about it but it's annoying to watch nevertheless."
  },
  {
   "score": 8,
   "id": "dgm2k4v",
   "pid": "t1_dgm1sxk",
   "date": "2017-04-22 12:24:49",
   "depth": 1,
   "text": "I thought magical girl was going to die in episode 3 as a meta joke"
  },
  {
   "score": 1,
   "id": "dgpz5j3",
   "pid": "t1_dgm2k4v",
   "date": "2017-04-25 02:12:11",
   "depth": 2,
   "text": "That would have been really gutsy. IMO this show has been (merely) OK so far, but I think it would have been pretty special if they went all in on the meta-humour as its premise"
  },
  {
   "score": 2,
   "id": "dgm745q",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 14:06:30",
   "depth": 0,
   "text": "These 3 episodes have been very well done. The music, dialogue, and animation has all been amazing. The interactions with selesia and her creator and their dynamic father/daughter relationship is the best way they could have made it. Im gonna guess the others will have a specific kind of relationship with their creators. Like Yuya could have some kind of best friend or brother-ish kind of relationship with his creator if he meets him/her. Like maybe his creator made him with that kind of character in mind so thats how he would act with his creator. I just hope we get to see more interactions like this with the other characters."
  },
  {
   "score": 2,
   "id": "dgmi6d1",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 18:27:19",
   "depth": 0,
   "text": "New theory;\nSetsuna is the character Sota made and stopped drawing.\nMeaning that by \"banished\" Gunpuku is referring to the fact that the world Sota drew would have stopped, possibly leaving Setsuna unable to travel to others.\nStill, could be wrong"
  },
  {
   "score": 3,
   "id": "dgmqspd",
   "pid": "t1_dgmi6d1",
   "date": "2017-04-22 22:04:42",
   "depth": 1,
   "text": "I'm pretty sure all the characters are characters he's drawn at some point, including the military girl, who's not from a story, who was his original design at some point.\n\nOr maybe him and the girl who's committed suicide in ep 1 and is in the OP made something, the girl writing the characters and him drawing them."
  },
  {
   "score": 1,
   "id": "dgmuwpm",
   "pid": "t1_dgmqspd",
   "date": "2017-04-23 00:35:07",
   "depth": 2,
   "text": "> I'm pretty sure all the characters are characters he's drawn at some point, including the military girl, who's not from a story, who was his original design at some point.\n> \n\nGood point. \nNow I'm even more excited for the next episode!"
  },
  {
   "score": 2,
   "id": "dgmlyer",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 19:58:20",
   "depth": 0,
   "text": "I kinda like it that the OP is the dirty, gritty reality of them being dragged into this world, but the ED is them experiencing the not-so-gritty fun stuff that we also built in this world."
  },
  {
   "score": 2,
   "id": "dgmy6vk",
   "pid": "t3_66w5q4",
   "date": "2017-04-23 03:24:55",
   "depth": 0,
   "text": "This episode was genuinely good. I love how they are creating something coherent from what we thought was a mess. This is Japan anime's signature. Eager to see more."
  },
  {
   "score": 2,
   "id": "dgn26i0",
   "pid": "t3_66w5q4",
   "date": "2017-04-23 06:20:07",
   "depth": 0,
   "text": "Hm...for whatever reason, I really like the military girl's character design."
  },
  {
   "score": 2,
   "id": "dgn2vnk",
   "pid": "t1_dgn26i0",
   "date": "2017-04-23 06:42:38",
   "depth": 1,
   "text": "You are not alone."
  },
  {
   "score": 2,
   "id": "dgnughd",
   "pid": "t3_66w5q4",
   "date": "2017-04-23 16:45:47",
   "depth": 0,
   "text": "I'm confused about gunpoku(military uniform pricess). I thought the reason that created are appreaing in the real world cuz they are popular. But the MC clearly said in ep2 that he never seen gunpoku bf. so basically,where did her popularity come from? Impact from the past which leave a big impression on many people? Cant wait to find out more."
  },
  {
   "score": 2,
   "id": "dgp3qro",
   "pid": "t1_dgnughd",
   "date": "2017-04-24 12:42:40",
   "depth": 1,
   "text": "It basically suggests that the \"popularity\" theory is wrong. Unless, of course, she's a time traveler and she comes from a time where chunni magic sword chicks like her are popular."
  },
  {
   "score": 1,
   "id": "dgp83l7",
   "pid": "t1_dgp3qro",
   "date": "2017-04-24 14:02:45",
   "depth": 2,
   "text": "i dont think it is wrong, but i do think she is an 'exception'. i means she is the one who make the worlds collide --> meaning she is the first one who apprehend - the condition may be different from another. After the world collide a popularity began to materialize.\n\nAlso, i found the concept of time traveler dint make sense here. if she really did come from the future why didnt she just come to her precious setsuna and recuse her bf she get banished/sucide.(what the point of jumping back to the past just to destroy the world)\n\nSo far my theory goes like this:\n\n   - setsuna & sona create military girl\n\n   - setsuna do something and she comes to this world\n\n   - she learns about this world include sota\n\n   - setsuna commit suicide\n\n   - she develop a hate feeling to this world\n\n   - she make the worlds collide & summon others for a purpose of revenge\n\n   -  \n"
  },
  {
   "score": 2,
   "id": "dgo9zsn",
   "pid": "t1_dgnughd",
   "date": "2017-04-23 23:39:03",
   "depth": 1,
   "text": "I'm confused with you. This is probably the main thing in the show I want to learn about."
  },
  {
   "score": 2,
   "id": "dgm1931",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:55:02",
   "depth": 0,
   "text": "Feeling a lot of plotholes, to me with the atmosphere of the setting of the show they should be better explained.\n\nCan't go wrong with that aldnoah zero op tho\n\nEdit: is anyone else here excited to see the obligatory \"get in casual clothes to fit in\" scene, its gonna be so good and funny"
  },
  {
   "score": 4,
   "id": "dgmbv6e",
   "pid": "t1_dgm1931",
   "date": "2017-04-22 15:53:29",
   "depth": 1,
   "text": "> Feeling a lot of plotholes, to me with he setting of the show hey should be explained.\n\nMind expanding on that?"
  },
  {
   "score": 1,
   "id": "dgmdw8a",
   "pid": "t1_dgmbv6e",
   "date": "2017-04-22 16:42:04",
   "depth": 2,
   "text": "Yeh I totally spazzed out there, its fixed"
  },
  {
   "score": 4,
   "id": "dgmfeyr",
   "pid": "t1_dgmdw8a",
   "date": "2017-04-22 17:18:55",
   "depth": 3,
   "text": "I don't see any plotholes."
  },
  {
   "score": 9,
   "id": "dgmb2hq",
   "pid": "t1_dgm1931",
   "date": "2017-04-22 15:35:28",
   "depth": 1,
   "text": "I think they would be really confused by the number of different clothes in people's wardrobes, given that they wear repetitive outfits."
  },
  {
   "score": 2,
   "id": "dgm1iy0",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 12:01:19",
   "depth": 0,
   "text": "I was expecting it to start turning into an action show where creators invent the better versions of their characters to fight against each other, and then the anti-climax happened.\n\nI still don't know where this show is going, and I don't think it is a good sign. We're 3 episodes in, and the last 2 episodes had a lot of talking, but we barely learned anything, if you think about it. Almost all the characters didn't go beyond their archetypes (with the only exception being the bad guy who turned out to be kind of nice and interesting), while the creators are just boring people to follow as you'd probably expect them to be.\n\nThe show has a lot to prove in the next few episodes. It touches on some interesting concepts, but I'm not sure it will be able to explore them properly. One worrying sign is the show telling us how the LN author outlined the world view of the heroine very well. But we don't actually see it. Arguing with the creator is one thing, but other than that she acts like a super generic fantasy LN female protagonist. Is the show going to tell us that LNs like these feature well written characters? In most cases they clearly don't.\n\nI also don't like how the illustrator immediately buys the idea of the characters being the real deal. I wouldn't want her to overreact, but at least some level of suspicion would make the scene much more believable, especially after they failed to change the character."
  },
  {
   "score": 1,
   "id": "dgpz9c9",
   "pid": "t1_dgm1iy0",
   "date": "2017-04-25 02:17:56",
   "depth": 1,
   "text": "Sums up what I'm feeling really well. I think the show's strongest feature is still its premise, which is a bit worrying even at episode 3 out of 22."
  },
  {
   "score": 3,
   "id": "dgmgo1r",
   "pid": "t1_dgm1iy0",
   "date": "2017-04-22 17:49:57",
   "depth": 1,
   "text": "> I still don't know where this show is going, and I don't think it is a good sign. We're 3 episodes in...\n\nOf a 22 episode series. Give the show time to actually develop. The characters know just as much or less than we do."
  },
  {
   "score": 1,
   "id": "dgm2tc6",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 12:30:45",
   "depth": 0,
   "text": "Damn this show is sweet. The character interactions are just so fresh and interesting given the plot, and seeing the different genres of the characters is sweet\n\nAlso I'm guessing right now that Sota has something to do with maybe drawing Military-Uniform-chan and another character when he was younger, yet he killed off the other character and now she's out for revenge. "
  },
  {
   "score": 1,
   "id": "dgm42ot",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 12:59:05",
   "depth": 0,
   "text": "So Suicide girl somehow knew our protag who has in-turn told Military chick about the nature of this world. My guess is that she crushed on him given their conversation."
  },
  {
   "score": 1,
   "id": "dgm4ovy",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 13:13:00",
   "depth": 0,
   "text": "do animes like Mamika actually exist?? i always see parodies of a loli that has a wand and super friendship power and stuff but i never actually hear of them as actual shows"
  },
  {
   "score": 6,
   "id": "dgmab2f",
   "pid": "t1_dgm4ovy",
   "date": "2017-04-22 15:17:44",
   "depth": 1,
   "text": "Yes they exist, they are aimed mainly at younger girls. One that seems to be the source of multiple parodies and basically has set the magical girl image in stone is <Cardcaptor Sakura> that ran for a few years at the end of the 90s (and will have a new series next year), before that the most popular one was probably Sailor Moon.\n\nThese shows are really for a complete different demographic than the people you would find in this sub though."
  },
  {
   "score": 10,
   "id": "dgm524k",
   "pid": "t1_dgm4ovy",
   "date": "2017-04-22 13:21:17",
   "depth": 1,
   "text": "Are you asking if magical girl shows really exist? You know for parodies to exist there has to be something to parody. Magical Girl shows are not that big in NA. Sailor Moon was probably most widely known but there are tons of these shows and they're pretty popular in Japan."
  },
  {
   "score": 1,
   "id": "dgm58g8",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 13:25:21",
   "depth": 0,
   "text": "Another great episode. Mirokuji needs some more fight scenes. That disappointment when Selesia didn't suddenly get updated though."
  },
  {
   "score": 1,
   "id": "dgm5d04",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 13:28:08",
   "depth": 0,
   "text": "Still can't unhear Onoda from the MC as a YowaPeda watcher. \n\nCalling it now military uniform girl is MC's creation and he mad her lover look like himself"
  },
  {
   "score": 1,
   "id": "dgm6auy",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 13:48:51",
   "depth": 0,
   "text": "So people have to accept the changes/power for it to take affect.  Maybe the author can post it online with a pretext of giving her these powers in a future episode, if it is accepted by fans then maybe she will get the powers."
  },
  {
   "score": 1,
   "id": "dgm6g7g",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 13:52:01",
   "depth": 0,
   "text": "I got an idea (it's from Alan Wake game), what if in the end Sota was draw the military uniform girl and write some story from the beginning? Would he be a god of all gods since now he can literally control the world?"
  },
  {
   "score": 1,
   "id": "dgm6ky9",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 13:54:55",
   "depth": 0,
   "text": "This episode was stellar. Got to see more Yuuya and the interaction with Selesia and her creator, just damn... I know that the people on the [subreddit for it](https://www.reddit.com/r/ReCreators/) will go crazy about it."
  },
  {
   "score": 1,
   "id": "dguubpk",
   "pid": "t1_dgm6ky9",
   "date": "2017-04-27 21:24:27",
   "depth": 1,
   "text": "Dat advertisement though xD"
  },
  {
   "score": 1,
   "id": "dgma21n",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 15:11:53",
   "depth": 0,
   "text": "This is like an anime version of Toy Story"
  },
  {
   "score": 1,
   "id": "dgmafu4",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 15:20:46",
   "depth": 0,
   "text": "so i think the one who created the militarily uniform girl is sota's sister\nand she died, so the Militarily uniform girl knew who sota is which explains the end of the episode, And sota probably quit drawing either because he was bad or because of his sister, remember this is just a theory and everything here is just something i picked up while watching the episodes :3."
  },
  {
   "score": 1,
   "id": "dgme696",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 16:48:41",
   "depth": 0,
   "text": "I think I like the ED more than the anime. If the show was more lighthearted and took itself less serious I would enjoy it more. And I'm not feeling Sawano's OST this time."
  },
  {
   "score": 1,
   "id": "dgme6b3",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 16:48:43",
   "depth": 0,
   "text": "This answers some questions I had, but also leaves some more.\n\n* If popularity determines which stories become real, are there really bare-bones worlds out there based on single episode ovas?\n* How do characters experience the events during time skips and montages?\n* How do the worlds based on very inconsistent stories function?\n* Since the Saw films probably have about as many fans as any anime, do they exist in some world somewhere?\n* How do retcons affect the fiction worlds?\n* In SAO's world, did chapter 16.5 really happen?\n* In world's based on VNs, which route is real? Does each route get a world?\n* Is there a world based on Candy Crush?\n\nThe more I think about the meta-physics of the show, the more confused I get, but it's still a very entertaining show. Personally I'm leaning more towards the worlds existing independent of any actions of the inhabitants of our world, and some people just receive information about those worlds and create fiction based on it. I think I'm going to take some ibuprofen and take a nap."
  },
  {
   "score": 1,
   "id": "dgmev89",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 17:05:25",
   "depth": 0,
   "text": "Ok, so some girl wrote up something but no body wanted to publish her work so she jumped, her created pop up summon other characters from hit works by other authors to screw up the world of the creators.\n\npetty reason much?"
  },
  {
   "score": 1,
   "id": "dgmi3oj",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 18:25:28",
   "depth": 0,
   "text": "So if you write a story and then a character from that is brought to the real world you cant just put them back into the story right, but one of the characters in this seems to want to go back to their own world\n\nseems bad... cause youd have memories of being in that world but you probably weren't conscious there. That's how I'm interpreting these worlds for now."
  },
  {
   "score": 1,
   "id": "dgmnlh5",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 20:37:05",
   "depth": 0,
   "text": "So, the canon is important. The story needs to be published and accepted as true. But I think Selesia's powers change according the anime episodes, since she is from the anime."
  },
  {
   "score": 1,
   "id": "dgmwbhr",
   "pid": "t1_dgmnlh5",
   "date": "2017-04-23 01:44:27",
   "depth": 1,
   "text": "But the anime follows the the VN/Manga in most cases, though"
  },
  {
   "score": 1,
   "id": "dgn84nd",
   "pid": "t1_dgmwbhr",
   "date": "2017-04-23 08:58:48",
   "depth": 2,
   "text": "A lot of anime adaptations change from the original work. A lot of Manga/VN readers here complain about that all the time.\n\nBiggest example I can recall is [Sousei no Onmyouji](https://myanimelist.net/anime/32105/Sousei_no_Onmyouji) with anime original characters and such."
  },
  {
   "score": 1,
   "id": "dgmoejx",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 20:58:05",
   "depth": 0,
   "text": "This is like 'American Gods' or something?"
  },
  {
   "score": 1,
   "id": "dgmtshx",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 23:46:09",
   "depth": 0,
   "text": "A fair amount of exposition.  But at the same time it didn't feel forced.  Also, there is something larger afoot.  In the last scene, the Military Princess is saying that Sota is involved again.  Something big is in the works.  "
  },
  {
   "score": 1,
   "id": "dgn942e",
   "pid": "t3_66w5q4",
   "date": "2017-04-23 09:20:42",
   "depth": 0,
   "text": "I am not watching this anime (yet?).How is this show so far guys? What other anime is like this? "
  },
  {
   "score": 1,
   "id": "dgncs7i",
   "pid": "t1_dgn942e",
   "date": "2017-04-23 10:40:45",
   "depth": 1,
   "text": "It's good and you should watch it."
  },
  {
   "score": 2,
   "id": "dgnct60",
   "pid": "t1_dgncs7i",
   "date": "2017-04-23 10:41:20",
   "depth": 2,
   "text": "nice and simple. Thanks! Just dont like that its on amazon and I have to pay for it :/"
  },
  {
   "score": 1,
   "id": "dgnbrmo",
   "pid": "t3_66w5q4",
   "date": "2017-04-23 10:18:58",
   "depth": 0,
   "text": "Just dropping this here https://www.reddit.com/r/anime/comments/65jpox/recreators_episode_2_discussion/dgbrxc7/\n\nGlad they went this general direction as obvious as it might be"
  },
  {
   "score": 1,
   "id": "dgrb9c8",
   "pid": "t3_66w5q4",
   "date": "2017-04-25 19:42:43",
   "depth": 0,
   "text": "Sorry Rick and Morty already beat you to the punch line.\n\nhttps://www.youtube.com/watch?v=-7L6SSxIvms"
  },
  {
   "score": 1,
   "id": "dh89201",
   "pid": "t3_66w5q4",
   "date": "2017-05-06 19:07:16",
   "depth": 0,
   "text": "such a wholesome anime"
  },
  {
   "score": 1,
   "id": "dglyqhp",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:58:31",
   "depth": 0,
   "text": "Is this really an action series? Okay, the fight scene is good but I still don't understand why the hell do they have to fight each other. \n\nThis is 3 episode now. So curious what they are going to do with this, the same time I just want to drop it. So confuse."
  },
  {
   "score": 3,
   "id": "dgmb605",
   "pid": "t1_dglyqhp",
   "date": "2017-04-22 15:37:38",
   "depth": 1,
   "text": "One faction wants to force their creators to change their stories using force. Another wants to do it the peaceful way."
  },
  {
   "score": 1,
   "id": "dglz3qc",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 11:06:30",
   "depth": 0,
   "text": "The premise continues to be interesting, but personally so far, it's boring. Pretty much the only character I enjoyed so far is the illustrator and the gang guy. The rest are completely forgettable(even if they are intentionally generic). For me, soundtrack and action are pretty much the only thing carrying this show so far. \n\nAlso I really didn't like the pacing this episode. Did we really need like half an episode just to show that they can't simply change themselves by rewriting things?"
  },
  {
   "score": -3,
   "id": "dglw444",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:00:57",
   "depth": 0,
   "text": "boring ep. Nothing happened and the build-up to the revision ended on literally nothing."
  },
  {
   "score": -3,
   "id": "dgmcag9",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 16:03:26",
   "depth": 0,
   "text": "Ugh, exposition again. Better than last ep, but man, can't we have stupid action back, at least that has cheap thrills to it.  \n\nNo, I don't care for the Military Girl's motives. Seles is the only character I'd listen to because she has balls and a presence for herself. And the epic Shaman King boss wasn't that much of a bad guy either lol, he's actually quite fair.\n\nAlso, the way it teases its own concept doesn't help, since it's probing my mind with how certain characters would manifest in out world. Which is more amusing and entertaining than exposition dumps directed by Aoki :/"
  },
  {
   "score": 0,
   "id": "dgqn8cl",
   "pid": "t3_66w5q4",
   "date": "2017-04-25 11:41:26",
   "depth": 0,
   "text": "I've kind of lost interest in this show now... what a letdown. Another show with good art and music ruined by nothing ever happening except for exposition dumpstering. The white hair chick is annoying and there are times I forget the MC is even there. Unless ep4 is amazing I'm dropping it."
  },
  {
   "score": -3,
   "id": "dglvh1t",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 09:46:33",
   "depth": 0,
   "text": "It's available for non Amazon users! If you want to know where, pm me."
  },
  {
   "score": -4,
   "id": "dglx0ga",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 10:20:46",
   "depth": 0,
   "text": "This show is a fuckin mess. I love it...I think"
  },
  {
   "score": -2,
   "id": "dglpjrp",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 07:20:28",
   "depth": 0,
   "text": "Is it out yet outside of Amazon? "
  },
  {
   "score": 0,
   "id": "dglvino",
   "pid": "t1_dglpjrp",
   "date": "2017-04-22 09:47:34",
   "depth": 1,
   "text": "It is. PM me if you want to know where."
  },
  {
   "score": 1,
   "id": "dglrstw",
   "pid": "t1_dglpjrp",
   "date": "2017-04-22 08:19:32",
   "depth": 1,
   "text": "Last two episodes took 7 hours.\n\nAmazon subs are not easy to rip, someone told me.\n\nThat's why the Re:Creators episode threads lags in the middle rather than the top because they is a long ass delay between official subs and the unofficial subs."
  },
  {
   "score": 10,
   "id": "dglsquj",
   "pid": "t1_dglrstw",
   "date": "2017-04-22 08:42:22",
   "depth": 2,
   "text": "Actually it is easy to rip now, but a certain ripping group you'd expect to hasn't added Amazon shows to their automatic scheduled ripper yet, so they just do it manually whenever they're around."
  },
  {
   "score": 1,
   "id": "dgls4pq",
   "pid": "t1_dglpjrp",
   "date": "2017-04-22 08:27:27",
   "depth": 1,
   "text": "It is now, but only a screen capture."
  },
  {
   "score": 1,
   "id": "dglruj9",
   "pid": "t1_dglpjrp",
   "date": "2017-04-22 08:20:39",
   "depth": 1,
   "text": "The ones who rip from legal sites drop it at 5pm EST, at least according to their schedule."
  },
  {
   "score": 3,
   "id": "dglst0u",
   "pid": "t1_dglruj9",
   "date": "2017-04-22 08:43:48",
   "depth": 2,
   "text": "That time is just a placeholder."
  },
  {
   "score": 5,
   "id": "dglpn3f",
   "pid": "t1_dglpjrp",
   "date": "2017-04-22 07:22:58",
   "depth": 1,
   "text": "Its not on the torrenting site, so no. But given that Sword Oratoria and Rage of Bahamut popped up on there soon aftet Amazon, its only a matter of time."
  },
  {
   "score": 2,
   "id": "dgls5qa",
   "pid": "t1_dglpn3f",
   "date": "2017-04-22 08:28:08",
   "depth": 2,
   "text": "Sword Oratoria and a few others are also on Anime Lab in Australia, which is easier to rip from."
  },
  {
   "score": -7,
   "id": "dglse2q",
   "pid": "t3_66w5q4",
   "date": "2017-04-22 08:33:41",
   "depth": 0,
   "text": "Can we wait until we...? Uh.. get the subs? I don't know how amazon works but it doesn't seem to be available for general public."
  },
  {
   "score": -2,
   "id": "dglvjf7",
   "pid": "t1_dglse2q",
   "date": "2017-04-22 09:48:02",
   "depth": 1,
   "text": "PM me for a place to stream it."
  },
  {
   "score": 5,
   "id": "dglstlr",
   "pid": "t1_dglse2q",
   "date": "2017-04-22 08:44:11",
   "depth": 1,
   "text": "Wait to make a thread until pirates can watch it? Why would anyone do that?"
  },
  {
   "score": 2,
   "id": "dgmc56p",
   "pid": "t1_dglstlr",
   "date": "2017-04-22 16:00:02",
   "depth": 2,
   "text": "> Wait to make a thread until pirates can watch it? Why would anyone do that?\n\nMajority of anime watchers sail the high seas. But I agree, threads should be up as soon as people can see it in any way be it a paying customer or a pirate, whichever gets it first."
  },
  {
   "score": 4,
   "id": "dglvncu",
   "pid": "t1_dglstlr",
   "date": "2017-04-22 09:50:31",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 0,
   "id": "dglvwwx",
   "pid": "t1_dglvncu",
   "date": "2017-04-22 09:56:36",
   "depth": 3,
   "text": ">Why do you think amazon didn't offer it's strike standalone from prime?\n\nDunno.\n\n>And if they did the above, why not make strike as a bundle with prime for people who both want prime and strike without feeling like they're getting racketed?\n\nLike make it cheaper somehow? I'm not sure what you mean.\n\n>Strike isn't a lot, but it rubs people the wrong way to pay twice regardless of the cost.\n\nThen don't pay for it? Though that's a really dumb reason not to."
  },
  {
   "score": 4,
   "id": "dglxzby",
   "pid": "t1_dglvwwx",
   "date": "2017-04-22 10:42:19",
   "depth": 4,
   "text": "[deleted]"
  },
  {
   "score": 1,
   "id": "dgm6trq",
   "pid": "t1_dglxzby",
   "date": "2017-04-22 14:00:16",
   "depth": 5,
   "text": "It's $5/month, so $60 a year versus ~$100 a year for Prime."
  },
  {
   "score": 3,
   "id": "dgmc2og",
   "pid": "t1_dgm6trq",
   "date": "2017-04-22 15:58:23",
   "depth": 6,
   "text": "You need to pay for both..."
  },
  {
   "score": 1,
   "id": "dgmc8o0",
   "pid": "t1_dgmc2og",
   "date": "2017-04-22 16:02:15",
   "depth": 7,
   "text": "I am well aware. "
  },
  {
   "score": 3,
   "id": "dgmegot",
   "pid": "t1_dgmc8o0",
   "date": "2017-04-22 16:55:31",
   "depth": 8,
   "text": "So you'll be paying $160 a year for a piss poor anime selection. Don't you find that a bit weird?\n\nI, for example, don't have that kind of cash to throw away, heck even CR is a stretch for me so I sail the high seas."
  },
  {
   "score": 1,
   "id": "dgmfhxd",
   "pid": "t1_dgmegot",
   "date": "2017-04-22 17:21:01",
   "depth": 9,
   "text": "If they license some anime I want to watch, sure. I mean, I already have Prime anyway."
  },
  {
   "score": 3,
   "id": "dgm0moe",
   "pid": "t1_dglxzby",
   "date": "2017-04-22 11:40:41",
   "depth": 5,
   "text": "Strike is $5 per *month*.\n\nWhen I thought it was just $5 I was annoyed, but considered paying it; when I realized it was $60 on top of the $100, my annoyance quickly turned to hostility."
  },
  {
   "score": 5,
   "id": "dglsqgs",
   "pid": "t1_dglse2q",
   "date": "2017-04-22 08:42:05",
   "depth": 1,
   "text": "To be fair, its not as if Crunchyroll's most recent episodes are available to anyone but paying members too, and for a show like Natsume's Book of Friends (season 6), discussions take place well before pirated versions are made (pirated versions for that show are always delayed for some reason).\n\nI'm more miffed by how it's the US that gets to see it first, and rest of the world (which amazon also has the rights to) are asked to wait for no obvious reason."
  },
  {
   "score": 3,
   "id": "dglt6jx",
   "pid": "t1_dglsqgs",
   "date": "2017-04-22 08:52:49",
   "depth": 2,
   "text": "> (pirated versions for that show are always delayed for some reason)\n\nCR only uploaded a hardsubbed version for about a day, and HS only rips something if it's softsubbed."
  },
  {
   "score": 2,
   "id": "dgltgs5",
   "pid": "t1_dglt6jx",
   "date": "2017-04-22 08:59:40",
   "depth": 3,
   "text": "Huh, the more you learn :). \n\nI wasn't complaining btw, but wanted to give an illustrative example of a reasonably popular show that is discussed on this sub well before pirated copies appear, that you'd need membership and a paid subscription to watch as it comes out."
  },
  {
   "score": 8,
   "id": "dglspyp",
   "pid": "t1_dglse2q",
   "date": "2017-04-22 08:41:44",
   "depth": 1,
   "text": "[No subs?\n](http://imgur.com/a/SJZfr)\n\nIf you buy a subscription and the show is available in your territory you can see it right now."
  },
  {
   "score": 1,
   "id": "dgltn4o",
   "pid": "t1_dglspyp",
   "date": "2017-04-22 09:03:53",
   "depth": 2,
   "text": "Not quite true, many territories that have the show available are having the most recent episode of Re Creators delayed by upwards of 2 days. "
  },
  {
   "score": 1,
   "id": "dglt8w3",
   "pid": "t1_dglspyp",
   "date": "2017-04-22 08:54:22",
   "depth": 2,
   "text": "I see. okay."
  },
  {
   "score": 11,
   "id": "dglsxas",
   "pid": "t1_dglse2q",
   "date": "2017-04-22 08:46:37",
   "depth": 1,
   "text": "This is no different than threads going up as soon as Crunchyroll releases an episode."
  }
 ]
}