{
 "score": 965,
 "id": "69lja0",
 "num_comments": 486,
 "date": "2017-05-06 07:45:54",
 "comments": [
  {
   "score": 463,
   "id": "dh7l0lz",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:25:53",
   "depth": 0,
   "text": "That conference scene was surprisingly well done, with no character stepping out of their bounds, I liked it. \n\nMeteora's reaction when she was told how much money she owed... She looked like a student with a big ass loan..."
  },
  {
   "score": 3,
   "id": "dh8hjsg",
   "pid": "t1_dh7l0lz",
   "date": "2017-05-06 23:29:48",
   "depth": 1,
   "text": "All I could think of during the conference was how fucking terrible the conferences in Seikaisuru Kado are in comparison. I'm loving this show more and more with each episode!"
  },
  {
   "score": 2,
   "id": "dh8neei",
   "pid": "t1_dh8hjsg",
   "date": "2017-05-07 04:22:53",
   "depth": 2,
   "text": "I put SK on hold after the first episode. I'll wait and see if it gets better. From what I remember I was annoyed by that overly genki female doctor."
  },
  {
   "score": 2,
   "id": "dh8nl10",
   "pid": "t1_dh8neei",
   "date": "2017-05-07 04:31:33",
   "depth": 3,
   "text": "I more or less got trough the first 3 episodes, but while the plot is really interesting, I dislike the \"camera work\", the switching between CGI and hand drawn animation is annoying (and the CGI isn't anything to write home about) and the scientist girl sure doesn't help either. Dropped for now, but I may pick it back up if it turns out to be really good later on."
  },
  {
   "score": 2,
   "id": "dh8nzv2",
   "pid": "t1_dh8nl10",
   "date": "2017-05-07 04:50:48",
   "depth": 4,
   "text": ">  Dropped for now, but I may pick it back up if it turns out to be really good later on.\n\nLet's do just that."
  },
  {
   "score": 3,
   "id": "dh8cfor",
   "pid": "t1_dh7l0lz",
   "date": "2017-05-06 20:36:33",
   "depth": 1,
   "text": "> She looked like a student with a big ass loan...\n\nWho also used their course-related cost for not-so-course-related things.\n\nN-not that I'd know anything about that."
  },
  {
   "score": 6,
   "id": "dh8gxz5",
   "pid": "t1_dh7l0lz",
   "date": "2017-05-06 23:04:24",
   "depth": 1,
   "text": "I like how the government isn't totally blind to the situation.  I think there will be some friction with this special cabinet at some point.  But the last thing any faction wants to do is increase their enemies since they don't know what is going on.  "
  },
  {
   "score": 93,
   "id": "dh7mt9z",
   "pid": "t1_dh7l0lz",
   "date": "2017-05-06 10:07:18",
   "depth": 1,
   "text": "The one thing I didn't like about the conference scene was [Not-Shinji's sudden change of heart about wanting to help save the 'real' world](https://puu.sh/vHAev/2ca0b55fa6.jpg) after throwing a tantrum about it earlier in the episode. Is he just that susceptible to peer pressure? I dunno.\n\nBut I am glad that five episodes in, the main characters have formally set an objective, i.e. to suppress disturbances set off by the creations and find the Military Uniform Princess."
  },
  {
   "score": 3,
   "id": "dh8k88q",
   "pid": "t1_dh7mt9z",
   "date": "2017-05-07 01:35:26",
   "depth": 2,
   "text": "> Not-Shinji\n\nNaah, He's Not-Amuro."
  },
  {
   "score": 21,
   "id": "dh83ccl",
   "pid": "t1_dh7mt9z",
   "date": "2017-05-06 16:41:44",
   "depth": 2,
   "text": "That could mean he's just poorly written. Not in the show, in *his* story. You can see a clear difference between how characters move around in a completely foreign world by how complex can their minds be. In my opinion, that's what makes Selesia and Aliceteria (for example) act so differently."
  },
  {
   "score": 232,
   "id": "dh7nc80",
   "pid": "t1_dh7mt9z",
   "date": "2017-05-06 10:19:12",
   "depth": 2,
   "text": "Don't forget that he's an anime main character, and he's not Shinji. He was going to side with the good guys to save the world from the start, he just had to throw a tantrum when ordered around. I think he also didn't want to be left behind."
  },
  {
   "score": 15,
   "id": "dh7pd1h",
   "pid": "t1_dh7nc80",
   "date": "2017-05-06 11:04:50",
   "depth": 3,
   "text": "I guess it fits with the bits of his character description they mentioned, but it would be nice to have a character who just wanted to live a quiet life, for contrast. The heroes are all being heroic, the villains are mostly villainous, it's a little too clear cut. There's the character carrying on normally, and the one who just doesn't get it, but there isn't a named character, \"fictional\" or not, actively trying to stay out of the conflict. \n\nThe story feels a little one dimensional as just team narrator vs team military uniform princess. Adding another dimension to the situation would make it feel a lot more real."
  },
  {
   "score": 1,
   "id": "dhbsrts",
   "pid": "t1_dh7pd1h",
   "date": "2017-05-09 06:35:26",
   "depth": 4,
   "text": "A bit late to the discussion, but I wouldn't bet on stuff staying as simple as that. After all, most of the characters are based on usual heroic main character template. That already gives us another interesting dimension, especially seeing that as far as I see it, most of the characters ended on different sides by luck, depending on who first found them and told them their version of events.\n\nAnyways, it's going to have 22 episodes - plenty of time for it to get more grey."
  },
  {
   "score": 3,
   "id": "dh8zyqy",
   "pid": "t1_dh7pd1h",
   "date": "2017-05-07 10:31:22",
   "depth": 4,
   "text": "I wonder what if a harem MC comes in the world. Wtf would they do... "
  },
  {
   "score": 48,
   "id": "dh7rzvu",
   "pid": "t1_dh7pd1h",
   "date": "2017-05-06 12:05:54",
   "depth": 4,
   "text": "[He's living such a quiet life that you forgot about him.](https://myanimelist.cdn-dena.com/images/characters/5/322622.jpg)"
  },
  {
   "score": 2,
   "id": "dh9zel2",
   "pid": "t1_dh7rzvu",
   "date": "2017-05-08 01:38:43",
   "depth": 5,
   "text": "<10min total screen time and he's still my favourite "
  },
  {
   "score": 21,
   "id": "dh7speq",
   "pid": "t1_dh7rzvu",
   "date": "2017-05-06 12:22:38",
   "depth": 5,
   "text": "He's the one carrying on normally... His world was just fictionalized Japan and he's just doing the sort of stuff he'd be doing anyway. He's not really trying to avoid the conflict, and he isn't taking this as an opportunity to stop fighting."
  },
  {
   "score": 32,
   "id": "dh7oljx",
   "pid": "t1_dh7nc80",
   "date": "2017-05-06 10:47:35",
   "depth": 3,
   "text": "Right, I just thought his apathy about saving the world was going to be an actual personality trait. Maybe that is still who he is, and he was simply following the crowd during the conference. \n\nAnyway, it's not too big of a deal. His true mindset will probably be made clearer in later episodes."
  },
  {
   "score": 98,
   "id": "dh7oxnj",
   "pid": "t1_dh7oljx",
   "date": "2017-05-06 10:55:08",
   "depth": 4,
   "text": "He's not apathetic about the world, his character is just that he throws tantrums about stuff he's going to do but doesn't really want to."
  },
  {
   "score": 2,
   "id": "dh8lzfh",
   "pid": "t1_dh7oxnj",
   "date": "2017-05-07 03:08:51",
   "depth": 5,
   "text": "He's probably a \"typical\" main character but with joke references to Shinji. I mean, in universe. And out universe too."
  },
  {
   "score": 12,
   "id": "dh7pof2",
   "pid": "t1_dh7oxnj",
   "date": "2017-05-06 11:12:10",
   "depth": 5,
   "text": "Oh, I see what you mean. In other words, he probably won't ever throw a fit in a way that affects the plot? I think that would have some interesting possibilities."
  },
  {
   "score": 57,
   "id": "dh7r0qj",
   "pid": "t1_dh7pof2",
   "date": "2017-05-06 11:43:02",
   "depth": 6,
   "text": "Well his creator did note that he thought \"it would be more interesting if the story took a plot twist when he got defensive.\" I'm not sure if that's supposed to be a hint towards a future plot point, but either way, it does seem fairly contrived to me. Although I suppose that might be the point, so that he is an observation of an underdeveloped character."
  },
  {
   "score": 4,
   "id": "dh843q8",
   "pid": "t1_dh7r0qj",
   "date": "2017-05-06 17:00:46",
   "depth": 7,
   "text": "That was when the creator realised he made a mistake and that if it was real life, he would be really annoying to deal with."
  },
  {
   "score": 19,
   "id": "dh7u87f",
   "pid": "t1_dh7r0qj",
   "date": "2017-05-06 12:58:12",
   "depth": 7,
   "text": "He's a functioning human being now so he can change his ways later on."
  },
  {
   "score": 3,
   "id": "dhbq4j2",
   "pid": "t1_dh7u87f",
   "date": "2017-05-09 05:26:31",
   "depth": 8,
   "text": "Well, the problem with that is that now that he's a real hooman and the universe has to calculate the logic of their world into ours... He's essentially bipolar. Tsundure in anime = Bipolar irl/trauma walls.\n\nIt could easily become a matter of him locking himself in the mecha/refusing to go in out of actual depression/trauma a la Shinji. (I haven't gone past 3 Evangelion episodes yet though, but I remember that whole shit being traumatic af for him, rather than bipolarism like in this kid's case).\n\n**That's what I think they're doing here with showing the effects of these 'caricatures' being translated into the real world. Their extreme personalities have consequences here.** \n\n* Madokaish-san's beat-em up until they turn good essentially makes her a violent vigilante. \n* [Celty](https://myanimelist.cdn-dena.com/images/characters/8/85308.jpg)/[King Arthuria-Sama's](https://myanimelist.cdn-dena.com/images/characters/6/275276.jpg) strict ideals to protect her version of England leads her to be a rash, sacrificial, gullible mess with tyranical PTSD. \n* [Shinji-kun](https://myanimelist.cdn-dena.com/images/characters/5/225177.jpg) has the trauma of not wanting to pilot the crazy-ass mech mixed with the generic main character enthusiasm **plus** the 'stop telling me what to do I'm a big kid/i'll prove myself' traits making him into a bipolar mess. When the author is speaking of him you can tell he's still unfinished and not fleshed out as a character. The traits he set forth were meant to later aggregate into a plot-twist/epiphany he hasn't reached yet.\n* [Red King](https://myanimelist.cdn-dena.com/images/characters/15/189718.jpg)/[Ban](https://myanimelist.cdn-dena.com/images/characters/8/30608.jpg)/[Renji](https://vignette1.wikia.nocookie.net/bleach/images/0/01/RenjiEpisode363.png/revision/latest/scale-to-width-down/250?cb=20130727231650&path-prefix=en)/[Shizu-chan](https://myanimelist.cdn-dena.com/images/characters/5/110552.jpg) on the other hand seems to balance out as a logical rival-type character who has good intentions and is logical, but is merciless and sadistic if you test him. He also seems to be aloof (not realizing he could have just bought himself food), a likely-trope introduced in his story to make him seem less cold and more caring towards his friends even though he's supposed to be a bad guy. So far, my favorite character! Seems to come from a mafia/street-brawling/esper genre.\n* Military Princess (won't go into much detail because my theory might be a spoiler) but she follows the trope of the villain who lost hope in the world and wants to see it destroyed.\n* Old Revolver Dude - Already have a few characters similar to him I can think of, but I'll wait until we know more about him\n* Meteora seems like a [Lelei la Lalena](https://myanimelist.cdn-dena.com/images/characters/11/278274.jpg) type. Well adapted, but emotionless. This might become part of her development later on. Maybe having a breakdown or something.\n* Selesia so far seems like the generic protagonist in a political battle anime. No opinion yet.\n* Magane from the intro immediately gives me the vibes of [Roy Mustang](https://s-media-cache-ak0.pinimg.com/originals/cc/fd/9b/ccfd9b69848b5b823ad90fc2f154af99.png) meets [Ougi](http://static.zerochan.net/Oshino.Ougi.full.1938375.jpg) given her intro, she's likely going to be a mysterious character with unknown motives.\n\nThat's all I got so far. They're all based on characters we already know that have made an impact on us. I just wish this was Prime exclusive so more people could enjoy this."
  },
  {
   "score": 1,
   "id": "dhcnk7g",
   "pid": "t1_dhbq4j2",
   "date": "2017-05-09 16:18:34",
   "depth": 9,
   "text": "Selesia has this nice vibe of playfulness and a sort of my pace kind of girl going on compare to the usual warrior-lady archetypes in my opinion.  I wouldn't really call her \"generic\" though. I mean when was the last time you see an Onee-san character as the main lead or female lead in a Light Novel?\n\nAlso nice analysis dude. \n"
  },
  {
   "score": 1,
   "id": "dhbs9oi",
   "pid": "t1_dhbq4j2",
   "date": "2017-05-09 06:23:51",
   "depth": 9,
   "text": "They generally put the existential crises and psycological issues past the characters from where we are. Most of them had it much harder there than here so I think a little change of pace is not doing bad for them.\n\nYou can make an easy example of this with Selesia, after learning she was a character in a story spawned outside of Souta's screen after some moment of confusion she adjusted herself to the fact that she was alive and active, while she doesn't like to see her source material, justifiably so, she doesn't find the need to question her existence.\n\nHaving said this, I don't think we should disregard these altogether. They have already done a similar thing to Mamika where she got horrified and froze up after seeing Selesia get horribly hurt. Last week on /a the fact that government hasn't done anything despite substantial damage and witnesses was an issue brought up by many and both sides were argued a lot. So we should wait and see where they take this issue, but knowing that the focus will be more on the action I'm not seeing this is going to be an issue for a lot of the characters."
  },
  {
   "score": 2,
   "id": "dhbspj5",
   "pid": "t1_dhbs9oi",
   "date": "2017-05-09 06:34:00",
   "depth": 1,
   "text": "I did a long-winded edit since that initial comment, so not sure if you replied to that or my much shorter comment from before. \n\nGreat point on Selesia! I think the government added logically in this case. In the real world, they'd want to keep this shit under wraps and they already know they can't contain them. They meant to come over peacefully, but when that big mecha came, they took action, thinking the time to negotiate had already passed. Meteora was scolded, but they realize further damage was aborted (yes, she destroyed a lot of shit, but if she hadn't, Military-San's rampage in the open on the highway (as opposed to high in the sky above a secluded park) would have been worse. She apologized and that's the end of that simply because she's better as an ally than an enemy."
  },
  {
   "score": 1,
   "id": "dhcbv4x",
   "pid": "t1_dhbspj5",
   "date": "2017-05-09 12:38:26",
   "depth": 2,
   "text": "I answered the short reply. There's a lot of food for thought in your extended reply, I'd like to see what others think when the time for the next episode comes."
  },
  {
   "score": 5,
   "id": "dh7uzmf",
   "pid": "t1_dh7u87f",
   "date": "2017-05-06 13:16:30",
   "depth": 8,
   "text": "Sure, but there still needs to be a motivation for why he changes his mind. As of this episode, none is given. Hence the contrivance of his sudden switch."
  },
  {
   "score": 2,
   "id": "dh7waqc",
   "pid": "t1_dh7uzmf",
   "date": "2017-05-06 13:47:18",
   "depth": 9,
   "text": "I meant that's how she operates right now. Later on he can go on to make his own decisions."
  },
  {
   "score": 2,
   "id": "dh7wxzs",
   "pid": "t1_dh7waqc",
   "date": "2017-05-06 14:02:39",
   "depth": 1,
   "text": "Sure, but that's not what I'm taking issue with. On a character development level, his decision to support the group's plan contradicts what was previously established about his character. Normally, this would be representative of bad writing. However, this would make a little more sense if his defensiveness was meant to be contrived, as alluded to by the statement that his creator makes about that particular trait. I would take this to be a meta commentary by the show on the nature of character development. A character is inconsistent when his motivations and values do not line up with his actions.\n\nHowever, if this interpretation is correct, the lack of any value judgments about it (whether this inconsistency is ultimately good or bad for the character) means that it doesn't really amount to much. Its only purpose would be to highlight the contrivance that the show has created by openly acknowledging its poor writing, which would seem pretty meaningless to me. However, I find it to be a slightly more nuanced, if ultimately unfulfilling, meta reading of his character trait."
  },
  {
   "score": 4,
   "id": "dh845a0",
   "pid": "t1_dh7uzmf",
   "date": "2017-05-06 17:01:53",
   "depth": 9,
   "text": "Maybe he was just badly written in his meta world. Remember, his creator thought that making him throw a whiny tantrum was an interesting plot twist."
  },
  {
   "score": 1,
   "id": "dh84zte",
   "pid": "t1_dh845a0",
   "date": "2017-05-06 17:23:20",
   "depth": 1,
   "text": "Yeah, I agree. I just hope that this has some sort of impact later down the line, otherwise it will be meta just for the sake of being meta. That may not be a bad thing, but I don't find it to be good either."
  },
  {
   "score": 15,
   "id": "dh7y9vn",
   "pid": "t1_dh7uzmf",
   "date": "2017-05-06 14:35:18",
   "depth": 9,
   "text": "I'd think it'd make perfect sense for him to agree to go along when confronted by high-level Figures of Authority and be more apt to snap at 21st century cosplayers spouting nonsense at him."
  },
  {
   "score": 5,
   "id": "dh7z1ox",
   "pid": "t1_dh7y9vn",
   "date": "2017-05-06 14:53:58",
   "depth": 1,
   "text": "I suppose that makes sense. I think it would have been better if the show had done a better job of emphasizing the difference in authority between the two groups and correlating that with Kanoya's decision, but I get that's a personal gripe/nitpick."
  },
  {
   "score": 162,
   "id": "dh7nrhm",
   "pid": "t1_dh7nc80",
   "date": "2017-05-06 10:28:43",
   "depth": 3,
   "text": "He just a tsundere I guess."
  },
  {
   "score": 6,
   "id": "dh8sd11",
   "pid": "t1_dh7nrhm",
   "date": "2017-05-07 07:30:57",
   "depth": 4,
   "text": "\"It's part of his character setting\""
  },
  {
   "score": 40,
   "id": "dhbpxn1",
   "pid": "t1_dh7nrhm",
   "date": "2017-05-09 05:20:55",
   "depth": 4,
   "text": "It's freaking hilarious though. It's pure gold to see his author just be like \"Fuck... I made him bipolar as fuck... Now I have to deal with his shit.\"\n\nDon't get me wrong, it's a real disease, but it harks me back to when I really wanted to date a \"Tsundure.\" In the real world, that translates to her overreacting to little stuff randomly and trying to kill me. *insert shrug ascii emoji*\n\n\n\n\nSex was interesting too. It could go anywhere from 'use me like an object/you're an object' to mid-intercourse crying because 'am I just an object to you?' All in all, this is to say that Tsundure is an ideal we seek, but perhaps not without fully understanding its implications."
  },
  {
   "score": 2,
   "id": "dk9uiy0",
   "pid": "t1_dhbpxn1",
   "date": "2017-07-15 17:04:43",
   "depth": 5,
   "text": "I'm a little bit late to the party, but what you're describing is more of a Yandere archetype, one that gets psychotic very quickly when he\\she feels that relationship is somehow threatened. And yes, these archetypes generally apply to men too.\n\nA \"tsundere\" person is a person with a big \"Jealous\"\\\"Shy\" gap in their character. The one who would normally act bossy\\self-righteous and wouldn't hesitate to (friendly) trash-talk you or make some sick burns, be dominant and proactive in general, but is extremely shy and defenseless when things get more intimate. And that, contrary to a yandere archetype, can actually be very cute and endearing in real life.\n\nIt's not for everybody, of course, but some people actually dig this."
  },
  {
   "score": 2,
   "id": "dka1c11",
   "pid": "t1_dk9uiy0",
   "date": "2017-07-15 20:01:03",
   "depth": 6,
   "text": "I'd say it's a little half and half. I've dated both. Tsundure's generally were only Tsun's at the beginning and then the walls and sick burns would diminish and become insecure, without outright stating their jealousy. In her case, I knew that it was because she was both too afraid to know it to be true (it wasn't) or that I'd hate her for accusing me. She never said so, but you get to know how a person thinks after a few years. She would only verbally say scary shit that made me often wonder if I was going to die. Very cute regardless, and I quickly came to endear her as my 'princess'.\n\nThe Yandere... Oh my dear mexican black widow. She would genuinely chop me to little pieces if she ever had to and yet, I still miss her.\n\nNot for everyone, as it definitely takes work, perception, and understanding beyond what most characterizations show it as."
  },
  {
   "score": 26,
   "id": "dh85ayz",
   "pid": "t1_dh7l0lz",
   "date": "2017-05-06 17:31:09",
   "depth": 1,
   "text": "> Meteora's reaction when she was told how much money she owed... She looked like a student with a big ass loan...\n\nI hate doing this since you know, a lot of Americans on this sub but...\n\n[European_irl](http://isitvivid.com/wp-content/uploads/2017/01/debt-free-web.jpg) ;)"
  },
  {
   "score": 0,
   "id": "dhj1rwc",
   "pid": "t1_dh85ayz",
   "date": "2017-05-13 18:58:32",
   "depth": 2,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dhjazdv",
   "pid": "t1_dhj1rwc",
   "date": "2017-05-13 23:49:04",
   "depth": 3,
   "text": "Yea those are pretty nice places indeed."
  },
  {
   "score": 26,
   "id": "dh8w7mi",
   "pid": "t1_dh85ayz",
   "date": "2017-05-07 09:06:28",
   "depth": 2,
   "text": "Hello it's me, your Greece"
  },
  {
   "score": 51,
   "id": "dh7vixr",
   "pid": "t1_dh7l0lz",
   "date": "2017-05-06 13:29:03",
   "depth": 1,
   "text": "I was honestly expecting her reaction to be something like \n[this](http://i0.kym-cdn.com/photos/images/original/000/854/060/63e.gif)."
  },
  {
   "score": 133,
   "id": "dh8416s",
   "pid": "t1_dh7l0lz",
   "date": "2017-05-06 16:59:02",
   "depth": 1,
   "text": "You stole 165 million yen worth of taxpayer money.\n\n... Sorry."
  },
  {
   "score": 6,
   "id": "dh8gzbk",
   "pid": "t1_dh8416s",
   "date": "2017-05-06 23:05:50",
   "depth": 2,
   "text": "But you used it to keep more damage from happening.  "
  },
  {
   "score": 111,
   "id": "dh847bo",
   "pid": "t1_dh8416s",
   "date": "2017-05-06 17:03:18",
   "depth": 2,
   "text": "[](#killitwithfire)"
  },
  {
   "score": 2,
   "id": "dh8g4hi",
   "pid": "t1_dh847bo",
   "date": "2017-05-06 22:33:05",
   "depth": 3,
   "text": "I don't remember this face from gabriel dropout, which episode was it in?"
  },
  {
   "score": 2,
   "id": "dh9zlfi",
   "pid": "t1_dh8g4hi",
   "date": "2017-05-08 01:48:38",
   "depth": 4,
   "text": "episode 9, the christmas one"
  },
  {
   "score": 2,
   "id": "dh8ehgh",
   "pid": "t1_dh847bo",
   "date": "2017-05-06 21:36:55",
   "depth": 3,
   "text": "what anime is this from ?"
  },
  {
   "score": 7,
   "id": "dh8fw9p",
   "pid": "t1_dh8ehgh",
   "date": "2017-05-06 22:24:32",
   "depth": 4,
   "text": "Gabriel Dropout from last season."
  },
  {
   "score": 1,
   "id": "dh96ub0",
   "pid": "t1_dh8fw9p",
   "date": "2017-05-07 12:57:11",
   "depth": 5,
   "text": "?/10"
  },
  {
   "score": 4,
   "id": "dh99tdp",
   "pid": "t1_dh96ub0",
   "date": "2017-05-07 13:59:11",
   "depth": 6,
   "text": "~7/10 for most people, but if you like the subject and genre it can easily be a strong 8."
  },
  {
   "score": 85,
   "id": "dh870t5",
   "pid": "t1_dh7l0lz",
   "date": "2017-05-06 18:15:18",
   "depth": 1,
   "text": "I appreciated how calm, rational and cooperative the government was. Usually in shows like this government would be angry and distrustful of the foreigners (creations in this case) and being stubborn. Actually listening to the main characters and asking for their help was nice."
  },
  {
   "score": 1,
   "id": "diwjq5l",
   "pid": "t1_dh870t5",
   "date": "2017-06-14 11:41:57",
   "depth": 2,
   "text": "Reminds me of [GATE](https://myanimelist.net/anime/28907/Gate__Jieitai_Kanochi_nite_Kaku_Tatakaeri)"
  },
  {
   "score": 6,
   "id": "dh98jud",
   "pid": "t1_dh870t5",
   "date": "2017-05-07 13:32:56",
   "depth": 2,
   "text": "I agree, as soon as the JSDF came in I was expecting bureaucracy^2 , and for them to just be a hindrance. Really glad it didn't end up that way, it's just frustrating to watch."
  },
  {
   "score": 25,
   "id": "dh8ou1h",
   "pid": "t1_dh870t5",
   "date": "2017-05-07 05:26:27",
   "depth": 2,
   "text": "This also probably implies that the situation will probably be even more dangerous for all parties, since there won't probably be a period  of time where several less-costly mistakes are made due to a lack of cooperation. "
  },
  {
   "score": 220,
   "id": "dh7mnzp",
   "pid": "t1_dh7l0lz",
   "date": "2017-05-06 10:03:55",
   "depth": 1,
   "text": "> Meteora's reaction when she was told how much money she owed... She looked like a student with a big ass loan...\n\nme_irl"
  },
  {
   "score": 60,
   "id": "dh804lq",
   "pid": "t1_dh7mnzp",
   "date": "2017-05-06 15:20:24",
   "depth": 2,
   "text": ">>  Meteora's reaction when she was told how much money she owed... She looked like a student with a big ass loan...\n\n> me_irl\n\nabsolutelynotme_irl/  \n\nThank you Denmark, for making my education taxpaid!"
  },
  {
   "score": 6,
   "id": "dh8k6vb",
   "pid": "t1_dh804lq",
   "date": "2017-05-07 01:33:22",
   "depth": 3,
   "text": "God bless the welfare system."
  },
  {
   "score": 7,
   "id": "dh888zn",
   "pid": "t1_dh804lq",
   "date": "2017-05-06 18:46:29",
   "depth": 3,
   "text": "Does getting to claim it during tax season and getting most back count? Yay Canada."
  },
  {
   "score": 15,
   "id": "dh89rqk",
   "pid": "t1_dh888zn",
   "date": "2017-05-06 19:26:22",
   "depth": 4,
   "text": "I completely avoided student debt by remaining unedumacted."
  },
  {
   "score": 5,
   "id": "dh8biq7",
   "pid": "t1_dh89rqk",
   "date": "2017-05-06 20:12:06",
   "depth": 5,
   "text": "After 3 years of retail I went back haha"
  },
  {
   "score": 81,
   "id": "dh7n7rd",
   "pid": "t1_dh7mnzp",
   "date": "2017-05-06 10:16:24",
   "depth": 2,
   "text": "~~me_irl~~ /r/anime_irl\n\n"
  },
  {
   "score": 2,
   "id": "dh8snoj",
   "pid": "t1_dh7n7rd",
   "date": "2017-05-07 07:38:54",
   "depth": 3,
   "text": "Nope, thank you GI Bill."
  },
  {
   "score": 221,
   "id": "dh7mokg",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:04:17",
   "depth": 0,
   "text": "I think Shimazaki(the girl at the end) was bullied by her readers, probably, hence the \"last story, good bye\" message, and this is all Military Uniform Princess' revenge on the world that shunned her creation. \n\nIt also ties in with what MUP said at the end of EP3. \"He's(the MC) a part of the world that banished you. Setsuna(her penname, probably), until the end of this world, I will always be your ally.\"\n\nOf course, all conjecture but I think it's plausible.\n\nIf anyone can translate the messages in the thread at the end, maybe it will shed some light on what people think about her story.\n\nDoesn't explain why the MC forgot about her though."
  },
  {
   "score": 3,
   "id": "dh8rorx",
   "pid": "t1_dh7mokg",
   "date": "2017-05-07 07:11:40",
   "depth": 1,
   "text": "aint the girl thay killed herself at the beginning of episode 1, and was brought by her creation to its world "
  },
  {
   "score": 3,
   "id": "dh8h121",
   "pid": "t1_dh7mokg",
   "date": "2017-05-06 23:07:52",
   "depth": 1,
   "text": "That is one theory.  It may also be some kind of manifestation of her lingering will.  "
  },
  {
   "score": 9,
   "id": "dh8jany",
   "pid": "t1_dh7mokg",
   "date": "2017-05-07 00:48:44",
   "depth": 1,
   "text": "IIRC Hime is an unofficial character created by Setsuna for some game (or whatever). There is a high probability that there was some conflict between her and company, leading to suicide. In other words it's more likely that main reason for suicide was how whole anime industry functions, which is why Hime despises land of gods and why she can't forgive them. MC probably was working with her on early stages of designing story or character but ultimately didn't notice or helped when Setsuna needed it the most. By Chekhov's gun principle since 1st episode we were fed bits of information about MC leading to him being: a) partly creator of Hime b) being the one who will right everything and resolve situation. Last episode just confirms it in Meteora's words. Captions in last episode don't show much enmity for regular viewers so, just average comments, again, it's more likely that it's more about industry killing Setsuna and not about some simple cyber-bullying."
  },
  {
   "score": 92,
   "id": "dh7p89z",
   "pid": "t1_dh7mokg",
   "date": "2017-05-06 11:01:51",
   "depth": 1,
   "text": "He might've done some basic concept art for Shimazaki, but his early concept of \"Altair\" might've been way different from the one Shimazaki ultimately wrote and did the final art for (given her clear issues.)\n\nAnd I think Sota knows that Shimazaki went and had a dance with a train, so he might've also blocked out that final collaboration because of that (which would also explain why he starts the series as an illustrator in a deep funk.)\n\nFinally, I think he might've been surprised by how far the story actually went. He remembered the character name and the author, but he played the PV he found like he was surprised that it existed."
  },
  {
   "score": 14,
   "id": "dh8dl95",
   "pid": "t1_dh7p89z",
   "date": "2017-05-06 21:09:41",
   "depth": 2,
   "text": "Didn't he start getting really quiet and introspective while riding on a train? It might have triggered some memories."
  },
  {
   "score": 16,
   "id": "dh8efig",
   "pid": "t1_dh7p89z",
   "date": "2017-05-06 21:35:16",
   "depth": 2,
   "text": "> Finally, I think he might've been surprised by how far the story actually went. He remembered the character name and the author, but he played the PV he found like he was surprised that it existed.\n\nI think he was surprised by its popularity. Remember that the characters who crossed over are supposed to have made a strong impression in the public consciousness. Presumably Shimazaki's fanfiction developed a cult following."
  },
  {
   "score": 51,
   "id": "dh7q0hg",
   "pid": "t1_dh7p89z",
   "date": "2017-05-06 11:19:52",
   "depth": 2,
   "text": "> He might've done some basic concept art for Shimazaki, but his early concept of \"Altair\" might've been way different from the one Shimazaki ultimately wrote and did the final art for (given her clear issues.)\n\nThat's actually a really good theory. I mean, in this episode alone we see a portrait of someone who looks like the Military Princess, for it to change to who we know now. It's possible his first illustration was the portrait of the traditional princess-like character, then Setsuna changed it and added the uniform. "
  },
  {
   "score": 232,
   "id": "dh7rs8j",
   "pid": "t1_dh7mokg",
   "date": "2017-05-06 12:00:52",
   "depth": 1,
   "text": "Sorry messy post but:\n\nIt seems the girl's name was Shimazaki Setsuna or that was her pen name? \n\nThe thread says: \n-Where did Altair's saber come from?\n-Why a pigtail princess\n-The military uniform design is cute - moe, her design stands out from other characters I like\n\nIt seems Shimazaki Setsuna wrote the World Etude as like an AU or doujin spin off of the original. Trying to read the words in the video description for World Etude, but it's very small. It says something like \"I used to like writing and I was very happy that people supported me. A lot of things have happened. At the mere___, was the start of it. \n\nThis is Shimazaki Setsuna's ___. I suppose there will no longer __.\"\n\nSome of the video comments say \"the uploader's comment is scary ,\" \"what a godly song,\" \"I can't get enough of this setting,\" \"I want her to step on me,\" \"I keep repeating it,\" \"a military uniform and saber,\" \"Hey, what kind of feeling are you feeling\" and there's another comment that talks about antis who bashed her (Setsuna, I'm assuming). \n\nSome of the tags on the video include, Altair, Beginning of a Legend, Godly Song, Shimazaki Setsuna, 二次創作 (which is a derivative work, so in this case it seems it's like a fan spinoff), pigtail princess, military uniform, almost an original character.\n\nIn Setsuna's last post it says \"This is my new work, as I mentioned before, giving a star's name...This is probably the last one. Thank you for loving this character...Good bye.\" \n\nAhhh ok, I think Altair is an OC from Setsuna's work called World Etude which is spun off from the original series called Yuukyuu Taisen Megalosphere (Eternal Great War Megalosphere). And maybe World Etude was a video/song series (?) seeing as it was up on ~not nico nico douga~\n\nWelp that was really unorganized/out of order since I kept going back and forth between scenes trying to read it.\n\nNot exactly sure the connection b/w Setsuna & Souta but it seems that they did interact w/ each other and she had consulted Souta before about wanting to draw (?)\n"
  },
  {
   "score": 14,
   "id": "dh8esp0",
   "pid": "t1_dh7rs8j",
   "date": "2017-05-06 21:47:01",
   "depth": 2,
   "text": "> Mega Crossfire\n\n[Megalosphere](https://i.imgur.com/xDcvZIr.png), ain't it?  Unless it says Mega Crossfire somewhere else."
  },
  {
   "score": 6,
   "id": "dh8evp3",
   "pid": "t1_dh8esp0",
   "date": "2017-05-06 21:49:37",
   "depth": 3,
   "text": "Ah! LOL I'm not so good at translating katakana into regular English (or more like my eyes glaze over a bit at katakana names lol) and completely missed this, thanks for catching it /edits. I re-read it now and it does say megarosufia XDD"
  },
  {
   "score": 49,
   "id": "dh83ef8",
   "pid": "t1_dh7rs8j",
   "date": "2017-05-06 16:43:11",
   "depth": 2,
   "text": "Thanks for interpreting the text shown. Amazon's subtitling didn't cover everything so I'm thankful you've given us this run-down of it."
  },
  {
   "score": 1,
   "id": "dkig8ca",
   "pid": "t1_dh83ef8",
   "date": "2017-07-20 23:55:06",
   "depth": 3,
   "text": "isn't anime strike well worth the subscription!"
  },
  {
   "score": 1,
   "id": "dkjp2rx",
   "pid": "t1_dkig8ca",
   "date": "2017-07-21 17:01:58",
   "depth": 4,
   "text": "I wouldn't know - my viewing was from HS who just so happens to rip it from Amazon. I'm assuming there wasn't anything lost when they did so hence blaming Amazon instead of HS."
  },
  {
   "score": 19,
   "id": "dh87bq5",
   "pid": "t1_dh83ef8",
   "date": "2017-05-06 18:23:02",
   "depth": 3,
   "text": "ah no problem! I thought it was kinda weird they didn't translate everything but I guess they didn't think it was super important (?). Hopefully this helps give some more background! I'm still kinda unclear exactly what kind of relationship Setsuna and Souta have though : o looking forward to how the rest of it plays out. "
  },
  {
   "score": 164,
   "id": "dh7zfu4",
   "pid": "t1_dh7rs8j",
   "date": "2017-05-06 15:03:18",
   "depth": 2,
   "text": ">\"I want her to step on me\" \n\nGreat minds think alike"
  },
  {
   "score": 2,
   "id": "dh8gqsp",
   "pid": "t1_dh7zfu4",
   "date": "2017-05-06 22:56:39",
   "depth": 3,
   "text": "...and fools seldom differ"
  },
  {
   "score": 38,
   "id": "dh8g7vg",
   "pid": "t1_dh7zfu4",
   "date": "2017-05-06 22:36:32",
   "depth": 3,
   "text": "What a relevant username."
  },
  {
   "score": 210,
   "id": "dh7n1sj",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:12:39",
   "depth": 0,
   "text": "*\"Kanoya\" has shut himself in.*\n\n*There's no way I \"can know,yah\"* lmao\n\nThis is why Meteora is best girl! "
  },
  {
   "score": 2,
   "id": "dh8vu4e",
   "pid": "t1_dh7n1sj",
   "date": "2017-05-07 08:57:38",
   "depth": 1,
   "text": "Sounds even better in original, but props to the translators, lol."
  },
  {
   "score": 28,
   "id": "dh7zclq",
   "pid": "t1_dh7n1sj",
   "date": "2017-05-06 15:01:05",
   "depth": 1,
   "text": "What does it mean? "
  },
  {
   "score": 110,
   "id": "dh80jmo",
   "pid": "t1_dh7zclq",
   "date": "2017-05-06 15:30:24",
   "depth": 2,
   "text": "Can know, yah = Kanoya. It's a terrible, terrible pun which is why it's so great."
  },
  {
   "score": 66,
   "id": "dh81doj",
   "pid": "t1_dh80jmo",
   "date": "2017-05-06 15:51:21",
   "depth": 3,
   "text": "[](#gabdisgust)"
  },
  {
   "score": 2,
   "id": "dh8d5f0",
   "pid": "t1_dh81doj",
   "date": "2017-05-06 20:56:55",
   "depth": 4,
   "text": "lol, how did you not get that?"
  },
  {
   "score": 75,
   "id": "dh879lf",
   "pid": "t1_dh81doj",
   "date": "2017-05-06 18:21:31",
   "depth": 4,
   "text": "A pun that transcends languages, an uncommon pun, but being Japanese with their fondness for puns makes this terrible _terrible_ pun a rare one.\n\nMeteora is a rare species, cherish her-"
  },
  {
   "score": 132,
   "id": "dh84c9z",
   "pid": "t1_dh7n1sj",
   "date": "2017-05-06 17:06:42",
   "depth": 1,
   "text": "The pun was so bad a swat team had to be sent to [arrest them.](https://media.giphy.com/media/l4FGGG9f84i7U8wzC/giphy.gif)"
  },
  {
   "score": 396,
   "id": "dh7re1g",
   "pid": "t3_69lja0",
   "date": "2017-05-06 11:51:40",
   "depth": 0,
   "text": " So, my brother and i were watching the episode on different computers, and it ocurred to him to look up the [video that \"MC\"-kun clicked at the end](http://imgur.com/a/auggw).\n\n[AND ITS FUCKIN REAL](http://www.nicovideo.jp/watch/sm31138174). Tho it seems to be only a 30 second clip with the \"World Etude\" logo frozen there.\n\nWhat is interesting about this is the uploader. \"シマザキセツナ\" means Shimazaki Setsuna. The girl that Gunpuku was talking to(?) in episode 3.\n\nThe video was uploaded yesterday. Seems like an interesting easter egg lol."
  },
  {
   "score": 3,
   "id": "dh8d025",
   "pid": "t1_dh7re1g",
   "date": "2017-05-06 20:52:41",
   "depth": 1,
   "text": "> The girl that Gunpuku was talking to(?) in episode 3.\n\nHow the hell did you even remember that?"
  },
  {
   "score": 1,
   "id": "dhae7hz",
   "pid": "t1_dh8d025",
   "date": "2017-05-08 09:02:56",
   "depth": 2,
   "text": "There was a recent popular rpg called \"My name is Setsuna,\" Probably the only reason it sticks in my mind. "
  },
  {
   "score": 7,
   "id": "dh8eh98",
   "pid": "t1_dh8d025",
   "date": "2017-05-06 21:36:45",
   "depth": 2,
   "text": "As soon as i read \"Setsuna\" i remembered it lol."
  },
  {
   "score": 3,
   "id": "dh8la07",
   "pid": "t1_dh8eh98",
   "date": "2017-05-07 02:30:44",
   "depth": 3,
   "text": "That's some good memory you got there."
  },
  {
   "score": 3,
   "id": "dh89rx4",
   "pid": "t1_dh7re1g",
   "date": "2017-05-06 19:26:29",
   "depth": 1,
   "text": "This is so meta"
  },
  {
   "score": 5,
   "id": "dh8gzxm",
   "pid": "t1_dh7re1g",
   "date": "2017-05-06 23:06:32",
   "depth": 1,
   "text": "Etude means \"study\" in French.  "
  },
  {
   "score": 38,
   "id": "dh7xl1o",
   "pid": "t1_dh7re1g",
   "date": "2017-05-06 14:18:15",
   "depth": 1,
   "text": "Wah, this is so cool, I think it's fantastic when the media goes beyond the screen to make these things, like when Sombra was being released or the \"hidden\" videos of RE7 send to various youtubers after the game was launched.\n\nOn a side note, those logos on the corners lol"
  },
  {
   "score": 1,
   "id": "dho3ut1",
   "pid": "t1_dh7xl1o",
   "date": "2017-05-17 03:42:00",
   "depth": 2,
   "text": "Didn't the main characters from Skam have their own IG accounts run by their actresses as well?"
  },
  {
   "score": 1,
   "id": "dh90974",
   "pid": "t1_dh7xl1o",
   "date": "2017-05-07 10:38:01",
   "depth": 2,
   "text": "hidden RE7 videos sent to youtubers? what?"
  },
  {
   "score": 1,
   "id": "dh9bide",
   "pid": "t1_dh90974",
   "date": "2017-05-07 14:34:40",
   "depth": 3,
   "text": "At least that's what someone told me in the comments. It's been a while so I don't quite remember, but short before RE7 was released, a few youtubers got a \"video\" along the game where an actor playing as Peter (The asshole from Beginning Hour) appeared running away from something, from the sounds probably Marguerite. In the video, this guy said something along the lines \"So, if you find this, [Youtuber], take it to the police\".\n\nI tried to search it on r/residentevil but not luck. It was unreal to see a real guy in the freaking Baker house running away, a la Blair Wicth Project."
  },
  {
   "score": 4,
   "id": "dh912xb",
   "pid": "t1_dh7xl1o",
   "date": "2017-05-07 10:56:46",
   "depth": 2,
   "text": "Yeah, those are called ARGs for Alternate Reality Game. I think Portal 2 had a big one, as well."
  },
  {
   "score": 82,
   "id": "dh7vhqg",
   "pid": "t1_dh7re1g",
   "date": "2017-05-06 13:28:14",
   "depth": 1,
   "text": "That's pretty cool attention to detail :D Is there a way to watch these videos without registering? Some kind of workaround maybe?"
  },
  {
   "score": 7,
   "id": "dh84ahw",
   "pid": "t1_dh7vhqg",
   "date": "2017-05-06 17:05:30",
   "depth": 2,
   "text": "There is.\n\nhttp://www.mmcafe.com/nico.html#http://www.nicovideo.jp/watch/sm31138174\n"
  },
  {
   "score": 91,
   "id": "dh7x5i7",
   "pid": "t1_dh7vhqg",
   "date": "2017-05-06 14:07:39",
   "depth": 2,
   "text": "Registration is required. Here's a mirror for this specific video: https://streamable.com/h0vx3  \n\nBut there's no need to watch it since it's just 30 seconds of this still frame: https://imgur.com/kDp0SOz"
  },
  {
   "score": 3,
   "id": "dhc6wmk",
   "pid": "t1_dh7x5i7",
   "date": "2017-05-09 11:04:21",
   "depth": 3,
   "text": "real mvp right here"
  },
  {
   "score": 17,
   "id": "dh7xn2t",
   "pid": "t1_dh7x5i7",
   "date": "2017-05-06 14:19:39",
   "depth": 3,
   "text": "Thank you!"
  },
  {
   "score": 136,
   "id": "dh7vggd",
   "pid": "t1_dh7re1g",
   "date": "2017-05-06 13:27:26",
   "depth": 1,
   "text": "Holy fuck, that's great."
  },
  {
   "score": 157,
   "id": "dh7liag",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:37:13",
   "depth": 0,
   "text": "When you want to get down to business but [first you need to push up your glasses] (http://imgur.com/gallery/4MTey)"
  },
  {
   "score": 1,
   "id": "dh90a2p",
   "pid": "t1_dh7liag",
   "date": "2017-05-07 10:38:35",
   "depth": 1,
   "text": "What a waste of frames that was. "
  },
  {
   "score": 120,
   "id": "dh7ogsn",
   "pid": "t1_dh7liag",
   "date": "2017-05-06 10:44:36",
   "depth": 1,
   "text": "When your glasses are already pushed all the way up but you still have to push em up"
  },
  {
   "score": 45,
   "id": "dh84nz8",
   "pid": "t1_dh7ogsn",
   "date": "2017-05-06 17:14:54",
   "depth": 2,
   "text": "https://i.gyazo.com/0094067025239db4f5370ab303914020.gif"
  },
  {
   "score": 5,
   "id": "dh8j535",
   "pid": "t1_dh84nz8",
   "date": "2017-05-07 00:41:10",
   "depth": 3,
   "text": "http://i.imgur.com/qki1B9U.gif"
  },
  {
   "score": 140,
   "id": "dh7verq",
   "pid": "t1_dh7liag",
   "date": "2017-05-06 13:26:20",
   "depth": 1,
   "text": "*LOG HORIZON INTENSIFIES*"
  },
  {
   "score": 7,
   "id": "dh8if3o",
   "pid": "t1_dh7verq",
   "date": "2017-05-07 00:07:29",
   "depth": 2,
   "text": "just living in the DATABASE DATABASE DATABASE!!"
  },
  {
   "score": 110,
   "id": "dh89wae",
   "pid": "t1_dh7verq",
   "date": "2017-05-06 19:29:44",
   "depth": 2,
   "text": "COUNTERACTION STATUS:\n\n[✓] RISING\n\n[   ] DROPPING"
  },
  {
   "score": 45,
   "id": "dh8ihcz",
   "pid": "t1_dh89wae",
   "date": "2017-05-07 00:10:06",
   "depth": 3,
   "text": "Are we ready for the punchline then?"
  },
  {
   "score": 27,
   "id": "dh8x2du",
   "pid": "t1_dh8ihcz",
   "date": "2017-05-07 09:25:42",
   "depth": 4,
   "text": "And will there be any use with all our gimmicks?"
  },
  {
   "score": 20,
   "id": "dh9nu2l",
   "pid": "t1_dh8x2du",
   "date": "2017-05-07 19:17:30",
   "depth": 5,
   "text": "Is it necessary that we check this out?"
  },
  {
   "score": 8,
   "id": "dh9yh99",
   "pid": "t1_dh9nu2l",
   "date": "2017-05-08 00:51:52",
   "depth": 6,
   "text": "Maybe we should log in then?"
  },
  {
   "score": 278,
   "id": "dh7lqte",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:42:38",
   "depth": 0,
   "text": "I just want to see how someone from Oreimo or Eromanga-sensei meeting their Creator goes down."
  },
  {
   "score": 29,
   "id": "dh7xxwa",
   "pid": "t1_dh7lqte",
   "date": "2017-05-06 14:27:07",
   "depth": 1,
   "text": "If it's Sagiri or Kirino: Obvious answer: http://i.imgur.com/kiEeD0x.jpg\n\nIt works for the both of them.\n"
  },
  {
   "score": 122,
   "id": "dh7nszv",
   "pid": "t1_dh7lqte",
   "date": "2017-05-06 10:29:39",
   "depth": 1,
   "text": "I want to see the already existing characters discover doujinshis."
  },
  {
   "score": 3,
   "id": "dh8hlpx",
   "pid": "t1_dh7nszv",
   "date": "2017-05-06 23:32:02",
   "depth": 2,
   "text": "I hope they do that. It has potential to be beyond hilarious."
  },
  {
   "score": 12,
   "id": "dh7oqi8",
   "pid": "t1_dh7nszv",
   "date": "2017-05-06 10:50:42",
   "depth": 2,
   "text": "This is what i've been hoping for since the first episode."
  },
  {
   "score": 121,
   "id": "dh7o1yf",
   "pid": "t1_dh7nszv",
   "date": "2017-05-06 10:35:16",
   "depth": 2,
   "text": "Selesia would appear disgusted but still read them out of curiosity. \n\nMeteora would make several bad puns before impartially explaining that this is how people in this world releive their desire for her.\n\nMamika's reaction would be...interesting. Lewdness probably doesn't even exist in her universe, being a kids' show and all."
  },
  {
   "score": 5,
   "id": "dh8at3e",
   "pid": "t1_dh7o1yf",
   "date": "2017-05-06 19:54:04",
   "depth": 3,
   "text": "Alice ex machina would find the doujin author and murder him for sullying her honour."
  },
  {
   "score": 59,
   "id": "dh7ptxl",
   "pid": "t1_dh7o1yf",
   "date": "2017-05-06 11:15:39",
   "depth": 3,
   "text": "Spot on. Poor Mamika, too. She'd probably be pretty disturbed, or just confused. What I really want to know though: What would Yuuya say about the doujinshis with him and the game's main character? Because if he really is a rival character, these are bound to exist.\n\nRui would definitely throw a tantrum."
  },
  {
   "score": 10,
   "id": "dh7vf06",
   "pid": "t1_dh7ptxl",
   "date": "2017-05-06 13:26:30",
   "depth": 4,
   "text": "Nothing wrong with some bromance man, as long as its no homo"
  },
  {
   "score": 4,
   "id": "dh8vmc8",
   "pid": "t1_dh7vf06",
   "date": "2017-05-07 08:52:37",
   "depth": 5,
   "text": "9/10 bromance doujins are homo. And I'm giving an underestimate."
  },
  {
   "score": 5,
   "id": "dh8vpa0",
   "pid": "t1_dh8vmc8",
   "date": "2017-05-07 08:54:32",
   "depth": 6,
   "text": "Nothing gay with some bro-on-bro rivalry of the physical kind\n\nJust 2 manly men battling for the title of gym boss"
  },
  {
   "score": 52,
   "id": "dh7xdc7",
   "pid": "t1_dh7ptxl",
   "date": "2017-05-06 14:12:59",
   "depth": 4,
   "text": "If Mamika read a doujinshi of herself that would break her already fragile mind, convince her that this world is evil, and proceed to rain death and destruction on everyone.\n"
  },
  {
   "score": 28,
   "id": "dh8bs3e",
   "pid": "t1_dh7xdc7",
   "date": "2017-05-06 20:18:52",
   "depth": 5,
   "text": "anti-Madoka project"
  },
  {
   "score": 134,
   "id": "dh7rndc",
   "pid": "t1_dh7o1yf",
   "date": "2017-05-06 11:57:40",
   "depth": 3,
   "text": "[Obligatory Mamika](http://i.imgur.com/RtgZgIG.jpg)"
  },
  {
   "score": 5,
   "id": "dh8nc1f",
   "pid": "t1_dh7rndc",
   "date": "2017-05-07 04:19:38",
   "depth": 4,
   "text": "By Fatal Pulse at that... poor Mamika."
  },
  {
   "score": 1,
   "id": "dh98o0r",
   "pid": "t1_dh8nc1f",
   "date": "2017-05-07 13:35:20",
   "depth": 5,
   "text": "Can I ask why the significance? Asking for a friend..."
  },
  {
   "score": 1,
   "id": "dhbl74k",
   "pid": "t1_dh98o0r",
   "date": "2017-05-09 01:58:40",
   "depth": 6,
   "text": "They're famous for some really dark corruption doujins."
  },
  {
   "score": 2,
   "id": "dh99f7d",
   "pid": "t1_dh98o0r",
   "date": "2017-05-07 13:50:59",
   "depth": 6,
   "text": "Uh... well... The \"Mamika Doujins\" in the screenshot have a certain title... If you were to look that up... Let me just say, Mamika, being used to a happy world where Sadism doesn't exist would probably look exactly like in that screenshot if she were to find that Doujin."
  },
  {
   "score": 20,
   "id": "dh7sdnz",
   "pid": "t1_dh7rndc",
   "date": "2017-05-06 12:14:57",
   "depth": 4,
   "text": "Is that...real? If yes, then *man* was that fast"
  },
  {
   "score": 5,
   "id": "dh7spbx",
   "pid": "t1_dh7sdnz",
   "date": "2017-05-06 12:22:35",
   "depth": 5,
   "text": "Not yet."
  },
  {
   "score": 61,
   "id": "dh7sta0",
   "pid": "t1_dh7sdnz",
   "date": "2017-05-06 12:25:06",
   "depth": 5,
   "text": "Someone already made that pic after the 2nd episode, so there's that.\n\nBut It's just an edit. For now, at least."
  },
  {
   "score": 14,
   "id": "dh7vd48",
   "pid": "t1_dh7sta0",
   "date": "2017-05-06 13:25:16",
   "depth": 6,
   "text": "It was from before ep 2 actually"
  },
  {
   "score": 258,
   "id": "dh7t09x",
   "pid": "t1_dh7nszv",
   "date": "2017-05-06 12:29:32",
   "depth": 2,
   "text": "It would probably go something like this: https://imgur.com/gC0aEwS"
  },
  {
   "score": 5,
   "id": "dh89hia",
   "pid": "t1_dh7t09x",
   "date": "2017-05-06 19:18:54",
   "depth": 3,
   "text": "I... what LOL"
  },
  {
   "score": 6,
   "id": "dh8mvmf",
   "pid": "t1_dh7t09x",
   "date": "2017-05-07 03:56:32",
   "depth": 3,
   "text": "Oh God, imagine if a character from a hentai came into the real world. That would get messed up quickly."
  },
  {
   "score": 16,
   "id": "dh8d3iw",
   "pid": "t1_dh7t09x",
   "date": "2017-05-06 20:55:27",
   "depth": 3,
   "text": "LOL all those \"ahoges\""
  },
  {
   "score": 18,
   "id": "dh7vhrh",
   "pid": "t1_dh7t09x",
   "date": "2017-05-06 13:28:15",
   "depth": 3,
   "text": "Is this real?"
  },
  {
   "score": 54,
   "id": "dh7w2me",
   "pid": "t1_dh7vhrh",
   "date": "2017-05-06 13:41:56",
   "depth": 4,
   "text": "I believe it's fanart; but in my head it's real. =)"
  },
  {
   "score": 30,
   "id": "dh7uldt",
   "pid": "t1_dh7t09x",
   "date": "2017-05-06 13:06:50",
   "depth": 3,
   "text": "That's beautiful"
  },
  {
   "score": 96,
   "id": "dh7w6ue",
   "pid": "t1_dh7t09x",
   "date": "2017-05-06 13:44:45",
   "depth": 3,
   "text": "LOL, I just spotted an Aqua doujin in the picture (second row from the top)\n\n"
  },
  {
   "score": 137,
   "id": "dh7nrdk",
   "pid": "t1_dh7lqte",
   "date": "2017-05-06 10:28:39",
   "depth": 1,
   "text": "[](#cup7)"
  },
  {
   "score": 1,
   "id": "dh9m9kh",
   "pid": "t1_dh7nrdk",
   "date": "2017-05-07 18:40:29",
   "depth": 2,
   "text": "what is this comment face from?  \nedit: nvm I remembered; it's rin from shelter"
  },
  {
   "score": 3,
   "id": "dha026d",
   "pid": "t1_dh9m9kh",
   "date": "2017-05-08 02:13:31",
   "depth": 3,
   "text": "wait, but when is she shown holding a cup like this in the video? Or is this an edit...?"
  },
  {
   "score": 2,
   "id": "dhaof0e",
   "pid": "t1_dha026d",
   "date": "2017-05-08 12:12:59",
   "depth": 4,
   "text": "it's an edit"
  },
  {
   "score": 199,
   "id": "dh7mt0m",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:07:09",
   "depth": 0,
   "text": "I don't think people in this thread are appreciating the completely random stupid pun that was covered by an unexpected military attack."
  },
  {
   "score": 2,
   "id": "dh8qpin",
   "pid": "t1_dh7mt0m",
   "date": "2017-05-07 06:31:29",
   "depth": 1,
   "text": "I didn't/don't understand the pun though so... -hangs head-"
  },
  {
   "score": 5,
   "id": "dh8w6ho",
   "pid": "t1_dh8qpin",
   "date": "2017-05-07 09:05:42",
   "depth": 2,
   "text": "It was a pun on Kanoya's name, in both languages."
  },
  {
   "score": 1,
   "id": "dh8wmff",
   "pid": "t1_dh8w6ho",
   "date": "2017-05-07 09:15:42",
   "depth": 3,
   "text": "thank you"
  },
  {
   "score": 33,
   "id": "dh849gj",
   "pid": "t1_dh7mt0m",
   "date": "2017-05-06 17:04:47",
   "depth": 1,
   "text": "The moment when your pun was so bad the swat team comes in to [arrest you.](https://media.giphy.com/media/l4FGGG9f84i7U8wzC/giphy.gif)"
  },
  {
   "score": 49,
   "id": "dh7nuqu",
   "pid": "t1_dh7mt0m",
   "date": "2017-05-06 10:30:44",
   "depth": 1,
   "text": "[Bless that military attack...](https://i.imgur.com/B74UgQw.jpg)"
  },
  {
   "score": 104,
   "id": "dh7rdd6",
   "pid": "t1_dh7mt0m",
   "date": "2017-05-06 11:51:13",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 4,
   "id": "dh8f461",
   "pid": "t1_dh7rdd6",
   "date": "2017-05-06 21:57:32",
   "depth": 2,
   "text": "a joke to soothe your heart"
  },
  {
   "score": 13,
   "id": "dh849ya",
   "pid": "t1_dh7rdd6",
   "date": "2017-05-06 17:05:07",
   "depth": 2,
   "text": "Plus a thumb up"
  },
  {
   "score": 15,
   "id": "dh899ss",
   "pid": "t1_dh7rdd6",
   "date": "2017-05-06 19:13:09",
   "depth": 2,
   "text": "[Get it?](http://i.imgur.com/a/Bti5w)"
  },
  {
   "score": 37,
   "id": "dh7vfny",
   "pid": "t1_dh7rdd6",
   "date": "2017-05-06 13:26:55",
   "depth": 2,
   "text": "This is why she is the best."
  },
  {
   "score": 91,
   "id": "dh7ka3t",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:08:42",
   "depth": 0,
   "text": "The girl in uniform is called Altair?"
  },
  {
   "score": 6,
   "id": "dh8uz6v",
   "pid": "t1_dh7ka3t",
   "date": "2017-05-07 08:37:35",
   "depth": 1,
   "text": "She's on track searching for the forbidden fruit"
  },
  {
   "score": 19,
   "id": "dh7ocob",
   "pid": "t1_dh7ka3t",
   "date": "2017-05-06 10:41:58",
   "depth": 1,
   "text": "Probably, I think he first search word 'name of star' or something."
  },
  {
   "score": 39,
   "id": "dh7oi0p",
   "pid": "t1_dh7ka3t",
   "date": "2017-05-06 10:45:23",
   "depth": 1,
   "text": "problably, because Altair means The flyer in arabic.. but then again she is not the only one who flies."
  },
  {
   "score": 2,
   "id": "di4a9b5",
   "pid": "t1_dh7oi0p",
   "date": "2017-05-27 11:03:35",
   "depth": 2,
   "text": "Altair also has some relevance to Japanese mythology. \n\nYou know the \"festival episodes\" you see in every other anime? Those festivals are to celebrate the meeting of Orihime and Hikoboshi, who are the stars Vega and Altair. \n\nIt's why those two names show up every so often in anime, like with the [Bakemonogatari ED](https://www.youtube.com/watch?v=S2TJ1qqeRD8) or the upcoming [Shoukoku no Altair](https://myanimelist.net/anime/34547/Shoukoku_no_Altair)."
  },
  {
   "score": 6,
   "id": "dh8lzgk",
   "pid": "t1_dh7oi0p",
   "date": "2017-05-07 03:08:53",
   "depth": 2,
   "text": "Does this make the Military Uniform Princess Assassin class?"
  },
  {
   "score": 6,
   "id": "dh7z847",
   "pid": "t1_dh7oi0p",
   "date": "2017-05-06 14:58:08",
   "depth": 2,
   "text": "Maybe the only one in her world. "
  },
  {
   "score": 54,
   "id": "dh7kht9",
   "pid": "t1_dh7ka3t",
   "date": "2017-05-06 09:13:44",
   "depth": 1,
   "text": "It's a possible romanization and the one that makes most sense, reading the fake-search results."
  },
  {
   "score": 76,
   "id": "dh7k9cq",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:08:13",
   "depth": 0,
   "text": "Someone became Homeless..."
  },
  {
   "score": 2,
   "id": "dh84d89",
   "pid": "t1_dh7k9cq",
   "date": "2017-05-06 17:07:22",
   "depth": 1,
   "text": "It's Tokyo Godfather time."
  },
  {
   "score": 2,
   "id": "dh808z1",
   "pid": "t1_dh7k9cq",
   "date": "2017-05-06 15:23:23",
   "depth": 1,
   "text": "Join me in that party too..."
  },
  {
   "score": 41,
   "id": "dh7yldp",
   "pid": "t1_dh7k9cq",
   "date": "2017-05-06 14:43:03",
   "depth": 1,
   "text": "RIP House-kun. "
  },
  {
   "score": 234,
   "id": "dh7ip94",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:31:09",
   "depth": 0,
   "text": "[Gate - Thus The JSDF Fought Anime, Games, Light Novels And A Giant Robot](https://streamable.com/p9gdy)"
  },
  {
   "score": 2,
   "id": "dh7zj9i",
   "pid": "t1_dh7ip94",
   "date": "2017-05-06 15:05:37",
   "depth": 1,
   "text": "I loved that show"
  },
  {
   "score": 3,
   "id": "dh81jt8",
   "pid": "t1_dh7ip94",
   "date": "2017-05-06 15:55:46",
   "depth": 1,
   "text": "I had just watched some parts of Gate and was anticipating a cross over moment in that scene."
  },
  {
   "score": 24,
   "id": "dh7jni8",
   "pid": "t1_dh7ip94",
   "date": "2017-05-06 08:53:54",
   "depth": 1,
   "text": "What the fuck, that was awesome (but cliche.. but awesome)"
  },
  {
   "score": 103,
   "id": "dh7rebz",
   "pid": "t1_dh7jni8",
   "date": "2017-05-06 11:51:50",
   "depth": 2,
   "text": "I think it goes against cliche. Usually fiction has the authorities slow on the uptake or incompetent, but Re:Creators has them acting more realistically. It's a refreshing change."
  },
  {
   "score": 10,
   "id": "dh83g2i",
   "pid": "t1_dh7rebz",
   "date": "2017-05-06 16:44:18",
   "depth": 3,
   "text": "> acting more realistically    \n\n\n> acting quickly    \n\n\nI think you forgot that \"realistically\" also means \"with bureaucracy\". \n"
  },
  {
   "score": 18,
   "id": "dh83yv7",
   "pid": "t1_dh83g2i",
   "date": "2017-05-06 16:57:23",
   "depth": 4,
   "text": "It's a disaster/emergency situation involving national security. This goes straight to the top.  \n\nIn her briefing Kikuchihara said that they did dismiss the earliest sightings of MUP months ago as \"rumors or a hoax\". But after Meteora stole and used military supplies, Mamika blew craters in downtown Tokyo, and Alicetaria charged into a police station... the evidence was quite clear and they shifted into crisis mode. "
  },
  {
   "score": 27,
   "id": "dh7x062",
   "pid": "t1_dh7rebz",
   "date": "2017-05-06 14:04:04",
   "depth": 3,
   "text": "Thank you, authority figures that act like authority figures."
  },
  {
   "score": 46,
   "id": "dh7vqb7",
   "pid": "t1_dh7rebz",
   "date": "2017-05-06 13:33:48",
   "depth": 3,
   "text": "> . Usually fiction has the authorities slow on the uptake or incompetent, but Re:Creators has them acting more realistically. It's a refreshing change.\n\nThis. I was really surprised at how quickly the agency(forgot their name)grasped the situation and seemed to be cool about it. Other than 100m yen for ATM missiles, of course\n"
  },
  {
   "score": 24,
   "id": "dh874r1",
   "pid": "t1_dh7vqb7",
   "date": "2017-05-06 18:18:03",
   "depth": 4,
   "text": "I mean seriously, in the face of something like this you really have no option than to believe it.\n\nIt's like taking the flat-earth believers into ISS (but they'd probably find a way to worm out of that one as well). There's simply an overwhelming evidence of something paranormal is happening and it can even be recorded, scrutinized, and the people involved in it are people that can be spoken to."
  },
  {
   "score": 16,
   "id": "dh7tr7z",
   "pid": "t1_dh7ip94",
   "date": "2017-05-06 12:47:01",
   "depth": 1,
   "text": "I always thought Selesia's creator looked like an older Itami from Gate."
  },
  {
   "score": 4,
   "id": "dh858nj",
   "pid": "t1_dh7tr7z",
   "date": "2017-05-06 17:29:32",
   "depth": 2,
   "text": "Isn't it the same VA?"
  },
  {
   "score": 5,
   "id": "dh86pyn",
   "pid": "t1_dh858nj",
   "date": "2017-05-06 18:07:28",
   "depth": 3,
   "text": "According to MAL, no. The VA for Itami in GATE is: https://myanimelist.net/people/95/Junichi_Suwabe  \n\nWhile the VA for Matsubara in Re:Creators is: https://myanimelist.net/people/20/Katsuyuki_Konishi  \n\nThough the latter did also voice Prince Zorzal in GATE."
  },
  {
   "score": 3,
   "id": "dh8b32s",
   "pid": "t1_dh86pyn",
   "date": "2017-05-06 20:01:18",
   "depth": 4,
   "text": "Ah ok, I vaguely remembered he'd done some Voice work on GATE. Just didn't remember which character."
  },
  {
   "score": 25,
   "id": "dh7n39f",
   "pid": "t1_dh7ip94",
   "date": "2017-05-06 10:13:35",
   "depth": 1,
   "text": "I was thinking the same thing. It will be interesting to see how much they intervene in the future, and how much they do if so.\n\nIt also begs the question, like Gate did, as to whether or not other countries are going to get involved."
  },
  {
   "score": 7,
   "id": "dh8kfrh",
   "pid": "t1_dh7n39f",
   "date": "2017-05-07 01:46:25",
   "depth": 2,
   "text": "let's hope that it doesn't go ultranationalistic like Gate and we see Japanese special forces killing spetsnaz, Team Six and Chinese special forces like there were nothing.\n\nOr missing the point completly about the helicopter scene on Apocalipse Now."
  },
  {
   "score": 177,
   "id": "dh7lt90",
   "pid": "t1_dh7ip94",
   "date": "2017-05-06 09:44:12",
   "depth": 1,
   "text": "I'm freeken glad the government did something tbh, look at the damage caused at all the fights before "
  },
  {
   "score": 7,
   "id": "dh87cwo",
   "pid": "t1_dh7lt90",
   "date": "2017-05-06 18:23:51",
   "depth": 2,
   "text": "its actually something i really appreciate, its always felt weird how little the governments react to the happenings of fantasy works set in modern times. like we have millions of sensors set up to detect normal non fantastic movements of humans, there is no way that random explosions and murders would go unnoticed. "
  },
  {
   "score": 92,
   "id": "dh7n5mm",
   "pid": "t1_dh7lt90",
   "date": "2017-05-06 10:15:04",
   "depth": 2,
   "text": "I'm not sure why they didn't talk about the fight with Mamika..."
  },
  {
   "score": 1,
   "id": "dh7oosp",
   "pid": "t1_dh7n5mm",
   "date": "2017-05-06 10:49:38",
   "depth": 3,
   "text": "Yeah...they might have forgot about that one, but remembered, everything else? Okay then."
  },
  {
   "score": 25,
   "id": "dh7pngs",
   "pid": "t1_dh7n5mm",
   "date": "2017-05-06 11:11:33",
   "depth": 3,
   "text": "probably just cut because of time constraints\n\ndon't need to include every single little detail"
  },
  {
   "score": 17,
   "id": "dh86nf3",
   "pid": "t1_dh7pngs",
   "date": "2017-05-06 18:05:42",
   "depth": 4,
   "text": "Both in terms of the production of the anime, and diagetically, as well. The audience doesn't care, and everyone sitting in that meeting gets the point."
  },
  {
   "score": 38,
   "id": "dh7rfoc",
   "pid": "t1_dh7n5mm",
   "date": "2017-05-06 11:52:43",
   "depth": 3,
   "text": "I'm not sure about the in-world explanation, but from the perspective of this being a show, it was more of an excuse to show scenes that we haven't seen yet. Or to bring up Gunpuku specifically because she's the main villain so they have to point her out. It makes sense to not focus on Mamika's battle because it wouldn't have actually given us more information about the impact of the Creations, so it would just be wasted time.\n\nIt's weird because it feels like the only thing excluded, so the display of the inferences of the Creations on the world looked like it was otherwise supposed to be comprehensive, but if we assume there were a handful of other incidents that were just not important enough to mention, then it makes sense. They only showed incidents that conveyed other important information, like that one Creator getting kidnapped or chastising Meteora for reckless use of military resources."
  },
  {
   "score": 15,
   "id": "dh873l5",
   "pid": "t1_dh7rfoc",
   "date": "2017-05-06 18:17:13",
   "depth": 4,
   "text": "> but from the perspective of this being a show, it was more of an excuse to show scenes that we haven't seen yet\n\nWow that actually makes a lot of sense. Good observation."
  },
  {
   "score": 151,
   "id": "dh7qhr4",
   "pid": "t1_dh7n5mm",
   "date": "2017-05-06 11:30:57",
   "depth": 3,
   "text": "'And that one part where Selesia got wrecked by a small child' "
  },
  {
   "score": 4,
   "id": "dh8p4h5",
   "pid": "t1_dh7qhr4",
   "date": "2017-05-07 05:37:31",
   "depth": 4,
   "text": "Doesn't most of Selesia's power come from her Mech?"
  },
  {
   "score": 4,
   "id": "dh8p82v",
   "pid": "t1_dh8p4h5",
   "date": "2017-05-07 05:41:24",
   "depth": 5,
   "text": "So she needs a giant robot to be on par with a small child. It doesn't help her case much, does it? Better to let it slide. "
  },
  {
   "score": 10,
   "id": "dh9bqy3",
   "pid": "t1_dh8p82v",
   "date": "2017-05-07 14:39:42",
   "depth": 6,
   "text": "A small child with power kinda negates the disadvantage of being a small child. "
  },
  {
   "score": 3,
   "id": "dhckbaa",
   "pid": "t1_dh9bqy3",
   "date": "2017-05-09 15:15:29",
   "depth": 7,
   "text": "I know it is memed to death, but it would be fun to see OPM in an anime like this. Completely oblivious to the situation, excited to shop in all the crazy stores, and completely unstoppable to anyone in his way."
  },
  {
   "score": 10,
   "id": "dh8qpm8",
   "pid": "t1_dh8p4h5",
   "date": "2017-05-07 06:31:34",
   "depth": 5,
   "text": "Yeah she is a mecha pilot, the only reason she lasts that long against a magical girl is because she comes from a fantasy series and knows magic. "
  },
  {
   "score": 78,
   "id": "dh7qq8n",
   "pid": "t1_dh7qhr4",
   "date": "2017-05-06 11:36:22",
   "depth": 4,
   "text": "[**Savage**](#dubs)"
  },
  {
   "score": 60,
   "id": "dh7mgde",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:59:00",
   "depth": 0,
   "text": "[Rui is a man's name and he's a man!](https://files.catbox.moe/0ayl1l.webm)"
  },
  {
   "score": 2,
   "id": "dh8cr2o",
   "pid": "t1_dh7mgde",
   "date": "2017-05-06 20:45:31",
   "depth": 1,
   "text": "Is it?"
  },
  {
   "score": 3,
   "id": "dh8kmru",
   "pid": "t1_dh7mgde",
   "date": "2017-05-07 01:56:40",
   "depth": 1,
   "text": "That hasn't stop us before."
  },
  {
   "score": 4,
   "id": "dh83jzu",
   "pid": "t1_dh7mgde",
   "date": "2017-05-06 16:46:59",
   "depth": 1,
   "text": "As I said in my own comment, I'm very much looking forward to the Rule 63."
  },
  {
   "score": 19,
   "id": "dh7qsv7",
   "pid": "t1_dh7mgde",
   "date": "2017-05-06 11:38:00",
   "depth": 1,
   "text": "Kamille-kun!!!"
  },
  {
   "score": 70,
   "id": "dh7pfgx",
   "pid": "t1_dh7mgde",
   "date": "2017-05-06 11:06:24",
   "depth": 1,
   "text": "[The mannerisms and voice of a woman...](http://i2.kym-cdn.com/photos/images/original/000/285/653/765.jpg)"
  },
  {
   "score": 2,
   "id": "dkzuv0i",
   "pid": "t1_dh7pfgx",
   "date": "2017-07-31 19:38:21",
   "depth": 2,
   "text": "I see Steins;Gate, I upvote"
  },
  {
   "score": 4,
   "id": "di67uwq",
   "pid": "t1_dh7pfgx",
   "date": "2017-05-28 20:24:30",
   "depth": 2,
   "text": "Daga... Otoko da! "
  },
  {
   "score": 63,
   "id": "dh8hcgo",
   "pid": "t3_69lja0",
   "date": "2017-05-06 23:21:10",
   "depth": 0,
   "text": "https://www.sunday-webry.com/events/re_creators_naked/interview05/\n\nA few interesting details:\n\n- Initally Gigas Machina was supposed to be as tall as Vogelschevalier (17 m) then they decided to make it bigger (55 m) in order to emphasize the difference - and that input came from Aoki;\n- Hiroe says that Rui is a mixture of several characters from mecha shows, including the obvious Shinji reference;\n- When discussing Celesia's character, who had some moments of comedy relief, Hiroe said he wasn't expecting her to do so when he started to write the series. In a sense, he said the character became \"three dimensional\";\n- Hiroe purposely wrote the government and the female officer in particular as competent because he felt it was frustrating to have people in power that do idiotic things. "
  },
  {
   "score": 3,
   "id": "dh8zm82",
   "pid": "t1_dh8hcgo",
   "date": "2017-05-07 10:23:28",
   "depth": 1,
   "text": "Your link isn't working (it seems like a part of it turned into ellipses)."
  },
  {
   "score": 2,
   "id": "dh9112v",
   "pid": "t1_dh8zm82",
   "date": "2017-05-07 10:55:37",
   "depth": 2,
   "text": "Fixed. Thanks for pointing it out!"
  },
  {
   "score": 6,
   "id": "djn7kw8",
   "pid": "t1_dh8hcgo",
   "date": "2017-07-01 05:47:24",
   "depth": 1,
   "text": "> Hiroe purposely wrote the government and the female officer in particular as competent because he felt it was frustrating to have people in power that do idiotic things.\n\nThis part was so refreshing. No craziness with the government trying to use the fictional characters powers, detaining them and doing evil stuff. No loudmouth generals demanding that they take out the fictional characters or some weird gungho type stuff. Just a security council trying to assess the situation and figure out what's going on, without doing anything that would piss off the potential threat."
  },
  {
   "score": 8,
   "id": "dhbg36e",
   "pid": "t1_dh8hcgo",
   "date": "2017-05-08 22:15:21",
   "depth": 1,
   "text": "They didn't name it Gigas for nothing. But man, 55 m IS huge."
  },
  {
   "score": 151,
   "id": "dh7kkyb",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:15:48",
   "depth": 0,
   "text": "Daga otoko da"
  },
  {
   "score": 1,
   "id": "dh8w8x9",
   "pid": "t1_dh7kkyb",
   "date": "2017-05-07 09:07:21",
   "depth": 1,
   "text": "You mean Kanoya ? Or did I miss some Urushibara there ? "
  },
  {
   "score": 3,
   "id": "dh8pdkh",
   "pid": "t1_dh7kkyb",
   "date": "2017-05-07 05:46:56",
   "depth": 1,
   "text": "What part was that?"
  },
  {
   "score": 3,
   "id": "dh8v0fm",
   "pid": "t1_dh8pdkh",
   "date": "2017-05-07 08:38:27",
   "depth": 2,
   "text": "it's a reference from steins;gate"
  },
  {
   "score": 68,
   "id": "dh7namb",
   "pid": "t1_dh7kkyb",
   "date": "2017-05-06 10:18:14",
   "depth": 1,
   "text": "[](#datass)"
  },
  {
   "score": 103,
   "id": "dh7k2zt",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:04:05",
   "depth": 0,
   "text": "I love how Rui was all like \"I won't touch that thing again\" but the moment things get a bit rough on him? Paff he goes and call his robot without even flinching. I love him already. "
  },
  {
   "score": 23,
   "id": "dh8diop",
   "pid": "t1_dh7k2zt",
   "date": "2017-05-06 21:07:33",
   "depth": 1,
   "text": " I bet it's more like he personally doesn't want to get in and pretty much hates it. But he's not stupid and knows when he needs to get in"
  },
  {
   "score": 195,
   "id": "dh7jpic",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:55:14",
   "depth": 0,
   "text": "OF COURSE\n\nSHE IS A HE\n\n**OF FUCKING COURSE**\n\n#AND HES CUTE AS WELL\n\n^^^ok ^^^seriously ^^^what ^^^isnt ^^^this ^^^guy"
  },
  {
   "score": 0,
   "id": "dh8c9l5",
   "pid": "t1_dh7jpic",
   "date": "2017-05-06 20:31:53",
   "depth": 1,
   "text": "https://i.redditmedia.com/m_sPxxGTs6q033tYPrH0XZg0t_RfD05v6Nc6yhRttEk.jpg?w=320&s=67fc0b1c20b7189c43ccdc1a90bf4ac0"
  },
  {
   "score": 2,
   "id": "dh8kkal",
   "pid": "t1_dh7jpic",
   "date": "2017-05-07 01:53:08",
   "depth": 1,
   "text": "Prepare for the doujinshi, boys!"
  },
  {
   "score": 4,
   "id": "dhbfzvt",
   "pid": "t1_dh7jpic",
   "date": "2017-05-08 22:12:13",
   "depth": 1,
   "text": "You actually expected him to be a she? 'Cause I could see it right away that Rui was a he."
  },
  {
   "score": 20,
   "id": "dh89v2v",
   "pid": "t1_dh7jpic",
   "date": "2017-05-06 19:28:48",
   "depth": 1,
   "text": "[BALLS OR NOT, MAN...](http://38.media.tumblr.com/945de9691e3a95958d160a9ea191c3af/tumblr_mrh6hlrOGa1rs4yfmo3_500.gif)"
  },
  {
   "score": 26,
   "id": "dh7xguy",
   "pid": "t1_dh7jpic",
   "date": "2017-05-06 14:15:22",
   "depth": 1,
   "text": "[But it's a boy](https://www.youtube.com/watch?v=qpsyRTL7LRg)"
  },
  {
   "score": 2,
   "id": "dh8we3e",
   "pid": "t1_dh7xguy",
   "date": "2017-05-07 09:10:42",
   "depth": 2,
   "text": "That's what I think of when someone mentions Cagliostro from Granblue Fantasy.  \n  \n^^^^Althout ^^^^I ^^^^understand ^^^^that ^^^^it's ^^^^a ^^^^bit ^^^^different ^^^^as ^^^^Caglistro ^^^^is ^^^^a ^^^^man's ^^^^mind ^^^^in ^^^^a ^^^^girl's ^^^^body"
  },
  {
   "score": 7,
   "id": "dh8klsv",
   "pid": "t1_dh7xguy",
   "date": "2017-05-07 01:55:15",
   "depth": 2,
   "text": "Let's be honest here.\n\nA good amount of people in this subreddit doesn't care about that.\n\n...me included."
  },
  {
   "score": 13,
   "id": "dh8d7no",
   "pid": "t1_dh7jpic",
   "date": "2017-05-06 20:58:42",
   "depth": 1,
   "text": "How did people assume that he was a she? It looked like a he from the very beginning. I dont get this!"
  },
  {
   "score": 2,
   "id": "dha097u",
   "pid": "t1_dh8d7no",
   "date": "2017-05-08 02:24:19",
   "depth": 2,
   "text": "Same here, it always looked like a 'he' to me. It was the same for Kirito in SAO2, he just looked like a dude with long hair.\n\nBut hey, traps are the whole new fad people like to freak out about. I think they just permanently look at everything with fetish rose-tinted glasses, hence the \"misunderstandings\"."
  },
  {
   "score": 22,
   "id": "dh7mhu4",
   "pid": "t1_dh7jpic",
   "date": "2017-05-06 09:59:57",
   "depth": 1,
   "text": "Trap-bait confirmed. Doujins incoming."
  },
  {
   "score": 106,
   "id": "dh7mzop",
   "pid": "t1_dh7jpic",
   "date": "2017-05-06 10:11:20",
   "depth": 1,
   "text": "Wait til you see the MC of the upcoming Knights & Magic: https://pbs.twimg.com/media/C67ZLK-UwAEud-b.jpg\n\nUnlike Rui (and Shinji), this guy's always rearing to get in the mech..."
  },
  {
   "score": 1,
   "id": "dh8wbd0",
   "pid": "t1_dh7mzop",
   "date": "2017-05-07 09:08:58",
   "depth": 2,
   "text": "Oh come on! So much potential ..."
  },
  {
   "score": 3,
   "id": "dh7zwi7",
   "pid": "t1_dh7mzop",
   "date": "2017-05-06 15:14:49",
   "depth": 2,
   "text": "Ho boy he's a hottie :O"
  },
  {
   "score": 34,
   "id": "dh7pbzt",
   "pid": "t1_dh7mzop",
   "date": "2017-05-06 11:04:11",
   "depth": 2,
   "text": "i mean, to be fair, in manga and anime, you just draw a female character and call it a man, and there you are. it's not like there's anything that makes them a man other than the word of the fiction itself."
  },
  {
   "score": 1,
   "id": "djskvb3",
   "pid": "t1_dh7pbzt",
   "date": "2017-07-04 20:29:20",
   "depth": 3,
   "text": "I started reading the LN and dude... it's almost disgusting how much it keeps saying how pretty the MC is, how much of his features were inherited from his mother, how his \"purple-silver hair\" is this, how his \"oval face\" is that, how people are literally breathless about his beauty and started calling him \"the girl of the library\" in some sort of poetic sense and if a painter saw him sitting by there reading books he would start painting the scene, etc.\n\nThere's at least one paragraph talking about it every chapter. In contrast his father was described as just a dude in his 30s."
  },
  {
   "score": 23,
   "id": "dh8qrmf",
   "pid": "t1_dh7pbzt",
   "date": "2017-05-07 06:33:17",
   "depth": 3,
   "text": "I'm not sure this is totally true. I never thought Kanoya was a girl and am kind of surprised people did. Though that Knights and Magic one is pretty ambiguous."
  },
  {
   "score": 5,
   "id": "dh8qvl4",
   "pid": "t1_dh8qrmf",
   "date": "2017-05-07 06:36:46",
   "depth": 4,
   "text": "well, not always, but it is very common. the reason traps are so popular is because well, they're just like futas- just girls with added dicks. they're not masculine enough to alienate the straight crowd.\n\nof course, some traps actually have boyish characteristics, but honestly, that's pretty rare."
  },
  {
   "score": 75,
   "id": "dh7n8in",
   "pid": "t1_dh7mzop",
   "date": "2017-05-06 10:16:54",
   "depth": 2,
   "text": "Ho shit he's cute."
  },
  {
   "score": 80,
   "id": "dh7nud0",
   "pid": "t1_dh7n8in",
   "date": "2017-05-06 10:30:30",
   "depth": 3,
   "text": "There's something wrong in this sentence but I don't want to point it out."
  },
  {
   "score": 3,
   "id": "dh8gmdf",
   "pid": "t1_dh7nud0",
   "date": "2017-05-06 22:52:03",
   "depth": 4,
   "text": ">Ho shit he's cute.\n\nHoly*?? That's the only thing I see wrong with that sentence."
  },
  {
   "score": 34,
   "id": "dh7ow6v",
   "pid": "t1_dh7nud0",
   "date": "2017-05-06 10:54:15",
   "depth": 4,
   "text": "Jump on the shota train?  Choo choo!"
  },
  {
   "score": 52,
   "id": "dh7mscp",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:06:44",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 1,
   "id": "dh9woqy",
   "pid": "t1_dh7mscp",
   "date": "2017-05-07 23:33:06",
   "depth": 1,
   "text": "I wouldn't be shocked if this is more subtle pro-JSDF propaganda lol"
  },
  {
   "score": 52,
   "id": "dh7o7b4",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:38:39",
   "depth": 0,
   "text": "They exchanged glasses. Lewd. "
  },
  {
   "score": 118,
   "id": "dh7k0bk",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:02:22",
   "depth": 0,
   "text": "That subway scene was girl talk vs guy talk in a nutshell; pretty funny stuff.\n\nAnd Meteora solidfying her place as best girl of the show. Her reactions to hearing the bill and trying to get out of it was hilarious.\n\nAnd looks like we got our plot twist that lines up pretty well with what people have been saying here. So \"MC\" was familiar with the girl who died in the opening scene with them having a writer/illustrator affiliation. And the military princess work was their creation? The subs didn't really go far enough for me to fully get it. \n\nKind of excited that we're 5 episodes in and the show hasn't really hit any big bumps in the road as of yet. It's premature to be at ease since this is 2 cour but I'm happy to still be enjoying this. "
  },
  {
   "score": 1,
   "id": "dhauy18",
   "pid": "t1_dh7k0bk",
   "date": "2017-05-08 14:10:17",
   "depth": 1,
   "text": "Oooh this is 2 cour? That makes me a lot more excited. They've gotten so far in the plot already so I wonder where things will go from here"
  },
  {
   "score": 3,
   "id": "dhbni8b",
   "pid": "t1_dh7k0bk",
   "date": "2017-05-09 03:54:15",
   "depth": 1,
   "text": "How about too much exposition, not enough story?\nEver since that magical girl vs knight lady fight it's been nothing but talking and talking but no story progression. The most we know from the last few episodes is that creators can't OP their creations, Evil Military princess wants to destroy the world, the government is involved and that girl who died In the beginning was the creator of Evil Military Princess. That's it. "
  },
  {
   "score": 32,
   "id": "dh7tknf",
   "pid": "t1_dh7k0bk",
   "date": "2017-05-06 12:42:41",
   "depth": 1,
   "text": "I appreciate what HorribleSubs does, but hopefully once a proper fansub group does this episode I'll actually be able to get the full context of what he was doing on his computer at the end of the episode. There was a lot of text and I feel like I missed a ton because I couldn't read it."
  },
  {
   "score": 1,
   "id": "dhaem7n",
   "pid": "t1_dh7tknf",
   "date": "2017-05-08 09:10:47",
   "depth": 2,
   "text": "Some people summarized it here in this comment chain if you didn't see.\n\nhttps://www.reddit.com/r/anime/comments/69lja0/spoilers_recreators_episode_5_discussion/dh7mokg/"
  },
  {
   "score": 6,
   "id": "dh87bzt",
   "pid": "t1_dh7tknf",
   "date": "2017-05-06 18:23:13",
   "depth": 2,
   "text": "On a semi-related note, I found the intense, dramatic music while he was searching his PC to be so strong it was actually kind of funny given he was just Googling and clicking links."
  },
  {
   "score": 28,
   "id": "dh83dky",
   "pid": "t1_dh7tknf",
   "date": "2017-05-06 16:42:35",
   "depth": 2,
   "text": "Amazon dropping the ball with their subtitling again...It doesn't look like there's any fansubs doing the show either.  \n\n[This comment describes the text fairly well though.](https://www.reddit.com/r/anime/comments/69lja0/spoilers_recreators_episode_5_discussion/dh7rs8j/)"
  },
  {
   "score": 36,
   "id": "dh81a70",
   "pid": "t1_dh7tknf",
   "date": "2017-05-06 15:48:53",
   "depth": 2,
   "text": "> once a proper fansub group\n\nSo, an actual fansub group?  \nIs any fansub even doing this show?"
  },
  {
   "score": 46,
   "id": "dh8f7js",
   "pid": "t1_dh81a70",
   "date": "2017-05-06 22:00:36",
   "depth": 3,
   "text": "Those times are long gone. War has changed."
  },
  {
   "score": 39,
   "id": "dh7s92x",
   "pid": "t3_69lja0",
   "date": "2017-05-06 12:11:56",
   "depth": 0,
   "text": "#My ~~God~~ *Sonzai Exus* things escalated.  \n\nThe govt busting in was great and the quick reactions by the team were nice, even if a house was destroyed...  \n\nSo now team venture is partnered with the govt and going to find and protect the other creations and creators.  This should be good.  I like the idea of this honestly.  Kinda reverse GATE in that they had fantasy people helping in fantasy land but here its the reverse.  \n\nThat ending credits scene was tense as hell though but good on them for doing it like that.  So our MC-kun might be one of the creators of Sword Bitch, and yes he did know the author who killed herself in ep 1 (i had a feling that would be the case).  Its a shame shes dead because i liked her character design.  Reminded me a bit of Eri Ninamori from FLCL.  \n\nI guess now the painful wait until next week...  I wonder if MC-kun will tell the others... i feel like he might hide it a bit while he digs around.  \n\nNeedless to say this show leaves me flabbergasted every week.  So damn interesting and well made.  \n\n[](#awe)"
  },
  {
   "score": 3,
   "id": "dh8vrqg",
   "pid": "t1_dh7s92x",
   "date": "2017-05-07 08:56:07",
   "depth": 1,
   "text": ">The govt busting in was great\n\nThey may have sent in their swat team after the mech appeared, but maybe things wouldn't have been so violent if they didn't overhear the horrible pun."
  },
  {
   "score": 38,
   "id": "dh84n83",
   "pid": "t3_69lja0",
   "date": "2017-05-06 17:14:22",
   "depth": 0,
   "text": "Girls : Kyaaa!!! Girls night!!!\n\nGuys : So...a guys night? Yeah... but not my place. My house is gone."
  },
  {
   "score": 2,
   "id": "dh9etuy",
   "pid": "t1_dh84n83",
   "date": "2017-05-07 15:46:41",
   "depth": 1,
   "text": "> but not my place. My house is gone.\n\nLOL"
  },
  {
   "score": 44,
   "id": "dh8ixfp",
   "pid": "t1_dh84n83",
   "date": "2017-05-07 00:30:41",
   "depth": 1,
   "text": "> but not my place. My house is gone\n\n[FeelsBadMan](http://i.imgur.com/B8yUfs1.jpg)"
  },
  {
   "score": 35,
   "id": "dh7schh",
   "pid": "t3_69lja0",
   "date": "2017-05-06 12:14:10",
   "depth": 0,
   "text": "I've been wanting to see the real-world consequences for the battles since the first episode, so this episode gave me exactly what I wanted. It's a pleasant surprise to see the council come off as competent and well-meaning, and they're shown to have reasonable concerns like costs and the impact on people. They didn't specify anyone getting hurt (except, perhaps, the creator who got kidnapped) so everything must have been limited to property damage thus far.\n\n...I was actually completely able to accept that Meteora just happened to have the magic ability of sending military-grade weapons at people despite seemingly coming from a medieval-esque world but having a sensible explanation works too. Importantly, it means her battle resources are pretty limited, as she only has the machine gun with one cartridge and some hand grenades left, although the council is surely willing to replenish her stock of things that aren't 26M yen each. Anyway, the cost was said as 165M, but 6 missiles at 26M each works out to 156M. Subbing error.\n\nThere have been enough slow episodes that I should probably readjust my expectations to something slower-paced and more cerebral than the action series the premise signals. Especially with Meteora putting the focus on normal people's imaginations as opposed to the creations at the end. And all of the incentives for the heroes are to minimise the battles and their impact on people (although that means the opposite for Gunpuku's team), so only having a few battles is the best way to show they're serious about that. I like that kind of show too, as long as I know that's what I'm watching."
  },
  {
   "score": 2,
   "id": "dh7w286",
   "pid": "t1_dh7schh",
   "date": "2017-05-06 13:41:40",
   "depth": 1,
   "text": ">Importantly, it means her battle resources are pretty limited, as she only has the machine gun with one cartridge and some hand grenades left, although the council is surely willing to replenish her stock of things that aren't 26M yen each. Anyway, the cost was said as 165M, but 6 missiles at 26M each works out to 156M. Subbing error.\n\nCouldn't her author simply \"upgrade\" her abilities so she can use better magic? I mean, he's essentially \"god\". Just giver her any OP power. Make he invincible  "
  },
  {
   "score": 17,
   "id": "dh87qs1",
   "pid": "t1_dh7w286",
   "date": "2017-05-06 18:33:37",
   "depth": 2,
   "text": "Did you skip episode 3?  They covered that topic.  Not to mention they found out last episode Meteora's creator is dead.\n"
  },
  {
   "score": 19,
   "id": "dh7wbjh",
   "pid": "t1_dh7w286",
   "date": "2017-05-06 13:47:49",
   "depth": 2,
   "text": "Episode 3 had a sequence showing it's not possible, or at least not that simple, for a creator to change the creation that way. Episode 4 showed that her creator is dead. So there are two reasons that that's impossible."
  },
  {
   "score": 36,
   "id": "dh7lspf",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:43:50",
   "depth": 0,
   "text": "Oh man, Rui's introduction was great. Pretty funny interactions with the whole cast (turning down Selestia because she's too old was priceless). Actually, there were a lot of funny moments this episode, which the show seems to weave into the show pretty well. Comedy moments in anime sometimes can be far too distracting and unnecessary, though that isnt the case here. \n\nGlad the exposition dump is out of the way as well and the plot is moving forward fast. "
  },
  {
   "score": 9,
   "id": "dh89uzs",
   "pid": "t1_dh7lspf",
   "date": "2017-05-06 19:28:44",
   "depth": 1,
   "text": "After seeing how Rui & Alice-exmachina acted, thank Matsubara for writing reasonable characters like Celesia."
  },
  {
   "score": 41,
   "id": "dh7r8oo",
   "pid": "t1_dh7lspf",
   "date": "2017-05-06 11:48:09",
   "depth": 1,
   "text": "Did you see Rui eyes scan Selestia from head to toe before saying she was old.  He actually considered it. "
  },
  {
   "score": 35,
   "id": "dh7m01j",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:48:33",
   "depth": 0,
   "text": "Alright it was pretty funny watching the creators deal with an annoying defensive character that they created."
  },
  {
   "score": 12,
   "id": "dh81816",
   "pid": "t1_dh7m01j",
   "date": "2017-05-06 15:47:20",
   "depth": 1,
   "text": "It actually made me pause and think. Yeah, I'm laughing at them now, just like they probably thought it was funny in the show-within-the-show. And then I kinda felt bad a little? Damn this meta mindfuckery."
  },
  {
   "score": 23,
   "id": "dh7nrb7",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:28:37",
   "depth": 0,
   "text": "Okay but Sota. You know that girl suicided right? Or maybe it's BECAUSE she suicided that he stopped doing illustrations or whatnot. TELL US SOTA. TELL US EVERYTHING! IN THE NEXT EPISODE! ^Of ^Dragon ^Ball ^Z!"
  },
  {
   "score": 2,
   "id": "dh89wl0",
   "pid": "t1_dh7nrb7",
   "date": "2017-05-06 19:29:57",
   "depth": 1,
   "text": "They fight for 5 minutes."
  },
  {
   "score": 79,
   "id": "dh7mr7c",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:05:59",
   "depth": 0,
   "text": "REDDIT WE HAVE GOT A GOOD ONE ON OUR HANDS!\n\nThe government got involved! They creations were given human rights and residency status! We have as much realism as possible!\n\nAnd to my knowledge, there are almost no plot holes at the moment, every hole that has been made has been filled with each episode. \n\nI'm so glad to watch this every week, it's really turning out to be a treat."
  },
  {
   "score": 1,
   "id": "dh8rzlp",
   "pid": "t1_dh7mr7c",
   "date": "2017-05-07 07:20:47",
   "depth": 1,
   "text": "I hope we get the moment when government decides to steal creations's technology "
  },
  {
   "score": 5,
   "id": "dh8iswj",
   "pid": "t1_dh7mr7c",
   "date": "2017-05-07 00:24:49",
   "depth": 1,
   "text": "> every hole that has been made has been filled \n\n[Too easy.](http://i0.kym-cdn.com/photos/images/original/000/829/841/5e0.gif)"
  },
  {
   "score": 31,
   "id": "dh7utv5",
   "pid": "t1_dh7mr7c",
   "date": "2017-05-06 13:12:33",
   "depth": 1,
   "text": "I think the only hole that bothers me atm, assuming I haven't missed an explanation, is Meteora's theory seems a little farfetched atm. ie. She came up with something very detailed with very little info, and it sorta felt like a jump too big.\n\n...but maybe Military Girl said something she could base her theory on, unsure.\n\nEDIT: Replies have helped convince me that it's k. Thanks guys!"
  },
  {
   "score": 1,
   "id": "dhcmwmi",
   "pid": "t1_dh7utv5",
   "date": "2017-05-09 16:05:13",
   "depth": 2,
   "text": "The glitches that happened when creations entered the world, I saw it happening to the moon in the OP. Metora already saw that, so it was possible that parts of her theory comes from that phenomenon. \n \nAlso there is still those magnetic fields and radio interference mentioned by the government and her talks with Hime. "
  },
  {
   "score": 2,
   "id": "dh90v8j",
   "pid": "t1_dh7utv5",
   "date": "2017-05-07 10:51:56",
   "depth": 2,
   "text": "I mean she is a wizard that used to guard a magical library. "
  },
  {
   "score": 9,
   "id": "dh8f7vw",
   "pid": "t1_dh7utv5",
   "date": "2017-05-06 22:00:55",
   "depth": 2,
   "text": "I'd say that the leaps of logic are probably part of her character.  It's entirely possible that her entire theory is just wrong, but it's enough to give people a good idea of what *could* be at stake. The basic idea of \"Military girl is up to something big from the way she was talking, we need to stop the flow of more characters entering this world and do some damage control while we figure stuff out\" is pretty sound at this point. Her theory gives more credence to what she believes is the best course of action, whether it's true or not.  \n\nAssuming it's not explicitly true, it kind of reminds me of the way Majora's Mask framed the 3 day timer before you realized the moon was gonna destroy everything: the happy mask man was \"leaving\" in 3 days. It's enough to get you moving while you're still learning the real motivation. As an RPG character, she might have had something similar in her game(which she literally just played before coming up with the theory) to give her an idea like that."
  },
  {
   "score": 14,
   "id": "dh8cjvd",
   "pid": "t1_dh7utv5",
   "date": "2017-05-06 20:39:46",
   "depth": 2,
   "text": "Early on in the 2nd episode, Meteora shows that she can gather a lot of information about the world with her magic. Her character setting is no doubt also someone that is able to correctly predict things from minimal amounts of information.\n\nI do agree that Meteora has made a few leaps in logic, but I've found it acceptable thus far, especially when the series does amazing things like including the government in the story. The government being conveniently left out is such a common setting in any story that seeing them actively identify & act upon the situation is refreshing by default."
  },
  {
   "score": 30,
   "id": "dh7woj3",
   "pid": "t1_dh7utv5",
   "date": "2017-05-06 13:56:28",
   "depth": 2,
   "text": "I think that's what most believe how she got to that conclusion. They had a talk, and meteora even had the time to steal supplies before stopping the hime-selesia fight."
  },
  {
   "score": 1,
   "id": "dh90omc",
   "pid": "t1_dh7woj3",
   "date": "2017-05-07 10:47:50",
   "depth": 3,
   "text": "I wish they conveyed that better, though. As it is, it seems like she's just randomly pulling the theory out of thin air, with nothing to back it up.\n\nI'm​ enjoying​ the show so far, but it needs to learn to \"show, don't tell\" for some bits of it. Dialogue heavy exposition isn't necessarily *bad*, but the way they handled that \"world is being threatened\" explanation was done pretty badly, with lots of leaps of logic being dumped at viewers."
  },
  {
   "score": 68,
   "id": "dh7ohmg",
   "pid": "t1_dh7mr7c",
   "date": "2017-05-06 10:45:08",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 41,
   "id": "dh7zew6",
   "pid": "t1_dh7ohmg",
   "date": "2017-05-06 15:02:38",
   "depth": 2,
   "text": "They're all just collectively hiding their past otaku lives by trying to play it cool. "
  },
  {
   "score": 105,
   "id": "dh7l3nu",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:27:54",
   "depth": 0,
   "text": "I caught up with this show this week and I think it's unfortunate it airs so close to Attack on Titan, I think it really takes the attention away from it. [Anyway, now I watch it so that's one more person](http://i.imgur.com/pqMDcje.png)\n\nHow to verbally murder an author/artist:\n\n\"You seen my [show?](http://i.imgur.com/ayEeXRq.png)\"\n\n\"Well... [No](http://i.imgur.com/G7MIU7B.png)\"\n\n~~Shinji~~ is whiny as always and it seems a lolicon too... [Me_irl (except I'm not a cute anime girl)](http://i.imgur.com/Ue5JwfD.png). \n\nTo be honest, yes [Celestia](http://i.imgur.com/aHq6wSZ.png) you are great, but also you ended up in in the same world with [Me](http://i.imgur.com/eGg3aQD.png)-[te](http://i.imgur.com/SoPluZO.png)-[ora](http://i.imgur.com/7dqUXl2.jpg)\n\nShe's really great, IMO\n\n[](#headpat)"
  },
  {
   "score": 3,
   "id": "dh8liu5",
   "pid": "t1_dh7l3nu",
   "date": "2017-05-07 02:44:07",
   "depth": 1,
   "text": "The Dio one is better when you realize his link is [](/s \"the -ORA!\")"
  },
  {
   "score": 21,
   "id": "dh7voyf",
   "pid": "t1_dh7l3nu",
   "date": "2017-05-06 13:32:56",
   "depth": 1,
   "text": "I don't have the chance to stream this legally, but from what I've read in this thread it's not SnK that steals it's attention but Amazon Strike being horrible :/"
  },
  {
   "score": 14,
   "id": "dh7w7dw",
   "pid": "t1_dh7voyf",
   "date": "2017-05-06 13:45:06",
   "depth": 2,
   "text": "Neither do I, because of where I live. I'd say it's a combination of a lot of things. Saturday is really hectic with Boku no Hero Academia and Eromanga also being out can't be helping much, either. Furthermore, it doesn't have an established fanbase as it is original story.\n\nAmazon Strike is absolutely horrible from what I heard and I think Grimoire of Zero suffers from the same issue. I wish the streaming options were better, especially in mainland Europe.\n\n Whatever it really is, it's a shame."
  },
  {
   "score": 2,
   "id": "dhajv7z",
   "pid": "t1_dh7w7dw",
   "date": "2017-05-08 10:48:32",
   "depth": 3,
   "text": "Maybe a late comment, but you should be able to see it on Primevideo.com in Europe - though if 1 show is worth the (low!) price is up to you (Saekano S2 and Rage of Bahamut is also there).\n\n(Or I just read your comment wrong and you already know of it...)"
  },
  {
   "score": 2,
   "id": "dhakqql",
   "pid": "t1_dhajv7z",
   "date": "2017-05-08 11:04:32",
   "depth": 4,
   "text": "Oh wow, I'm a world-class idiot, I completely forgot that I actually do have amazon Prime! The quality and the player are subpar, but at least I can watch it legally, along with some other shows.\n\nThank you **so** much! :D"
  },
  {
   "score": 1,
   "id": "dhakyg2",
   "pid": "t1_dhakqql",
   "date": "2017-05-08 11:08:36",
   "depth": 5,
   "text": "Heh, no problem :)\n\nI like the player better than crunchyroll tho, no flash bullshit, and my tv has an app for it :)"
  },
  {
   "score": 1,
   "id": "dhalwex",
   "pid": "t1_dhakyg2",
   "date": "2017-05-08 11:26:22",
   "depth": 6,
   "text": "You are correct. I'm probably just a bit *too* used to using VLC ;)"
  },
  {
   "score": 6,
   "id": "dh8kpnk",
   "pid": "t1_dh7w7dw",
   "date": "2017-05-07 02:00:49",
   "depth": 3,
   "text": "Same, half of  the series that I'm watching this season don't have legal steaming on my country."
  },
  {
   "score": 44,
   "id": "dh7sts5",
   "pid": "t1_dh7l3nu",
   "date": "2017-05-06 12:25:24",
   "depth": 1,
   "text": "Been a while since Dio got me by surprise."
  },
  {
   "score": 52,
   "id": "dh7n5ao",
   "pid": "t1_dh7l3nu",
   "date": "2017-05-06 10:14:52",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 5,
   "id": "dh8ho5e",
   "pid": "t1_dh7n5ao",
   "date": "2017-05-06 23:34:58",
   "depth": 2,
   "text": "tfw Meteora explain how Za Warudo works"
  },
  {
   "score": 60,
   "id": "dh7hfb6",
   "pid": "t3_69lja0",
   "date": "2017-05-06 07:59:05",
   "depth": 0,
   "text": "Meteora just keeps on stealing scenes in this anime.  Just completely shutdown the mangaka from giving the trap character misinformation.    Just seems to appoint herself de facto spokesman for the group and no one questions it.  The brief battle with JSDF gave her some really cool action sequences.\n\nThe revelation that she stole all of those missiles was hilarious.  Though it appears [Meteora regrets nothing]( http://imgur.com/a/pMzHm)  It’s a really cool ‘actions have consequences’ sequence with the Japan officials.  I liked the conversation with the man about how dangerous coverups were to the general public.  I can totally see Meteora raising the ranks of the JSDF as a commander.\n\nFinally the ending scene on the train with all the girls getting excited about a girls night out.  \n\n\n[](#concealedexcitement)\n\n\nI want to see that.  Don’t show me the boring guys night out.  Even they know it would suck. \n"
  },
  {
   "score": 14,
   "id": "dh7il4j",
   "pid": "t1_dh7hfb6",
   "date": "2017-05-06 08:28:22",
   "depth": 1,
   "text": "Don't forget her losing her composure for a second when telling Rui to stop his robot. That was fun too."
  },
  {
   "score": 39,
   "id": "dh7o34r",
   "pid": "t1_dh7hfb6",
   "date": "2017-05-06 10:35:58",
   "depth": 1,
   "text": "[Best](https://i.imgur.com/hxk7z1I.jpg) [girl.](https://i.imgur.com/6fI6YA7.jpg)\n\nEveryone having a girls / guys night, meanwhile Souta is searching for information about anime and LNs on the internet. /r/anime_irl "
  },
  {
   "score": 3,
   "id": "dh80bn7",
   "pid": "t1_dh7o34r",
   "date": "2017-05-06 15:25:06",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 4,
   "id": "dh81ll2",
   "pid": "t1_dh80bn7",
   "date": "2017-05-06 15:57:04",
   "depth": 3,
   "text": "Yes"
  },
  {
   "score": 18,
   "id": "dh7pe33",
   "pid": "t1_dh7o34r",
   "date": "2017-05-06 11:05:30",
   "depth": 2,
   "text": "But he gets to mask it as trying to save the world.\n\n\n[Whats my excuse](#imdone)\n\n\nI'll never make my anime knowledge real-world relevant"
  },
  {
   "score": 47,
   "id": "dh7l2iu",
   "pid": "t1_dh7hfb6",
   "date": "2017-05-06 09:27:08",
   "depth": 1,
   "text": "[Madoka Magica Spoilers](/s \"Reminds me of Homura stealing weapons from the military.\")"
  },
  {
   "score": 29,
   "id": "dh7ln8m",
   "pid": "t1_dh7l2iu",
   "date": "2017-05-06 09:40:19",
   "depth": 2,
   "text": "Oh man, i remember this very well.\n\nAnd remember the news where military equipments actually went missing during the airing of said episode?"
  },
  {
   "score": 6,
   "id": "dh7q7i5",
   "pid": "t1_dh7ln8m",
   "date": "2017-05-06 11:24:23",
   "depth": 3,
   "text": "Really? I don't know that...source?"
  },
  {
   "score": 10,
   "id": "dh8coqt",
   "pid": "t1_dh7q7i5",
   "date": "2017-05-06 20:43:38",
   "depth": 4,
   "text": "[Link to the original report](https://ja.wikipedia.org/wiki/%E7%8E%96%E7%8F%A0%E9%A7%90%E5%B1%AF%E5%9C%B0%E6%AD%A6%E5%99%A8%E4%BA%A1%E5%A4%B1%E4%BA%8B%E4%BB%B6)\n\n[Link to an article that translated the rumour] (http://extrovertedotaku.blogspot.com/2011/04/akemi-homuras-weapon-gallery.html)\n\nhalfchan had a lot of fun digging this up."
  },
  {
   "score": 64,
   "id": "dh7j4r9",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:41:45",
   "depth": 0,
   "text": "[me when Meteora explains the world](http://i.imgur.com/cI9Mlzp.png)\n\n[I guess he does look like Aqua, even his VA is the same as her (Sora Amamiya)](http://i.imgur.com/IznGYdu.png)\n\n[Get in the fucking mech Shinj... oops wrong anime](http://i.imgur.com/cK2YC9d.png)\n\n[Kanoya, can know yah, nice pun Meteora](http://i.imgur.com/amqOkpR.png)\n\n[tfw you stole 6 missiles worth +150 million yen and blow up an entire park](http://i.imgur.com/DFXsEfs.png)\n\n[nice reply for someone who doesn't even want to fight there](http://i.imgur.com/sO67Jm0.png)"
  },
  {
   "score": 2,
   "id": "dh7pl9c",
   "pid": "t1_dh7j4r9",
   "date": "2017-05-06 11:10:10",
   "depth": 1,
   "text": "I don't feel like any of Meteora's explanations explained anything. I have this little voice in the back of my head demanding I make sense of any fictional logic/technobabble I encounter, and after going over her scenes several time I can't even. "
  },
  {
   "score": 10,
   "id": "dh80rgl",
   "pid": "t1_dh7pl9c",
   "date": "2017-05-06 15:35:42",
   "depth": 2,
   "text": "Creations being brought into reality bends the laws of physics/nature. The more that the Creations are recognized as bending the laws of nature, the worse it becomes. It can become so bad that the world \"breaks\" and is forced to hard reset itself in order to continue any means of existence."
  },
  {
   "score": 15,
   "id": "dh7u4n3",
   "pid": "t1_dh7j4r9",
   "date": "2017-05-06 12:55:48",
   "depth": 1,
   "text": "kudos to the translators as well, pun translating is a pain"
  },
  {
   "score": 4,
   "id": "dh83q52",
   "pid": "t1_dh7u4n3",
   "date": "2017-05-06 16:51:14",
   "depth": 2,
   "text": "But was it a pun in the original I don't know how that would have worked. "
  },
  {
   "score": 8,
   "id": "dh87iqd",
   "pid": "t1_dh83q52",
   "date": "2017-05-06 18:27:55",
   "depth": 3,
   "text": "I think it was that pun based on the spoken words as well. There wasn't much effort needed for the translators...save being able to actually catch the barely English phrase inside it.\n\nit was something like:\n\n>Dojikko motta Kanoya, \"can know ya\" nai.\n\n...I don't really study Japanese so I'm not even sure if I typed out the words correctly, I'm just winging it by ear.\n\nedit:\n\nchanged \"no\" to \"know\" to fit the context better"
  },
  {
   "score": 21,
   "id": "dh7of4e",
   "pid": "t1_dh7j4r9",
   "date": "2017-05-06 10:43:33",
   "depth": 1,
   "text": "She probably got a lot of practice from Aqua."
  },
  {
   "score": 38,
   "id": "dh7jjji",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:51:18",
   "depth": 0,
   "text": "[Just like Shinji, it looks like Rui doesn't want to get in the robot!](http://imgur.com/a/IN31R)\n\nAnyway this episode just basically answered the burning question at the back of my mind. \"Why aren't the authorities doing anything?\" Like the attacks have been large scale and pretty obvious so I was kinda disturbed that there was no reaction from the authorities but in fact they were being observed all this time.\n\nLove the explanation on why Meteora was seen using modern weapons in episode 1. She doesn't know how to use offensive spells so she had to borrow weapons from the JSDF. Her reaction while the amount of each weapon was just golden. Meteora just continues to steal this show <3\n\nNow with their group has been legitimately recognized as the \"good guys\" by the government I'm curious to see what will be Military Princess' answer to all of this."
  },
  {
   "score": 2,
   "id": "dh7vvw7",
   "pid": "t1_dh7jjji",
   "date": "2017-05-06 13:37:25",
   "depth": 1,
   "text": ">Love the explanation on why Meteora was seen using modern weapons in episode 1. She doesn't know how to use offensive spells so she had to borrow weapons from the JSDF.\n\nI wonder if Meteroa would beat Lelei in a  magic fight."
  },
  {
   "score": 6,
   "id": "dh7mt8v",
   "pid": "t1_dh7jjji",
   "date": "2017-05-06 10:07:17",
   "depth": 1,
   "text": "> Just like ~~Shinji~~ almost any real robot MC\n\nFTFY"
  },
  {
   "score": 25,
   "id": "dh7kc3c",
   "pid": "t1_dh7jjji",
   "date": "2017-05-06 09:09:59",
   "depth": 1,
   "text": "> \"Why aren't the authorities doing anything?\" Like the attacks have been large scale\n\nAnd here I thought we might have some police corps and military grade slobs like the ones in the Fuuka riot during their Live performance.\n\nReally nice detail of the writters to actually think outside the box in a more natural and sensible way.\n\n>Love the explanation on why Meteora was seen using modern weapons in episode 1. She doesn't know how to use offensive spells so she had to borrow weapons from the JSDF. Her reaction while the amount of each weapon was just golden. Meteora just continues to steal this show <3\n\nYeah, Meteora is the one carrying the whole group as a leader. I like her whole design, she's not your usual deadpan monotone heroine. She feels a lot more balanced; she's very logical and sensible when it comes to planning and acting on the fly, but she also looks like a girl that can let her hair down and have a good time around Selesia & Marine.\n\nSpeaking of designs, Rui Kanoya was also pretty well rounded, a bit defensive & shy, but can also suffer from outbursts and turn into typical shounen pilot. Oh boy, poor Selesia got rejected by a younger boy when she was just trying to calm him down. Speaking of Selesia, it's really great that her creator doesn't think of her as an object or a product of his own creation, but she's recognized as a human being along with all the other creations popping up in this world."
  },
  {
   "score": 2,
   "id": "dhbgkif",
   "pid": "t1_dh7kc3c",
   "date": "2017-05-08 22:32:15",
   "depth": 2,
   "text": "On the other hand, I feel Selesia (or Celestia?) is way too predictable. Her personality and appearance design is boring. Her fighting ability could've been better. Damn, why did they leave her mecha behind? Now she just feels like another Asuna to me."
  },
  {
   "score": 13,
   "id": "dh7kwqa",
   "pid": "t1_dh7kc3c",
   "date": "2017-05-06 09:23:29",
   "depth": 2,
   "text": "[comment face when?](http://puu.sh/vHygX/f52515d39c.jpg) "
  },
  {
   "score": 3,
   "id": "dh7mumm",
   "pid": "t1_dh7kwqa",
   "date": "2017-05-06 10:08:10",
   "depth": 3,
   "text": "This is too good. Needs to be added."
  },
  {
   "score": 13,
   "id": "dh7jzb1",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:01:41",
   "depth": 0,
   "text": "soo can anybody explain the last part to me ? didt quite get that."
  },
  {
   "score": 11,
   "id": "dh7khls",
   "pid": "t1_dh7jzb1",
   "date": "2017-05-06 09:13:37",
   "depth": 1,
   "text": "That girl was in a one-off fan production. I called Black Rock Shooter - now I think she's an Asagi expy, jealous that her story became vaporware. :S "
  },
  {
   "score": 36,
   "id": "dh7kp7p",
   "pid": "t1_dh7jzb1",
   "date": "2017-05-06 09:18:37",
   "depth": 1,
   "text": "Simply put: the princess is the creation of the girl who commit suicide in the first episode, and most probably Sota was the one who illustrate her"
  },
  {
   "score": 4,
   "id": "dh7nmj8",
   "pid": "t1_dh7kp7p",
   "date": "2017-05-06 10:25:39",
   "depth": 2,
   "text": "So he did her character design but ended up forgetting about it? What?"
  },
  {
   "score": 9,
   "id": "dh7plrd",
   "pid": "t1_dh7nmj8",
   "date": "2017-05-06 11:10:29",
   "depth": 3,
   "text": "Looks like Souta worked with the creator, maybe did the original character design, but the design was later heavily altered such that Souta didn't initially recognize MUP."
  },
  {
   "score": 15,
   "id": "dh7o7vb",
   "pid": "t1_dh7nmj8",
   "date": "2017-05-06 10:39:00",
   "depth": 3,
   "text": "I think the girl in the beginning was probably a close friend of his. One of the messages said \"This would be the last one\" implying she wrote the story before her suicide, I suspect that the Sota illustrated it for her, but the reason he forgot may be due to some sort of traumatic suppression, due to her suicide soon after. (idk if that's even possible, I'm not a psychologist.)"
  },
  {
   "score": 18,
   "id": "dh7npzw",
   "pid": "t1_dh7kp7p",
   "date": "2017-05-06 10:27:47",
   "depth": 2,
   "text": "I don't think he was the one who illustrates her, because he seemed surprised to see that she had a graphical design. But he probably did take part in the project either professionally or by supporting the creator."
  },
  {
   "score": 32,
   "id": "dh7ory6",
   "pid": "t1_dh7npzw",
   "date": "2017-05-06 10:51:36",
   "depth": 3,
   "text": "i actually think sota illustrated her (he remembered her from somewhere + they showed her without equipment and with equipment), but the equipment like the uniform and saber were added later by the author or someone else. \n"
  },
  {
   "score": 12,
   "id": "dh7peif",
   "pid": "t1_dh7ory6",
   "date": "2017-05-06 11:05:47",
   "depth": 4,
   "text": "That would make sense. There were also online comments (not in real life but in the show) that were asking where her saber came from, too.  "
  },
  {
   "score": 75,
   "id": "dh7k7qw",
   "pid": "t1_dh7jzb1",
   "date": "2017-05-06 09:07:10",
   "depth": 1,
   "text": "It appears the the girl that killed herself in the first episode had some connection with Souta.  Looks to me like they had some sort of collaborative project in which the uniform villian girl was a character in.  So Souta 'discovered' who she was and will explain next episode"
  },
  {
   "score": 1,
   "id": "dh9kxn9",
   "pid": "t1_dh7k7qw",
   "date": "2017-05-07 18:08:40",
   "depth": 2,
   "text": "How did Sota not recognize her right off the bat though"
  },
  {
   "score": 20,
   "id": "dh7l1v1",
   "pid": "t1_dh7k7qw",
   "date": "2017-05-06 09:26:42",
   "depth": 2,
   "text": "wait when did a girl kill herself in the first ep?"
  },
  {
   "score": 72,
   "id": "dh7l6uf",
   "pid": "t1_dh7l1v1",
   "date": "2017-05-06 09:29:56",
   "depth": 3,
   "text": "In the opening scene, girl jumped in front of a train. And then never referenced again until just now."
  },
  {
   "score": 54,
   "id": "dh7njs1",
   "pid": "t1_dh7l6uf",
   "date": "2017-05-06 10:23:56",
   "depth": 4,
   "text": "oh. totally forgot about that\n\n[](#nyanpasu)\n"
  },
  {
   "score": 21,
   "id": "dh7ubx8",
   "pid": "t1_dh7njs1",
   "date": "2017-05-06 13:00:39",
   "depth": 5,
   "text": "To be fair she was mentioned by Hime by the end of the 3rd episode, that's when we actually learned what her name was, Setsuna."
  },
  {
   "score": 18,
   "id": "dh7l7d5",
   "pid": "t1_dh7k7qw",
   "date": "2017-05-06 09:30:15",
   "depth": 2,
   "text": "Man, I figured from the earlier episodes that Princess must have been created by Souta, but in the future, which would explain her interest in him and his lack of knowledge of her. I didn't expect a connection to the first scene, though."
  },
  {
   "score": 13,
   "id": "dh7uy3j",
   "pid": "t3_69lja0",
   "date": "2017-05-06 13:15:28",
   "depth": 0,
   "text": "with every episode and every new anime archetype they introduce, I like this show more and more. there's a certain sharpness to the writing that gives each character - even the ones who are intentionally flat - a lot of depth. If not for Kado, I'd say this is the smartes show of the season."
  },
  {
   "score": 1,
   "id": "dhiy72u",
   "pid": "t1_dh7uy3j",
   "date": "2017-05-13 17:24:39",
   "depth": 1,
   "text": "I have a thing for crossovers and stories that go meta into the issues with the creative process, so I was on board the moment I read that this show existed - I'm liking it so far, but I worry every time I see people complaining that it's mostly people talking. At least the early episodes, and at least episode 6 should help appease that public.\n\nSomething like Meteora in episode 4 talking about her experience and thoughts about having played her own game felt pretty heartfelt (and emotionally striking, to an extent - I keep worrying about the characters and stories from an online I like, Final Fantasy XI, not having the luxury of single-player eternity to stick around) - so something like that getting dismissed as \"too much talking\" worries me as far as the show's public perception goes.\n\nHopefully 22 episodes should have plenty of room for interesting ideas, character moments, and sword-rifle violin action to satisfy everyone."
  },
  {
   "score": 4,
   "id": "dhjeeda",
   "pid": "t1_dhiy72u",
   "date": "2017-05-14 02:46:21",
   "depth": 2,
   "text": "The people complaining about the conversations seem to forget about Ghost in the Shell SAC, and FMA, and EVA. These are all-time classics that are FULL of slow, talky parts. Those are what give meaning to the crazy, bombastic action sequences.\n\nThe people demanding all action, all the time just don't get it.\n\nI'm gonna try to help them get it with an upcoming video though, so stay tuned for that."
  },
  {
   "score": 1,
   "id": "dhjm11t",
   "pid": "t1_dhjeeda",
   "date": "2017-05-14 07:46:03",
   "depth": 3,
   "text": "Nice! I generally like your videos, but I wasn't expecting the show's OP to get particular focus, since it spreads itself thing flashing each character's original setting, the real world, those characters existing in it and hints at the overarching story.\n\nSo, it's nice to get some hope if it being highlighted for other merits. I ended up watching Rakugo based on your videos BTW."
  },
  {
   "score": 5,
   "id": "dhju59e",
   "pid": "t1_dhjm11t",
   "date": "2017-05-14 10:56:57",
   "depth": 4,
   "text": "it's more of a video essay about how I think it could be the next all-time anime classic."
  },
  {
   "score": 1,
   "id": "dhk21hu",
   "pid": "t1_dhju59e",
   "date": "2017-05-14 13:47:44",
   "depth": 5,
   "text": "Seems a bit early for such a claim, but I'm looking forward to see the reasoning for that."
  },
  {
   "score": 12,
   "id": "dh7n5wj",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:15:15",
   "depth": 0,
   "text": "Nice to see the government actually being rational and competent in this kind of show rather than overreacting. "
  },
  {
   "score": 12,
   "id": "dh7l1cz",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:26:21",
   "depth": 0,
   "text": "༼ つ ◕_◕ ༽つ HYPE ༼ つ ◕_◕ ༽つ"
  },
  {
   "score": 11,
   "id": "dh7qgjz",
   "pid": "t3_69lja0",
   "date": "2017-05-06 11:30:14",
   "depth": 0,
   "text": "The last scene just gave me goosebumps.... love the music and sequences when sota started to remember MUP.\n\nGood thing though, Gundam is copyrighted, if not. They could have been also in this world. Firing at each othr or dropping colonies.\n\ncan't wait for nxt ep."
  },
  {
   "score": 2,
   "id": "dh90y5s",
   "pid": "t1_dh7qgjz",
   "date": "2017-05-07 10:53:47",
   "depth": 1,
   "text": "I think the creators for this wanted to put in MCs from other real anime, but the authors couldn't ever agree with who's creation would win in a fight so they had to make up new anime characters. \n"
  },
  {
   "score": 6,
   "id": "dh8gg2l",
   "pid": "t1_dh7qgjz",
   "date": "2017-05-06 22:45:13",
   "depth": 1,
   "text": "*something something Aldnoah.Zero*"
  },
  {
   "score": 18,
   "id": "dh7obin",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:41:15",
   "depth": 0,
   "text": "Meteora is just so bae."
  },
  {
   "score": 16,
   "id": "dh7oyl1",
   "pid": "t1_dh7obin",
   "date": "2017-05-06 10:55:43",
   "depth": 1,
   "text": "[Agreed](http://i.imgur.com/pqMDcje.png)"
  },
  {
   "score": 8,
   "id": "dh7oyj9",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:55:41",
   "depth": 0,
   "text": "OK, this was significantly better than last week. Looks like they're getting exposition out of the way as soon as possible. Still nothing as great as the \"there's usually no blood\" moment, though.\n\nI like to think of mech-pilot's spastic tantrums as a flaw in his *writing* that the rest of the team has to deal with now.\n\nI'd love to see them play around with the rules/mechanics a bit and explore the consequences of the characters being *fictional*, all of them coming from different universes with different laws. Something like a 'clash of ideals', Fate/Zero style. Mamika failing to redemption-talk Selesia was a brilliant example of this.\n\nAlso it'd be great if the creators could actually figure out how to successfully rewrite characters and influence battles in future episodes. Would be way more interesting to watch than usage of simple brute force."
  },
  {
   "score": 10,
   "id": "dh7pkn7",
   "pid": "t3_69lja0",
   "date": "2017-05-06 11:09:47",
   "depth": 0,
   "text": "So her name is Saber and from a viral video called Altairs world etude. So its not limited to anime, manga or LN but all sources of fiction. So technically original characters from tv shows and movies could spawn too."
  },
  {
   "score": 1,
   "id": "dh9cb5m",
   "pid": "t1_dh7pkn7",
   "date": "2017-05-07 14:51:25",
   "depth": 1,
   "text": "That prolly means, Megumin and Kaori-tan exits!!!"
  },
  {
   "score": 7,
   "id": "dh82b0u",
   "pid": "t1_dh7pkn7",
   "date": "2017-05-06 16:15:41",
   "depth": 1,
   "text": "I think it's an amazing statement - that anyone can be a creator - if their creation can become established in the collective consciousness."
  },
  {
   "score": 8,
   "id": "dh7wyui",
   "pid": "t3_69lja0",
   "date": "2017-05-06 14:03:13",
   "depth": 0,
   "text": "The government stepped in finally it seems. Guess it was only a matter of time. Nice to see them being on the same side with Meteora though. \n\nWonder how the interaction between Sota and the Military Uniform Princess will go though since he has an idea as to who created her.\nDiscussion on the [subreddit](https://www.reddit.com/r/ReCreators/)"
  },
  {
   "score": 31,
   "id": "dh7mguv",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:59:19",
   "depth": 0,
   "text": "OK guys I would fuck the shit out of that OL giving the briefing. She is fine as hell."
  },
  {
   "score": 4,
   "id": "dh7qcd5",
   "pid": "t1_dh7mguv",
   "date": "2017-05-06 11:27:34",
   "depth": 1,
   "text": "Like anyone on this sub could get laid, and even if they did they wouldn't last 30 seconds with a 5/10 let alone a 10/10.\n\nedit: This may be just me, can anyone else confirm my suspicions?"
  },
  {
   "score": 9,
   "id": "dh7vu4w",
   "pid": "t1_dh7qcd5",
   "date": "2017-05-06 13:36:18",
   "depth": 2,
   "text": "Let's verify, back in 35 seconds"
  },
  {
   "score": 5,
   "id": "dh7zkmg",
   "pid": "t1_dh7vu4w",
   "date": "2017-05-06 15:06:34",
   "depth": 3,
   "text": "It's been an hour, did you get results?"
  },
  {
   "score": 5,
   "id": "dh7zq3q",
   "pid": "t1_dh7zkmg",
   "date": "2017-05-06 15:10:22",
   "depth": 4,
   "text": "He could've gotten results before the edit asterisk is applied. "
  },
  {
   "score": 5,
   "id": "dh7zumb",
   "pid": "t1_dh7zq3q",
   "date": "2017-05-06 15:13:32",
   "depth": 5,
   "text": "I could indeed reach up to 2 minutes\n\nAs in, split in 20 seconds intervals"
  },
  {
   "score": 4,
   "id": "dh828cw",
   "pid": "t1_dh7zumb",
   "date": "2017-05-06 16:13:44",
   "depth": 6,
   "text": "Longer than me my man."
  },
  {
   "score": 2,
   "id": "dh87u37",
   "pid": "t1_dh7mguv",
   "date": "2017-05-06 18:35:59",
   "depth": 1,
   "text": "what the fuck is an OL"
  },
  {
   "score": 5,
   "id": "dh8hgr2",
   "pid": "t1_dh87u37",
   "date": "2017-05-06 23:26:21",
   "depth": 2,
   "text": "office lady"
  },
  {
   "score": 6,
   "id": "dh7mzkh",
   "pid": "t1_dh7mguv",
   "date": "2017-05-06 10:11:15",
   "depth": 1,
   "text": "LOL"
  },
  {
   "score": 14,
   "id": "dh7r361",
   "pid": "t1_dh7mguv",
   "date": "2017-05-06 11:44:36",
   "depth": 1,
   "text": "[](#emptyinside)"
  },
  {
   "score": 5,
   "id": "dh7zqxv",
   "pid": "t1_dh7r361",
   "date": "2017-05-06 15:10:56",
   "depth": 2,
   "text": "There may be some debate but I'd say this is the best new comment face we've gotten. "
  },
  {
   "score": 7,
   "id": "dh84k3s",
   "pid": "t1_dh7zqxv",
   "date": "2017-05-06 17:12:09",
   "depth": 3,
   "text": "Have you not seen [](#doggo)?"
  },
  {
   "score": 18,
   "id": "dh7oifg",
   "pid": "t1_dh7mguv",
   "date": "2017-05-06 10:45:38",
   "depth": 1,
   "text": "He's just saying what we've all been thinking"
  },
  {
   "score": 26,
   "id": "dh7nk1f",
   "pid": "t1_dh7mguv",
   "date": "2017-05-06 10:24:06",
   "depth": 1,
   "text": "Sure, but she's up against a trap mecha pilot, a hot redhead mecha pilot with a sword, and a cute silver-haired magician..."
  },
  {
   "score": 7,
   "id": "dh7znx1",
   "pid": "t1_dh7nk1f",
   "date": "2017-05-06 15:08:51",
   "depth": 2,
   "text": "I'd say she's tied in 2nd with Selesia, frankly it's unfair that she's in the same show as Meteora. "
  },
  {
   "score": 52,
   "id": "dh7np68",
   "pid": "t1_dh7mguv",
   "date": "2017-05-06 10:27:16",
   "depth": 1,
   "text": "[oh dear](#emiliaohdear)\n\n"
  },
  {
   "score": 16,
   "id": "dh7q74u",
   "pid": "t3_69lja0",
   "date": "2017-05-06 11:24:09",
   "depth": 0,
   "text": "**NO! NONONONONONONOOOOOOO!**\n\n###DON'T DO THIS! DON'T!\n\n##**YOU FUCKERSSSSSSSSSS! YOU JUST CAN'T GIVE ME THE SO AWAITED SCENES I'VE BEEN CRAVING FOR, AND END IT THEREEEEEE!!!!!!!!!!** \n\nWay to keep my Hype high as fuck. And here I was beginning to cool down. (costantly a 10/10 in my MAL).\n\nEdit: Typo. I will also make a more detailed description of my feelings later. As I have to calm down or else I won't be write in human anymore.\n\n**EDIT 2: [Here's my full thoughts](https://animemangalnvn.wordpress.com/2017/05/07/regarding-recreators-episode-5-you-fuckerssssss/)**, a masterpiece (for me).\n"
  },
  {
   "score": 2,
   "id": "dh9zhs0",
   "pid": "t1_dh7q74u",
   "date": "2017-05-08 01:43:20",
   "depth": 1,
   "text": "I just want to point out that MUP isn't using a sword on a violin. She's using a sword on an assault rifle *like* a violin, which honestly makes even less sense."
  },
  {
   "score": 4,
   "id": "dh808nd",
   "pid": "t1_dh7q74u",
   "date": "2017-05-06 15:23:10",
   "depth": 1,
   "text": "Lol i had fun reading your blog, with a better css, it would be a nice place to read after an episode. Memes were good btw."
  },
  {
   "score": 3,
   "id": "dh80xvw",
   "pid": "t1_dh808nd",
   "date": "2017-05-06 15:40:10",
   "depth": 2,
   "text": "Many thanks for reading it! It makes me really happy to hear that!\n\nI'm still a newbie at blogging and managing a site in general, so sorry but I have no idea how I can edit/modify the CSS. \n\nThanks for the feedback!"
  },
  {
   "score": 3,
   "id": "dh84id2",
   "pid": "t1_dh80xvw",
   "date": "2017-05-06 17:10:58",
   "depth": 3,
   "text": "Well, I'm no artist, so I can't help with making your CSS look better. I would try to help, but then I have no easy way of getting the CSS to you. "
  },
  {
   "score": 3,
   "id": "dh84wc2",
   "pid": "t1_dh84id2",
   "date": "2017-05-06 17:20:51",
   "depth": 4,
   "text": "Don't worry. I don't even understand what is CSS. And, with the exception of some things called \"CSS Classes\" only for the menus, I don't really think I can change or edit it (as I have the basic blog pack).\n\nBut I can try to make it look it better with the normal admin \"customize\". Heck, to tell the truth, after the first 2 days of customizing, I actually forgot to finish and just started talking about anime... and now I have actually no time... \n\nI'm in deep trouble, as my teachers just love to make tests just before school ends... But screw that and let's follow Itami's motto. First hobby and then duty."
  },
  {
   "score": 3,
   "id": "dh83u08",
   "pid": "t1_dh80xvw",
   "date": "2017-05-06 16:53:57",
   "depth": 3,
   "text": "look for guides, there are plenty for make custom themes and stuff, ill be waiting for your next episode's review (and memes) "
  },
  {
   "score": 3,
   "id": "dh84pjy",
   "pid": "t1_dh83u08",
   "date": "2017-05-06 17:16:02",
   "depth": 4,
   "text": "I see, I'll try to look them up then. Though I think I'm actually unable to do it because I don't have a self hosting blog. Oh, well.\n\nHaha, many thanks! My usual posts are rather short, but when there I start with the series I really love, I just don't stop. \n\nNow, I only have to find the time... (it's actually around 3 AM here, and I didn't even start to study for the next week tests... Military Uniform Goddess please halp)."
  },
  {
   "score": 2,
   "id": "dh86jjd",
   "pid": "t1_dh84pjy",
   "date": "2017-05-06 18:02:56",
   "depth": 5,
   "text": "well just change the blog colors with light colors, that would fit better for read your content, and try to not aim to something complicated, in fact, the theme only takes care about the fonts and how the info is displayed, i think with a free wordpress theme and the basic tool you can do it well.\n\n[surrender @ 20](http://www.surrenderat20.net/) is a famous blog,  and if you look it, the desing is really simple/clean. i hope that this could give you some ideas. cya mate until next week.\n"
  },
  {
   "score": 2,
   "id": "dh8jcnd",
   "pid": "t1_dh86jjd",
   "date": "2017-05-07 00:51:28",
   "depth": 6,
   "text": "I see, so it would be more readable with light colours? I chose dark simply because I like them (and during night, it strains less my eyes).\n\nYeah, I'm quite satisfied (for now) about my theme. \n\nThanks for the feedback! See you next time."
  },
  {
   "score": 9,
   "id": "dh7n768",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:16:04",
   "depth": 0,
   "text": "Oh, Suicide-chan from the first episode finally has a name, wonder how everything will play out, the pacing been quite slow since episode 3 so I hope it will finally get some action."
  },
  {
   "score": 17,
   "id": "dh7rprm",
   "pid": "t1_dh7n768",
   "date": "2017-05-06 11:59:15",
   "depth": 1,
   "text": "We still have 17 episodes to go so I think the pace has been reasonable so far although I do agree probably is time to have a more action focused episode since a lot of the world and characters have already been established."
  },
  {
   "score": 11,
   "id": "dh7vozm",
   "pid": "t1_dh7rprm",
   "date": "2017-05-06 13:32:57",
   "depth": 2,
   "text": "Now that the gang are going to prevent the creations from doing bad things, I think we'll be getting some action soon enough."
  },
  {
   "score": 8,
   "id": "dh8i1pu",
   "pid": "t3_69lja0",
   "date": "2017-05-06 23:51:16",
   "depth": 0,
   "text": "Fun info from Re Creators creators:\nhttps://www.sunday-webry.com/events/re_creators_naked/interview05/\n\n- Rui's Gigas Machina was originally made to be as tall as Celestia's Vogelschevalier (17 m). The director suggested making the Gigas bigger (55 m) in order to emphasize the difference.\n(Basically the Gigas is a little shorter than the Leaning Tower of Pisa, at 56.4m.)\n\n- Hiroe says Rui is a mixture of several characters from mecha shows, including Ikari Shinji.\n\n- When discussing Celesia's character, who had some moments of comedy relief, Hiroe said he wasn't expecting her to do so when he started to write the series. In a sense, he said the character became \"three dimensional\";\n\n- Hiroe purposely wrote the government and the female officer in particular as competent because he felt it was frustrating to have people in power doing idiotic things."
  },
  {
   "score": 38,
   "id": "dh7jguk",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:49:32",
   "depth": 0,
   "text": ">Look like a girl\n\n>Sound like a girl\n\n>Calling them boy\n\nWhy is this legal?"
  },
  {
   "score": 11,
   "id": "dh7vnai",
   "pid": "t1_dh7jguk",
   "date": "2017-05-06 13:31:51",
   "depth": 1,
   "text": "Because questioning your sexuality is fun."
  },
  {
   "score": 20,
   "id": "dh7ma93",
   "pid": "t1_dh7jguk",
   "date": "2017-05-06 09:55:03",
   "depth": 1,
   "text": "reminds me of [this](https://68.media.tumblr.com/9e9092e524ab1ec11b53d2eda92d0933/tumblr_ofu57gqFlH1u55q7oo1_500.gif)"
  },
  {
   "score": 6,
   "id": "dh7pbcs",
   "pid": "t1_dh7ma93",
   "date": "2017-05-06 11:03:47",
   "depth": 2,
   "text": "https://youtu.be/AbuDApFRBlU"
  },
  {
   "score": 8,
   "id": "dh7vc8m",
   "pid": "t3_69lja0",
   "date": "2017-05-06 13:24:43",
   "depth": 0,
   "text": "I was wondering when the government would do something. You can't just have giant mechs and flying people without anyone noticing.\n\nAnd it seems Hime's creator really is the girl who killed herself at the start. It's likely she has some relationship with the MC."
  },
  {
   "score": 4,
   "id": "dh7w4z7",
   "pid": "t1_dh7vc8m",
   "date": "2017-05-06 13:43:34",
   "depth": 1,
   "text": "I was wondering when the government would do something. You can't >just have giant mechs and flying people without anyone noticing.\n\n\nA lot of anime shows have this issue. What I like about Re-cretator is that it's actually addressed and government/authorities notice/"
  },
  {
   "score": 7,
   "id": "dh7vrna",
   "pid": "t3_69lja0",
   "date": "2017-05-06 13:34:39",
   "depth": 0,
   "text": "Meteora trying to get out of the damages she caused was excellent.\n\nI called it way back,  Military Uniform girl was the creation of the girl who commited suicide in the first episode.  Now just gotta see if the second part of my prediction is true, that her death somehow gave Military Uniform girl her creator powers."
  },
  {
   "score": 3,
   "id": "dh84khc",
   "pid": "t1_dh7vrna",
   "date": "2017-05-06 17:12:25",
   "depth": 1,
   "text": "At the end.... Sorry was the only thing she could say."
  },
  {
   "score": 6,
   "id": "dh81xp9",
   "pid": "t3_69lja0",
   "date": "2017-05-06 16:05:55",
   "depth": 0,
   "text": "Everytime I finish a Re:Creators episode I feel so happy that we are getting 24 episodes."
  },
  {
   "score": 9,
   "id": "dh841aq",
   "pid": "t1_dh81xp9",
   "date": "2017-05-06 16:59:05",
   "depth": 1,
   "text": "*22"
  },
  {
   "score": 6,
   "id": "dh857sg",
   "pid": "t1_dh841aq",
   "date": "2017-05-06 17:28:52",
   "depth": 2,
   "text": "I thought it was going to be 24 :(\n\nIt still is miles better than just 12."
  },
  {
   "score": 2,
   "id": "dhbgri6",
   "pid": "t1_dh857sg",
   "date": "2017-05-08 22:39:28",
   "depth": 3,
   "text": "In my earlier \"career\" as anime watcher, I used to assume ALL animes have at least 24 episodes. 'twas such a shock when I found out some good shows had only 12 episodes."
  },
  {
   "score": 31,
   "id": "dh7jfp7",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:48:49",
   "depth": 0,
   "text": "Shinji-kun is [that](http://i.imgur.com/Ia6nV0K.jpg) [you](http://i.imgur.com/rG9NjXf.jpg)?  \n[](#shinjimug)  \nAnd that's the [moment](http://i.imgur.com/IFfrFrZ.jpg) you realise this guy is a lolicon. (maybe the author as well)  \nWe finally get to see the government point of view on the situation and I am glad, that it is done pretty well. So far this anime is really unique with the point of being realistic, when dealing with fictional characters coming to real life. And holy sht that cost and that face [reaction](http://i.imgur.com/aGC728x.jpg)!  \nSo, Souta knows smth and that's that the creator is probably the girl who suicided and he seems to know her and maybe he was even the reason she did it."
  },
  {
   "score": 2,
   "id": "dh7jugc",
   "pid": "t1_dh7jfp7",
   "date": "2017-05-06 08:58:30",
   "depth": 1,
   "text": "Not whinny enough"
  },
  {
   "score": 11,
   "id": "dh7nfgo",
   "pid": "t1_dh7jugc",
   "date": "2017-05-06 10:21:14",
   "depth": 2,
   "text": "Not fucked up enough."
  },
  {
   "score": 8,
   "id": "dh7qfle",
   "pid": "t1_dh7nfgo",
   "date": "2017-05-06 11:29:36",
   "depth": 3,
   "text": "There's still time... There's still time."
  },
  {
   "score": 4,
   "id": "dh7zxdn",
   "pid": "t1_dh7qfle",
   "date": "2017-05-06 15:15:26",
   "depth": 4,
   "text": "Plenty of hospitals around..."
  },
  {
   "score": 3,
   "id": "dh83roi",
   "pid": "t1_dh7jfp7",
   "date": "2017-05-06 16:52:19",
   "depth": 1,
   "text": "Nah. Not cute enough. Shinji can't win against a trap. "
  },
  {
   "score": 19,
   "id": "dh7k9j3",
   "pid": "t1_dh7jfp7",
   "date": "2017-05-06 09:08:20",
   "depth": 1,
   "text": "Even his parallel in another show is all like \n\n[**None of my busniess**](#shinjimug)\n\nYes it sure is your damn business, you whiny brat!"
  },
  {
   "score": 6,
   "id": "dh7m5zu",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:52:16",
   "depth": 0,
   "text": "haven't watched toady's ep. yet but,\n\nI'm liking the show so far and I love the conversations going on between the different characters. \n\nCan't wait to see what MC's role in all of this is, I have a feeling [that (speculation)](/s \"he created the military girl in the future and he gave the character a reality bending ability which helped her escape her world.\")\n\n"
  },
  {
   "score": 18,
   "id": "dh7mnul",
   "pid": "t1_dh7m5zu",
   "date": "2017-05-06 10:03:50",
   "depth": 1,
   "text": "nope, it seems like someone he knew created her. Probably the girl that commited suicide at the beginning of episode 1"
  },
  {
   "score": 6,
   "id": "dh7zf2y",
   "pid": "t3_69lja0",
   "date": "2017-05-06 15:02:46",
   "depth": 0,
   "text": "SHINJI GET IN FUCKING ROBOT!"
  },
  {
   "score": 5,
   "id": "dh7zhqy",
   "pid": "t3_69lja0",
   "date": "2017-05-06 15:04:36",
   "depth": 0,
   "text": "Finally the army comes in, was getting worried for Japan's self defense system"
  },
  {
   "score": 7,
   "id": "dh88h7o",
   "pid": "t3_69lja0",
   "date": "2017-05-06 18:52:15",
   "depth": 0,
   "text": "Missed opportunity. They should have used a character from AldNoah and their mech so that we could get even more META. Just a thought. "
  },
  {
   "score": 5,
   "id": "dh8e2r1",
   "pid": "t1_dh88h7o",
   "date": "2017-05-06 21:24:10",
   "depth": 1,
   "text": "Might as well bring in Lelouch and have him geass the Military Princess"
  },
  {
   "score": 10,
   "id": "dh7vh9e",
   "pid": "t3_69lja0",
   "date": "2017-05-06 13:27:57",
   "depth": 0,
   "text": "The writing is being handled extremely well so far. The fact that the military is involved since a giant robot just showed up is a level of detail that you dont get often from anime. This is turning out to be an amazing show."
  },
  {
   "score": 4,
   "id": "dh7lgde",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:35:59",
   "depth": 0,
   "text": "Rui was Trap"
  },
  {
   "score": 5,
   "id": "dh7n9r9",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:17:40",
   "depth": 0,
   "text": "I'm interested in knowing if there are any synopses of the made-up animanga series the Uniform Princess is pulling the characters out from. It would help provide background as to some of their actions (like why Rui doesn't want to pilot the robot, etc).\n\nHave official sources released anything like this?"
  },
  {
   "score": 3,
   "id": "dha08fo",
   "pid": "t1_dh7n9r9",
   "date": "2017-05-08 02:23:05",
   "depth": 1,
   "text": "Well, in all fairness Rui's \"creator\" said he made him like that to encourage a plot twist or something down the line in the show; basically he's just a character that seems low-key but gets riled up easily (i.e. \"defensive\"). \n\nI'm not 100% sure on this, but I'm pretty sure the show Rui is from is \"anime original\" since Nakanogane said he was a character desinger and Selesia's creator said he'd only seen a picture of him shouting before. Most likely, Rui has a very shallow personality because of that element as anime only characters tend to not have *as* fully formed designs as those written for light novels or even manga.\n\nThat would also explain why Meteora seems kind of flat: She was essentially an information-fount NPC at the very end of a video game. All the \"characters\" generally seem to have as personality only what they were given by their original creators, which frankly makes the show much more interesting when you start comparing some of their quirks and outlandishness to the \"real people\" characters, who seem to have more complicated emotions and reactions to unfurling events."
  },
  {
   "score": 17,
   "id": "dh7irxd",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:33:00",
   "depth": 0,
   "text": "So I'm totally shipping Kikuchihara and Meteora! The chemistry and tension just seem to be there...really like those 2.\n\nMore talkey talkey this episode but it looks like their establishing their goal for the next few episodes. Ending reveal wasn't anything surprising but I'm happy they're getting it out of the way now."
  },
  {
   "score": 2,
   "id": "dh7qo1i",
   "pid": "t1_dh7irxd",
   "date": "2017-05-06 11:34:55",
   "depth": 1,
   "text": "I thought kikuchi is part of the team that created meteora\nthats why meteora was happy"
  },
  {
   "score": 4,
   "id": "dh7k8z5",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:07:59",
   "depth": 0,
   "text": "I can see the MC physically fighting the white haired antagonist in the near future after seeing that ending."
  },
  {
   "score": 5,
   "id": "dh7o1no",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:35:04",
   "depth": 0,
   "text": "Military Girl is still the best. ;)"
  },
  {
   "score": 4,
   "id": "dh7q0r5",
   "pid": "t3_69lja0",
   "date": "2017-05-06 11:20:03",
   "depth": 0,
   "text": "For an action show, there hasn't been much action in the last two episodes. Yet I haven't found myself bored yet. To me, that's a sign of good writing and direction. \n\nMy only mild complaint is that I'm getting a little tired of them having to explain the situation to every new character that they meet. I get why they have to do that, but it does get a little tedious. "
  },
  {
   "score": 4,
   "id": "dh8515q",
   "pid": "t1_dh7q0r5",
   "date": "2017-05-06 17:24:17",
   "depth": 1,
   "text": "Very similar to fate zero, actually a surprisingly small amount of action in that early on."
  },
  {
   "score": 4,
   "id": "dh8223i",
   "pid": "t3_69lja0",
   "date": "2017-05-06 16:09:10",
   "depth": 0,
   "text": "I'm looking forward to the Rule 63.  \n\nAlso, I appreciate the POV shot. You don't see it enough, IMO. "
  },
  {
   "score": 4,
   "id": "dh8ecnr",
   "pid": "t3_69lja0",
   "date": "2017-05-06 21:32:46",
   "depth": 0,
   "text": "This show is so utterly fucking ridiculous and so utterly committed to playing its premise completely straight, I love it."
  },
  {
   "score": 5,
   "id": "dh8gj0j",
   "pid": "t3_69lja0",
   "date": "2017-05-06 22:48:23",
   "depth": 0,
   "text": "I like how Meteora is slowly becoming an expert on everyone's worlds.\n\n\"I'm not getting back in that thing, no matter what anyone says.\"\n\nGet in the fuckin robot Rui!\n\nRui can call his mech to him. That's badass.\n\nAll those damages coming back to bite Meteora in the ass. Any money she ever makes will be taken for repairs and to replace the weapons she used."
  },
  {
   "score": 4,
   "id": "dh8il1z",
   "pid": "t3_69lja0",
   "date": "2017-05-07 00:14:46",
   "depth": 0,
   "text": "If the Military Princess's name is Altair, then there must be a Vega, right? "
  },
  {
   "score": 1,
   "id": "dkbipf4",
   "pid": "t1_dh8il1z",
   "date": "2017-07-16 21:01:22",
   "depth": 1,
   "text": "and a Deneb?"
  },
  {
   "score": 10,
   "id": "dh7i4m3",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:17:04",
   "depth": 0,
   "text": "[A trap is fine too...](http://i.imgur.com/1GkEYHP.png)"
  },
  {
   "score": 6,
   "id": "dh84o2h",
   "pid": "t1_dh7i4m3",
   "date": "2017-05-06 17:14:58",
   "depth": 1,
   "text": "[No fanart yet](#emptyinside \"No fanart yet\")"
  },
  {
   "score": 6,
   "id": "dh7lyfw",
   "pid": "t3_69lja0",
   "date": "2017-05-06 09:47:31",
   "depth": 0,
   "text": "This show is so good.\n\nI'm loving the Creations so far."
  },
  {
   "score": 8,
   "id": "dh8ithx",
   "pid": "t3_69lja0",
   "date": "2017-05-07 00:25:37",
   "depth": 0,
   "text": "While this show has a lot of good ideas, the amount of exposition is staggering. It seems that from episode 2, we've simply jumped from exposition scene to exposition scene. I love worldbuilding but it's just \"characters sitting listening the exposition\" the anime. First it was Meteora, now this show tries to \"mix things up a bit\" by adding a new character who adds nothing to the story but exposition.\n\nIt also bothers me how much Meteora seems to know. From early on we're told that Meteora doesn't have any more information than the rest of the cast so she's just guessing what's going on. It's become increasingly clear that she could write a textbook using nothing but her \"guesses\".\n\nThe author of this show is just using Meteora as a plot device to explain things that none of the characters should know. This helps to build some drama since Meteora tells us that there's consequences to not doing anything, listening to her matter-of-factly ramble on for 20 minutes while no one questions whether she could be wrong shows that she's an exposition engine rather than some sort of detective.\n\nIt hurts to see a show with such interested ideas bogged down by lazy writing. _Something_ needs to happen soon if this show is to keep my interest. I'm not asking for non-stop action and explosions, it doesn't even have to be action. I just want this show to go 10 or even 5 minutes without exposition, is that too much to ask for?\n\nTldr: Too much exposition; it's not even good exposition."
  },
  {
   "score": 6,
   "id": "dh8jco1",
   "pid": "t3_69lja0",
   "date": "2017-05-07 00:51:30",
   "depth": 0,
   "text": "This show has a shit ton of talking...\n\nIt's not even witty talking. It's just plain exposition talking. Like we exposition talked between MC and redhead, then them and library chick, then them and redhead's creators, then them and mecha girly-boy's creator, and finally between all of them and the government. \n\nIt's like ever expanding explanatory meetings the anime."
  },
  {
   "score": 3,
   "id": "dh7hyve",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:13:03",
   "depth": 0,
   "text": "Did they just get caught? I remember no reaction coming from the government was a distinct complaint, but honestly we should've seen this coming, hime literally wants to destroy the world."
  },
  {
   "score": 12,
   "id": "dh7o5go",
   "pid": "t1_dh7hyve",
   "date": "2017-05-06 10:37:28",
   "depth": 1,
   "text": "Also they're firing missiles and magical hearts around, of course *someone* would notice."
  },
  {
   "score": 3,
   "id": "dh7p49f",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:59:18",
   "depth": 0,
   "text": "So the main villain is called Altair, like that dude from that game from Ubisoft.    \nIt all makes sense now."
  },
  {
   "score": 3,
   "id": "dh8iv9u",
   "pid": "t1_dh7p49f",
   "date": "2017-05-07 00:27:55",
   "depth": 1,
   "text": "\"Altair\" is also one of the stars in the constellations."
  },
  {
   "score": 3,
   "id": "dh7teil",
   "pid": "t3_69lja0",
   "date": "2017-05-06 12:38:40",
   "depth": 0,
   "text": "Wait I'm confused does that mean he is the creator of the military princess or does he just know what story she's from?"
  },
  {
   "score": 3,
   "id": "dh8507g",
   "pid": "t1_dh7teil",
   "date": "2017-05-06 17:23:36",
   "depth": 1,
   "text": "Seems likely that the dead girl created her, and he did some early concept art but never fully finished the picture. Makes sense for her being so interested in him, introducing and hiding is drawings early and an extra level of guilt about her death."
  },
  {
   "score": 7,
   "id": "dh7uvff",
   "pid": "t1_dh7teil",
   "date": "2017-05-06 13:13:36",
   "depth": 1,
   "text": "From what I understand, he probably had seen (or even made) some initial sketches of MUP but not her final form, so she was familiar but not instantly recognizable to him and yes he definitely was in communication with her author (the girl that dies at the start of the first episode)."
  },
  {
   "score": 3,
   "id": "dh84tv0",
   "pid": "t3_69lja0",
   "date": "2017-05-06 17:19:01",
   "depth": 0,
   "text": "Ok, so sota wasn't actually her creator? Or more likely he drew an early concept for her but didn't actually make the character?"
  },
  {
   "score": 5,
   "id": "dh87gdl",
   "pid": "t1_dh84tv0",
   "date": "2017-05-06 18:26:19",
   "depth": 1,
   "text": "The girl that committed suicide was her creator. Sota was somehow collaborating with her, not clear how yet."
  },
  {
   "score": 3,
   "id": "dh8csro",
   "pid": "t3_69lja0",
   "date": "2017-05-06 20:46:48",
   "depth": 0,
   "text": "So far, this is probably my favorite episode. The openning scene was absolutely hilarious considering how savy the creator was to throw the big screen out of the house and thus save it. (For a few hours.) \n\nThe meeting scene was really well done and it felt highly realistic. I loved how they scolded Meteora about stealing weapons. \n\nOtherwise, Military Princess will finally have her identity revealed. Looking forward to that. Sounds like it was the girl that created her rather than Narrator-kun. "
  },
  {
   "score": 3,
   "id": "dh8e0p0",
   "pid": "t3_69lja0",
   "date": "2017-05-06 21:22:28",
   "depth": 0,
   "text": "I haven't watched it yet, but Rui best boy. Heckin cutie. "
  },
  {
   "score": 3,
   "id": "dh90661",
   "pid": "t3_69lja0",
   "date": "2017-05-07 10:36:07",
   "depth": 0,
   "text": "A nice depiction of governments \n\nUsually they are bumbling idiots in most cases"
  },
  {
   "score": 2,
   "id": "dh90mv2",
   "pid": "t1_dh90661",
   "date": "2017-05-07 10:46:44",
   "depth": 1,
   "text": "I was shocked when they actually used logic when they discussed the recent events. "
  },
  {
   "score": 2,
   "id": "dh919ix",
   "pid": "t1_dh90mv2",
   "date": "2017-05-07 11:00:53",
   "depth": 2,
   "text": "> I was shocked when they actually used logic\n\nfor me it was how civil discourse became their go to method of solving their problem, this is good\n\nwas expecting some Man of Steel level carnage but we get a nice exchange between minds\n\nthat is good\n"
  },
  {
   "score": 3,
   "id": "dh7tlrl",
   "pid": "t3_69lja0",
   "date": "2017-05-06 12:43:26",
   "depth": 0,
   "text": "ITT: No one questioning why the government is so ready to help.\n\nCall me jaded, but I find it incredibly hard to imagine the government being so altruistic to just be ready and lob resources at an unknown group of supernatural beings that \"borrowed\" their military weapons, cause multiple terrorist-like events, and don't pay taxes.\n\nEveryone here is saying that the show needed answers from the government, which is a step toward the realist atmosphere they want to maintain, but the actions of the officials are extremely inconsistent. \n\nFirst they show up guns blazing, ready to \"apprehend\" and protect the creators(hah). Then they just 180 and say they're given special status to just live there and believe their story, without any proof. And finally, they're just like, 'hey go off on this train ride and we won't observe you or mandate any control of your potential terrorism.'\n\nEDIT: However, I do have to say that the one thing they're really consistent about is how they handled the money of the missles. \"Total cost is like 150 million yen. You know, with taxpayer money.\" Then they brush it off like it's just: \"Hah, whatever, it's just taxpayer money.\""
  },
  {
   "score": 3,
   "id": "dh7v6ug",
   "pid": "t1_dh7tlrl",
   "date": "2017-05-06 13:21:13",
   "depth": 1,
   "text": "I think its a good initial approach from the government to the new characters, depending on how the story develops I'm sure we could see parts of the government wanting to exploit the phenomenon in some way but not go full blown antagonists to not divert the focus from the military uniform princess (at least for now)\n\nFinding a way to reliable open a portal to other worlds and bring back resources from there would be highly valuable, specially if they are not too exotic since if those resources \"make sense\" in the real world then they pose no threat."
  },
  {
   "score": 2,
   "id": "dh7vohc",
   "pid": "t1_dh7v6ug",
   "date": "2017-05-06 13:32:36",
   "depth": 2,
   "text": "Then why even include them into the series if there's no setup? All we got from their interaction to the group is that Alicetaria ran rampant in a police station and they won't need to worry about government interference. They didn't have any involvement prior. \n\nTheir reasons for involvement should either be explicit to the characters, explicit to the audience, or implicit to the audience. But we got nothing. They didn't ask for anything from the other world. Maybe an implicit save us, but that's as far as we got.\n\nIf they introduce characters, in this case the government is a character, without any reason and purpose, it's just poor writing. And if they suddenly come out and say that they were in it for resources or whatever in the end without any initial groundwork, it'll just be another ass-pull."
  },
  {
   "score": 3,
   "id": "dh7whmq",
   "pid": "t1_dh7vohc",
   "date": "2017-05-06 13:51:55",
   "depth": 3,
   "text": "There were so many watching at the Mamika fight. I thought they would get away with it as random cosplayers but they did nothing to change their appearances afterwards. So it wasn't impossible to see this coming."
  },
  {
   "score": 3,
   "id": "dh81yiv",
   "pid": "t1_dh7whmq",
   "date": "2017-05-06 16:06:34",
   "depth": 4,
   "text": "I get that this might have been an inevitability. But what does this do?\n\nIf you simply remove the mech fight with Sora and the group surrendering, they simply would've gotten on the train back to Tokyo. There was nothing gained, in either insight or material from either party. And it didn't create any meaningful development in character or plot. Maybe Meteora being more cautious with what she borrows. "
  },
  {
   "score": 1,
   "id": "dh82opo",
   "pid": "t1_dh81yiv",
   "date": "2017-05-06 16:25:11",
   "depth": 5,
   "text": "Well at least they are not doing an asspull like \"they don't see us fight, they lose their memory\" or anything like that. Hime set out to destroy the world, so of course the government would have a part to play in the long run."
  },
  {
   "score": 4,
   "id": "dh9x8o0",
   "pid": "t1_dh7tlrl",
   "date": "2017-05-07 23:56:03",
   "depth": 1,
   "text": "I would say when you are dealing with unknown threat which can summon 55m tall robot, police station on fire and 23 man wounded, people got kidnapped and no foreseeable solution in sight. Guilt-ripping three of fictional characters into cooperation with just a few stolen missiles, property damage and citizenship(which costs almost none) is pretty good deal to me. Since the damage those fictional character could/will done is almost guaranteed to be way higher than those.\n\nI do agree that a lot of characters feels inconsistent, like Rui agreed to help without any incentive from government. Everyone buys Meteora theory without proper proof of plausible coorelation."
  },
  {
   "score": 2,
   "id": "dhcmdt8",
   "pid": "t1_dh9x8o0",
   "date": "2017-05-09 15:54:54",
   "depth": 2,
   "text": ">Everyone buys Meteora theory without proper proof of plausible coorelation. \n\nThere were voices that said they couldn't believe this. Also they probably won't lose much even if the hypothesis was wrong, after all the other creations' rampages would still be dealt with. So I don't think they buy it fully. They were probably trying to be polite.   "
  },
  {
   "score": 8,
   "id": "dh85uj9",
   "pid": "t1_dh7tlrl",
   "date": "2017-05-06 17:45:16",
   "depth": 1,
   "text": "I imagine its part supernatural fiction beings have appeared in our world and are causing chaos, part we want to keep the people causing massive damage to the country and threatening people's lives on our good side, part weird shit is happening so fuck it get the weird shit to help us, and part the world may very well be ending because of the weird shit happening.\n\nIt would be like superpowers suddenly appearing in real life. The government is going to hire/capture/imprison anyone that has one or we get stuff like this popping up randomly around the world. You don't suppress it or take advantage of it and you people like the Military Uniform Princess, the real life equivalent of Marvel's Captain America and other heroes/villains causing massive issues everywhere. You keep track of them and keep them on your side or you're about to be fucked without lube, just look at at what Meteora did to the base that held the missile launchers she stole. Do you want fantasy/fictional people with magic/superpowers running around like they were previously and hope that people won't notice?"
  },
  {
   "score": 11,
   "id": "dh7nujo",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:30:37",
   "depth": 0,
   "text": "Exposition-chan really need to tone down on her pseudo world theory babble. I yawn whenever she starts talking (and she gets to talk a lot). "
  },
  {
   "score": 4,
   "id": "dh7qs4i",
   "pid": "t1_dh7nujo",
   "date": "2017-05-06 11:37:32",
   "depth": 1,
   "text": "She has some great lines, but I simply find her voice acting boring. It's too monotone.\n\n"
  },
  {
   "score": 5,
   "id": "dh8fgz1",
   "pid": "t3_69lja0",
   "date": "2017-05-06 22:09:32",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 2,
   "id": "dh90roh",
   "pid": "t1_dh8fgz1",
   "date": "2017-05-07 10:49:46",
   "depth": 1,
   "text": "The violin attack made me sit up and take notice in the series. Hopefully we get to see that again soon "
  },
  {
   "score": 2,
   "id": "dh7oz1k",
   "pid": "t3_69lja0",
   "date": "2017-05-06 10:56:00",
   "depth": 0,
   "text": "what is that ending"
  },
  {
   "score": 2,
   "id": "dh8dga6",
   "pid": "t3_69lja0",
   "date": "2017-05-06 21:05:36",
   "depth": 0,
   "text": "ok...did i miss something? Did Sota make her? Or come up with the idea? Or what? OMG it was so good and i'm just clambering to know"
  },
  {
   "score": 2,
   "id": "dh8e7db",
   "pid": "t3_69lja0",
   "date": "2017-05-06 21:28:10",
   "depth": 0,
   "text": "It still amazes me people don't realize dead girl is his sister. Go back and watch the first part of the first episode. The girl kills herself then Souta breaks out into a monologue about about how events center around his dead sister because she is the main character. That's literally what's happening in the show, events are going to centering on her/her creation."
  },
  {
   "score": 2,
   "id": "dh8ikoi",
   "pid": "t3_69lja0",
   "date": "2017-05-07 00:14:17",
   "depth": 0,
   "text": "If it was actual real life I am sure the government would never give them a chance. They'd be locked up or something. Here they get to freely speak and get citizenship. Weee!\n\nI kinda expected a \"[teehee. sorry taxpayers](http://i.imgur.com/n0jpvky.jpg)\".\n\nI'm having a good time with this anime. I hope more crazy stuff happens."
  },
  {
   "score": 4,
   "id": "dh8py7s",
   "pid": "t1_dh8ikoi",
   "date": "2017-05-07 06:07:03",
   "depth": 1,
   "text": "It's Japan though, not murica."
  },
  {
   "score": 2,
   "id": "dh8ldx7",
   "pid": "t3_69lja0",
   "date": "2017-05-07 02:36:39",
   "depth": 0,
   "text": "One thing that wasn't brought up was at what state the Creations are with respect to their stories. Selesia was her anime version, so what about the others? Also, does that mean that if she had power ups later in her LN could she potentially awaken them early should the conditions be met?\n\nAlso, I think the Military Girl wants the worlds destroyed in order to reset the world and undo Setsuna's death.\n\n"
  },
  {
   "score": 2,
   "id": "dh94bxz",
   "pid": "t3_69lja0",
   "date": "2017-05-07 12:04:52",
   "depth": 0,
   "text": "A thought\n\nIt's strange that the central plot and theme are all being driven by Meteora.\n\nWhich means that if for some reason, it is *wrong*, we know who to blame. \n\nThis is probably just me over thinking it, but I can't the only one who found it a tad suspicious that literally all of our problems come from the expose of one created.\n\nA heel face turn later in the future from Meteora will probably make the current fanbase shit their pants.\n\nI don't see that happening, but *I'mma call it just in case*..."
  },
  {
   "score": 2,
   "id": "dh9l1l8",
   "pid": "t3_69lja0",
   "date": "2017-05-07 18:11:18",
   "depth": 0,
   "text": "The references so far:\nCelestia: Sword Art Online\n\nMeteora, Aliceteria and Blitz: Fate Stay\n\nYuya: Persona\n\nMamika: Madoka\n\nThe girl with the wicked eyes and teeth: Danganronpa\n\nRui: Evangelion or Gundam\n\nThe Girl in Military Uniform: Hatsune Miku?"
  },
  {
   "score": 2,
   "id": "dhb4oeg",
   "pid": "t3_69lja0",
   "date": "2017-05-08 17:36:37",
   "depth": 0,
   "text": "So did anyone else cringe listening to that conference room dialogue??? I don't know, I thought it was pretty cringy but maybe that's just me. (starting to get horrible flashbacks to Gate here.)"
  },
  {
   "score": 2,
   "id": "dn4zr69",
   "pid": "t1_dhb4oeg",
   "date": "2017-09-17 12:59:45",
   "depth": 1,
   "text": "4 months later, but yeah it was.. very unrealistic. "
  },
  {
   "score": 2,
   "id": "dhb5pa4",
   "pid": "t3_69lja0",
   "date": "2017-05-08 17:59:15",
   "depth": 0,
   "text": "Super Smash Bros the Animation\n\nStaring - Fire Emblem: Escaflowne\n\nFinal Fantasy\n\nShin Megami Tensei\n\nNeon Genesis Aldnoah\n\nGeneric Magical Girl show\n\n"
  },
  {
   "score": 2,
   "id": "dhd0eqj",
   "pid": "t3_69lja0",
   "date": "2017-05-09 20:46:07",
   "depth": 0,
   "text": "[Military Catgirl Princess?](http://i.imgur.com/lsEtJMv.jpg)"
  },
  {
   "score": 4,
   "id": "dh7jn7h",
   "pid": "t3_69lja0",
   "date": "2017-05-06 08:53:43",
   "depth": 0,
   "text": "first half was really dope, though I hope people don't turn it into an fbi loli gif. Second half was exposition like usual with this show. Also I didn't quite understand the end..."
  },
  {
   "score": 6,
   "id": "dh7ojk5",
   "pid": "t1_dh7jn7h",
   "date": "2017-05-06 10:46:20",
   "depth": 1,
   "text": "That's just another addition to my loli cop attack folder, you can't stop the memes"
  },
  {
   "score": 2,
   "id": "dh87v6m",
   "pid": "t3_69lja0",
   "date": "2017-05-06 18:36:46",
   "depth": 0,
   "text": "Will the MC finally gets more than 10 lines per episode, and learn how to speak instead of just repeating the last word that someone else said?! "
  },
  {
   "score": 1,
   "id": "dh8wi39",
   "pid": "t3_69lja0",
   "date": "2017-05-07 09:13:09",
   "depth": 0,
   "text": "I love this series and all, and this episode was great! But i hope Rei Hiroe goes back to writing Black Lagoon after all of this is done :P. Or maybe a Revy cameo in this series!!!! "
  },
  {
   "score": 1,
   "id": "dh917gt",
   "pid": "t1_dh8wi39",
   "date": "2017-05-07 10:59:39",
   "depth": 1,
   "text": "He's getting back, in fact the series should start again by the end of this month if I'm not mistaken.\nAnd I think Hiroe drew Celestia and Revy as the series was starting airing."
  },
  {
   "score": 1,
   "id": "dhbds1b",
   "pid": "t3_69lja0",
   "date": "2017-05-08 21:03:38",
   "depth": 0,
   "text": "God this op is too good"
  },
  {
   "score": 1,
   "id": "dhc4tch",
   "pid": "t3_69lja0",
   "date": "2017-05-09 10:26:44",
   "depth": 0,
   "text": "Kinda dull for me sadly"
  },
  {
   "score": 1,
   "id": "dhd20l8",
   "pid": "t3_69lja0",
   "date": "2017-05-09 21:29:56",
   "depth": 0,
   "text": "Can't wait for the next ep! Im definitely enjoying this show alot :)"
  },
  {
   "score": 1,
   "id": "dhqjlbi",
   "pid": "t3_69lja0",
   "date": "2017-05-18 13:05:23",
   "depth": 0,
   "text": "So....military uniform girl is our creation?"
  },
  {
   "score": 1,
   "id": "dh8b11h",
   "pid": "t3_69lja0",
   "date": "2017-05-06 19:59:52",
   "depth": 0,
   "text": "Sota is the world's most boring MC. I forgot he was there during the council scene\n\nBUT he finally remembered! Thank goodness!"
  },
  {
   "score": 6,
   "id": "dh9exnv",
   "pid": "t1_dh8b11h",
   "date": "2017-05-07 15:49:11",
   "depth": 1,
   "text": "sota is the story's narrator, not mni character. he said that himself on first episode."
  },
  {
   "score": 5,
   "id": "dhablyc",
   "pid": "t1_dh9exnv",
   "date": "2017-05-08 08:12:29",
   "depth": 2,
   "text": "One of the first lines in the show as well"
  },
  {
   "score": 1,
   "id": "dh8gyg6",
   "pid": "t3_69lja0",
   "date": "2017-05-06 23:04:53",
   "depth": 0,
   "text": "So far every episode has been quite well done. There is always something that catches you off guard. I like the mystery aspect the series is developing."
  },
  {
   "score": 0,
   "id": "dh8n123",
   "pid": "t3_69lja0",
   "date": "2017-05-07 04:04:18",
   "depth": 0,
   "text": "Oh good, the government's finally getting involved! Of course that just means more GODDAMN TALKING, but at least we're making progress. "
  }
 ]
}