{
 "score": 205,
 "id": "62tsv8",
 "num_comments": 117,
 "date": "2017-04-01 09:37:23",
 "comments": [
  {
   "score": 40,
   "id": "dfp3mdk",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 09:39:20",
   "depth": 0,
   "text": "So they are starting from episode 1 after all? The first two were already released online."
  },
  {
   "score": 13,
   "id": "dfp49o1",
   "pid": "t1_dfp3mdk",
   "date": "2017-04-01 09:54:49",
   "depth": 1,
   "text": "So this ep is the same with the previous 2 episodes released before? "
  },
  {
   "score": 3,
   "id": "dfp4kch",
   "pid": "t1_dfp49o1",
   "date": "2017-04-01 10:01:56",
   "depth": 2,
   "text": "I think so."
  },
  {
   "score": 14,
   "id": "dfp4ns5",
   "pid": "t1_dfp49o1",
   "date": "2017-04-01 10:04:12",
   "depth": 2,
   "text": "Yup! Just touched up visually. But the directing is frame for frame with the already released episodes."
  },
  {
   "score": 5,
   "id": "dfpqi41",
   "pid": "t1_dfp4ns5",
   "date": "2017-04-01 19:13:12",
   "depth": 3,
   "text": "So..is the Crunchyroll gonna be updated with the touched up version?"
  },
  {
   "score": 10,
   "id": "dfp55ma",
   "pid": "t1_dfp4ns5",
   "date": "2017-04-01 10:16:01",
   "depth": 3,
   "text": "Good. I waited an entire season for this. Now I can watch the episodes weekly."
  },
  {
   "score": 35,
   "id": "dfpxh08",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 22:52:37",
   "depth": 0,
   "text": "Mysterious girl falls from the sky and meets a naive, but kind hearted county bumpkin who immediately chooses to assist her in fleeing from an evil empire. It's like every JRPG cliche rolled into one.\n\n...Put me down for the season, I'm in."
  },
  {
   "score": 1,
   "id": "dgakp8y",
   "pid": "t1_dfpxh08",
   "date": "2017-04-15 05:02:49",
   "depth": 1,
   "text": "Exactly my thoughts 🤣\nIncredibly cliche.... I'm in."
  },
  {
   "score": 17,
   "id": "dfpxjhg",
   "pid": "t1_dfpxh08",
   "date": "2017-04-01 22:55:24",
   "depth": 1,
   "text": "Well.. people from final fantasy 4 and 6 is working on this (Nobuo Uematsu and Hideo Minaba), thats why the plot is basically a 90s jrpg. Im in because the nostalgia is too stronk."
  },
  {
   "score": 22,
   "id": "dfpak6b",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 12:28:17",
   "depth": 0,
   "text": "Needs more Djeeta"
  },
  {
   "score": 7,
   "id": "dfpib6k",
   "pid": "t1_dfpak6b",
   "date": "2017-04-01 15:44:52",
   "depth": 1,
   "text": "I hope she isn't stuck with just being free sticker material to celebrate the anime and actually makes an appearance later on."
  },
  {
   "score": 13,
   "id": "dfp3r9f",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 09:42:35",
   "depth": 0,
   "text": "How's the animation in this show, did they pull a Rage of Bahamut and dump unlimited money into it to get a really solid animation staff?"
  },
  {
   "score": 3,
   "id": "dfyxtgm",
   "pid": "t1_dfp3r9f",
   "date": "2017-04-07 13:00:47",
   "depth": 1,
   "text": "Kinda surprised you seem to be in the minority, I also though the animation was very good. Maybe it's more related to the art style, directing or whatever ? But in any case, I thought it was very pretty to look at."
  },
  {
   "score": 11,
   "id": "dfp3x00",
   "pid": "t1_dfp3r9f",
   "date": "2017-04-01 09:46:23",
   "depth": 1,
   "text": "I wouldn't say its good its average at best, some of the effects look very plain and old. Like this exploding crystal at the very beginning did not look good. "
  },
  {
   "score": 1,
   "id": "dfpkmtf",
   "pid": "t1_dfp3x00",
   "date": "2017-04-01 16:43:09",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 1,
   "id": "dfpvp93",
   "pid": "t1_dfpkmtf",
   "date": "2017-04-01 21:47:40",
   "depth": 3,
   "text": "Fingers crossed for FGO, but I'm not very optimistic about it."
  },
  {
   "score": 22,
   "id": "dfpbiq9",
   "pid": "t1_dfp3x00",
   "date": "2017-04-01 12:52:02",
   "depth": 2,
   "text": "Kind of a shame since the general art style and character designs look very pretty"
  },
  {
   "score": 6,
   "id": "dfpwmry",
   "pid": "t1_dfpbiq9",
   "date": "2017-04-01 22:20:38",
   "depth": 3,
   "text": "Of course the art is amazing. It's from the Final Fantasy veterans. A shame A1-Pictures can't handle it."
  },
  {
   "score": 7,
   "id": "dfpmohr",
   "pid": "t1_dfp3r9f",
   "date": "2017-04-01 17:34:02",
   "depth": 1,
   "text": "It's... okay. Linework look kinda choppy sometimes though."
  },
  {
   "score": 10,
   "id": "dfrfi1l",
   "pid": "t3_62tsv8",
   "date": "2017-04-02 23:55:35",
   "depth": 0,
   "text": "So is this basically Castle in the Sky? Girl with a magic crystal falls out of the sky and meets boy. Girl and boy are pursued by government agents because they want the power of the girl and her crystal. They will also be able to fulfill the boy's wish relating to his father.\n\nIt's pretty and sweet (hate the fucking lizard thing) but someone please tell me it gets more original."
  },
  {
   "score": 6,
   "id": "dfrnyeo",
   "pid": "t1_dfrfi1l",
   "date": "2017-04-03 05:55:35",
   "depth": 1,
   "text": "LOL\n"
  },
  {
   "score": 9,
   "id": "dfpmmyj",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 17:32:56",
   "depth": 0,
   "text": "Ok I haven't played the game but they're summoning fucking BAHAMUT in the first episode?"
  },
  {
   "score": 8,
   "id": "dfpr65o",
   "pid": "t1_dfpmmyj",
   "date": "2017-04-01 19:31:48",
   "depth": 1,
   "text": "Yeah, but take in count that Bahamut was a long as fuck coldown and they need like a magical power source nearby. And yes, is the same Bahamut that is in Shingeki no Bahamut :p"
  },
  {
   "score": 8,
   "id": "dfpbppe",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 12:56:50",
   "depth": 0,
   "text": "Is the editing in this really bad and jerky, or is Crunchyroll's streaming really messed up?\n\nEdit: found out it's the latest update to the Android app doing it.  Great.\n\nSo I watched the show on Roku and liked it. It's slightly standard fantasy, but so much is that I decide what I like based on the characters,  and I like these characters. I like that the standard older warrior is a woman, and the little dragon had a great seiyuu adding lots of personality to the little guy. And the h/h are a cute couple.  I'm sticking with this. "
  },
  {
   "score": 3,
   "id": "dfq2hmd",
   "pid": "t1_dfpbppe",
   "date": "2017-04-02 03:10:57",
   "depth": 1,
   "text": "Thanks for figuring this out. I thought I was only one experiencing skipping in the animation while using the Crunchyroll android app. Moved to my laptop and watched with no problems."
  },
  {
   "score": 24,
   "id": "dfp5b5m",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 10:19:44",
   "depth": 0,
   "text": "Sawashiro as a sword wielding cool character, yes please. Can do without the mascot though...\n\nInteresting first episode though it felt a bit clunky at times."
  },
  {
   "score": -2,
   "id": "dfp92gd",
   "pid": "t1_dfp5b5m",
   "date": "2017-04-01 11:50:34",
   "depth": 1,
   "text": "Yeah, I knew her voice was very familiar, but couldn't place it until I looked it up on MAL - Celty, Kanbaru and Bishamon? Not bad.\n\nAnd yes, could've done without the mascot, but at least it wasn't the \"pesky getting in the way of everything\" kind like in Twin Star Exorcists.\n\nOverall seems too generic to bother with when my backlog is full of more interesting stuff."
  },
  {
   "score": 13,
   "id": "dfpzd1h",
   "pid": "t1_dfp5b5m",
   "date": "2017-04-02 00:14:51",
   "depth": 1,
   "text": "[don't talk shit about the mascot](https://www.youtube.com/watch?v=nMFD2v0iybw)"
  },
  {
   "score": 13,
   "id": "dfp68fr",
   "pid": "t1_dfp5b5m",
   "date": "2017-04-01 10:41:59",
   "depth": 1,
   "text": "Right? Rie Kugimiya, I love you, you've done good work, but why do you keep doing mascot characters with that annoying voice...."
  },
  {
   "score": 11,
   "id": "dfp6z3b",
   "pid": "t1_dfp68fr",
   "date": "2017-04-01 10:59:58",
   "depth": 2,
   "text": "> but why do you keep doing mascot characters with that annoying voice....\n\nBecause that's her only marketable voice..."
  },
  {
   "score": 3,
   "id": "dfpkaii",
   "pid": "t1_dfp6z3b",
   "date": "2017-04-01 16:34:37",
   "depth": 3,
   "text": "She also voices Vampy, a loli vampire girl, on the game but I don't think she will show on the anime. "
  },
  {
   "score": 9,
   "id": "dfpbyzq",
   "pid": "t1_dfp6z3b",
   "date": "2017-04-01 13:03:20",
   "depth": 3,
   "text": "Not at all. Tsundere characters may be the thing she's normally cast for, but I absolutely adored her as Alphonse from FMA, or Rokujo in Nabari no Ou (which I can't say I've seen mentioned once on this subreddit).\n\nI've grown weary of her high-pitched voice, but it's such a joy when she goes way lower (so pretty much males)."
  },
  {
   "score": 3,
   "id": "dfpdbg3",
   "pid": "t1_dfpbyzq",
   "date": "2017-04-01 13:37:21",
   "depth": 4,
   "text": "VAs aren't hired for their range, but for that one voice they nail one time and is easily marketable."
  },
  {
   "score": 3,
   "id": "dfpksm6",
   "pid": "t1_dfpdbg3",
   "date": "2017-04-01 16:47:13",
   "depth": 5,
   "text": "Unless you're hiring for a show like Rakugo!"
  },
  {
   "score": 6,
   "id": "dfpmyxz",
   "pid": "t1_dfpdbg3",
   "date": "2017-04-01 17:41:28",
   "depth": 5,
   "text": "Exhibit A: Nao Toyama. She actually has a pretty great range, but by and large she gets top billing for her genki Chiyo/Yuigahama voice. Kongou is the rare exception  "
  },
  {
   "score": 14,
   "id": "dfpa81j",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 12:19:40",
   "depth": 0,
   "text": "That was fairly nice. Generic but i'm a sucker for a Final Fantasy type atmosphere with this world. I like the characters. \n\nThose last three or four minutes were pretty badly written though, really predictable and there was not much impact. \n\nEverything before that was intriguing."
  },
  {
   "score": 17,
   "id": "dfpiq3z",
   "pid": "t1_dfpa81j",
   "date": "2017-04-01 15:55:21",
   "depth": 1,
   "text": "Actually, believe it ot not, old staff from the old school final fantasies worked on the game and they're also working in the anime adaptation. Nobuo Uematsu is doing the music and one of the art directors is Hideo Minaba, who also worked on Final Fantasy VI. It's basically the typical plot of a JRPG from the first half on the 90s, and i think is intended to be like that. Pretty nostalgic, hooked me up. I never expected to say that i missed the generic stories from the 90s rpgs, funny. I agree with the ending, but as i say i think is to be expected from this kind of story, the second episode has been out since january if you want to watch it, Bahamut is basically the ''summon'' of the girl, a la final fantasy."
  },
  {
   "score": 3,
   "id": "dfpq8mm",
   "pid": "t1_dfpiq3z",
   "date": "2017-04-01 19:05:54",
   "depth": 2,
   "text": "Cygames has been pulling in that old Squaresoft era talent. Akihiko Yoshida joined the same art team that Minaba is in, and Yasumi Matsuno has a game in the works with them too. I'm half-expecting them to get Isamu Kamikokuryou next since he announced that he left SE like a day ago..."
  },
  {
   "score": 1,
   "id": "dfq50zf",
   "pid": "t1_dfpq8mm",
   "date": "2017-04-02 05:29:57",
   "depth": 3,
   "text": "It's called going freelance."
  },
  {
   "score": 3,
   "id": "dfpqvxb",
   "pid": "t1_dfpq8mm",
   "date": "2017-04-01 19:24:09",
   "depth": 3,
   "text": "I think their expertise is pretty remarkable thanks to more than 20 years of experience with this genre and its shows in the vibe of this show, it has all of what a normal fantasy story but stills feels kind of ''magical''? sort to speak, also the reception and opinion i has been reading. If this was made by whatever other team most people would just say ''trash, another fantasy anime'' but instead with GBF im mostly hearing something more atone with ''pretty nostalgic'' or ''pretty entertaining''. BTW mfw Cygames is becoming SquareSofts spiritual sucessor, actually im kinda ok with that."
  },
  {
   "score": 5,
   "id": "dfpeqm6",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 14:13:08",
   "depth": 0,
   "text": "Bump of Chicken opening <3\n\nThought it was a pretty standard first episode. Nothing too fancy, but nothing immediately bad either. Really digging the art style though, it looks... different? Not sure how to describe it"
  },
  {
   "score": 23,
   "id": "dfp4mxd",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 10:03:37",
   "depth": 0,
   "text": "[BAHAMUUUUT!](https://youtu.be/kYW1wrYOxy8)\n\nConsider yourselves formally, aggressively accosted to watch [Shingeki no ~~Kyojin~~ Bahamut: Genesis](https://myanimelist.net/anime/21843/). A Pirates of the Carribean style adventure fantasy show that transitions into just plain high fantasy."
  },
  {
   "score": 19,
   "id": "dfpiy7b",
   "pid": "t1_dfp4mxd",
   "date": "2017-04-01 16:00:52",
   "depth": 1,
   "text": "I love that Cygames basically made Bahamut a transdimentional god-being that exist in all of their games."
  },
  {
   "score": 1,
   "id": "dfpm3f6",
   "pid": "t1_dfpiy7b",
   "date": "2017-04-01 17:19:33",
   "depth": 2,
   "text": "Creator of all realms."
  },
  {
   "score": 6,
   "id": "dfpmo9y",
   "pid": "t1_dfpiy7b",
   "date": "2017-04-01 17:33:52",
   "depth": 2,
   "text": "They did that with a lot of characters, but Bahamut is basicaly their mascot."
  },
  {
   "score": 5,
   "id": "dghuoy9",
   "pid": "t3_62tsv8",
   "date": "2017-04-19 18:10:15",
   "depth": 0,
   "text": "God this anime is so bad.\n\nGeneric looking MC chopping wood... WITH ARMOR ON. WHY? Why, just why?! Why would you have your armor on... to chop wood?! Do you fear ents?! What the fuck. Who does that. That shit's heavy yo.\n\nThen the pet / mascot thing. Holy fuck most annoying voice ever. Is this the new \"hey! listen!\"?\n\nAnd then some shit happens, explosions and stuff, and the MC ALONE goes to check the forest. Like there's a whole village. A whole fucking village. Not a single soul gives a shit about checking but the MC does. What the fuck is this retard doing.\n\nHe goes there finds a girl. Hmm, cool. She survived the fall how exactly? Then this kid. This motherfucking kid. He just goes MURDERING INNOCENT SOLDIERS because of some hoe he just found lying in the woods. Seriously. And he's just so nonchalant about it. \\*slash\\* u dead \\*slash\\* u dead too \\*slash\\* u too. k, lets go gang. Like what the actual fuck?\n\nI'm assuming this is based on some shitty RPG game because there's no way an anime director came up with this shit for real without being forced to follow some stupidly dumb introductory gameplay for a RPG which literally ruined this anime completely. Rage of Bahamut is based on a game but doesn't pull this crap. Who the fuck thought it was a good idea to adapt scene by scene a frigging video game?"
  },
  {
   "score": 3,
   "id": "dglcoh9",
   "pid": "t1_dghuoy9",
   "date": "2017-04-21 22:00:17",
   "depth": 1,
   "text": "I was thinking the same things. Also, how are the empires soldiers so incompetent? Especially in their heavy plate armor, how is some country bumpkin kid murdering them so easily?\n\nAnd yeah, most generic MC I have seen in a while. Kirito flashbacks."
  },
  {
   "score": 4,
   "id": "dglctws",
   "pid": "t1_dglcoh9",
   "date": "2017-04-21 22:05:12",
   "depth": 2,
   "text": "Kirito at least had the Matrix Neo skin. This one is the default adventurer skin all level 1 players have."
  },
  {
   "score": 9,
   "id": "dfpiv66",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 15:58:44",
   "depth": 0,
   "text": "I like the animation style.... and thats about the only positive thing that can be said about this anime. It could not be more generic even if it tried."
  },
  {
   "score": 2,
   "id": "dfyy06h",
   "pid": "t1_dfpiv66",
   "date": "2017-04-07 13:04:18",
   "depth": 1,
   "text": "It looks like a very generic old JRPG story, but that's exactly what makes me interested. Loving it so far."
  },
  {
   "score": 8,
   "id": "dfprfuo",
   "pid": "t1_dfpiv66",
   "date": "2017-04-01 19:39:16",
   "depth": 1,
   "text": "Well, yes actually that is the idea, the game of granblue fantasy was made in 2014 and Cygames hired a bunch of old school developers from the old final fantasies (4 and 6) to make the game, thats why it looks and feels so much like a final fantasy from the 90s, because basically follows the same formula inclusive the plot is extremely similar to final fantasy 4 or 6..\n\n"
  },
  {
   "score": 4,
   "id": "dfpqgb3",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 19:11:49",
   "depth": 0,
   "text": "Granblue's anime producer said he was planning to make Gran and Djeeta (the female version of the playable avatar in-game) co-leads for the anime, but the corporate overlords at Cygames refused - they wanted to maintain the \"boy meets girl aspect of Gran meeting Lyria\".\nThe producer is still trying to see if they can use Djeeta in some way.\n\nRumour has it Cygames is commissioning 4 cours of Granblue, but nothing's been officially stated.\n\nThe source game's still a Japan only release, but the game offers an English-translated dialogue option."
  },
  {
   "score": 7,
   "id": "dfpqyzg",
   "pid": "t1_dfpqgb3",
   "date": "2017-04-01 19:26:29",
   "depth": 1,
   "text": "48 episodes total in 4 seasons? Thats pretty neat if becomes a reality"
  },
  {
   "score": 3,
   "id": "dfpvevp",
   "pid": "t1_dfpqyzg",
   "date": "2017-04-01 21:38:11",
   "depth": 2,
   "text": "And if my gut is right, that art style is expensive to animate. It's a good thing that the game is a hit in Japan."
  },
  {
   "score": 3,
   "id": "dfp6fk8",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 10:46:44",
   "depth": 0,
   "text": "Will Cagliostro be in this?"
  },
  {
   "score": 5,
   "id": "dfpicnw",
   "pid": "t1_dfp6fk8",
   "date": "2017-04-01 15:45:57",
   "depth": 1,
   "text": "Most likely not. If you played the actual game, this is most likely following that storyline."
  },
  {
   "score": 6,
   "id": "dfp7jf7",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 11:13:40",
   "depth": 0,
   "text": "Really only watching this because I actively play the game, but all things considered its pretty well made for what it is. Certainly could be much worse. Some of the later arcs could be pretty legitimately cool too if they get to them. I could maybe see them getting to Vira at least."
  },
  {
   "score": 2,
   "id": "dfpehzl",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 14:06:57",
   "depth": 0,
   "text": "When i first watched this i feel like it was just plain \"average\"\n\nHowever for the fact that this is an adaptation of a mobile game i can see this either being really good or really bad"
  },
  {
   "score": 1,
   "id": "dg1rtfn",
   "pid": "t1_dfpehzl",
   "date": "2017-04-09 15:07:44",
   "depth": 1,
   "text": "The only mobile game anime I've watched was Divine Gate and booooooy was that awful."
  },
  {
   "score": 1,
   "id": "dgdthb1",
   "pid": "t1_dg1rtfn",
   "date": "2017-04-17 10:40:54",
   "depth": 2,
   "text": "Shingeki no Bahamut: Genesis is a mobile game and it's awesome, you should check it out, it's sequel is currently airing this season. "
  },
  {
   "score": 2,
   "id": "dfpgzp4",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 15:10:44",
   "depth": 0,
   "text": "I haven't played the game so it's all new to me, and the first episode was fun! Kind of seems like a typical JRPG style fantasy, but I like JRPGs so that kind of style is very enjoyable to me."
  },
  {
   "score": 1,
   "id": "dfpiryr",
   "pid": "t1_dfpgzp4",
   "date": "2017-04-01 15:56:37",
   "depth": 1,
   "text": "Actually, believe it ot not, old staff from the old school final fantasies worked on the game and they're also working in the anime adaptation. Nobuo Uematsu is doing the music and one of the art directors is Hideo Minaba, who also worked on Final Fantasy VI. It's basically the typical plot of a JRPG from the first half on the 90s, and i think is intended to be like that. Pretty nostalgic, hooked me up."
  },
  {
   "score": 2,
   "id": "dfpuvj2",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 21:20:43",
   "depth": 0,
   "text": "I was expecting something ala Rage of Bahamut but this is fine I guess. Pretty standard opening. Animation for Sawashiro's character during swordfights are amazing though. I'm curious where this series will go to."
  },
  {
   "score": 4,
   "id": "dfpxjyl",
   "pid": "t1_dfpuvj2",
   "date": "2017-04-01 22:55:56",
   "depth": 1,
   "text": "Fun fact: The Bahamut of this show is the same dragon of Shingeki no Bahamut."
  },
  {
   "score": 1,
   "id": "dfpy1kp",
   "pid": "t1_dfpxjyl",
   "date": "2017-04-01 23:15:49",
   "depth": 2,
   "text": "Really? I know they were developed both by Cygames but I didn't know that. Why is he like a friendly summon here and not a world ending threat like in RoB?"
  },
  {
   "score": 7,
   "id": "dfpy6ll",
   "pid": "t1_dfpy1kp",
   "date": "2017-04-01 23:21:46",
   "depth": 3,
   "text": "Ok lore time, Bahamut is basically a god, he represents the cycle of life and death (he cannot die btw, just be sealed at max), he is not intrinsically evil, he just ''resets'' the world once he thinks is times for a new cycle. In Shingeki no bahamut Zeus, Odin and Satan managed to seal Bahamut before he''resets'' the world, in the process Zeus died and leads to the events of the anime\n\nGranBlue fantasy is an alternative universe where Zeus didn't make it to completely seal Baha, so the dragon managed to wipe the world (thats why in this show the earth is destroyed and people is living in floating islands) and thats also why Bahamut haves a blindfold and his arms tied, he got half-sealed, and thats also the reason of why he needs to be summoned, because he is not free, he helps Lyria because i think the soul of Lyria is connected with Bahamut, so if she dies, Bahamut haves no way to being summoned.\n\n If you watch the episode again you will hear how the baddie says ''you are escaping with that ''thing'', such powerful weapon'' and he also talks about people dying, and the earth destroyed referencing the events i said. \n\nAnd yes, this means that characters from Shingeki no Bahamut also exist in Gran blue fantasy, Jeanne for example exists in both timelines."
  },
  {
   "score": 3,
   "id": "dfpyero",
   "pid": "t1_dfpy6ll",
   "date": "2017-04-01 23:31:32",
   "depth": 4,
   "text": "Ohhh! I like the lore! I hope RoB:Vigin Soul expands on that and show the benevolent side of Bahamut, S1 made him really look like this terrible baddie that's just there to destroy everything with no reason.\n\nOn a scale of 1-10 you just made my interest in this show just go from 4 to 8!"
  },
  {
   "score": 5,
   "id": "dfpymgi",
   "pid": "t1_dfpyero",
   "date": "2017-04-01 23:41:00",
   "depth": 5,
   "text": "The thing about Lyria and Bahamut sharing a soul can be a little of a spoiler, sorry for that. Take in count tho that GranBlue fantasy is much, much more like a 90s JRPG fantasy, since it haves people like Hideo Minaba or Nobue Uematsu in it, basically people that worked in the old school Final fantasies (4 and 6), so the story is a little more ''brighter'' and more typical fantasy journey than RoB, so keep that in mind. Still i enjoy the shared universe tho.\n\nMore fun facts: In Granblue Fantasy since the world was destroyed Lucifer decided to not betray the heaven and stills a good guy in this story and he is pretty badass in the game, look at this \nhttps://www.youtube.com/watch?v=yAZi93Zujzkanimation he is a summon just like bahamut\n\nAlso, Cygames has another game called Shadowverse, is a recent card game, and Bahamut is also part of that world, well he kind of got teleported there along with Satan but still, is cool that Cygame basically connected the 3 of their games canonically"
  },
  {
   "score": 2,
   "id": "dfq20au",
   "pid": "t3_62tsv8",
   "date": "2017-04-02 02:40:40",
   "depth": 0,
   "text": "It's pretty shaky but it seems like it has potential. If Lyria gets a bit more confidence, Katalina takes more of a central role, and they lay off the romance it could be great. It feels very nostalgic so no surprise that it has FF people behind it. The art and animation is a bit jarring but I think I can get used to it."
  },
  {
   "score": 1,
   "id": "dfqv3ek",
   "pid": "t1_dfq20au",
   "date": "2017-04-02 15:56:52",
   "depth": 1,
   "text": "Actually the romance is never really a common theme in the game, its not a current theme since both main protagonist and blue haired loli are like those characters that are basically the ship since episode 1 that everybody knows that will end together anyway much like final fantasy romances, they go together everywhere in the game so they basically are just like a couple even if is not explicitly said, i prefer it like that, i wish more anime would treat romance like that in fantasy or actions shows, so after a good amount of episodes or adventures some characters just became a couple without making a big deal about it, it feels more natural and less forced."
  },
  {
   "score": 2,
   "id": "dfq3pao",
   "pid": "t3_62tsv8",
   "date": "2017-04-02 04:24:15",
   "depth": 0,
   "text": "Gotta say I LOVE the look of this show.  Art style looks great to me.  Looks interesting enough to give it a shot.  Found it funny how Gran knew how to say the bahamut incantation after just getting a power transferal a couple of seconds ago, guess he learns fast?   "
  },
  {
   "score": 2,
   "id": "dfp40np",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 09:48:49",
   "depth": 0,
   "text": "While I'm not overly impressed with this show, I will probably still watch because I'm a sucker for airships and steampunk stuff. We don't get nearly enough steampunk anime. "
  },
  {
   "score": 1,
   "id": "dgy2o46",
   "pid": "t1_dfp40np",
   "date": "2017-04-30 07:34:01",
   "depth": 1,
   "text": "Nice opening though."
  },
  {
   "score": 5,
   "id": "dfpm38d",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 17:19:26",
   "depth": 0,
   "text": "Boy, that art style is trouble. Looks like they still haven't figure out how to animate it consistently smooth."
  },
  {
   "score": 1,
   "id": "dfprdlo",
   "pid": "t1_dfpm38d",
   "date": "2017-04-01 19:37:29",
   "depth": 1,
   "text": "Good catch, last year A1 pictures said that style of drawing is a pain in the ass to animate, is too static, looks super good in quiet shots buts gets blurry in fast paced scenes. The game uses this style of drawing but is a mobile game with chibi characters, i think they understimated they thing and said ''lets do all the show with that style so we stay loyal to the style of the game'' and now they're regretting it. Actually, this show has been in production a lot of time now for that reason and i assume that consumes a lot of budget."
  },
  {
   "score": 1,
   "id": "dfpvb9y",
   "pid": "t1_dfprdlo",
   "date": "2017-04-01 21:34:45",
   "depth": 2,
   "text": "And this a shounen series to boot which is a pity since I'm a fan of Yoshida's art style and the art director for this anime clearly knows how to establish a sense of scale with the shots."
  },
  {
   "score": 1,
   "id": "dfpw3x3",
   "pid": "t1_dfpvb9y",
   "date": "2017-04-01 22:01:32",
   "depth": 3,
   "text": "One of the people in the art deparment for this show is Hideo Minaba a veteran in the gaming industry, he worked in final fantasy 6. I mean, actually they have a really powerful animation group and the people that is working in the OST is also really good plus it haves the participaion of Nobuo Uematsu. So when it comes to visuals and sound theres not much to nitpick really, maybe it doesn't it seems but is supposed to be like top notch quality, is the animation the hard part. Mmm.. i was thinking how much budget has been pumped into the production of this show, the more i think of it, the more it eems"
  },
  {
   "score": 2,
   "id": "dfq4p62",
   "pid": "t1_dfpm38d",
   "date": "2017-04-02 05:14:55",
   "depth": 1,
   "text": "> Boy, that art style is trouble.\n\nI like it. Very Showa-like."
  },
  {
   "score": 1,
   "id": "dfpaxby",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 12:37:18",
   "depth": 0,
   "text": "Looks fine, but the animation and art style is not perfect. Probably won't drop it though. They better kiss by the end."
  },
  {
   "score": 3,
   "id": "dfpq5vv",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 19:03:50",
   "depth": 0,
   "text": "I felt like I was watching a bad action version of Castle in the Sky. I think those were some of the most impactless and bland fight scenes I've ever seen, like there was no exciting music to back it up and something just felt wrong. Maybe the weight was wrong? Maybe I don't like just a swing to take down lackey #91245. "
  },
  {
   "score": 1,
   "id": "dfpr0q7",
   "pid": "t1_dfpq5vv",
   "date": "2017-04-01 19:27:45",
   "depth": 1,
   "text": "Yeah, well in this game this zone was also like that since this is basically the tutorial zone of the game and is waaay shorter there, here they extended the thing a little."
  },
  {
   "score": 1,
   "id": "dfpozfs",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 18:33:28",
   "depth": 0,
   "text": "Episode tl;dr \n\nFemale protag that the male protag met ten minutes ago says \"no Gran I love you because of your white knight syndrome don't die yet let me give you my power and together we'll summon Bahamut to destroy our pursuers because you totally already know what I'm about to do because plot convenience\" the end. \n\nLineart style is kind of meh and makes the animation look sloppy. Not a strong start at all, although the world is giving me Hobbit x Final Fantasy vibes.  "
  },
  {
   "score": 4,
   "id": "dfpr29z",
   "pid": "t1_dfpozfs",
   "date": "2017-04-01 19:28:53",
   "depth": 1,
   "text": "A1 pictures and Cygames had people that worked in Final fantasy 4 and 6 in the game and this anime adaptation, thats why the FF vibes are so strong. The music was made by Nobuo Uematsu."
  },
  {
   "score": 3,
   "id": "dfp806r",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 11:24:52",
   "depth": 0,
   "text": "This is a [pretty bad upscaling](http://i.imgur.com/IQspqJu.jpg) job isn't it."
  },
  {
   "score": -1,
   "id": "dfpdgrx",
   "pid": "t1_dfp806r",
   "date": "2017-04-01 13:41:06",
   "depth": 1,
   "text": "anime on budget"
  },
  {
   "score": 16,
   "id": "dfpb8ei",
   "pid": "t1_dfp806r",
   "date": "2017-04-01 12:45:03",
   "depth": 1,
   "text": "It's just the line style"
  },
  {
   "score": 2,
   "id": "dfpcgah",
   "pid": "t1_dfpb8ei",
   "date": "2017-04-01 13:15:31",
   "depth": 2,
   "text": "I heard that that's actually why it's airing this season and not last."
  },
  {
   "score": 1,
   "id": "dfpimaw",
   "pid": "t1_dfpcgah",
   "date": "2017-04-01 15:52:44",
   "depth": 3,
   "text": "what do you mean?"
  },
  {
   "score": 2,
   "id": "dfpj1fr",
   "pid": "t1_dfpimaw",
   "date": "2017-04-01 16:03:06",
   "depth": 4,
   "text": "Well, I had heard that due to the art style they had to air this show this season rather than last. I think it's because it's not so easy to draw, which set them back. \n\nCan't remember where I got this from though."
  },
  {
   "score": 2,
   "id": "dfpmq1f",
   "pid": "t1_dfpj1fr",
   "date": "2017-04-01 17:35:08",
   "depth": 5,
   "text": "Oh, I thought they just waited to air it simultaneously with Rage of Bahamut."
  },
  {
   "score": 2,
   "id": "dfpojfs",
   "pid": "t1_dfpmq1f",
   "date": "2017-04-01 18:21:56",
   "depth": 6,
   "text": "Maybe, but I wouldn't know.¯\\\\\\_(ツ)\\_/¯ "
  },
  {
   "score": 2,
   "id": "dfpj3n5",
   "pid": "t1_dfpj1fr",
   "date": "2017-04-01 16:04:38",
   "depth": 5,
   "text": "Oh, i get you, yes, yes is really like.. very...static, illustration like?, it seems hard to make fluid movements with it, but when in static shots looks beatiful"
  },
  {
   "score": 8,
   "id": "dfpnl62",
   "pid": "t1_dfpj1fr",
   "date": "2017-04-01 17:56:57",
   "depth": 5,
   "text": "I thought it was because of Eugen's VA"
  },
  {
   "score": 1,
   "id": "dfqbbpm",
   "pid": "t3_62tsv8",
   "date": "2017-04-02 08:45:10",
   "depth": 0,
   "text": "So why can she summon bahamut and isn't this the wrong anime/game for him anyway?"
  },
  {
   "score": 2,
   "id": "dfqux2w",
   "pid": "t1_dfqbbpm",
   "date": "2017-04-02 15:53:11",
   "depth": 1,
   "text": "Shingeki no bahamut and GranBlue shares the same base universe."
  },
  {
   "score": 1,
   "id": "dfumnfc",
   "pid": "t3_62tsv8",
   "date": "2017-04-04 21:51:50",
   "depth": 0,
   "text": "Plot is shaping up to be very Star Wars"
  },
  {
   "score": 1,
   "id": "dg1rqwb",
   "pid": "t3_62tsv8",
   "date": "2017-04-09 15:06:10",
   "depth": 0,
   "text": "Sorey #2."
  },
  {
   "score": 1,
   "id": "dg3n4tb",
   "pid": "t3_62tsv8",
   "date": "2017-04-10 18:37:10",
   "depth": 0,
   "text": "From my point of view, it's not the protagonists that were OP, the soldiers were just standing there, waiting for being killed (by those swords with no sharp at all)."
  },
  {
   "score": 1,
   "id": "dgy2wau",
   "pid": "t3_62tsv8",
   "date": "2017-04-30 07:39:57",
   "depth": 0,
   "text": "Seriously a girl who fell from the sky with no injuries? Hmmm."
  },
  {
   "score": 1,
   "id": "dh7wxa6",
   "pid": "t3_62tsv8",
   "date": "2017-05-06 14:02:11",
   "depth": 0,
   "text": "Question, can I watch this directly or do I need to watch something else first? I recall there was another Granblue anime so I was confused. Is this a sequel or a new show?"
  },
  {
   "score": 2,
   "id": "dfpkpnr",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 16:45:10",
   "depth": 0,
   "text": "Feels like a generic fantasy anime. The main girl just moans a lot, the main guy looks generic and it's just a hero of justice, the bad guy sounds generic evil and the army dudes are just evil. "
  },
  {
   "score": 2,
   "id": "dg1rxhy",
   "pid": "t1_dfpkpnr",
   "date": "2017-04-09 15:10:15",
   "depth": 1,
   "text": "Generic doesn't mean bad. "
  },
  {
   "score": 1,
   "id": "dg2oeef",
   "pid": "t1_dg1rxhy",
   "date": "2017-04-10 07:40:04",
   "depth": 2,
   "text": "It does if you don't like what's generic, which I don't. "
  },
  {
   "score": 2,
   "id": "dg2pyjk",
   "pid": "t1_dg2oeef",
   "date": "2017-04-10 08:10:15",
   "depth": 3,
   "text": "> It does if you don't like what's generic, which I don't. \n\nReread what you said and see how stupid it sounds.\n\nYou not liking something =/=  bad. \n\nYou personally dislike this type of thing in your show and that doesn't affect the ratings or anything. Most of us still like generic shit. \n"
  },
  {
   "score": 1,
   "id": "dg4x9q2",
   "pid": "t1_dg2pyjk",
   "date": "2017-04-11 14:05:38",
   "depth": 4,
   "text": "When did I say it bad in my first comment? \n\nPlus most people believe in subjectivity, even if I had said it was bad, it would only mean it's bad for myself and not necessarily for anyone else.\n\nSeems to me like you're desperately trying to protect this show for some reason. "
  },
  {
   "score": 2,
   "id": "dg4ykgz",
   "pid": "t1_dg4x9q2",
   "date": "2017-04-11 14:31:43",
   "depth": 5,
   "text": "I said \"Generic doesn't mean bad\" \nand you answered with \"It does if you don't like what's generic, which I don't\" \n\nWhich means you said Generic was bad. I'm not protecting this show but I'm just saying that generic can be good or bad depending on the way its used. "
  },
  {
   "score": 1,
   "id": "dgb2j0o",
   "pid": "t1_dg4ykgz",
   "date": "2017-04-15 12:39:25",
   "depth": 6,
   "text": "I said that what's generic in this show is what I consider to be bad, not that generic things are bad as a whole. "
  },
  {
   "score": 2,
   "id": "dfpr7pm",
   "pid": "t1_dfpkpnr",
   "date": "2017-04-01 19:33:00",
   "depth": 1,
   "text": "Well, yes actually that is the idea, the game of granblue fantasy was made in 2014 and Cygames hired a bunch of old school developers from the old final fantasies (4 and 6) to make the game, thats why it looks and feels so much like a final fantasy from the 90s, because basically follows the same formula."
  },
  {
   "score": 1,
   "id": "dfpjqgd",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 16:20:45",
   "depth": 0,
   "text": "I think they spent all their animation budget on the summon.  That Rie mascot thing is grating.  Make it shut up"
  },
  {
   "score": 0,
   "id": "dfq8wrb",
   "pid": "t3_62tsv8",
   "date": "2017-04-02 07:44:03",
   "depth": 0,
   "text": "wow that was bad\n"
  },
  {
   "score": 1,
   "id": "dfquyc9",
   "pid": "t1_dfq8wrb",
   "date": "2017-04-02 15:53:56",
   "depth": 1,
   "text": "art, sound, or the 90s rpg typica plot?"
  },
  {
   "score": 1,
   "id": "dfqvu2i",
   "pid": "t1_dfquyc9",
   "date": "2017-04-02 16:12:35",
   "depth": 2,
   "text": "the art felt too static, shadow and lighting was almost non-existent. during the fight scenes i had to move farther away from the monitor, the camera work was too messy and blurry.\n\nthe first episode being uneventful didn't help either. I wasn't expecting anything special, i just watched it because all those doujins made me curious xD "
  },
  {
   "score": 2,
   "id": "dfqwup9",
   "pid": "t1_dfqvu2i",
   "date": "2017-04-02 16:34:28",
   "depth": 3,
   "text": "the second episode is out since january, theres more action. About the animation, you're right, actually what happened is this, A1 pictures tried to replicate the style of the illustrations of the game, but they understimated the complications of this, A1 pictures had said that due to the style of drawing this show is hard as fuck to animate and make it look fluid, the static shots look really beatiful but is because that, is like trying to animate an illustration, so it gets blurry in fast movements, A1 also said that they had sink a lot of money on this to make it work, as a fun fact, this show has been so hard to animate that was delayed like 3 months"
  },
  {
   "score": 1,
   "id": "dfqxsp7",
   "pid": "t1_dfqwup9",
   "date": "2017-04-02 16:54:00",
   "depth": 4,
   "text": "Oh wow, had no idea about that. The anime certain times is so static that reminded me of those cheap hentai where they just slightly animate the original manga if you have in mind. \n\nI'll probably give it another shot tho, i don't really like dropping stuff. \n\nty for the info  "
  },
  {
   "score": -3,
   "id": "dfpneva",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 17:52:26",
   "depth": 0,
   "text": "If only the voice actors were as good as the animation. Getting ready to shut this one off for good."
  },
  {
   "score": 1,
   "id": "dfpr4nm",
   "pid": "t1_dfpneva",
   "date": "2017-04-01 19:30:39",
   "depth": 1,
   "text": "I found the main guy and the female knight decent, i think i have heard both of those voice actors in a shit ton of other shows"
  },
  {
   "score": 2,
   "id": "dfq4eou",
   "pid": "t1_dfpr4nm",
   "date": "2017-04-02 05:01:06",
   "depth": 2,
   "text": "They're pretty par for the course. The voice actors for Lyria and Vyrn are atrocious, though."
  },
  {
   "score": -11,
   "id": "dfpfhqt",
   "pid": "t3_62tsv8",
   "date": "2017-04-01 14:32:15",
   "depth": 0,
   "text": "I was pretty excited when I heard they where making an anime based on Grand Blue..................., \n\n\n\n"
  }
 ]
}