{
 "score": 136,
 "id": "6f22h1",
 "num_comments": 32,
 "date": "2017-06-03 09:30:42",
 "comments": [
  {
   "score": 38,
   "id": "diex2z8",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 11:32:38",
   "depth": 0,
   "text": "Gran stomping on that guy's face was satisfying. Hot chicks are always welcomed in the team."
  },
  {
   "score": 11,
   "id": "dievcli",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 10:50:44",
   "depth": 0,
   "text": "For some reason nobody seems to remember Rosetta... https://www.reddit.com/r/anime/comments/6dol45/spoilers_granblue_fantasy_the_animation_episode_9/di4ii1b/?st=j3hkqqhi&sh=a233237d\n\n"
  },
  {
   "score": 11,
   "id": "dievgip",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 10:53:18",
   "depth": 0,
   "text": "I'm not sure how to feel about the story change compared to how it looks in game. "
  },
  {
   "score": 3,
   "id": "difug57",
   "pid": "t1_dievgip",
   "date": "2017-06-04 03:55:12",
   "depth": 1,
   "text": "It's better IMO. The game's weakness was its story at the earlier parts"
  },
  {
   "score": 3,
   "id": "diewyvw",
   "pid": "t1_dievgip",
   "date": "2017-06-03 11:29:50",
   "depth": 1,
   "text": "What is it exactly? I don't mind spoilers for this part of the story where we are at."
  },
  {
   "score": 13,
   "id": "diezn4i",
   "pid": "t1_diewyvw",
   "date": "2017-06-03 12:32:16",
   "depth": 2,
   "text": "[Spoilers](/s \"Basically: At this point they should be going to fight Leviathan to calm him down with Eugen and then head to Lumacie Archipelago and meet Rosetta there for the first time. Eugen going with the crew as well. Lyria didn't shut herself in as well.\") It's different but I cannot hate this it's so great! "
  },
  {
   "score": 4,
   "id": "difw5ld",
   "pid": "t1_diezn4i",
   "date": "2017-06-04 05:12:47",
   "depth": 3,
   "text": "I guess that would be rather boring as an anime because you basically get the same thing multiple times. [Spoiler](/s \"Get to new area. Mess around. Fight a primal beast or two. Get a new crew member\")"
  },
  {
   "score": 2,
   "id": "dikper5",
   "pid": "t1_difw5ld",
   "date": "2017-06-07 05:15:58",
   "depth": 4,
   "text": "Yeah, but this time [Anime Spoiler](/s \"Eugen didn't come with them to Lumacie\"), and there the party should meet [Game Spoiler](/s \"Black Knight\"), who is actually [Spoiler](/s \"Eugen's daughter\")."
  },
  {
   "score": 14,
   "id": "dif7ut0",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 15:41:46",
   "depth": 0,
   "text": "Once again the anime is carried by the character interactions, wich i love, i love how natural they talk to each other, also the way they act, shows like this are the ones who end giving me headches in other shows, here in GBF (or shingeki no bahamut) the characters see a problem then they act *immediately*, they just don't stand watching or giving an useless speech, they move, for example in whatever other anime Gran would have just stood in front of the bad guy screaming at him while he laughs or something but here no, he literally doesn't talk, Gran just breaks in smashing everyone in front of him, he even got shoot in the shoulder because of it, thats the type shit i want to see more often. Fuck im becoming a fanboy of Cygames, guys, halp.\n\nps. Also i like the battle synergy they have with each other, as i said, in other shows most groups of characters become efficient fighting together after a lot of drama or training but here everyone knows their role and act accordingly since episode 1 wich makes total sense because everyone of them except lyria haves combat experience.\n\nps2. Katalina is literally, best mom."
  },
  {
   "score": 2,
   "id": "diiwoe8",
   "pid": "t1_dif7ut0",
   "date": "2017-06-06 02:50:53",
   "depth": 1,
   "text": "I also liked a lot when the imperial guards were scattered and you could see Eugen and Rackam firing a few shots at the stragglers. Made a lot of sense imho."
  },
  {
   "score": 5,
   "id": "dif4vsr",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 14:32:07",
   "depth": 0,
   "text": "Sometimes the music in this show really just gets to me.  In particular, the music toward the end of the episode as they are making the decision to set out was great.\n\nOverall the episode was OK, it was kind of necessary I suppose in order to set up the plot of the last few episodes, but wasn't really great in and of itself.  Also, we had some definite *quality* visuals that didn't help out, as well as the airships falling after being destroyed looking a little wonky.   Hopefully next episode will be back up to the regular standard of the show, which I think generally looks pretty good."
  },
  {
   "score": 8,
   "id": "dieswio",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 09:53:05",
   "depth": 0,
   "text": "[Rosetta seems pretty cool](http://i.imgur.com/g1FR2d3.jpg) but did they ever see her when she saved them before?\n\n"
  },
  {
   "score": 1,
   "id": "diett9c",
   "pid": "t1_dieswio",
   "date": "2017-06-03 10:14:38",
   "depth": 1,
   "text": "> but did they ever see her when she saved them before?\n\nI know they showed in her in Port Breeze but I don't remember what she did exactly...I think she helped."
  },
  {
   "score": 3,
   "id": "dieug9a",
   "pid": "t1_diett9c",
   "date": "2017-06-03 10:29:43",
   "depth": 2,
   "text": "I think she was in the rooftop and blocked the path of the ones following them but i am not sure they even saw her."
  },
  {
   "score": 5,
   "id": "dif1sn2",
   "pid": "t1_dieug9a",
   "date": "2017-06-03 13:21:17",
   "depth": 3,
   "text": "They didn't see her, Gran just remembers seeing vines"
  },
  {
   "score": 3,
   "id": "dievf0y",
   "pid": "t1_dieswio",
   "date": "2017-06-03 10:52:20",
   "depth": 1,
   "text": "Didn't she put up a vine walk when they were being chased? I don't think she was actually shown."
  },
  {
   "score": 9,
   "id": "diex10s",
   "pid": "t1_dieswio",
   "date": "2017-06-03 11:31:18",
   "depth": 1,
   "text": "> Rosetta seems pretty ~~cool~~ hot\n\nFTFY. Also Gran thanked her for what she did in Port Breeze so I assume at least he knows that she helped them escape."
  },
  {
   "score": 21,
   "id": "dievi6z",
   "pid": "t1_dieswio",
   "date": "2017-06-03 10:54:25",
   "depth": 1,
   "text": "> but did they ever see her when she saved them before?\n\nGran saw vines so he probably put 1 + 1 and figured it was her"
  },
  {
   "score": 7,
   "id": "difauhp",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 16:52:56",
   "depth": 0,
   "text": "[Lich](https://gbf.wiki/Lich) makes an appearance. That's unexpected.\n\nRosetta introduced herself way earlier. Originally in the game, they had to calm down Leviathan's rampage first before going to Lumacie Archipelago. It was only after they landed that Rosetta appeared herself. Looks like they're doing the reverse here. I only suspect [they're setting up](/s \"Orchis to absorb Leviathan as\") a plot hook for a second season."
  },
  {
   "score": 2,
   "id": "dig2ntx",
   "pid": "t1_difauhp",
   "date": "2017-06-04 08:22:34",
   "depth": 1,
   "text": "> [they're setting up](/s \"Orchis to absorb Leviathan\")\n\nDang, I didn't thought of that before. That would be more interesting than the original game plot, and also provides a shocking revelation about [spoilers for those who don't play the game](/s \"her power\")"
  },
  {
   "score": 3,
   "id": "dig3jdg",
   "pid": "t1_dig2ntx",
   "date": "2017-06-04 08:42:53",
   "depth": 2,
   "text": "The only problem about this is where will they fit in [spoiler](/s \"Lyria becoming close friends with Orchis\") since that particular plot point happened in Lumacie."
  },
  {
   "score": 4,
   "id": "diex2x5",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 11:32:35",
   "depth": 0,
   "text": "That flashback was really good, Lyria was really only a test subject that was (is?) a ticking time bomb. She didn't even have feelings nor could she express them properly. Katalina taught her all of this, now we know why she is so attached to her.\n\nRosetta is lit, i love her character design. She's the mysterious one, yet she gives off the impression that you can trust her. \n\nYet another very enjoyable episode that is only possible cause of the character interactions and how they formed a real strong bond together."
  },
  {
   "score": 2,
   "id": "difwntx",
   "pid": "t3_6f22h1",
   "date": "2017-06-04 05:32:55",
   "depth": 0,
   "text": "I actually love how the anime are more like an In-depth version of the game so that we can understand more about each character. Imo The game, the anime, and even the Gran Blues have their own unique twist in which makes me enjoy each of them separately.\n\nAlso that Lich bro."
  },
  {
   "score": 2,
   "id": "dig2pd4",
   "pid": "t1_difwntx",
   "date": "2017-06-04 08:23:36",
   "depth": 1,
   "text": "Lich not only haunting your gacha but also haunting Lyria"
  },
  {
   "score": 2,
   "id": "dig5kh9",
   "pid": "t1_dig2pd4",
   "date": "2017-06-04 09:28:54",
   "depth": 2,
   "text": "Lich also haunts your Lich raid"
  },
  {
   "score": 3,
   "id": "diete0v",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 10:04:32",
   "depth": 0,
   "text": "Ah more Rosetta me likey. Also enjoyed getting to see Lyria and Katalina's first meetings!"
  },
  {
   "score": 3,
   "id": "dif3ceo",
   "pid": "t1_diete0v",
   "date": "2017-06-03 13:55:41",
   "depth": 1,
   "text": "Katalina is basically the surrogate mother of Lyria at this point.\n\nAlso it seems that Rosetta and Gran are relatives? Or at least she knows him since before the beggining of the story or something."
  },
  {
   "score": 1,
   "id": "diffwub",
   "pid": "t1_dif3ceo",
   "date": "2017-06-03 18:58:45",
   "depth": 2,
   "text": "[Rosetta,](/s \"knows Gran's father.\")"
  },
  {
   "score": 1,
   "id": "difippr",
   "pid": "t1_diffwub",
   "date": "2017-06-03 20:09:13",
   "depth": 3,
   "text": "[She](/s \"also knows Vyrn and is implied to have known Lyria as well.\")"
  },
  {
   "score": 3,
   "id": "dif4e0d",
   "pid": "t1_dif3ceo",
   "date": "2017-06-03 14:20:11",
   "depth": 2,
   "text": "Sister*\n\nAlso JK is not related in such a way to Gran"
  },
  {
   "score": 3,
   "id": "dif5jsv",
   "pid": "t3_6f22h1",
   "date": "2017-06-03 14:47:45",
   "depth": 0,
   "text": "Loved the discussions between the characters. Rackam and Io are pretty straightforward in general, but seeing Katalina open up and talk about how she felt about Lyria, as well as Vyrn supporting Gran as an old friend, was very interesting."
  },
  {
   "score": -6,
   "id": "difq8nm",
   "pid": "t3_6f22h1",
   "date": "2017-06-04 00:22:07",
   "depth": 0,
   "text": "[Rosetta](/s \"was part of the crew of Gran's dad\")"
  }
 ]
}