{
 "score": 127,
 "id": "6h8p5y",
 "num_comments": 64,
 "date": "2017-06-14 09:41:45",
 "comments": [
  {
   "score": 28,
   "id": "diwe4jc",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 10:05:36",
   "depth": 0,
   "text": "#It was a nice eye opener seeing a ep from Haruki's perspective.  \n\nSeeing her deal with stuff on her own was amusing.  She def doesnt spend enough tie with others though because she doesnt really know how to deal with them.  But thats okay, shes devoted herself to Kei afterall.  \n\nThe house visit was cute too.  Her struggles with what to do and bring were great.  \n\nI try to keep a mental timeline for this show but it gets hard.  But i have a feeling this is during some overlap of other stuff... ill be curious to see how it all goes next week.  \n\nGreat ep though!  \n\n[](#feelsgoodman)"
  },
  {
   "score": -1,
   "id": "diwlik1",
   "pid": "t1_diwe4jc",
   "date": "2017-06-14 12:13:20",
   "depth": 1,
   "text": "the whole ep was amusing yet a c*cktease "
  },
  {
   "score": 9,
   "id": "diws4hw",
   "pid": "t1_diwlik1",
   "date": "2017-06-14 14:11:56",
   "depth": 2,
   "text": "You can say cock on Reddit."
  },
  {
   "score": 4,
   "id": "diwsezr",
   "pid": "t1_diws4hw",
   "date": "2017-06-14 14:17:17",
   "depth": 3,
   "text": "I read it at cucktease and got confused. lol"
  },
  {
   "score": 7,
   "id": "dixf4de",
   "pid": "t1_diwe4jc",
   "date": "2017-06-14 23:10:38",
   "depth": 1,
   "text": "When she realised that Kei is probably making dinner already, her brokenhearted voice was gold."
  },
  {
   "score": 1,
   "id": "dk93sar",
   "pid": "t1_dixf4de",
   "date": "2017-07-15 06:00:36",
   "depth": 2,
   "text": "Seriously. That sequence just had me go, \"NOOOO KEEP GOING\" It kills me to see people have this kind of low confidence in real life and they emulated it amazingly well with those few lines. "
  },
  {
   "score": 12,
   "id": "diwi2x5",
   "pid": "t1_diwe4jc",
   "date": "2017-06-14 11:13:06",
   "depth": 1,
   "text": "Agreed on the house visit.  Twintails mentioning that she should kiss Kei, and her struggles with thinking about what to bring and do made this episode great.\n\nReal Haruki x Kei kiss when"
  },
  {
   "score": 4,
   "id": "dixbs93",
   "pid": "t1_diwi2x5",
   "date": "2017-06-14 21:25:08",
   "depth": 2,
   "text": "it will be difficult to get i think.  Kei has some severe ptsd about that because it was his kiss with haruki and reset that caused Sumier to die.  So ide be curious to see how he handles that."
  },
  {
   "score": 26,
   "id": "diwfu21",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 10:34:40",
   "depth": 0,
   "text": "Of course, even in an episode that nothing really happens, this show still manages to throw around some interesting ideas. Also, I think this episode pretty much confirms that Haruki is autistic or at least somewhere on the spectrum."
  },
  {
   "score": 20,
   "id": "diwqjch",
   "pid": "t1_diwfu21",
   "date": "2017-06-14 13:43:24",
   "depth": 1,
   "text": "4chan calls this the most autistic anime of the season, and for once, that's actually sort of correct."
  },
  {
   "score": 1,
   "id": "diwqkae",
   "pid": "t1_diwqjch",
   "date": "2017-06-14 13:43:51",
   "depth": 2,
   "text": "Source?"
  },
  {
   "score": 3,
   "id": "diwqyu8",
   "pid": "t1_diwqkae",
   "date": "2017-06-14 13:51:06",
   "depth": 3,
   "text": "It's been said a few times on the various Sagrada threads."
  },
  {
   "score": 4,
   "id": "diwr7b1",
   "pid": "t1_diwqyu8",
   "date": "2017-06-14 13:55:13",
   "depth": 4,
   "text": "I checked [a thread about today's episode](http://boards.4chan.org/a/thread/158495882/sagradasakurada-rest), and the number of times \"autism\" is mentioned is ridiculous."
  },
  {
   "score": 5,
   "id": "diwtur1",
   "pid": "t1_diwr7b1",
   "date": "2017-06-14 14:43:56",
   "depth": 5,
   "text": "Well, that's 4chan for you."
  },
  {
   "score": 4,
   "id": "dixp3bo",
   "pid": "t1_diwqjch",
   "date": "2017-06-15 05:42:02",
   "depth": 2,
   "text": "I hate the way 4chan uses the word autistic tho. Sounds fuckin condescending every time I read it there."
  },
  {
   "score": 7,
   "id": "diy11it",
   "pid": "t1_dixp3bo",
   "date": "2017-06-15 09:37:02",
   "depth": 3,
   "text": "It's like the only insult they know."
  },
  {
   "score": 17,
   "id": "diwo9zz",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 13:02:37",
   "depth": 0,
   "text": "Soo... nothing really happened this episode.\n\nAnd yet, I liked it. A lot. We learned a lot more about how Misora's thought processes work, and got to see some incredibly cute moments. I really like her classmate, even though what she did apparently wasn't all that altruistic but rather for her own amusement because she thought it was interesting.\n\nAnd once again I had the feeling the show was talking about some philosophical stuff... especially the sweets shop scene where she was pondering on whether to get Ice cream which didn't contain Peaches or Peaches on something which Kei might not like? Maybe I'm just overthinking things. But I will definitely give this show a binge rewatch once the season is over because atm I'm quite sure I'm missing a lot of stuff while watching."
  },
  {
   "score": 7,
   "id": "dixejz5",
   "pid": "t1_diwo9zz",
   "date": "2017-06-14 22:50:54",
   "depth": 1,
   "text": ">We learned a lot more about how Misora's thought processes work\n\nThe amount of thinking and double thinking in this episode is comparable to other keikaku shows."
  },
  {
   "score": 17,
   "id": "dix0s70",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 17:06:03",
   "depth": 0,
   "text": "#Nothing happened\n\nYet everything happened. How is that possible?"
  },
  {
   "score": 0,
   "id": "dix8nyl",
   "pid": "t1_dix0s70",
   "date": "2017-06-14 20:05:10",
   "depth": 1,
   "text": "are you a [bill wurtz](https://youtu.be/xuCn8ux2gbs?t=12s)?"
  },
  {
   "score": 3,
   "id": "dixmmkn",
   "pid": "t1_dix0s70",
   "date": "2017-06-15 04:25:44",
   "depth": 1,
   "text": "A beautiful description of yesterday's episode."
  },
  {
   "score": 7,
   "id": "dix82ev",
   "pid": "t1_dix0s70",
   "date": "2017-06-14 19:51:01",
   "depth": 1,
   "text": "Because Sakurada Reset is being Sakurada Reset."
  },
  {
   "score": 14,
   "id": "diwk8lr",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 11:50:55",
   "depth": 0,
   "text": "its nice to see some folks like to watch this anime "
  },
  {
   "score": 2,
   "id": "diwsbo5",
   "pid": "t1_diwk8lr",
   "date": "2017-06-14 14:15:38",
   "depth": 1,
   "text": "I'm here with you. It's the only non-sequel I actually look forward to each week."
  },
  {
   "score": 5,
   "id": "diwzn2d",
   "pid": "t1_diwk8lr",
   "date": "2017-06-14 16:41:13",
   "depth": 1,
   "text": "For the first month I was considering if it was worth continuing, or if I'd just drop it, but I'll glad I didn't. The things they do with power combinations are really interesting, and this episode was such a treasure.\n\nIt's still not even close to one of my favorites this season, but I can definitely see giving it a 7 if it has a good ending. 8 if the ending is great "
  },
  {
   "score": 1,
   "id": "diyp76q",
   "pid": "t1_diwzn2d",
   "date": "2017-06-15 17:17:25",
   "depth": 2,
   "text": "Can you share your favs this season?"
  },
  {
   "score": 2,
   "id": "diypzhz",
   "pid": "t1_diyp76q",
   "date": "2017-06-15 17:36:00",
   "depth": 3,
   "text": "Tsuki ga Kirei, Re:Creators, SukaSuka and Clockwork Planet are my top favorites. \n\nAfter that, Attack on Titan, Akashic Records, Grimoire of Zero, Busou Shoujo, Sakura Quest, Hero Academia, Alice To Zoroku, Royal Tutor, Kado and Sagrada Reset are all solid shows. \n\nHinako Note, Renai Bokun, Sword Oratoria and Granblue Fantasy are all enjoyable, but forgettable. Eromanga-sensei is trash, but I still watch it because it has it's few moments. "
  },
  {
   "score": 15,
   "id": "dixa5na",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 20:41:54",
   "depth": 0,
   "text": "Are we friends yet? No.\n\nAre we friends yet? No.\n\nAre we friends yet? No."
  },
  {
   "score": 14,
   "id": "diwmvql",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 12:37:46",
   "depth": 0,
   "text": "I can't speak for anyone, but for some reason I really want to hear the pointless conversation about cloud shapes. I think that would be hilarious. \n\nThis episode was so pointless in terms of plot, but was great because we got to see her inner thoughts. Just her process from the supermarket and walk section is great. I hope we get another episode like this down the line. \n\nI've never seen Apple ice cream all my life."
  },
  {
   "score": 3,
   "id": "diwqpu7",
   "pid": "t1_diwmvql",
   "date": "2017-06-14 13:46:37",
   "depth": 1,
   "text": "I'd guess that the writer decided showing the cloud conversion was unnecessary, and this show extremely rarely shows anything unnecessarily."
  },
  {
   "score": 4,
   "id": "dix189u",
   "pid": "t1_diwmvql",
   "date": "2017-06-14 17:15:43",
   "depth": 1,
   "text": "That's because apple ice cream is the shop owner's special ability. The entire shop exists so she can use her ability. She suggests apple ice cream to everyone who comes to the shop, in some roundabout way."
  },
  {
   "score": 7,
   "id": "dixfg0c",
   "pid": "t1_dix189u",
   "date": "2017-06-14 23:22:20",
   "depth": 2,
   "text": "Shopkeeper: These aren't the sweets you're looking for. \n\nCustomer: These aren't the sweets I'm looking for.\n\nShopkeeper: You'll buy the apple ice cream.\n\nCustomer: I'll buy the apple ice cream."
  },
  {
   "score": 14,
   "id": "diwehmu",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 10:11:41",
   "depth": 0,
   "text": "Haruki being Haruki and it was pretty adorable i must say."
  },
  {
   "score": 1,
   "id": "dj0w0kj",
   "pid": "t1_diwehmu",
   "date": "2017-06-17 05:20:56",
   "depth": 1,
   "text": "It was a lot of fun watching her dilemma on Tart vs Ice cream"
  },
  {
   "score": 9,
   "id": "diwoxbm",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 13:14:23",
   "depth": 0,
   "text": "Goddamn, Haruki will get my votes in best girl contests until the end of time.\n\nThis show being this show, I think Pigtails is likely to become important in some major way in the future."
  },
  {
   "score": 3,
   "id": "diwqsi6",
   "pid": "t1_diwoxbm",
   "date": "2017-06-14 13:47:57",
   "depth": 1,
   "text": "Also the girl that got stuck in a marble. I'm expecting her to come back into the plot somehow."
  },
  {
   "score": 9,
   "id": "diwsg58",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 14:17:53",
   "depth": 0,
   "text": "Making a pointless episode about talking about talking about pointless things was genius. And as someone with autism, she feels like an extreme version of myself."
  },
  {
   "score": 6,
   "id": "diwzg4t",
   "pid": "t1_diwsg58",
   "date": "2017-06-14 16:37:03",
   "depth": 1,
   "text": "I think this was the best episode yet. It was so fun listening to all her inner thoughts while she over thought everything."
  },
  {
   "score": 8,
   "id": "diwgc8a",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 10:43:11",
   "depth": 0,
   "text": "So we finally get to see what goes on inside Misora's mind. I think it's perfect that they made this episode the halfway point of the season and it gives more context on what's Misora's thought process is like during these past 12 episodes.\n\nNow my only question left is how did she grow up to be like this Vulcan-like person where everything needs to have a logical reasoning/explanation. We already know that she's a loner but what about family? Does she have one? Is she like Kei who grew up completely alone? Typical for this show to give you more questions when you thought you finally have an answer."
  },
  {
   "score": 6,
   "id": "dixc681",
   "pid": "t1_diwgc8a",
   "date": "2017-06-14 21:36:08",
   "depth": 1,
   "text": "She grew up that way because of her powers and her home life.  Its been hinted that hers had some complications and with her reset power it justis a good formula for stress which i think has caused her personality.  Shes detached herself from the world.  I think she likes Kei because he \"saved her\"' in a way and gave her some much needed closeure on herself and her power.  Plus she knows she can always trust Kei because he remembers everything, so even if she resets, he wont forget her.  which seems to be something shes scared of.  \n\nI imagine we will get more insight sooner or later."
  },
  {
   "score": 2,
   "id": "dixcf9e",
   "pid": "t1_dixc681",
   "date": "2017-06-14 21:43:23",
   "depth": 2,
   "text": "When was Haruki's home life hinted at?"
  },
  {
   "score": 10,
   "id": "dixgazz",
   "pid": "t1_dixcf9e",
   "date": "2017-06-14 23:54:23",
   "depth": 3,
   "text": "the fact that when ever she sees a crying child she resets, thats a pretty big red flag. something had to cause that specific trauma.  I think it will go more into it eventully because they have only mentioned breifly about her life."
  },
  {
   "score": 1,
   "id": "diy1nf0",
   "pid": "t1_dixgazz",
   "date": "2017-06-15 09:47:39",
   "depth": 4,
   "text": "I'm calling it now: Haruki will go full yandere on Kei at some point."
  },
  {
   "score": 8,
   "id": "dix7ykg",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 19:48:30",
   "depth": 0,
   "text": "Enjoyable episode from Haruki's perspective. I don't know if other people feel the same way but I found Haruki's logical answers hilarious. \n\n\"Do you know the best way to recover from a cold?\" \"With medicine and lots of rest?\" "
  },
  {
   "score": 4,
   "id": "diwqkfd",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 13:43:55",
   "depth": 0,
   "text": "Oh shit, that preview.\n\nCute episode, too."
  },
  {
   "score": 4,
   "id": "dix9wlj",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 20:35:34",
   "depth": 0,
   "text": "My favorite episode so far, i would be perfectly okay with just more episodes from Haruki's perspective living her daily life x)\n\nThat being said next episode looks pretty interesting based on the preview..."
  },
  {
   "score": 3,
   "id": "dixeqmo",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 22:57:17",
   "depth": 0,
   "text": "[What a sweetheart](http://i.imgur.com/zVPrO2S.png). Inside her head she's such a goofball with how seriously she approaches things, the whole peach/ice cream conversation was pretty funny. Overall a very adorable episode, I think it got off to a rocky start but this show has actually been quite nice as of late."
  },
  {
   "score": 3,
   "id": "dix4m1o",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 18:32:23",
   "depth": 0,
   "text": "I see most of you liked this episode but I found this episode kind of boring. Yes it shows how haruki deals with things on day to day but we kind of already could see that's how she is. Hopefully this show picks up a bit, I'm not really sure what it's storyline objective is atm."
  },
  {
   "score": 3,
   "id": "dixfcwi",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 23:19:14",
   "depth": 0,
   "text": "First 10 minutes...\n\n***I DON'T KNOW, OKAAAY??***\n\n"
  },
  {
   "score": 3,
   "id": "dixohbi",
   "pid": "t3_6h8p5y",
   "date": "2017-06-15 05:25:12",
   "depth": 0,
   "text": "What I love about this episode is that even though it's \"filler\", it still shows us a lot. Haruki's character development (from the robot to the human she's turning into) and the introduction of twintails (who I'm sure will play some part in the show later on) gave us enough for me to at least be happy this week. It's a nice break from all the heavy shit that's been thrown at us recently, and I think this episode will be a lot more appreciated by viewers who watch after it finishes airing"
  },
  {
   "score": 2,
   "id": "diwj38e",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 11:30:46",
   "depth": 0,
   "text": "It was nice seeing it from Haruki's perspective this time, this episode was really very deep and logical in some way."
  },
  {
   "score": 2,
   "id": "dix71gy",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 19:27:37",
   "depth": 0,
   "text": "\"Let's try to find the kindest words in the world.\" That's something I've been doing... Man I love this show... \n\nAlso although Haruki is a boring character on paper, I found it funny in its own way how she deals with her situations."
  },
  {
   "score": 2,
   "id": "diymfc9",
   "pid": "t3_6h8p5y",
   "date": "2017-06-15 16:15:05",
   "depth": 0,
   "text": "You can let Misora alone with her struggles to get some friends, pair her with the most peaceful character in the show ~~best girl~~ and you have a really good first half.\n\nNow do the same but let her completely alone with her struggles about life and you have a REALLY good second half.\n\nThe nonbiri background music did it for me, this episode was everythng I like in modern anime and more. Good to see something like this between serious arcs, it also gives Misora a more human look. Waiting for next!"
  },
  {
   "score": 2,
   "id": "dj06esm",
   "pid": "t3_6h8p5y",
   "date": "2017-06-16 15:25:55",
   "depth": 0,
   "text": "I think this is the first time I've genuinely liked Haruki as a character. I think finally being able to see things from her perspective made her seem a little bit better written.  "
  },
  {
   "score": 5,
   "id": "diwqya1",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 13:50:49",
   "depth": 0,
   "text": "Haruki, you see a cat lying in the road that is cold and hungry, it needs your help. But you're not helping Haruki, it needs you to get food and a blanket, but you're not.\n\nWhy is that Haruki?"
  },
  {
   "score": 7,
   "id": "diws9pr",
   "pid": "t1_diwqya1",
   "date": "2017-06-14 14:14:39",
   "depth": 1,
   "text": "That hypothetical situation constrains her to only use words, so that's the most she could do."
  },
  {
   "score": 1,
   "id": "diwhqmi",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 11:07:08",
   "depth": 0,
   "text": "Excited for the next episode, introducing new characters and possibly a new conflict for Kei"
  },
  {
   "score": 3,
   "id": "dixjeba",
   "pid": "t1_diwhqmi",
   "date": "2017-06-15 02:08:32",
   "depth": 1,
   "text": "Is the new rival's name Kaku?"
  },
  {
   "score": 3,
   "id": "diy1qhh",
   "pid": "t1_dixjeba",
   "date": "2017-06-15 09:49:08",
   "depth": 2,
   "text": "Oka Eri is already one weird name too many."
  },
  {
   "score": 1,
   "id": "diwzhd6",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 16:37:49",
   "depth": 0,
   "text": "I loved this episode and was not expecting it. Totally thought it was going to be sumire related. "
  },
  {
   "score": 1,
   "id": "dix36sf",
   "pid": "t3_6h8p5y",
   "date": "2017-06-14 17:59:43",
   "depth": 0,
   "text": "I've never heard of apple ice cream but i kinda want some now"
  },
  {
   "score": 1,
   "id": "diyzwpj",
   "pid": "t3_6h8p5y",
   "date": "2017-06-15 21:45:02",
   "depth": 0,
   "text": "What was this episode? It was beautiful! But ridiculous all the same"
  },
  {
   "score": 1,
   "id": "dizu7uq",
   "pid": "t3_6h8p5y",
   "date": "2017-06-16 11:26:24",
   "depth": 0,
   "text": "So, I already liked Haruki a little, but after this Ep she's my second fav girl this season right after Megumi Katou.  \nReally good episode, it strayed a bit away from the others but managed to be still interesting as always and was probably the most amusing one we got so far.  \n"
  },
  {
   "score": 1,
   "id": "dmuc24r",
   "pid": "t3_6h8p5y",
   "date": "2017-09-10 20:32:58",
   "depth": 0,
   "text": "tfw you don't have anyone to talk to after rewatching episode 11... Just wanted to say that the talk with Nono is very much like the Little Prince and the fox."
  }
 ]
}