{
 "score": 135,
 "id": "6efqj1",
 "num_comments": 63,
 "date": "2017-05-31 08:36:13",
 "comments": [
  {
   "score": 41,
   "id": "dia1i8n",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 10:06:23",
   "depth": 0,
   "text": "Two things\n\n* Kit Kats prevent suicide.\n\n* Misora saying reset most of the episode was unnerving and kind of depressing. "
  },
  {
   "score": 8,
   "id": "diabkz6",
   "pid": "t1_dia1i8n",
   "date": "2017-05-31 13:02:44",
   "depth": 1,
   "text": "That was some pretty blatant product placement."
  },
  {
   "score": 14,
   "id": "dias0xg",
   "pid": "t1_dia1i8n",
   "date": "2017-05-31 18:42:16",
   "depth": 1,
   "text": "Kit Kat is a false cognate in Japan, and sounds like \"Kitto Kattsu\" which roughly translates to \"you will surely win.\" When I was over there in '99, people exchanged them with each other before tests as a good luck charm.\n\n[Article](http://www.telegraph.co.uk/food-and-drink/features/how-the-kitkat-became-a-phenomenon-in-japan/)"
  },
  {
   "score": 1,
   "id": "dibhtuq",
   "pid": "t1_dias0xg",
   "date": "2017-06-01 07:50:47",
   "depth": 2,
   "text": "> and sounds like \"Kitto Kattsu\" which roughly translates to \"you will surely win.\" \n\nI read somewhere on Reddit that this isn't the reason for it being given as gifts, but I don't exactly have any source for that claim."
  },
  {
   "score": 1,
   "id": "dooonoo",
   "pid": "t1_dibhtuq",
   "date": "2017-10-21 09:32:04",
   "depth": 3,
   "text": "I have japanese friends and they second that statement"
  },
  {
   "score": 14,
   "id": "diafaeq",
   "pid": "t1_dia1i8n",
   "date": "2017-05-31 14:10:44",
   "depth": 1,
   "text": "So all this time \"Break me off a a piece of that Kit Kat bar\" was a desperate cry for help?\n\n[](#ohfuck)"
  },
  {
   "score": 10,
   "id": "diar0i7",
   "pid": "t1_diafaeq",
   "date": "2017-05-31 18:19:20",
   "depth": 2,
   "text": "wubba lubba dub dub"
  },
  {
   "score": 24,
   "id": "dia2cmp",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 10:21:35",
   "depth": 0,
   "text": "Some possibilities going on through my head:\n\n1. Sumire decided to die as to not become a puppet of the Bureau.\n\n2. Same, but the Bureau will or has already revived her to control her power.\n\n3. Sumire was killed by the Bureau so they can revive her later and control her power."
  },
  {
   "score": 1,
   "id": "diay2to",
   "pid": "t1_dia2cmp",
   "date": "2017-05-31 21:01:05",
   "depth": 1,
   "text": "7 Sumire didn't die because she was not killed."
  },
  {
   "score": 2,
   "id": "dib0ut7",
   "pid": "t1_dia2cmp",
   "date": "2017-05-31 22:23:45",
   "depth": 1,
   "text": "Maybe she did kill herself but because she saw her future change from being with Kei to him being with Haruki.Maybe he fell in love with haruki before the reset that killed  sumire"
  },
  {
   "score": 11,
   "id": "dia7jor",
   "pid": "t1_dia2cmp",
   "date": "2017-05-31 11:53:19",
   "depth": 1,
   "text": "4\\. Sumire is not dead"
  },
  {
   "score": 6,
   "id": "diag99c",
   "pid": "t1_dia2cmp",
   "date": "2017-05-31 14:29:24",
   "depth": 1,
   "text": "I think I need to rewatch episodes 1 and 2 with the assumption that Sumire knows exactly what's going to happen in the future to Kei / Haruki, and her own death.\n\nedit: I've went and rewatched episodes 1 and 2. The scene right before the credits in episode 1 is Sumire jumping off the bridge where Kei and the fence lady got the KitKat. It's amazing how we all glossed over this and forgot about it."
  },
  {
   "score": 7,
   "id": "dia87q2",
   "pid": "t1_dia2cmp",
   "date": "2017-05-31 12:04:52",
   "depth": 1,
   "text": "5 An ability user from outside the Bureau decided to use Sumire."
  },
  {
   "score": 31,
   "id": "diac55b",
   "pid": "t1_dia2cmp",
   "date": "2017-05-31 13:12:41",
   "depth": 1,
   "text": "6 She didn't get any kitkat"
  },
  {
   "score": 43,
   "id": "dia5e9b",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 11:15:39",
   "depth": 0,
   "text": "#This ep is exactly why i love this show and what ive been waiting for.  \n\nWe finally get the glimpse into Kei's mind regarding Soma and resetting, and of course he blames himself.  But him deciding the only way to atone for that is to save everyone else is pretty warped in a way.  We also see that he is afraid of resets, saying that he does everything the same way so he doesnt risk changing the future needlessly.  Thats the kicker here.  He mentions how troubleing and boring it is to him, how he feels like hes acting in a boring play.  Remember when ep1 came out and everyone complained that Kei sounded very unemotional and dull?  WELL THERE IS THE ANSWER WHY!  Because for the past few years hes been repeating these days again and again and experiencing the same things numerous times, so much so that is worn him down to this point of being nearly emotionless.  Its nice to finally get confirmation that the way he acted was because of the reset and memory powers.  It also makes me think the answer to Soma's robot question is that Kei is the robot, choseing the life of monotony and shelving his emotions.  Haruki was the robot but found her emotions so shes become human, but Kei took her place i think.  \n\nHaruki spending all day trying to reset so Kei doesnt hate her was really well done too.  It was very depressing and just makes your soul hurt watching her trying over and over.  We also now know why Haruki cant use her power anymore unless Kei tells her to, because she doesnt want Kei to hate her.  \n\nIts funny how people dismissed this show so much yet here it is explaining why things are the way they are, why characters seem pretty warped.  This is some A++ writing really, to plan ahead this much is very nice.  \n\nI cant wait for next week to see how things go from here.  This show is probably going to be my season fav, i love a well written drama and with it being about powers, even better!  \n\n[](#juice1)"
  },
  {
   "score": 1,
   "id": "dia6w4n",
   "pid": "t1_dia5e9b",
   "date": "2017-05-31 11:41:57",
   "depth": 1,
   "text": "But didn't he decide to REALLY do it because he doesn't want unnecessary butterfly effect due to Sumire dying?"
  },
  {
   "score": 10,
   "id": "diabnx4",
   "pid": "t1_dia6w4n",
   "date": "2017-05-31 13:04:09",
   "depth": 2,
   "text": "Yes he chose to go through the same actions to avoid changing the future, its out of fear of causing someone to die again.  Kei has some serious trauma from all this.  \n\nAlso he just glossed over the fact that one day he threw out his house key and left home at like the age of 10 or 12... like what the hell was his homelife like to make him do that?  Thats another thing that interests me."
  },
  {
   "score": 1,
   "id": "diacice",
   "pid": "t1_diabnx4",
   "date": "2017-05-31 13:19:15",
   "depth": 3,
   "text": "Validations. He didn't receive \"validations\" from his parents. Maybe"
  },
  {
   "score": 5,
   "id": "diacsre",
   "pid": "t1_dia5e9b",
   "date": "2017-05-31 13:24:27",
   "depth": 1,
   "text": "Preach it brother. No matter what people say, we know Sakrada Reset is some A+ stuff."
  },
  {
   "score": 10,
   "id": "diao7dj",
   "pid": "t1_dia5e9b",
   "date": "2017-05-31 17:18:26",
   "depth": 1,
   "text": "I'm still sticking in there. This show doesn't excite me, and it's very boring to watch most of the time, but the ideas presented and the way they handle problems is very interesting. I can't help but think how this could have been a great show off SHAFT had animated. Just any visual excitement would have helped."
  },
  {
   "score": 1,
   "id": "dibfd2o",
   "pid": "t1_diao7dj",
   "date": "2017-06-01 07:02:35",
   "depth": 2,
   "text": "interesting and boring that's really conflicting. "
  },
  {
   "score": 1,
   "id": "dibg4ms",
   "pid": "t1_dibfd2o",
   "date": "2017-06-01 07:17:57",
   "depth": 3,
   "text": "I'm using the term boring as \"Not exciting\". Like my blood doesn't get pumping, out I don't laugh much or anything, but the narrative keeps me interested in what happens next. "
  },
  {
   "score": 6,
   "id": "diarw6q",
   "pid": "t1_diao7dj",
   "date": "2017-05-31 18:39:14",
   "depth": 2,
   "text": "I think the visuals are just fine, gorgeous even.  There is a clear style and nothing looks lacking."
  },
  {
   "score": 7,
   "id": "diatclj",
   "pid": "t1_diarw6q",
   "date": "2017-05-31 19:11:38",
   "depth": 3,
   "text": "You're not wrong. They're good, probably textbook good, they're just boring to look at IMO. "
  },
  {
   "score": 16,
   "id": "dia5fdq",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 11:16:11",
   "depth": 0,
   "text": "[That's a weird ability](https://imgur.com/a/8ugaN) \n\n\n[This is correct^(I want Kit Kat now..)](http://imgur.com/a/UKzX8)\n\n\n\nI wonder how many times Haruki said \"Reseto\" that day. Also, i got a theory- As we know from last eps. Sumire was/is able to see future. She predicted that Haruki would do a reset that day, which allowed Sumire to commit suicide and prevent anyone from rescuing Her.\n\n[FINALLY](https://imgur.com/a/QgkwY)\n\n\nSoundtrack in this episode was great, or maybe it's just me loving piano"
  },
  {
   "score": 12,
   "id": "diad0r3",
   "pid": "t1_dia5fdq",
   "date": "2017-05-31 13:28:25",
   "depth": 1,
   "text": "> She predicted that Haruki would do a reset that day, which allowed Sumire to commit suicide and prevent anyone from rescuing Her.\n\nClever. I'd wondered why she died specifically *after* Haruki's reset, and that is the obvious reason. Soma wanted to die but with Kei having access to reset, she had to wait for a time where Haruki wouldn't be able to reset to a time before her death."
  },
  {
   "score": 14,
   "id": "dia6a98",
   "pid": "t1_dia5fdq",
   "date": "2017-05-31 11:31:20",
   "depth": 1,
   "text": "> That's a weird ability\n\n(insert Trump joke here)"
  },
  {
   "score": 2,
   "id": "dia6rdf",
   "pid": "t1_dia6a98",
   "date": "2017-05-31 11:39:41",
   "depth": 2,
   "text": "I GET IT HAHAH"
  },
  {
   "score": 14,
   "id": "diad5ko",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 13:30:52",
   "depth": 0,
   "text": "*Have a break, have a Kitkat. Have a reset, have a second Kitkat.*"
  },
  {
   "score": 13,
   "id": "dia1xtw",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 10:14:10",
   "depth": 0,
   "text": "Finally, they will resume the first sub-chapter \"MEMORY in CHILDREN 3/3\" in the next episode. Kei might find out the reason why Soma Sumire wanted to commit suicide by entering into the photo.\n\nThis episode is nothing special but it brings us back to 2 years ago. It shows us why does Haruki like anything related to cat (Kei gave her the cat keychain) and why was Kei always trying to keep his acts to be the same as before the reset."
  },
  {
   "score": 12,
   "id": "dia1h1a",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 10:05:45",
   "depth": 0,
   "text": "This Kit Kat is great! Jelly-filled is my favorite! Nothing beats a jelly-filled Kit Kat!"
  },
  {
   "score": 3,
   "id": "didfl0r",
   "pid": "t1_dia1h1a",
   "date": "2017-06-02 10:49:44",
   "depth": 1,
   "text": "> jelly-filled Kit Kat!\n\nWhat the hell, I don't know if I should want one or not."
  },
  {
   "score": 8,
   "id": "dia3e6c",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 10:39:55",
   "depth": 0,
   "text": "Looks like we jumped timelines again and back to the following weeks after Sumire's supposed \"accident\". Didn't expect some product placement for Kit Kat and Koala March though."
  },
  {
   "score": 1,
   "id": "diat7s7",
   "pid": "t1_dia3e6c",
   "date": "2017-05-31 19:08:40",
   "depth": 1,
   "text": "Aren't they Koala yums or something in America? Though I don't think they've been sold in regular stores here since I was in elementary school... The chocolate ones were delicious though."
  },
  {
   "score": 8,
   "id": "diaclma",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 13:20:53",
   "depth": 0,
   "text": "God dammit, another amazing episode. The soundtrack that played when Kei had that conversation with Haruki around 2/3rds through the episode was *so* good.\n\nNot sure what we can expect from the rest of the season since there are like 16 episodes left but sure as fuck I'm hyped.\n\nNo matter what anyone says, Sakrada Reset is on its way to become my AOTS."
  },
  {
   "score": 1,
   "id": "dib9p4r",
   "pid": "t1_diaclma",
   "date": "2017-06-01 04:36:06",
   "depth": 1,
   "text": "I really like the show, and the soundtrack is decent, but would it kill anime studios to get soundtracks done with *good* pianos?"
  },
  {
   "score": 1,
   "id": "dibaynf",
   "pid": "t1_dib9p4r",
   "date": "2017-06-01 05:15:42",
   "depth": 2,
   "text": "Was that piano really bad tho? To be fair I didn't quite pay attention to the sound quality, but at the very least I found that that soundtrack sounded amazing."
  },
  {
   "score": 1,
   "id": "dicnt4x",
   "pid": "t1_dibaynf",
   "date": "2017-06-01 21:46:44",
   "depth": 3,
   "text": "I think the piano was about par, but every time I hear anime soundtracks that's the one thing I notice, so I'm pretty critical of it."
  },
  {
   "score": 1,
   "id": "diampua",
   "pid": "t1_diaclma",
   "date": "2017-05-31 16:45:09",
   "depth": 1,
   "text": "I feel the same way. I've enjoyed Sakurada Reset since Day 1, and the people who dropped it early on don't know what they're missing. Only thing getting in the way of this being my AOTS is Tsuki ga Kirei."
  },
  {
   "score": 5,
   "id": "diael1k",
   "pid": "t1_diaclma",
   "date": "2017-05-31 13:57:20",
   "depth": 1,
   "text": "> Sakrada Reset is on its way to become my AOTS.\n\nI'm glad I'm not alone. It's already AOTS for me."
  },
  {
   "score": 6,
   "id": "diaoyob",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 17:35:25",
   "depth": 0,
   "text": "This episode of Sagrada Reset is brought to you by KitKat™: Have a break, Have a KitKat. Don't jump off bridges."
  },
  {
   "score": 5,
   "id": "dia4tl5",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 11:05:22",
   "depth": 0,
   "text": "I like how it shows that Haruki didn't trust Kei with everything right from the start, but gradually developed that during the next 2 years.\n\nAnd this shows feels like Monogatari + Shinsekai Yori + HakoMari.\n\nBTW, are the Kit Kat and Koala March dialogues there in the original novel?"
  },
  {
   "score": 4,
   "id": "dia3r2q",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 10:46:18",
   "depth": 0,
   "text": "So Haruki can only reset when she feels all of her heart to do so. That means she wouldn't reset until she was completely convinced by Kei/someone to do so."
  },
  {
   "score": 5,
   "id": "dia416e",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 10:51:16",
   "depth": 0,
   "text": "Next episode, we finally get to see the third part of Memory in Children, can't wait to see Soma again."
  },
  {
   "score": 5,
   "id": "diaas0a",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 12:48:52",
   "depth": 0,
   "text": "Are you sure you ability isn't just to randomly create product placement, lady. Still I'm now regretting not buying those Japanese Kit Kats I saw at a con at the weekend, so it must be working.\n\nSo we've got a better understanding of how things work between Kei and Haruki, namely why she can't reset without him. I'm rather worried about what will happen to Haruki when Sumire returns, I've got a bad feeling we'll see her repeatedly saying \"Reset\" again.\n\nOn another note, the BGM for this show is lovely, the guitar track and the later piano one, sounded so nice."
  },
  {
   "score": 4,
   "id": "diau62h",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 19:30:01",
   "depth": 0,
   "text": "I'm really loving this show. Probably my favorite so far this year along with *Shuumatsu Nani Shitemasu ka? Isogashii desu ka? Sukutte Moratte Ii desu ka?*\n\nIt really sucks that the 2 shows I'm enjoying the most are underrated and shrugged aside"
  },
  {
   "score": 7,
   "id": "diay6v0",
   "pid": "t1_diau62h",
   "date": "2017-05-31 21:04:01",
   "depth": 1,
   "text": "From someone who loves Banchou Otome, ID-0 and Frame Arms Girl:\n\nYou merely adopted the underrated. I was born in it, molded by it. I didn't see the hype until I was already a man"
  },
  {
   "score": 3,
   "id": "diayylr",
   "pid": "t1_diay6v0",
   "date": "2017-05-31 21:25:38",
   "depth": 2,
   "text": "ID-0 and FAG are really good, Banchou is not bad but i wouldn't put it in the same category as the other two."
  },
  {
   "score": 4,
   "id": "dib9r3b",
   "pid": "t1_diayylr",
   "date": "2017-06-01 04:37:55",
   "depth": 3,
   "text": "I don't like this acronym we've developed for Frame Arms Girl..."
  },
  {
   "score": 3,
   "id": "dibhv3d",
   "pid": "t1_dib9r3b",
   "date": "2017-06-01 07:51:27",
   "depth": 4,
   "text": "What do you have against [fagotts](https://en.wikipedia.org/wiki/Bassoon)???? [Do you wanna make Mizore cry?](http://i.imgur.com/19vdxRm.png)\n\nEdit: Hibike! is not in your list, Mizore is a character from Hibike! and she plays that instrument."
  },
  {
   "score": 3,
   "id": "di9zxr4",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 09:37:50",
   "depth": 0,
   "text": "Again, back to the past. Looks like Kei will use that picture next episode.\n\nAlso if Soma Sumire really has the ability to see the future she probably just committed suicide."
  },
  {
   "score": 6,
   "id": "dia2tdc",
   "pid": "t1_di9zxr4",
   "date": "2017-05-31 10:29:44",
   "depth": 1,
   "text": "I don't think she ever died. I think they just decided to cloister her in one of their facilities to keep her prophecies from affecting the future she predicts, like they did with the Witch.\n\nSomehow, a pure \"revival\" ability, especially one which works after two weeks (or two years for that matter), would be a really weird thing to add to this show. There's the woman with the ability to clone dead people, but hadn't she left the city and forgotten her abilities by the time Soma died? Also, we don't know if her get can have abilities."
  },
  {
   "score": 4,
   "id": "diacxu3",
   "pid": "t1_dia2tdc",
   "date": "2017-05-31 13:26:59",
   "depth": 2,
   "text": "Nah, calling it now, Soma knew that the bureau was going to try and use her so she committed suicide because she didn't want a sad life in isolation similar to that of \"the witch\".\n\nWhat's weird about that theory tho is that she should've known that if she committed suicide, kei would find a way to revive her, but that remains to be seen. However, I am sure that at the moment, Soma is 100% dead."
  },
  {
   "score": 5,
   "id": "diak9y0",
   "pid": "t1_diacxu3",
   "date": "2017-05-31 15:51:29",
   "depth": 3,
   "text": "At least for the witch, she was only able to see the future she would actually have witnessed herself, so if her ability worked the same way, Soma wouldn't know anything about Kei trying to revive her in the future because she'd be dead."
  },
  {
   "score": 3,
   "id": "diaki7h",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 15:56:27",
   "depth": 0,
   "text": "The plan is slowly starting to come together, This show's been really intense so far, and I hope to see how intense it will get in future episodes."
  },
  {
   "score": 2,
   "id": "dib2ckb",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 23:16:56",
   "depth": 0,
   "text": "I'm one week late to this anime (Not watching through Amazon after some criticism about their translation), so I have yet to watch this episode. But after watching the 8th episode, I just hope people come back to this anime, and I hope it just keeps getting better.  \nI understand why people gave up, but damn, they're managing to build such an interesting story right now and I'm hoping it turns out to be something akin to Shinsekai Yori."
  },
  {
   "score": 1,
   "id": "dia2soh",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 10:29:23",
   "depth": 0,
   "text": "What is the name of that song in the beginning? when kei is talking to the old lady."
  },
  {
   "score": 1,
   "id": "diaipi8",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 15:18:19",
   "depth": 0,
   "text": "I still have somewhat of a hard time following this show after 9 episodes, I'll probably end up going back and rewatching some episodes but overall this was pretty solid. This show can definitely be confusing at times but it manages to keep me coming back for more!\n\n"
  },
  {
   "score": 1,
   "id": "diat1ak",
   "pid": "t3_6efqj1",
   "date": "2017-05-31 19:04:37",
   "depth": 0,
   "text": "Fuck Kei, how can you listen to such a terrible joke with a straight face? XD"
  },
  {
   "score": 1,
   "id": "dibbhud",
   "pid": "t3_6efqj1",
   "date": "2017-06-01 05:30:54",
   "depth": 0,
   "text": "The discussion around this show is really weird. There is a small group of people here who love the show, and everyone else has already stopped caring"
  },
  {
   "score": 1,
   "id": "dickbwu",
   "pid": "t1_dibbhud",
   "date": "2017-06-01 20:17:59",
   "depth": 1,
   "text": "This has already been noted [last episode](https://www.reddit.com/r/anime/comments/6d36nj/spoilers_sagrada_reset_episode_8_discussion/dhzrnv9/)"
  },
  {
   "score": 1,
   "id": "die1wrg",
   "pid": "t3_6efqj1",
   "date": "2017-06-02 18:30:49",
   "depth": 0,
   "text": "Theory:\n\nWhat if Sumire was actually created by the Bureau to be the witch's successor.\n\n- The bureau is desperate to find a successor and never found one according to the witch. \n- One of the first things Sumire brings up is the android question. \n- The last thing she asks Kei is the android question, and I think Kei answered wrong. \n- Imitations of living things that weren't really real were a common theme among all her philosophical conversations with Kei.\n- She kinda knew when their friendship would end since she talked about only summer plans when they met and never said anything about plans beyond the summer (ie next school year). Thus the suicide may have been premeditated early on.  \n- Why would she talk to Haruki for a year, and wait that long to introduce her to another friend (Kei)? The reason she gives is that their types are too different. Nevertheless, there were friends for a year. Maybe she knew she didn't have much time left and wanted to introduce Haruki to a new friend as a replacement, meanwhile giving the person she loved to Haruki.\n- Mari was basically a created imitation of a human. Thus imitation of humans is a theme for Memory in Children arc. \n- Mari's issue was solved in episode 2/3 of the arc, yet that arc isn't finished. They didn't give Sumire her separate arc even though she didn't play a main role in Mari's issue, and the goal of 3/3 is presumably different: raising old friend from the dead.\n- The name if the arc has \"children\" in plural. You'll notice that nouns in other episode names are singular. Mari and Sumire may be the \"children\" and have the same struggle--the struggle portrayed throughout this arc.\n- In this episode we see a Bureau member strong enough to blow a hole in the moon in the area where Sumire jumped. She's probably not really there to build a fence. Sumire may have had Bureau ties already back then. \n- She also knew that ability copier guy who was loyal to bureau even tho girl was about to be forgotten."
  },
  {
   "score": 1,
   "id": "dooomeg",
   "pid": "t3_6efqj1",
   "date": "2017-10-21 09:31:17",
   "depth": 0,
   "text": "So how much did Kit Kat paid to sponsor this episode"
  }
 ]
}