{
 "score": 146,
 "id": "6d36nj",
 "num_comments": 95,
 "date": "2017-05-24 09:20:53",
 "comments": [
  {
   "score": 44,
   "id": "dhzfxdt",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 09:29:49",
   "depth": 0,
   "text": "Man todays ep might have been one of the best ones yet.  So much went down and so many multi layered plans in motion, its super satisfying to see Kei's plans all come together.  \n\nSo the pictures seem like they will play a bigger role later since they can be used when ever, and it seems like Kei still has that one of the dead girl by the sea wall, so i guess that will be used in the plan to save her life or something.  I love the powers they have, such interesting ones.  Im also glad the witch got out and got to go see her man before she died.  She was a cool old lady.  \n\nIm curious if red eye girl will show up again later, he powers are interesting, lots of potential like that other girl who walks through walls and shit.  \n\nNext week it seems we are heading back to the past and maybe filling gaps in the 2 years or something.  I love the flow of this show, it really keeps me wanting more.  The people who left after ep1 dont know what they are missing.  \n\n[](#juice1)"
  },
  {
   "score": 3,
   "id": "di004qv",
   "pid": "t1_dhzfxdt",
   "date": "2017-05-24 15:13:21",
   "depth": 1,
   "text": "What I'm now actually wondering, is whether or not Kei can go into a photo and make a reset.\n\nThe whole photo-ability which was added just gives quite a lot of options. Reaching from using abilities in those photos to just talking to the person in the photo and potentially changing something in the story. Or atleast... that's how I think they could be used, still not 100% sure how much changing things in a photo could do.\n\nThough on the overall progression of the story: I totally agree, it's getting better and better yet again and I'm actually at the point where I'm genuinely interested in whats happening next."
  },
  {
   "score": 5,
   "id": "di0h0ce",
   "pid": "t1_dhzfxdt",
   "date": "2017-05-24 21:29:57",
   "depth": 1,
   "text": "> So the pictures seem like they will play a bigger role later since they can be used when ever, and it seems like Kei still has that one of the dead girl by the sea wall, so i guess that will be used in the plan to save her life or something.\n\nI'm actually wondering if Haruki could go into the photo of Souma and save then reset to that time the photo was taken, or if that would just break everything."
  },
  {
   "score": 5,
   "id": "di0nq5n",
   "pid": "t1_di0h0ce",
   "date": "2017-05-25 01:45:04",
   "depth": 2,
   "text": "probably would break the world lol"
  },
  {
   "score": 2,
   "id": "di0osly",
   "pid": "t1_di0nq5n",
   "date": "2017-05-25 02:35:33",
   "depth": 3,
   "text": "someone else pointed out that \"Haruki's relationship wouldn't be the same with Sumire around\" I'm not even sure if they'd be friends since she'd forget everything, I'm betting the what Haruki said in the preview \"I don't want Kei to hate me\" or something like that might hint at it.\n\nI don't want it anymore lol."
  },
  {
   "score": 6,
   "id": "dhzstud",
   "pid": "t1_dhzfxdt",
   "date": "2017-05-24 13:00:12",
   "depth": 1,
   "text": "I suggest you rewatch episodes 1 and 2 after finishing this episode. Everything that happened between Soma and Kei makes sense now considering how everything seemed so random at the beginning."
  },
  {
   "score": 6,
   "id": "dhzsxem",
   "pid": "t1_dhzstud",
   "date": "2017-05-24 13:01:55",
   "depth": 2,
   "text": "oh im keeping up.  i plan to rewatch it all once its all out too.  I did the same with steins;gate, rewatched the series right after finishing it. haha.  You gotta do that with these time travel shows."
  },
  {
   "score": 6,
   "id": "dhzlow1",
   "pid": "t1_dhzfxdt",
   "date": "2017-05-24 11:06:40",
   "depth": 1,
   "text": "I think that the past was changed so Kei didn't receive any photo from Sasano-san in 3rd time of Wednesday IMO"
  },
  {
   "score": 3,
   "id": "di02wte",
   "pid": "t1_dhzlow1",
   "date": "2017-05-24 16:09:57",
   "depth": 2,
   "text": "I'm surprised he forfeit the photo then, unless he took a look in to it offscreen?"
  },
  {
   "score": 23,
   "id": "dhzknfv",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 10:48:35",
   "depth": 0,
   "text": "That was some interesting mucking about with the photographs and despite her kuudere nature, Haruki is reaching almost yandere levels of obsession with Kei.\n\nAlso it was interesting how they used footage of [real waves](http://i.imgur.com/1du2vVW.png) on the beach scenes, I guess that saved some animation time/budget."
  },
  {
   "score": 12,
   "id": "di0e8qr",
   "pid": "t1_dhzknfv",
   "date": "2017-05-24 20:17:11",
   "depth": 1,
   "text": "> Also it was interesting how they used footage of real waves\n\nTotally didn't even notice that..."
  },
  {
   "score": 3,
   "id": "di0x3yr",
   "pid": "t1_di0e8qr",
   "date": "2017-05-25 06:55:35",
   "depth": 2,
   "text": "Ikr? They showed 3D water wtf"
  },
  {
   "score": 17,
   "id": "dhzjayq",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 10:25:17",
   "depth": 0,
   "text": "Good episode, reminds me about how glad I am that this series got 24 episodes."
  },
  {
   "score": 15,
   "id": "dhzhrad",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 09:58:55",
   "depth": 0,
   "text": "[This line](http://i.imgur.com/omzfWPO.png) hit to close"
  },
  {
   "score": 13,
   "id": "dhzrnv9",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 12:41:32",
   "depth": 0,
   "text": "Damn, what an amazing episode. I really have to hand it to the writer, the way Kei allowed the witch to escape without Oka becoming the bureau's enemy was pretty genius. We also got a nice bit of exposition towards the end regarding Kei's role in the rest of the story.\n\nI'm still wondering how Sakrada Reset is always hanging around ~92% upvotes. Usually only shows that the community really fuckin hates are that \"low\". I suppose we got quite a few haters who will downvote every episode without watching it. Oh well, maybe when the season is all over some of them will reconsider and maybe watch it. This show really doesn't deserve to be this unpopular.\n\nEdit: Aaaand we're down to 91%... srsly -_-"
  },
  {
   "score": 2,
   "id": "di12dex",
   "pid": "t1_dhzrnv9",
   "date": "2017-05-25 08:38:11",
   "depth": 1,
   "text": ">I suppose we got quite a few haters who will downvote every episode without watching it.\n\nJust so you know, just because the people that don't like it don't post in the thread doesn't mean that they don't watch the episode. "
  },
  {
   "score": 1,
   "id": "di16el8",
   "pid": "t1_di12dex",
   "date": "2017-05-25 09:52:43",
   "depth": 2,
   "text": "Yeeah, I'm pretty sure if you're dedicated enough to watch an episode of a show you hate, then you're also dedicated enough to post in the thread."
  },
  {
   "score": 1,
   "id": "di16n4j",
   "pid": "t1_di16el8",
   "date": "2017-05-25 09:57:00",
   "depth": 3,
   "text": "> then you're also dedicated enough to post in the thread.\n\nBut those are different things. One can totally watch a show they hate without wanting to post about their hate of it. Furthermore as for myself I watch the show later in the day (like I do with almost all of the shows I watch) so most of the times the discussion threads have slowed by the time I get to them so I rarely post in them. Add to that I have friends I watch with so I can converse with them about the episode so I don't need the discussion thread as much. And when the thread seems to be positive and enjoying it is there really a point to bringing out my long list of critisims?"
  },
  {
   "score": 2,
   "id": "di17ben",
   "pid": "t1_di16n4j",
   "date": "2017-05-25 10:09:19",
   "depth": 4,
   "text": "Without actually going into your points, let me just add that if you watch how the thread's up- to downvote ratio behaves, you will notice that right after it pops up, a shit ton of downvotes seem to come in. Thread was sitting at 90% for a while, now it's back up to 94%.\n\nNow, if you fuckin hate a show then I imagine you're not too keen on watching it right as it's uploaded, rather you'll finish other stuff first and watch it when you've got the time. So why the heck do most downvotes come in right away, instead of slowly in steady intervals?\n\nAnswer is simple. People who've decided they hate the show downvote the thread the moment they see it. Obviously there'll be exceptions to the rule, but those are just that in the end, exceptions."
  },
  {
   "score": 7,
   "id": "dhzso6e",
   "pid": "t1_dhzrnv9",
   "date": "2017-05-24 12:57:38",
   "depth": 1,
   "text": "I'd just say that this show is generally hated, with some people loving it a lot. In other words, it's extremely divisive and polarizing. "
  },
  {
   "score": 5,
   "id": "dhzv1b1",
   "pid": "t1_dhzso6e",
   "date": "2017-05-24 13:38:54",
   "depth": 2,
   "text": "But I don't get why anyone would hate it. Sure, it's not Shingeki no Kyojin with amazing action scenes but its story is very interesting and people are not giving the characters enough credit when they call them 'stones'. I'm pretty sure Sakrada Reset will be one of my top ~3 seasonal anime by the end of its 2nd cour."
  },
  {
   "score": 4,
   "id": "di0plob",
   "pid": "t1_dhzv1b1",
   "date": "2017-05-25 03:12:21",
   "depth": 3,
   "text": "people that cant comprehend these shows. I will just be glad I experience this weekly and we know it's a really good show. It's their lose."
  },
  {
   "score": 13,
   "id": "dhzvpw7",
   "pid": "t1_dhzv1b1",
   "date": "2017-05-24 13:50:34",
   "depth": 3,
   "text": "Potential deal-breakers (that are fine for me, but not for others):\n\n- Monotone voice\n- Unemotive faces\n- Long monologues\n- Convoluted plot\n- Tell, don't show"
  },
  {
   "score": 9,
   "id": "dhzvz0o",
   "pid": "t1_dhzso6e",
   "date": "2017-05-24 13:54:59",
   "depth": 2,
   "text": "I don't know why, I get a shinsekai yori vibe."
  },
  {
   "score": 2,
   "id": "di0bnrv",
   "pid": "t1_dhzvz0o",
   "date": "2017-05-24 19:18:27",
   "depth": 3,
   "text": "Same. That's the reason I'm watching this anime. I just love how things come together, the mystery and the mindfuck. It really is a bummer though how many people write it off as a terrible show."
  },
  {
   "score": 2,
   "id": "dhzw05n",
   "pid": "t1_dhzvz0o",
   "date": "2017-05-24 13:55:32",
   "depth": 3,
   "text": "And here I thought I was alone. It's probably because of the large amount of exposition and the occasional blood-splattering."
  },
  {
   "score": 2,
   "id": "di0t4e7",
   "pid": "t1_dhzw05n",
   "date": "2017-05-25 05:19:05",
   "depth": 4,
   "text": "It's also pretty calm. Apart from a few parts in Shinsekai, it was generally pretty calm and a bit slow (in a good way)"
  },
  {
   "score": 4,
   "id": "di070by",
   "pid": "t1_dhzw05n",
   "date": "2017-05-24 17:37:25",
   "depth": 4,
   "text": "I think these last 3 episodes really increased the comparison; there is a town full of people with \"abilities\" that is controlled by a shadowy \"bureau\" that knows secretive information that a group of kids are trying to figure out."
  },
  {
   "score": 2,
   "id": "di071io",
   "pid": "t1_di070by",
   "date": "2017-05-24 17:38:02",
   "depth": 5,
   "text": "I didn't think of that before."
  },
  {
   "score": 11,
   "id": "dhzzytm",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 15:09:58",
   "depth": 0,
   "text": "Two words, HOLY FUCK.\nI love this shit, good mystery/midnfucky shows are rare these days ffs"
  },
  {
   "score": 10,
   "id": "dhzgjlv",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 09:39:40",
   "depth": 0,
   "text": "This was actually a pretty interesting episode even if i spent most of it confused and trying to figure out exactly what was happening.\n\nI am left with one question but it is possible it is just me forgetting something, why didn't Murase reset? Can she use her ability to negate two things at the same time?"
  },
  {
   "score": 3,
   "id": "di01meh",
   "pid": "t1_dhzgjlv",
   "date": "2017-05-24 15:43:15",
   "depth": 1,
   "text": "Her ablility is to erase anything she is touching, including other people's abilities, abstract concepts, even the laws of physics.  We've seen her negate the Reset ability before."
  },
  {
   "score": 5,
   "id": "dhzrt00",
   "pid": "t1_dhzgjlv",
   "date": "2017-05-24 12:43:51",
   "depth": 1,
   "text": "Murase is basically Haruki's hardcounter. She can use her ability to become immune to his ability. So she jumped out of the window to leave the building, and when Haruki used reset, Murase was immune to it so while the rest of the world changed to its previous state, she didn't. If you go back to that episode, something like that was also mentioned in her fight against Kei, something along the lines of Kei could reset, but he would respawn right before her, implying that she'd be unaffected by it."
  },
  {
   "score": 1,
   "id": "dhzsrec",
   "pid": "t1_dhzrt00",
   "date": "2017-05-24 12:59:05",
   "depth": 2,
   "text": "But when Murase jumped off the building she used her ability again to negate gravity and not fall to her death, that is why i am asking if she can negate two things at the same time, if she can't then she would have reset with everyone else."
  },
  {
   "score": 1,
   "id": "dhzsw9g",
   "pid": "t1_dhzsrec",
   "date": "2017-05-24 13:01:20",
   "depth": 3,
   "text": "Did you read the other comment?"
  },
  {
   "score": 1,
   "id": "dhztf9u",
   "pid": "t1_dhzsw9g",
   "date": "2017-05-24 13:10:48",
   "depth": 4,
   "text": "I did, not sure he is right, i was expecting someone to tell me she can use multiple at the same time x)"
  },
  {
   "score": 2,
   "id": "dhzzemf",
   "pid": "t1_dhztf9u",
   "date": "2017-05-24 14:58:45",
   "depth": 5,
   "text": "I can't remember, was it said that her ability cannot be used concurrently?\n\nAssuming it can be, she negated abilities before tearing the photograph, 5 minutes (or was it seconds?) hasn't passed yet, hence when she passed through the wall and negated gravity, abilities are still negated."
  },
  {
   "score": 6,
   "id": "di0dkcy",
   "pid": "t1_dhztf9u",
   "date": "2017-05-24 20:01:05",
   "depth": 5,
   "text": "Yes she can, but 1 command only works for 5 minutes. Remember last time when she fought against Kei, she commaned her body to erase the gravel and human body at the same time."
  },
  {
   "score": 4,
   "id": "di09a12",
   "pid": "t1_dhzrt00",
   "date": "2017-05-24 18:26:25",
   "depth": 2,
   "text": "So you're telling me she continues to age after the reset? Since her time didn't get reset while everyone else's does. That's interesting. "
  },
  {
   "score": 4,
   "id": "dhzhot2",
   "pid": "t1_dhzgjlv",
   "date": "2017-05-24 09:57:50",
   "depth": 1,
   "text": "I think reset happened after she landed, so she switched to \"Full body - Ability\" before that."
  },
  {
   "score": 8,
   "id": "dhzsx42",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 13:01:47",
   "depth": 0,
   "text": "That was the best episode if you like abilities and how they can be used in a plan. Kei's a mastermind lol"
  },
  {
   "score": 6,
   "id": "dhzl2hu",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 10:55:50",
   "depth": 0,
   "text": "I have really mixed feelings about Kei and Haruki's relationship. On one hand, it's so genuine, but on the other hand, it's so unhealthy.\n\nAlso, has anybody else realized that the ED begins with a pool of blood?"
  },
  {
   "score": 7,
   "id": "dhzlgq8",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 11:02:54",
   "depth": 0,
   "text": "So Kei got a picture Sumire who died as a present. Same location where they were seen talking on a beach which was in the beginning of this arc I think. So in other words we can expect an arc where Kei tries to save her? I'm looking forward to that.\n\nAlso I like Kei's plans more and more. Uses everything at his disposal and I like how they used the photos to escape, but episode left me confused on a couple parts. So home girl ran into the room and copied the photo ability and ripped it to moments earlier. While Sasano took photos of the empty hallway. These photos don't get reset which is how they escape eventually. Where did the first empty photo come from I thought the people were in the way? Also why did she jump out of the building was that really needed for the reset? \n\nReally enjoyed the episode, but I'm a little lost. "
  },
  {
   "score": 4,
   "id": "di0h1r1",
   "pid": "t1_dhzlgq8",
   "date": "2017-05-24 21:31:09",
   "depth": 1,
   "text": "> So Kei got a picture Sumire who died as a present. Same location where they were seen talking on a beach which was in the beginning of this arc I think. So in other words we can expect an arc where Kei tries to save her? I'm looking forward to that.\n\nI'm actually wondering if Haruki could go into the photo of Souma and save then reset to that time the photo was taken, or if that would just break everything."
  },
  {
   "score": 7,
   "id": "dhzmhfa",
   "pid": "t1_dhzlgq8",
   "date": "2017-05-24 11:19:09",
   "depth": 1,
   "text": "Of course it was needed that she jumped out of the building before the reset, or else she would be stuck in that room after the reset and the Bureau will find her then and know something's going on. Also it was needed so the photos don't dissappear."
  },
  {
   "score": 12,
   "id": "dhzm1wi",
   "pid": "t1_dhzlgq8",
   "date": "2017-05-24 11:12:27",
   "depth": 1,
   "text": "The home girl ripped the photo just want to get the Bureau officer out of their way by making him into the photo world, like what Red Eyes Girl had done before.\n\nLater on, she jumped out of the building was necessary because she would be trapped inside the building after Resetting since she had made the ability ineffective on her whole body"
  },
  {
   "score": 7,
   "id": "dhzjidf",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 10:28:51",
   "depth": 0,
   "text": "i have a question here:\n\nIs that a person can possess the Sasano-san's ability again while he or she is right in the photo? \n\nIf not then I would be confused about Witch's way of escaping from Bureau. Or had she just used the photo taken from the view of her room?\n\nMy explanation on her way of escaping is: There are 2 photos taken by Sasano-san: the view from the elevator (A), and the view from Witch's room with the door opened (B). Firstly, she tore up the Photo B and walked out of the room until the end of the corridor which is in front of the elevator. Then she tore up the Photo A enter the photo and walked toward the part that was not taken in the Photo A (like what Kei had done earlier). And so, she back to the reality world and escaped the room successfully.\n\nI would say these 3ep (subchapter) is bringing up the pace a lot and it is getting better and better. It's definitely an underrated anime, based on what I can see so far. I am so glad that people in this thread for giving so much attention to this show. Let us enjoy this show together to the very end"
  },
  {
   "score": 15,
   "id": "dhzncan",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 11:32:52",
   "depth": 0,
   "text": "This anime is really under watched. Back in an other thread many people called this the worst of the season.\n\nI don't get it... That being said I'm gonna get a lot of fun of this one. I'm so glad this is 20+ episodes long.     "
  },
  {
   "score": 15,
   "id": "dhzx3h4",
   "pid": "t1_dhzncan",
   "date": "2017-05-24 14:15:16",
   "depth": 1,
   "text": "A lot of people just couldn't get over the stylistic choices in voice acting and facial animation. Their loss."
  },
  {
   "score": 1,
   "id": "di0exzv",
   "pid": "t1_dhzx3h4",
   "date": "2017-05-24 20:34:23",
   "depth": 2,
   "text": "Which is weird, it doesn't look strange or even bad."
  },
  {
   "score": 1,
   "id": "di279gv",
   "pid": "t1_di0exzv",
   "date": "2017-05-25 23:01:39",
   "depth": 3,
   "text": "At the same it's not as expressive as other shows so I understand where they are coming from\n\nThat said the sound/music direction is simply superb. If my Japanese listening isn't this shit I would like to try just listen to this show"
  },
  {
   "score": 5,
   "id": "dhzqu5y",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 12:28:25",
   "depth": 0,
   "text": "Aoi Yuuki - please come back again !"
  },
  {
   "score": 3,
   "id": "dhzs7e5",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 12:50:18",
   "depth": 0,
   "text": "So Soma faked her death?"
  },
  {
   "score": 1,
   "id": "di01225",
   "pid": "t1_dhzs7e5",
   "date": "2017-05-24 15:31:51",
   "depth": 1,
   "text": "The MC just has to tear up the photo that the old man gave him of her standing in the sunset. Then he can talk to her in the past and tell her not to go hiking that day. Then boom, she comes back to life."
  },
  {
   "score": 8,
   "id": "dhzv2qi",
   "pid": "t1_dhzs7e5",
   "date": "2017-05-24 13:39:35",
   "depth": 1,
   "text": "Pretty sure that she actually died. Just that she's going to come back to life because somehow Kei is going to save her? At least that's the impression I got."
  },
  {
   "score": 1,
   "id": "di01079",
   "pid": "t1_dhzv2qi",
   "date": "2017-05-24 15:30:50",
   "depth": 2,
   "text": "He just has to tear up the photo that the old man gave him of her standing in the sunset.  Then he can talk to her in the past and tell her not to go hiking that day.  Then boom, she comes back to life."
  },
  {
   "score": 16,
   "id": "di074py",
   "pid": "t1_di01079",
   "date": "2017-05-24 17:39:51",
   "depth": 3,
   "text": "In my understanding, the person in the photograph is merely a copy of the real person."
  },
  {
   "score": 2,
   "id": "di0pvod",
   "pid": "t1_di074py",
   "date": "2017-05-25 03:24:37",
   "depth": 4,
   "text": "maybe he can make the copy real with some ability, pull her out of the picture lol."
  },
  {
   "score": 3,
   "id": "di0vjsq",
   "pid": "t3_6d36nj",
   "date": "2017-05-25 06:21:12",
   "depth": 0,
   "text": "wait, wouldnt the two photos the old man gave him be reset? I mean, I guess he could just get them off the man again since they still exist"
  },
  {
   "score": 2,
   "id": "dhzjlmj",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 10:30:25",
   "depth": 0,
   "text": "Love how Kei easily schooled Eri. That's some Lelouch levels of advanced planning. Also I totally forgot that Sumire's power is predicting the future. So her death was all a setup by The Bureau all along? Now I'm curious how Kei will go against them and save Sumire, or will Sumire even want to be saved at all?"
  },
  {
   "score": 2,
   "id": "dhzmqg2",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 11:23:11",
   "depth": 0,
   "text": "This episode was really intresting to see, I can't wait to see how Kei's plans all come into action."
  },
  {
   "score": 1,
   "id": "di278h5",
   "pid": "t1_dhzmqg2",
   "date": "2017-05-25 23:00:38",
   "depth": 1,
   "text": "So many different chess pieces at his disposal\n\nInb4 it's all a mission to resurrect Sumire and the subsequent actions. Inb4 the ghost girls ability plays a part as well   "
  },
  {
   "score": 2,
   "id": "di00wfs",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 15:28:45",
   "depth": 0,
   "text": "I'm a little confused as to how the old man's powers work exactly, and how the Witch was able to use them to escape.  Did the photo overwrite the present because it was taken at the exact same time she tore it in half?  They didn't really explain it all that well."
  },
  {
   "score": 7,
   "id": "di03npr",
   "pid": "t1_di00wfs",
   "date": "2017-05-24 16:25:53",
   "depth": 1,
   "text": "I think you can change your position in the photo. So she was able to walk through the open door and go back to reality where the door was closed, but at a different position."
  },
  {
   "score": 1,
   "id": "di27cur",
   "pid": "t1_di03npr",
   "date": "2017-05-25 23:05:11",
   "depth": 2,
   "text": "So... Soul Weaver?"
  },
  {
   "score": 14,
   "id": "di06f9m",
   "pid": "t1_di03npr",
   "date": "2017-05-24 17:25:08",
   "depth": 2,
   "text": "Exactly. You can see this when Kei uses the picture on the beach and has a conversation with the Witch from the past; after he is done speaking to her, he leaves the picture world, looks down, and sees his footsteps, meaning he moved in the picture world and in the real world."
  },
  {
   "score": 2,
   "id": "di0b7m3",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 19:08:27",
   "depth": 0,
   "text": "Our ~~Edge~~Lord and Saviour Kei saves the day again lol\n\n\n\nSo if Souma knows that she is the successor of the Witch does that mean that she already planned her suicide cause she knows that she is going to be used by the Bureau?\n\n\nDamn this shows gets really interesting thank god i didn't drop this\n\n\nLooking forward for the next episode"
  },
  {
   "score": 2,
   "id": "dhzujo5",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 13:30:28",
   "depth": 0,
   "text": "I really like this show, but I don't think I've ever hated the voice for an anime song as much as I do this ending theme. "
  },
  {
   "score": 1,
   "id": "dhzx070",
   "pid": "t1_dhzujo5",
   "date": "2017-05-24 14:13:39",
   "depth": 1,
   "text": "I like it better than the Myriad Colors: Phantom World OP's voice."
  },
  {
   "score": 1,
   "id": "dhzyckx",
   "pid": "t1_dhzx070",
   "date": "2017-05-24 14:38:26",
   "depth": 2,
   "text": "Really? That one didn't bother me at all. "
  },
  {
   "score": 2,
   "id": "dhzyqyw",
   "pid": "t1_dhzyckx",
   "date": "2017-05-24 14:46:02",
   "depth": 3,
   "text": "Yeah... the voice was highlighted because there was a decent period before the voice came in and I always thought \"Oh, I guess this is one of those OP's I won't skip\" until the guy started singing, when I promptly jumped 75 seconds forward."
  },
  {
   "score": 1,
   "id": "dhzzz7j",
   "pid": "t1_dhzyqyw",
   "date": "2017-05-24 15:10:11",
   "depth": 4,
   "text": "Ah, I hear it now. It still doesn't bother me all that much, but I think what really bothers me about Reset's song is how the very first line is super whiney-emo sounding. Musaigen's is more like... mmm... kinda childish? I'm bad at describing sounds sorry. "
  },
  {
   "score": 3,
   "id": "di0pynr",
   "pid": "t1_dhzujo5",
   "date": "2017-05-25 03:28:11",
   "depth": 1,
   "text": "i somewhat like the ending actually."
  },
  {
   "score": 8,
   "id": "di0gs5c",
   "pid": "t1_dhzujo5",
   "date": "2017-05-24 21:23:24",
   "depth": 1,
   "text": "> I don't think I've ever hated the voice for an anime song as much as I do this ending theme.\n\nThey did the OP for Noragami Aragoto :( not sure if it's the same singer though but I'm loving this song."
  },
  {
   "score": 1,
   "id": "di15rle",
   "pid": "t1_di0gs5c",
   "date": "2017-05-25 09:41:01",
   "depth": 2,
   "text": "Haven't sen Noragami, but I looked up that opening and I like the song. I'm not sure if it's the same singer either though. The voice sounds similar, but the ending of Reset's singer like... slurs all his words together kind of ish, and that OP doesn't sound like that at all. -shrugs- Who knows. It's cool you like the song - I really like the show, so I'd feel sad for it if there weren't people enjoying the ending theme. "
  },
  {
   "score": 3,
   "id": "di18g4f",
   "pid": "t1_di15rle",
   "date": "2017-05-25 10:29:56",
   "depth": 3,
   "text": "Definitely, recommend it. A lot of fun/funny stuff, then a bit of seriousness followed by emotional bits, with cool action and a lot of sadness(not in that order though, don't quote me :P) \n\n> slurs all his words together kind of ish\n\nThat's kinda why I like it though, what I do hate or dislike is [this](https://youtu.be/wNXY2Fx2Pq4?t=7m21s) at the end of the song the way his voice kinda like fluctuates mixed with his voice(when it shows [the house](http://i.imgur.com/29kVZXT.png)) I guess? I don't like that much."
  },
  {
   "score": 1,
   "id": "di1g6b1",
   "pid": "t1_di18g4f",
   "date": "2017-05-25 12:50:37",
   "depth": 4,
   "text": "Do you mean that kind of vaguely sheep bleating sound? In which case, I have to assume you're not a huge fan of Gackt (he uses it more than any other singer I've heard). Like [here.](https://youtu.be/zVOsgkWbcSg?t=86) Or the [opening](https://www.youtube.com/watch?v=iWsuDdREkIU) for Trickster Edogawa Ranpo."
  },
  {
   "score": 2,
   "id": "di1gkdn",
   "pid": "t1_di1g6b1",
   "date": "2017-05-25 12:57:42",
   "depth": 5,
   "text": "Exactly that, Especially with their voice types... Cant stand it, now even more so that they actually do vaguely sound like sheep lol."
  },
  {
   "score": 3,
   "id": "di1nc7r",
   "pid": "t1_di1gkdn",
   "date": "2017-05-25 15:08:18",
   "depth": 6,
   "text": "lmao sorry for alerting you to that. I love Gackt, but listening to his sheep noise always makes me laugh. "
  },
  {
   "score": 1,
   "id": "dhzmgic",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 11:18:45",
   "depth": 0,
   "text": "Hadn't had a good headache since Orange. Although this episode ha an inception/ looper feel in it."
  },
  {
   "score": 1,
   "id": "dhzof1a",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 11:50:10",
   "depth": 0,
   "text": "So Soma Saito's ability is...\n\ndid she commit ?\nbecause she can ..."
  },
  {
   "score": 1,
   "id": "dhzskxw",
   "pid": "t1_dhzof1a",
   "date": "2017-05-24 12:56:09",
   "depth": 1,
   "text": "It's Sumire Soma."
  },
  {
   "score": 1,
   "id": "di07bk7",
   "pid": "t1_dhzskxw",
   "date": "2017-05-24 17:43:45",
   "depth": 2,
   "text": "Yup :p "
  },
  {
   "score": 1,
   "id": "dhzqx1i",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 12:29:38",
   "depth": 0,
   "text": "Some confusing timelines here.  The Witch knew about the photos, since she knows the future.   But in the original timeline she didn't, or at least acted as if she didn't.  So does she know all possible timelines?"
  },
  {
   "score": 2,
   "id": "dhzs1pd",
   "pid": "t1_dhzqx1i",
   "date": "2017-05-24 12:47:50",
   "depth": 1,
   "text": "I think she only knows her \"current\" timeline. So, for example, if someone rips a photo and someone from within the photo does something that changes this timeline... no wait that doesn't really make a lot of sense because she would know about that...\n\nI believe in most cases it's simply best not to think too hard on things like this. Time travel and telling the future are basically always huge paradoxons that can't be handled without a single logical fault."
  },
  {
   "score": 1,
   "id": "di2abjg",
   "pid": "t1_dhzs1pd",
   "date": "2017-05-26 01:13:35",
   "depth": 2,
   "text": "My impression was that the world in the photos is \"fake\" and only changes to the person who went in carry over, so it basically doesn't mess with the timeline. And they couldn't give the witch the photos until after the most recent reset, so she didn't know about them until then either. "
  },
  {
   "score": 1,
   "id": "di2bax3",
   "pid": "t1_di2abjg",
   "date": "2017-05-26 02:03:52",
   "depth": 3,
   "text": "> My impression was that the world in the photos is \"fake\" and only changes to the person who went in carry over\n\nYou are absolutely right about that, but that doesn't mean what happens in the photos can't change the present. Which would mean that something happening in the photos can indeed (or can it not?) mess with the timeline.\n\nNow, the problem is, if the witch can see the future, then she would also see Haruki's resets, when they happen, what happens before them, and what happens in the timelines after that. But apparently she doesn't, because as I said time travelling and shit always leads to huge paradoxons. Combine that time travelling with someone who can see the future and you've got yourself some A+ mind fuck content. Poor writer trying to make all that fit together nicely."
  },
  {
   "score": 1,
   "id": "dhzvuw7",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 13:53:01",
   "depth": 0,
   "text": "Anyone know the name of the song thats played when the MC is talking to the old lady about him already knowing the next successor? near the end of the episode."
  },
  {
   "score": 1,
   "id": "di0e0qn",
   "pid": "t3_6d36nj",
   "date": "2017-05-24 20:11:47",
   "depth": 0,
   "text": "Hum... I share everyone else's opinion, this was a really good episode, but... I feel kind of *basic* that the point of this anime is to show how smart Kei is, he is always the one doing the reasoning, elaborating the plans and then using everybody's powers to realize it.\n\nFor example, in Code Geass we have chances when Zero really is outsmarted, but I guess this is just because only 8 episodes passed. We still have a lot to see, glad this is two-cour. This is one of those shows I'd like to read the LN of. \n\nNext step is resurrecting Sumire? I don't know how that is going to work, but I know Kei will have a plan by the time something needs to be done. Enjoying this so far, waiting for more!"
  },
  {
   "score": 5,
   "id": "di0gyex",
   "pid": "t1_di0e0qn",
   "date": "2017-05-24 21:28:21",
   "depth": 1,
   "text": "> Next step is resurrecting Sumire? I don't know how that is going to work, but I know Kei will have a plan by the time something needs to be done. Enjoying this so far, waiting for more!\n\nI'm actually wondering if Haruki could go into the photo of Souma and save then reset to that time the photo was taken, or if that would just break everything."
  },
  {
   "score": 2,
   "id": "di0hqak",
   "pid": "t1_di0gyex",
   "date": "2017-05-24 21:51:22",
   "depth": 2,
   "text": "Well... Yeah, we have enough time travel shit with Haruki, the ability nullification (forgot her name, sorry), and the photos.\n\nLet's see... Doing that, they both would time travel 2 years in the past. Kei would see his own self two years ago in the context of the photo, and... I think him and Haruki's relationship wouldn't be the same with Sumire around, so that would make the two from the future a complete mindfucking paradox. Except there are multiple timelines, like in Steins;Gate.\n\ntl;dr: Please, Kei, don't."
  },
  {
   "score": 1,
   "id": "di0i4u0",
   "pid": "t1_di0hqak",
   "date": "2017-05-24 22:04:03",
   "depth": 3,
   "text": "> Please, Kei, don't.\n\nYou're right lol, that's is a nightmare we don want hahaha."
  },
  {
   "score": 1,
   "id": "di4t82o",
   "pid": "t3_6d36nj",
   "date": "2017-05-27 19:07:45",
   "depth": 0,
   "text": "Is this show still kind of boring? I started when it first came out, got busy with school and im still on episode 2. "
  },
  {
   "score": 2,
   "id": "di5b5yd",
   "pid": "t1_di4t82o",
   "date": "2017-05-28 06:59:18",
   "depth": 1,
   "text": "The entire thing is a giant puzzle, and it's fascinating"
  },
  {
   "score": 1,
   "id": "dife14m",
   "pid": "t3_6d36nj",
   "date": "2017-06-03 18:10:39",
   "depth": 0,
   "text": "I'm confused about the photograph ability and the aftermath of the witch's escape.\n\nSo it seems they took two photos to connect the hallway to the elevator?\n\nThe photograph stops after 5 minutes, so I'm guessing her location doesn't reset back into her room?  And that is how she escaped?  Does that mean if you are standing on top of a tiny plant many years ago, you'd die 5 minutes later inside a grown tree?  Theoretically.\n\nOkay, suppose I am correct so far....wouldn't the bureau who is watching her 24/7 see that she disappeared?  Wouldn't they go crazy searching for her?  Or is it because they know she will die soon, so they might just leave her alone?\n\nEven if they do leave her alone, wouldn't that put them on high alert on trying to find out who helped her?"
  }
 ]
}