{
 "score": 747,
 "id": "65fnbn",
 "num_comments": 254,
 "date": "2017-04-14 15:23:14",
 "comments": [
  {
   "score": 147,
   "id": "dg9wg3k",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:02:14",
   "depth": 0,
   "text": "[Rita's still the best](https://i.imgur.com/IHvi2Ch.jpg).\n\nShould be interesting to see how all of these narrative threads develop. Azazel and Kaisar's interactions, human advancements and their usurping both heaven and hell, demon slavery, dragon people that don't seem to fit the angel/human/demon model... And we're only on the second episode.\n\nED was pretty cute. Some development post-credits, too. [Today's endcard is Azazel](https://i.imgur.com/Qo3NYG6.jpg)!"
  },
  {
   "score": 9,
   "id": "dgc5tll",
   "pid": "t1_dg9wg3k",
   "date": "2017-04-16 08:38:17",
   "depth": 1,
   "text": "I am not endorsing slavery and think that what the humans are doing is atrocius but Azazel seems to be a little bit of a hypocrite.  Like the ind of exploitation that is happening to them now was happening to humans as they were basically forced to worship another creature in order to survive.  Literally Azazel himself killed favarros and Kaiser parents just to amuse himself. "
  },
  {
   "score": 1,
   "id": "dgfdnc0",
   "pid": "t1_dgc5tll",
   "date": "2017-04-18 09:42:12",
   "depth": 2,
   "text": "He's an hypocrite, but so is Kaisar. Characters aren't about being perfectly right but about doing what they believe is right, and Azazel believes demons should massacre humans, not vice-versa."
  },
  {
   "score": 23,
   "id": "dga8rtg",
   "pid": "t1_dg9wg3k",
   "date": "2017-04-14 20:49:57",
   "depth": 1,
   "text": ">Rita's still the best.\n\nI have no idea what she actually said, but that translation is fantastic (and Rita is also fantastic, as always)."
  },
  {
   "score": 64,
   "id": "dga9cf7",
   "pid": "t1_dga8rtg",
   "date": "2017-04-14 21:05:35",
   "depth": 2,
   "text": "Literally, I think the structure of the play on words is similar. Instead of `rag -> nag`, though, it's `hōtai -> hentai` for `bandage -> pervert`."
  },
  {
   "score": 34,
   "id": "dga9uf8",
   "pid": "t1_dga9cf7",
   "date": "2017-04-14 21:19:52",
   "depth": 3,
   "text": "Heh, that just makes it even better.  Props to whomever did that translation."
  },
  {
   "score": 47,
   "id": "dga7jv2",
   "pid": "t1_dg9wg3k",
   "date": "2017-04-14 20:17:26",
   "depth": 1,
   "text": "[Here's](http://i.imgur.com/4EsLdpG.png) a higher quality version of the endcard with no TV station logo if you want. [Here's](http://i.imgur.com/c9gCyap.png) episode 1's endcard too."
  },
  {
   "score": 1,
   "id": "dgj91c7",
   "pid": "t1_dga7jv2",
   "date": "2017-04-20 14:39:30",
   "depth": 2,
   "text": "Holy shit, he looks like Killua from hxh in this endcard... all grown up and somehow having acquired demon powers."
  },
  {
   "score": 103,
   "id": "dg9vie5",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 15:41:16",
   "depth": 0,
   "text": "Zombie loli is finally back! Also, never thought I'd feel sympathy for the demons."
  },
  {
   "score": 3,
   "id": "dgb7dld",
   "pid": "t1_dg9vie5",
   "date": "2017-04-15 14:30:29",
   "depth": 1,
   "text": "> never thought I'd feel sympathy for the demons.\n\nEasy when all the demons we encounter are humanoid very close to human standard of beauty."
  },
  {
   "score": 48,
   "id": "dga0e5h",
   "pid": "t1_dg9vie5",
   "date": "2017-04-14 17:29:29",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 77,
   "id": "dga0wzn",
   "pid": "t1_dga0e5h",
   "date": "2017-04-14 17:41:03",
   "depth": 2,
   "text": "They did play it pretty well in s1. Where we got told what Azazel did to Favarro's and Kaisar's families. And the whole plot basically up to the end. "
  },
  {
   "score": 92,
   "id": "dga1qsq",
   "pid": "t1_dga0wzn",
   "date": "2017-04-14 17:59:34",
   "depth": 3,
   "text": "Yeah, dunno what that guy's on about, Azazel was most certainly a villain that did terrible things for his own personal gain. He orchestrated the death of Favaro's father just so he could amuse himself with the resulting drama. He's not the victim, he just happens to be currently losing.\n\nHaving said that, his horrid actions in the past wouldn't excuse the enslavement of the demons."
  },
  {
   "score": 1,
   "id": "dgaix80",
   "pid": "t1_dga1qsq",
   "date": "2017-04-15 03:38:04",
   "depth": 4,
   "text": "man I don't know anything about s1 anymore and I watched it not too long ago. Guess it's pretty forgettable, probably because it has so many different elemts going on, probably too many, like right now in s2."
  },
  {
   "score": 35,
   "id": "dga3x2p",
   "pid": "t1_dga1qsq",
   "date": "2017-04-14 18:49:26",
   "depth": 4,
   "text": "The demons in this series are certainly evil, but only in the old school DND sense. They have their rules and motivations and they aren't always just going around killing people for no reason, but they are almost entirely self serving. Everything they do is, in the end, entirely dedicated to the benefit of themselves and themselves alone. If someone else profits as an unintended side effect they don't mind in the slightest, and they are more than willing to go along with the plans of others if those plans coincide with their own, but they'd never do anything if they weren't the ones who stood to gain the most from doing it.\n\nAs we saw in season one there were demons who were more than willing to betray Satan himself just to get to the top of the pecking order, but even those demons never intended to destroy the world or anything like that since they wouldn't gain anything from doing so.\n\nCompare this to the Angels who were in comparison far more cooperative with both human and one another, and significantly more self sacrificing. "
  },
  {
   "score": 3,
   "id": "dgapotg",
   "pid": "t1_dga3x2p",
   "date": "2017-04-15 07:43:19",
   "depth": 5,
   "text": "> They have their rules and motivations and they aren't always just going around killing people for no reason, but they are almost entirely self serving. Everything they do is, in the end, entirely dedicated to the benefit of themselves and themselves alone.\n\nSounds awfully like humans "
  },
  {
   "score": 2,
   "id": "dgb0nmw",
   "pid": "t1_dgapotg",
   "date": "2017-04-15 11:58:08",
   "depth": 6,
   "text": "The difference between Humans and Demons/Angels is that they have way more variance within them. They range from Chaotic Evil to Lawful Good and everything in between, unlike Demons and Angels who seem to stick to their respective good/evil categories pretty exclusively."
  },
  {
   "score": 21,
   "id": "dgaa7p0",
   "pid": "t1_dga3x2p",
   "date": "2017-04-14 21:30:37",
   "depth": 5,
   "text": "> As we saw in season one there were demons who were more than willing to betray Satan himself just to get to the top of the pecking order\n\nSatan was already gone by the start of the anime since he turned himself into the Demon Key, while Zeus turned himself into the God Key. I assume you meant Lucifer, who was the de facto leader of the demons after Satan was transformed."
  },
  {
   "score": 2,
   "id": "dgb0h4k",
   "pid": "t1_dgaa7p0",
   "date": "2017-04-15 11:54:06",
   "depth": 6,
   "text": "No I meant Satan. Like you said Satan turned himself into the Demon Key, but he did so specifically to seal away Bahamut. For one of the demons to go directly against his will and try to use that key to reawaken Bahamut would constitute a betrayal in my opinion. "
  },
  {
   "score": 4,
   "id": "dgad2rd",
   "pid": "t1_dgaa7p0",
   "date": "2017-04-14 23:02:56",
   "depth": 6,
   "text": "I can't remember Lucifer in S1 at all, I can only remember Azazel and Belzeebub as the big players on the demon side. I know he was mentioned by name, but did he appear at all?"
  },
  {
   "score": 2,
   "id": "dgagnz6",
   "pid": "t1_dgad2rd",
   "date": "2017-04-15 01:37:40",
   "depth": 7,
   "text": "I think he was the one with the books."
  },
  {
   "score": 10,
   "id": "dgadzwo",
   "pid": "t1_dgad2rd",
   "date": "2017-04-14 23:37:30",
   "depth": 7,
   "text": "He appears a few times, briefly. He does look a lot like Azazel so you might have conflated the two together."
  },
  {
   "score": 77,
   "id": "dga2l5h",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 18:18:55",
   "depth": 0,
   "text": "God we don't deserve this anime and 24 episodes of it."
  },
  {
   "score": 5,
   "id": "dgfdt4b",
   "pid": "t1_dga2l5h",
   "date": "2017-04-18 09:45:03",
   "depth": 1,
   "text": "Gabriel blesses us!"
  },
  {
   "score": 10,
   "id": "dgd1kbe",
   "pid": "t1_dga2l5h",
   "date": "2017-04-16 20:26:34",
   "depth": 1,
   "text": "24? really! Hell to the YESSSSSS. Just made my day kind internet stranger."
  },
  {
   "score": 23,
   "id": "dgawdki",
   "pid": "t1_dga2l5h",
   "date": "2017-04-15 10:20:51",
   "depth": 1,
   "text": "They did so much with 12 now lets see the grand spectacle that is 23"
  },
  {
   "score": 146,
   "id": "dg9ysui",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:54:08",
   "depth": 0,
   "text": "FAAAAAVARRRROOOOOO!\n\nhttp://i.imgur.com/Stwqitb.png"
  },
  {
   "score": 26,
   "id": "dgadtp0",
   "pid": "t1_dg9ysui",
   "date": "2017-04-14 23:30:45",
   "depth": 1,
   "text": "His entrance will probably be the demon tail shenanigans and end up getting sold as a demon slave."
  },
  {
   "score": 8,
   "id": "dgawu1r",
   "pid": "t1_dgadtp0",
   "date": "2017-04-15 10:31:16",
   "depth": 2,
   "text": "The two most likely options for his reappearance are either him being in trouble or him coming to the rescue of someone. NOot sure which it will be."
  },
  {
   "score": 1,
   "id": "dgbrj5n",
   "pid": "t1_dgawu1r",
   "date": "2017-04-15 23:06:49",
   "depth": 3,
   "text": "will nina get turn on by farvarooo"
  },
  {
   "score": 1,
   "id": "dgc5zm6",
   "pid": "t1_dgbrj5n",
   "date": "2017-04-16 08:42:04",
   "depth": 4,
   "text": "I mean hes favaro of course she will!  Epsicially since they made him sexy af."
  },
  {
   "score": 56,
   "id": "dga87cg",
   "pid": "t1_dg9ysui",
   "date": "2017-04-14 20:34:32",
   "depth": 1,
   "text": "Favaro confirmed, now we wait for his arrival. /s In all seriousness the show seems like it'll do great without him, I like how they've made Azazel more sympathetic in his goals (I still absolutely hate the guy), but if Favaro does show up (in the second half possibly?) it'd be perfect, considering he's the reason a lot of people loved the first series so much (plus the bromantic reunion scene we'd get between him and Kaisar)"
  },
  {
   "score": 28,
   "id": "dgaa44z",
   "pid": "t1_dga87cg",
   "date": "2017-04-14 21:27:44",
   "depth": 2,
   "text": "Remember how Favaro still had his demon tail at the end of the last season? "
  },
  {
   "score": 7,
   "id": "dgabt2o",
   "pid": "t1_dgaa44z",
   "date": "2017-04-14 22:18:31",
   "depth": 3,
   "text": "OHHH SHIT! Maybe they'll both make a return? That would be amazing, that would be the most fanservice thing they could do."
  },
  {
   "score": 19,
   "id": "dgaehx7",
   "pid": "t1_dgaa44z",
   "date": "2017-04-14 23:57:53",
   "depth": 3,
   "text": "That's false. The demon tail is last seen [genesis spoilers](/s \"right before the kiss with Amira\") and I always thought to myself that she lifted the curse that way at the very end. At least it's not shown yet. "
  },
  {
   "score": 95,
   "id": "dg9vhl1",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 15:40:46",
   "depth": 0,
   "text": "After this episode, I think it's necessary to watch the first season, we might get a lot of interaction between Kaisar and Azazel. I'm really looking foward to the rest of this.\n\nSadly, it seems that we won't be seeing Favaro soon. The OP was pretty good, though I am not sure if it fits the anime atmosphere.\n"
  },
  {
   "score": 1,
   "id": "dgbcj7y",
   "pid": "t1_dg9vhl1",
   "date": "2017-04-15 16:33:17",
   "depth": 1,
   "text": "It's essentially a hella long running gag that whenever Nina and Favaro are fated to meet, Nina will fall head over heels love at first sight and instantly Dragon Out"
  },
  {
   "score": 3,
   "id": "dga8lg1",
   "pid": "t1_dg9vhl1",
   "date": "2017-04-14 20:45:13",
   "depth": 1,
   "text": "wherer is Favaro? i cant really remember s1"
  },
  {
   "score": 36,
   "id": "dgafuq3",
   "pid": "t1_dga8lg1",
   "date": "2017-04-15 00:57:44",
   "depth": 2,
   "text": "Favaro is traveling the world trying to find a way to bring back his waifu"
  },
  {
   "score": -3,
   "id": "dgamoay",
   "pid": "t1_dgafuq3",
   "date": "2017-04-15 06:16:04",
   "depth": 3,
   "text": "is his waifu the girl from episode 1? what happened to her?"
  },
  {
   "score": 13,
   "id": "dgb1i8y",
   "pid": "t1_dgamoay",
   "date": "2017-04-15 12:16:45",
   "depth": 4,
   "text": "his waifu is Amira, the main girl from season 1"
  },
  {
   "score": 0,
   "id": "dgb4ve0",
   "pid": "t1_dgb1i8y",
   "date": "2017-04-15 13:32:49",
   "depth": 5,
   "text": "..so what happened to her..?"
  },
  {
   "score": 2,
   "id": "dgb5cs8",
   "pid": "t1_dgb4ve0",
   "date": "2017-04-15 13:43:38",
   "depth": 6,
   "text": "inside the bahamunt? idk"
  },
  {
   "score": 6,
   "id": "dgb5rko",
   "pid": "t1_dgb4ve0",
   "date": "2017-04-15 13:52:58",
   "depth": 6,
   "text": "hmmm did you watch the first season (genesis)? the answer for that is kinda spoilery. i highly recommend watching it if you didnt, especially if you're enjoying this virgin soul."
  },
  {
   "score": -1,
   "id": "dgb5u5o",
   "pid": "t1_dgb5rko",
   "date": "2017-04-15 13:54:35",
   "depth": 7,
   "text": "I think I stopped about 2-3 episodes before the end. "
  },
  {
   "score": 0,
   "id": "dgb7k60",
   "pid": "t1_dgb5u5o",
   "date": "2017-04-15 14:34:34",
   "depth": 8,
   "text": "ah yea, halfway through it went downhill for a bit, but the bromance at the end was well worth it."
  },
  {
   "score": 40,
   "id": "dg9zrlh",
   "pid": "t1_dg9vhl1",
   "date": "2017-04-14 17:15:45",
   "depth": 1,
   "text": "Yea, though to be fair neither did the OP for the first season. Also, the OP does a lot better job of fitting the atmosphere then the ED. While adorable, I don't think it's wise to go with that kind of tone right after we were immersed in the horrible oppression of demons at the hands of humans."
  },
  {
   "score": 8,
   "id": "dgaazuv",
   "pid": "t1_dg9zrlh",
   "date": "2017-04-14 21:53:22",
   "depth": 2,
   "text": "I think it works as a contrast to the OP."
  },
  {
   "score": 66,
   "id": "dga6zzk",
   "pid": "t1_dg9zrlh",
   "date": "2017-04-14 20:03:18",
   "depth": 2,
   "text": "I believe the ED is fitting, since it's all about how pure and naive Nina is."
  },
  {
   "score": 46,
   "id": "dg9xhlp",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:25:22",
   "depth": 0,
   "text": "This ED is great, I'm so happy for DAOKO!"
  },
  {
   "score": 8,
   "id": "dgaddh0",
   "pid": "t1_dg9xhlp",
   "date": "2017-04-14 23:13:53",
   "depth": 1,
   "text": "THAT'S WHO IT WAS! I thought it sounded familiar..."
  },
  {
   "score": 39,
   "id": "dga19kt",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:48:58",
   "depth": 0,
   "text": "AZAZEL BEST GIRL"
  },
  {
   "score": 75,
   "id": "dg9ztzv",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:17:12",
   "depth": 0,
   "text": "I love her little horny moments."
  },
  {
   "score": 51,
   "id": "dgapo6s",
   "pid": "t1_dg9ztzv",
   "date": "2017-04-15 07:42:52",
   "depth": 1,
   "text": "She needs to turn \"You wouldn't like me when I'm horny.\" into \"That's my secret, I'm always horny.\""
  },
  {
   "score": 30,
   "id": "dg9xbad",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:21:31",
   "depth": 0,
   "text": "Rita's [special](http://i.imgur.com/L4QBNff.jpg) [move](http://i.imgur.com/w4rbfL9.jpg) is back!\n\nI enjoyed this episode more than the first. I like how now demons are now at the bottom of the totem pole. Expecting all out war to happen soon.\n\nThere's also an after credit scene so don't miss that.\n\nAnd the [endcard](http://i.imgur.com/edDo2FQ.jpg) looks amazing"
  },
  {
   "score": 9,
   "id": "dgag6ht",
   "pid": "t1_dg9xbad",
   "date": "2017-04-15 01:13:28",
   "depth": 1,
   "text": "Endcard is trying to make more than just Nina aroused, I see."
  },
  {
   "score": 24,
   "id": "dgaa34z",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 21:26:54",
   "depth": 0,
   "text": "So far this is everything I could want out of a Rage of Bahamut sequel. The animation is still amazing, the goofiness and comedy has been cranked up to a higher level and simultaneously so has the darkness and grey morality. Seems like Azazel is going to be a main recurring character so it'll be interesting to see how our former villain develops. "
  },
  {
   "score": 71,
   "id": "dg9wn8m",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:06:42",
   "depth": 0,
   "text": "#MY GOD THAT OP.  \n\nGives so many familiar feels of \"They say BLACK or WHITE but the world is so GRAYYYYY\"  \n\nThis is just so good.  Man.  Seeing Rita again was great, shes as snarky as ever, also her assistant is great.  Still no Favaro yet but its only a matter of time...  \n\nAlso that ED is great too, man the music is great.  \n\n[](#combo)"
  },
  {
   "score": 6,
   "id": "dgaiy9t",
   "pid": "t1_dg9wn8m",
   "date": "2017-04-15 03:39:35",
   "depth": 1,
   "text": "I think the op doesn't fit at all for this medieval setting. It's pretty good on its own though."
  },
  {
   "score": 9,
   "id": "dgar3ao",
   "pid": "t1_dgaiy9t",
   "date": "2017-04-15 08:17:53",
   "depth": 2,
   "text": "[But Genesis was much the same.](https://www.youtube.com/watch?v=nsi_gBdRdt4)"
  },
  {
   "score": -7,
   "id": "dgar6xm",
   "pid": "t1_dgar3ao",
   "date": "2017-04-15 08:20:19",
   "depth": 3,
   "text": "didn't even remember that. it is pretty forgettable."
  },
  {
   "score": 21,
   "id": "dgaiz4t",
   "pid": "t1_dgaiy9t",
   "date": "2017-04-15 03:40:50",
   "depth": 2,
   "text": "I mean its a pretty heavy fantasy world, fitting of heavy music.  \n\n[](#whowouldathunkit)"
  },
  {
   "score": 5,
   "id": "dgaj21x",
   "pid": "t1_dgaiz4t",
   "date": "2017-04-15 03:45:08",
   "depth": 3,
   "text": "clearly."
  },
  {
   "score": 8,
   "id": "dgafb14",
   "pid": "t1_dg9wn8m",
   "date": "2017-04-15 00:32:45",
   "depth": 1,
   "text": "I'm pretty sure that it's the same band for the OP."
  },
  {
   "score": 4,
   "id": "dgai5it",
   "pid": "t1_dgafb14",
   "date": "2017-04-15 02:57:04",
   "depth": 2,
   "text": "Yeap, SiM did both the OPs so far."
  },
  {
   "score": 19,
   "id": "dga3vtx",
   "pid": "t1_dg9wn8m",
   "date": "2017-04-14 18:48:41",
   "depth": 1,
   "text": "Hey, Favaro *did* at least appear in the ED!"
  },
  {
   "score": 20,
   "id": "dg9w6es",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 15:56:14",
   "depth": 0,
   "text": "That kid looks pretty OP lol. He was able to cancel the Knights magic. I wonder just WHO that kid is 'cause that power is pretty OP. The king calls him \"Holy Child\", so probably has ties to the Gods somehow."
  },
  {
   "score": 1,
   "id": "dgb9g9q",
   "pid": "t1_dg9w6es",
   "date": "2017-04-15 15:18:24",
   "depth": 1,
   "text": "He could be Amira's child making him part Angel and Demon."
  },
  {
   "score": 5,
   "id": "dgaedn2",
   "pid": "t1_dg9w6es",
   "date": "2017-04-14 23:52:58",
   "depth": 1,
   "text": "When it showed his eyes as 2 different colours I thought maybe he was a angel/demon hybrid."
  },
  {
   "score": 39,
   "id": "dga2r3k",
   "pid": "t1_dg9w6es",
   "date": "2017-04-14 18:22:44",
   "depth": 1,
   "text": "*Or possibly a reincarnation of Archangel Michael...*"
  },
  {
   "score": 3,
   "id": "dgalwtv",
   "pid": "t1_dga2r3k",
   "date": "2017-04-15 05:49:32",
   "depth": 2,
   "text": "That would fit with the fact that I think that Jeanne is going to have a bigger role this season. Since we had a YouTube short with her and kaiser.  Akin to the one with kaiser and favaro.\n\n[Spoilers short](/s  \" in that short she talks about how she regrets her weakness with her becoming a demon and killing Michael.\" )\n."
  },
  {
   "score": 22,
   "id": "dgahkpc",
   "pid": "t1_dga2r3k",
   "date": "2017-04-15 02:25:52",
   "depth": 2,
   "text": "Never thought about that.  \nIf he is only 10 years old then it would match since Micheal also died then.  \nI would love for this to be true because Azazel and \"Michael\" going around on adventures together sounds entertaining af."
  },
  {
   "score": 13,
   "id": "dgahqod",
   "pid": "t1_dgahkpc",
   "date": "2017-04-15 02:34:43",
   "depth": 3,
   "text": "Quite a fitting development if proven correct, considering that they used to wage an unending war against each other and are now buddies."
  },
  {
   "score": 8,
   "id": "dgalhtx",
   "pid": "t1_dgahqod",
   "date": "2017-04-15 05:34:24",
   "depth": 4,
   "text": "Considering Azazel is a fallen angel, then he and Michael interacted as at least comrade prior to their war against each other. So actually, it would be more like former buddies becoming buddies again."
  },
  {
   "score": 33,
   "id": "dg9z3db",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:00:43",
   "depth": 0,
   "text": "Loving Nina's VA, she's giving a performance that I haven't quite heard in any other anime to this day. Nina's voice is quite unique imo.\n\nFun and interesting episode. Azazel should stop being so forceful on Nina. Thank goodness Rita was there to put him in his place. \n\nRita is fun to see as always. That little hand she has as an assistant is a... bit too specific. I mean, the existence of this hand will surely hint a moment in the story where literally no one can do a move and it will time for the hand to give a hand (Pun intended) to get everyone free.\n\nIn the encounter of Kaisar with Azazel, I'm with Kaisar. If Azazel keeps killing people this only will give Charioce the justification so the citizens and everyone go in a rampage and kill demons, and seeing how easily they hindered Azazel in the end of the episode, the moment they have the support of the citizen they will raid every demon to the ground. \n\nAnd with Nina: We learned that she does know that she transforms into a Dragon, and that her village is one that is full of half-dragon people that can transform. Something with her transformation seems to be particular though, since she doesn't seem to remember her time being a Dragon, something that it doesn't seems to be the case with the other half-dragon people. And the existence of this half-dragon people seems to be a secret in itself. This gives into the question that maybe Bahamut is itself a half-dragon that could have lost control that comes from this village, and as Nina itself when Bahamut transformed it lost control. It is an interesting thing to think about, and Nina is surely a charming MC to look for :)\n\nThis ED... I didn't expected it to be this cutesy xD, I laughed when Favaro passed in the background behind bars. I also saw someone that looks an awful lot like Amira, but it is for a brief moment so I can be wrong. The little \"Holy Chid\" appears almost at the end with another clothes. Kaisar seems the perfect handsome dude for Nina. Azazel still is an ass with Nina. And even Glasses-kun, the one that we saw in one of the PVs, appears at the very end.\n\nI'm loving the show so far. It is great :)"
  },
  {
   "score": 1,
   "id": "dgalc7j",
   "pid": "t1_dg9z3db",
   "date": "2017-04-15 05:28:38",
   "depth": 1,
   "text": "Both Kaiser and Azazel are in the right. The humans are too drunk on their own prosperity to ever care. No one is going to fight for the demons other than themselves. Azazel's kill all the humans plan isn't that smart either. And it would eventually fail, he doesn't have that much power and he knows it. However, Kaiser is off too. He's aiding abetting the very man who allows and promotes all these atrocities to go on. And also he knows all the bad that's happening, knows how horrible it is, and yet does NOTHING. Like Azazel said, it actually make him lower than the people actually doing the real crimes. Even Rita is helping in her own way. What is Kaiser doing nothing. \nSo, right now, Azazel is doing the only thing he can to free his people even though he knows his own power isn't enough. He really needs someone with more power, and also a more calm and meticulous brain. Someone who can plan as well as fight. "
  },
  {
   "score": 3,
   "id": "dgartmc",
   "pid": "t1_dgalc7j",
   "date": "2017-04-15 08:35:12",
   "depth": 2,
   "text": "Lets be honest here, if we were in Kaisar shoes probably we wouldn't know what to do either, but, imo, that doesn't make Kaisar lower than the humans that are abusing and killing the demon race. I mean, he isn't killing demons, that alone would put him above the ones that actually are killing them or putting them into slavery. \n\nYeah, he isn't doing something either, but I believe it is not because he thinks everything that is happening is something just. I believe that he is not doing anything because only killing the humans doing the abuse and the killing would enable Charioce the support of the citizens of the kingdom to kill all demons, and Kaisar knows pretty well that he can do that. It doesn't matter how powerful the Holy Child is, I don't think he can win against a battalion of magic armoured soldiers.\n\nKaisar isn't taking the easy way out, that is killing the humans, and that puts him above those humans that abuse and kill demonkind. He just can't devise a plan to save the demonkind without afterward Charioce killing them all, and that puts him even above Azazel, that is just taking the easy way out with a plan that is destined to fail and be the demise of all demonkind in the end. He needs to take a couple of steps back and take a look to what he is doing, and maybe team with Kaisar instead of fighting him so Kaisar would act as some kind of spy and together free demonkind with a fraction of the struggle and problems Azazel faces everytime he goes in Batman mode."
  },
  {
   "score": 3,
   "id": "dgdansl",
   "pid": "t1_dg9z3db",
   "date": "2017-04-17 01:59:56",
   "depth": 1,
   "text": "She does remember, pretty well too.\n\nIt's like coming out of a drunken torpor."
  },
  {
   "score": 2,
   "id": "dgdikht",
   "pid": "t1_dgdansl",
   "date": "2017-04-17 07:06:23",
   "depth": 2,
   "text": "Now she needs to do something regarding controlling it xD, other than that, surely it is pretty interesting."
  },
  {
   "score": 3,
   "id": "dgdjcxp",
   "pid": "t1_dgdikht",
   "date": "2017-04-17 07:24:36",
   "depth": 3,
   "text": "She'll be ass kicking at will just like amira except with extra airhead."
  },
  {
   "score": 2,
   "id": "dgdjj3z",
   "pid": "t1_dgdjcxp",
   "date": "2017-04-17 07:28:29",
   "depth": 4,
   "text": ":D She will be kicking ass and blushing at the same time when she's transformed into a dragon, kicking ass and Kaisar by some reason is riding on her because he needs to get somewhere in the middle of the battle."
  },
  {
   "score": 2,
   "id": "dgdjqzk",
   "pid": "t1_dgdjj3z",
   "date": "2017-04-17 07:33:25",
   "depth": 5,
   "text": "QUICK CUE THE UNAMUSED RITA LOOKING AT KAISAR RIDING DORAGON GURL"
  },
  {
   "score": 1,
   "id": "dgdlwn9",
   "pid": "t1_dgdjqzk",
   "date": "2017-04-17 08:18:44",
   "depth": 6,
   "text": "Add the hand on Rita's left shoulder gaving for no good reason for good measure!"
  },
  {
   "score": 3,
   "id": "dgb4avk",
   "pid": "t1_dg9z3db",
   "date": "2017-04-15 13:19:53",
   "depth": 1,
   "text": "> The little \"Holy Chid\" appears almost at the end with another clothes\n\nThat made me question this kid's gender. This show is seriously lacking in the female department... MAL only lists Sofiel as a new waifu. And it seems like Belphegor won't show up after her short scene in ep1 :("
  },
  {
   "score": 2,
   "id": "dgb6ac0",
   "pid": "t1_dgb4avk",
   "date": "2017-04-15 14:05:06",
   "depth": 2,
   "text": "Lets wait. Maybe between Nina, Sofiel, the Holy Child and Jeanne the waifus department can be completed without the need for another waifu. Although an appearance from Amira isn't totally out of the realm of possibility, I think we will have more than enough, especially with Jeanne. It will be interesting to see where she is after the things she did 10 years ago."
  },
  {
   "score": 2,
   "id": "dgc6g4n",
   "pid": "t1_dgb6ac0",
   "date": "2017-04-16 08:52:30",
   "depth": 3,
   "text": "Im definitely thinking amira is going to either show up at the seasons mid finale or its finale.  One of the two."
  },
  {
   "score": 1,
   "id": "dgcahgq",
   "pid": "t1_dgc6g4n",
   "date": "2017-04-16 10:21:17",
   "depth": 4,
   "text": "It would be awesome if she appears. I wonder if she turns into a half-dragon now that she is united with Bahamut."
  },
  {
   "score": 3,
   "id": "dga9lyv",
   "pid": "t1_dg9z3db",
   "date": "2017-04-14 21:13:13",
   "depth": 1,
   "text": "I like your theory of Bahamut maybe being a half dragon, it would be sk cool to see his human body, maybe he's related somehow to Charioce"
  },
  {
   "score": 11,
   "id": "dgab12m",
   "pid": "t1_dg9z3db",
   "date": "2017-04-14 21:54:24",
   "depth": 1,
   "text": "I'm kind of in the middle with Kaiser and Azazel. Yeah, Kaiser is absolutely right that killing humans will only add fuel to the fire of the hatred of demons, but then again, what right does he, as someone who lives in a society that has benefitted from the subjugation of demons, have to tell Azazel this when it is the humans who are undoubtedly doing much more damage? It's complicated."
  },
  {
   "score": 1,
   "id": "dganla2",
   "pid": "t1_dgab12m",
   "date": "2017-04-15 06:44:50",
   "depth": 2,
   "text": "It is not about the right to tell someone or not. Kaisar tells Azazel to think about the future and not so much on the immediate gain. I mean, if Azazel solely focused on freeing the demon race instead of killing everyone I bet he would be leagues more successful, while freeing even more captives, and posing a question within the citizens that maybe not all the demon race is bad as the legends have told."
  },
  {
   "score": 8,
   "id": "dgafwrn",
   "pid": "t1_dgab12m",
   "date": "2017-04-15 01:00:28",
   "depth": 2,
   "text": "Although when you also factor in the fact that Azazel murdered humans (Kaiser and Favaro's fathers) for fun as well, it kinda goes down the drain. "
  },
  {
   "score": 38,
   "id": "dgac0z3",
   "pid": "t1_dgab12m",
   "date": "2017-04-14 22:25:44",
   "depth": 2,
   "text": "Given that Azazel arranged the death of Kaisar's father simply for his own amusement, I'd say Kaisar has every right to lecture Azazel on the cycle of revenge."
  },
  {
   "score": 4,
   "id": "dgalg7a",
   "pid": "t1_dgac0z3",
   "date": "2017-04-15 05:32:45",
   "depth": 3,
   "text": "But at the same time, the very survival of a whole race of people is only being helped by Azazel's escapades. Is he to simply sit back and let the king and all of humanity continue, and Kaiser is cowardly doing? Sure the past between Kaiser and Azazel applies to them personally, but should that factor what the lives of an entire race or at stake?"
  },
  {
   "score": 11,
   "id": "dgam24x",
   "pid": "t1_dgalg7a",
   "date": "2017-04-15 05:54:54",
   "depth": 4,
   "text": "I doubt Kaisar's decisions have anything to do with cowardice - the question facing him is where his duty lies. Besides, the whole point of the discussion was that Azazel may not be achieving much to help demons with his random murders here and there."
  },
  {
   "score": 47,
   "id": "dga3i9y",
   "pid": "t1_dg9z3db",
   "date": "2017-04-14 18:40:15",
   "depth": 1,
   "text": "The hand is a left hand, Kaisar lost his left hand. *Thinking..*"
  },
  {
   "score": 2,
   "id": "dgb1k97",
   "pid": "t1_dga3i9y",
   "date": "2017-04-15 12:17:59",
   "depth": 2,
   "text": "i wonder what else does she use that hand for, since she used to be so close to him :D"
  },
  {
   "score": 2,
   "id": "dgb9zm4",
   "pid": "t1_dgb1k97",
   "date": "2017-04-15 15:31:16",
   "depth": 3,
   "text": "Scratch an itch? :)"
  },
  {
   "score": 8,
   "id": "dgbdyc3",
   "pid": "t1_dgb1k97",
   "date": "2017-04-15 17:05:38",
   "depth": 3,
   "text": "She holds it."
  },
  {
   "score": 4,
   "id": "dgbqbz6",
   "pid": "t1_dgbdyc3",
   "date": "2017-04-15 22:24:10",
   "depth": 4,
   "text": "*LEWD*"
  },
  {
   "score": 5,
   "id": "dgabtjl",
   "pid": "t1_dga3i9y",
   "date": "2017-04-14 22:18:59",
   "depth": 2,
   "text": "Did he lose a leg too?"
  },
  {
   "score": 13,
   "id": "dgac1i3",
   "pid": "t1_dgabtjl",
   "date": "2017-04-14 22:26:13",
   "depth": 3,
   "text": "Favaro lost a leg, Kaisar didn't."
  },
  {
   "score": 17,
   "id": "dga40c6",
   "pid": "t1_dga3i9y",
   "date": "2017-04-14 18:51:29",
   "depth": 2,
   "text": "I like this theory."
  },
  {
   "score": 5,
   "id": "dgabi3p",
   "pid": "t1_dga40c6",
   "date": "2017-04-14 22:08:53",
   "depth": 3,
   "text": "Like holy hell that makes soo much sense when you think of it that way\n"
  },
  {
   "score": 24,
   "id": "dga3zws",
   "pid": "t1_dga3i9y",
   "date": "2017-04-14 18:51:13",
   "depth": 2,
   "text": "I see, the one that needed a hand was Rita then... xD\n\nI totally forgot about that, but it may very well be the same hand. It will be hilarious to see if Kaisar makes a reaction if he sees his hand."
  },
  {
   "score": 43,
   "id": "dg9vv4s",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 15:49:11",
   "depth": 0,
   "text": "THAT OP! Love that comic style, it’s like a mixture of Gangsta & Drifters (which I both loved). The song will take some getting used to, however. As for the ED, it’s sooooo charming! \n\n- I need Hand-kun in every Rita scene complementing her, just like in the beginning! \n \n- At least Nina acknowledges her thirstiness, though I hope we get an explanation as to why she literally cannot function in the presence of a male. It’s the one thing dragging her character down for me.\n\n- That ending tho...it seems Mugaro has some angel in him. Another angel/demon hybrid would be very much welcome this season.\n\nSeems like this season will go for a more grounded, semi-political (?) approach, compared to S1’s high-fantasy environment. Didn’t expect all this slavery, racial discrimination, genocide and (hinted) corruption in the government, but I like it. Also totally fine with Kaisar acting as a deuteragonist in a separate plotline from Nina’s.\n"
  },
  {
   "score": -26,
   "id": "dg9y8te",
   "pid": "t1_dg9vv4s",
   "date": "2017-04-14 16:41:47",
   "depth": 1,
   "text": "Too bad that the songs for both OP's are terrible. Not many people like metal so it seems a bit odd to have it.  \nBut the visuals were really good."
  },
  {
   "score": 16,
   "id": "dg9z7i7",
   "pid": "t1_dg9y8te",
   "date": "2017-04-14 17:03:17",
   "depth": 2,
   "text": "I feel like plenty of people enjoy heavy music. Even if you don't like \"metal,\" calling the songs terrible seems a little over the top. "
  },
  {
   "score": 1,
   "id": "dgbvfgg",
   "pid": "t1_dg9vv4s",
   "date": "2017-04-16 02:11:19",
   "depth": 1,
   "text": "Regarding Nina's thirst, I'm thinking her getting, well, aroused is the trigger for her becoming a dragon. Episode 1 had her transform by being so close to Azazel, this episode had a strange cut-away every time she looked Azazel's way, and the ED has her transforming when she bumps into some dude.\n\nShe also mentions in her \"letter\" to her mom that the way she can turn into a dragon is something unique, so maybe it's something like that."
  },
  {
   "score": 6,
   "id": "dgambj4",
   "pid": "t1_dg9vv4s",
   "date": "2017-04-15 06:03:59",
   "depth": 1,
   "text": "In her defence, Azazel is a really pretty guy."
  },
  {
   "score": 8,
   "id": "dgajsh1",
   "pid": "t1_dg9vv4s",
   "date": "2017-04-15 04:22:21",
   "depth": 1,
   "text": "Hearing rumors of an Angel/Demon hybrid might be the thing that brings us Favaro's entrance. He could be looking around the world for Amira after all. But still....where's Jeanne?! She joined the Orleans Knights again with Kaisar, but still no sign of her."
  },
  {
   "score": 1,
   "id": "dgb3mmt",
   "pid": "t1_dgajsh1",
   "date": "2017-04-15 13:04:28",
   "depth": 2,
   "text": ">where's Jeanne?!\n\nAs one of the few female knights, i bet she's being 'disciplined' for betraying them in a very comfy room :D"
  },
  {
   "score": 2,
   "id": "dgb70ip",
   "pid": "t1_dgb3mmt",
   "date": "2017-04-15 14:22:03",
   "depth": 3,
   "text": "> Jea\nDoujin when? Also, please tell me you're a Mushoku fan.\n"
  },
  {
   "score": 1,
   "id": "dgb7n4v",
   "pid": "t1_dgb70ip",
   "date": "2017-04-15 14:36:21",
   "depth": 4,
   "text": "Sorry to disappoint you, but I've no idea what Mushoku is :("
  },
  {
   "score": 51,
   "id": "dg9yo6p",
   "pid": "t1_dg9vv4s",
   "date": "2017-04-14 16:51:18",
   "depth": 1,
   "text": "> That ending tho...it seems Mugaro has some angel in him. Another angel/demon hybrid would be very much welcome this season.\n\nI think Mugaro IS an angel. Azazel didn't really say he was a demon. he only mentioned that they removed Mugaro's wings and crushed his windpipe."
  },
  {
   "score": 5,
   "id": "dg9yy2u",
   "pid": "t1_dg9yo6p",
   "date": "2017-04-14 16:57:26",
   "depth": 2,
   "text": "I assumed demon because in S1, the humans worship angels and so far in S2, they've been shown to be overly-abusive to demons. \n\nIf he's an angel, it would show how far-removed this era is from S1, since this king and his society seem scummy as hell.\n"
  },
  {
   "score": 36,
   "id": "dg9z3a3",
   "pid": "t1_dg9yy2u",
   "date": "2017-04-14 17:00:40",
   "depth": 3,
   "text": "Last episode did start with the King and the Onyx Knights attacking a Holy Sanctuary and killing a bunch of angels."
  },
  {
   "score": 22,
   "id": "dga079p",
   "pid": "t1_dg9z3a3",
   "date": "2017-04-14 17:25:14",
   "depth": 4,
   "text": "I'm here for a demon/angel buddy cop spinoff with Azazel & Mugaro."
  },
  {
   "score": 3,
   "id": "dgal7dv",
   "pid": "t1_dg9yo6p",
   "date": "2017-04-15 05:23:20",
   "depth": 2,
   "text": "I doubt he's an angel, or at least ONLY an angel. If he was, the green forbidden would have affected him just as it did the ones Charioce killed in the beginning."
  },
  {
   "score": 33,
   "id": "dga6dp7",
   "pid": "t1_dg9yo6p",
   "date": "2017-04-14 19:48:17",
   "depth": 2,
   "text": "Mugaro's Heterochromia seems unlikely to be accident, though. "
  },
  {
   "score": 12,
   "id": "dgafsqd",
   "pid": "t1_dga6dp7",
   "date": "2017-04-15 00:55:12",
   "depth": 3,
   "text": "Plus it was given *a lot* of attention right at the end."
  },
  {
   "score": 41,
   "id": "dga1t91",
   "pid": "t1_dg9vv4s",
   "date": "2017-04-14 18:01:05",
   "depth": 1,
   "text": "> It’s the one thing dragging her character down for me.\n\nOne fun thing about it, though, is how it plays with \"dragons hungry for virgins\" trope."
  },
  {
   "score": 18,
   "id": "dga6jga",
   "pid": "t1_dga1t91",
   "date": "2017-04-14 19:52:14",
   "depth": 2,
   "text": "I guess you could say it's \"Dragon\" her down ;)"
  },
  {
   "score": 6,
   "id": "dgai34f",
   "pid": "t1_dga6jga",
   "date": "2017-04-15 02:53:26",
   "depth": 3,
   "text": "[](#yousaidsomethingdumb)"
  },
  {
   "score": 30,
   "id": "dg9yjft",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:48:18",
   "depth": 0,
   "text": "Nobody's posted this yet, so I'ma just leave [this face here](http://imgur.com/7Ku91Bg)..."
  },
  {
   "score": 19,
   "id": "dga9055",
   "pid": "t1_dg9yjft",
   "date": "2017-04-14 20:56:14",
   "depth": 1,
   "text": "U forgot to move your mouse before you took the screenshot lol"
  },
  {
   "score": 52,
   "id": "dgaderc",
   "pid": "t1_dga9055",
   "date": "2017-04-14 23:15:08",
   "depth": 2,
   "text": "[mfw someone doesn't move their mouse before taking a screenshot](http://i.imgur.com/7Ku91Bg.jpg)\n\n"
  },
  {
   "score": 29,
   "id": "dga0wxe",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:41:01",
   "depth": 0,
   "text": "> Shingeki no Bahamut: Virgin Soul - Episode 2 discussion\n\n\"I thought you were the rag demon, not the nag demon.\"\n\n\"At least they were worth killing.\"\n\nIt feels like Hell on Earth because there are so many burns surfacing everywhere! :P\n\nI liked Nina's first letter. The small bit of narration gave us a look into her village tucked away in the forest while giving us another chance to see what Nina does on a daily basis.\n\nAlso, the oppression/moral/racism angle is quite interesting. I don't expect the anime to go into these ideas in any major way (I'd love to be wrong), but just having them there gives the plot more to work with and ultimately a greater sense of substance.\n\nOf course, the fantasy, comedy, and action should be more than enough. Nina being a cute, gung-ho MC also does wonders. :3"
  },
  {
   "score": 12,
   "id": "dga1lte",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:56:32",
   "depth": 0,
   "text": "So is Nina in heat or something? It seems like she involuntarily swoons over every cute guy face she sees which seems to be the secret of her transformation also. New op is also great; even if i do like the old song more"
  },
  {
   "score": 6,
   "id": "dgai21v",
   "pid": "t1_dga1lte",
   "date": "2017-04-15 02:51:47",
   "depth": 1,
   "text": "Must be dragon mating season. "
  },
  {
   "score": 20,
   "id": "dg9w0ri",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 15:52:41",
   "depth": 0,
   "text": "Holy fuck can the king be more of a dick? I can't wait to see what part Favaro will take in all of this."
  },
  {
   "score": 36,
   "id": "dgaioky",
   "pid": "t1_dg9w0ri",
   "date": "2017-04-15 03:25:29",
   "depth": 1,
   "text": "At least he is competent as opposed to his precedessor."
  },
  {
   "score": 7,
   "id": "dgc6jfe",
   "pid": "t1_dgaioky",
   "date": "2017-04-16 08:54:32",
   "depth": 2,
   "text": "baby steps?"
  },
  {
   "score": 11,
   "id": "dg9yg9x",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:46:20",
   "depth": 0,
   "text": "Humans ruining everything as usual. That king is just....\n\nPoor Nina the men are driving her crazy!! Wonder how still get over it and what is the origin of those dragon powers?\n\n[Rita is still savage af](http://i.imgur.com/nvHPBHz.jpg)"
  },
  {
   "score": 11,
   "id": "dga48cd",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 18:56:38",
   "depth": 0,
   "text": "That ED was awesome, really amused me.\n\nGood to see Kaisar operating on his own already. Azazel is still a dick though - him accusing *Kaisar* of supporting the callous torture of other races is the most hypocritical thing I can imagine.\n\nRita's still a lot of fun, and doesn't put up with any nonsense. I feel like she sounds a bit different though, but maybe it's just that I haven't watched the first series in a while.\n\nI don't know why people complain about Nina's instant crushes, I think they're hilarious. Her background was an interesting reveal too - a whole concealed village of dragons is a lot of power to be just hidden away."
  },
  {
   "score": 10,
   "id": "dga71oi",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 20:04:30",
   "depth": 0,
   "text": "Hey guys, Mugaro is definitely half-blooded like Amira, isn't he?"
  },
  {
   "score": 1,
   "id": "dgb4gcj",
   "pid": "t1_dga71oi",
   "date": "2017-04-15 13:23:17",
   "depth": 1,
   "text": "Is it ever mentioned that Mugaro is a boy? \"He\" has no voice actor and shows up at the ending credits with girl's clothes..."
  },
  {
   "score": 1,
   "id": "dgc4fcw",
   "pid": "t1_dgb4gcj",
   "date": "2017-04-16 08:05:45",
   "depth": 2,
   "text": "https://shingekinobahamut-virginsoul.jp/en/characters/mugaro/"
  },
  {
   "score": 1,
   "id": "dgc5wqu",
   "pid": "t1_dgc4fcw",
   "date": "2017-04-16 08:40:14",
   "depth": 3,
   "text": "I'd argue that's a mistranslation, as the Japanese site doesn't mention gender, other than \"a child\". Besides, Schrodinger's gender would be quite fitting for such an enigmatic character :D"
  },
  {
   "score": 1,
   "id": "dgc85vg",
   "pid": "t1_dgc5wqu",
   "date": "2017-04-16 09:30:58",
   "depth": 4,
   "text": "It's an official translation so it's a decent indication. Although I agree that their gender is vague at best."
  },
  {
   "score": 2,
   "id": "dgc8pnz",
   "pid": "t1_dgc85vg",
   "date": "2017-04-16 09:42:59",
   "depth": 5,
   "text": "Yea, it's official, but still could be a mistranslation. Shadowverse, another of Cygame's work, is riddled with mistranslations and gender swapping :("
  },
  {
   "score": 2,
   "id": "dgaqjgy",
   "pid": "t1_dga71oi",
   "date": "2017-04-15 08:04:47",
   "depth": 1,
   "text": "I get the feeling he's Jeanne and Michael's son with what the king said."
  },
  {
   "score": 19,
   "id": "dga7j97",
   "pid": "t1_dga71oi",
   "date": "2017-04-14 20:17:00",
   "depth": 1,
   "text": "He's still MYSTERIOUS? And Amira, for being a half-breed, usually manifested her demonic side. Mugaro seems very holy specced. "
  },
  {
   "score": 5,
   "id": "dga9m6e",
   "pid": "t1_dga7j97",
   "date": "2017-04-14 21:13:23",
   "depth": 2,
   "text": "Amira had a demon father and an angel mother right?\n\nMugaro might have the reverse, meaning the majority of the power comes from the father's side."
  },
  {
   "score": 21,
   "id": "dgaafa8",
   "pid": "t1_dga9m6e",
   "date": "2017-04-14 21:36:39",
   "depth": 3,
   "text": "She was just an artificial being created by Beelzebub from his own essence combined with Nicole's essence (the kidnapped angel)."
  },
  {
   "score": 21,
   "id": "dg9xqsy",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:30:56",
   "depth": 0,
   "text": "[Quality Pout](http://imgur.com/gallery/bVAs2qS)"
  },
  {
   "score": 10,
   "id": "dg9zbbc",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:05:37",
   "depth": 0,
   "text": "Rita best girl"
  },
  {
   "score": 10,
   "id": "dga6vyy",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 20:00:33",
   "depth": 0,
   "text": "'I thought you were a *hotai* not a *hentai*.' Teehee even I understood that one.\n\nI'll never get tired of Rita's musical chime."
  },
  {
   "score": 8,
   "id": "dg9ykyn",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:49:15",
   "depth": 0,
   "text": "Glad to see SiM back doing the OP again! EXiSTENCE was such a fucking good song and LET iT END is just equally as good! The ED is a bit different from Genesis though, while in Genesis we got Amira dancing to a dream-like song we now have Nina, Hamsa, Rocky, and a weird fluff ball thing bouncing along to a very bubbly ED. \n\nAnyway did anyone else notice the lack of Favaro in the OP? It seems like the focus is on Azazel now. I guess Favaro is now stepping back a bit and will take on more of a supporting role and we'll have Azazel as our protagonist now? \n\nNina is just great. I'm liking here more every episode. [She's a goldmine for reaction faces!](http://imgur.com/a/UAZ63)\n"
  },
  {
   "score": 1,
   "id": "dgalbeo",
   "pid": "t1_dg9ykyn",
   "date": "2017-04-15 05:27:48",
   "depth": 1,
   "text": "> SiM\n\n[Millions of Stones](https://www.youtube.com/watch?v=pA98RUV8huk)\n\n[Crows](https://www.youtube.com/watch?v=cWPoczvmFQo)\n\nI find to be nice songs from them also."
  },
  {
   "score": 1,
   "id": "dgahml6",
   "pid": "t1_dg9ykyn",
   "date": "2017-04-15 02:28:37",
   "depth": 1,
   "text": "Well, we will obviously get a second OP for the latter half. So maybe they just didn't put Favaro in this one to keep it a secret just when he will appear in the story."
  },
  {
   "score": 8,
   "id": "dga08px",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:26:07",
   "depth": 0,
   "text": "Well that's definitely my favorite OP of the season. The part where Azazel is jumping into the group of knights and his charge at the king fit nicely with the music. The color scheme is fantastic too. \n\nI'm guessing some of the higher tier demons like Lucifer are in hiding, I hope we get to see some action from him this season. Also I'm looking forward to Favaroooo's return (whenever that will be)."
  },
  {
   "score": 5,
   "id": "dga10ag",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:43:04",
   "depth": 0,
   "text": "HOLY SHIT that's a baller as fuck OP"
  },
  {
   "score": 6,
   "id": "dg9vg46",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 15:39:51",
   "depth": 0,
   "text": "is there any word on a legal stream yet?"
  },
  {
   "score": 19,
   "id": "dg9w8vx",
   "pid": "t1_dg9vg46",
   "date": "2017-04-14 15:57:46",
   "depth": 1,
   "text": "I'm pretty sure it's on [Amazon](https://www.amazon.co.uk/Red-Dragon/dp/B06Y44697M/)."
  },
  {
   "score": 4,
   "id": "dg9x001",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:14:39",
   "depth": 0,
   "text": "Huh, so we're going Mike Mignola for the OP, nice!\n\n...actually now that I think about it, Nina's dragon design is really Mignola, something about the big limbs with the impractically tiny wings, it reminds me of a lot of the demons in Hellboy."
  },
  {
   "score": 7,
   "id": "dg9zldl",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:11:55",
   "depth": 0,
   "text": "That OP doe.\n\nThe ED was pretty good too, the cute 2d side scroller vibe really fits Nina's personality well.\n\nIt's rough to see Azael, a prominent and powerful figure from the first season, to be degraded to a trash man in this season. Talk about a fall from grace. It's interesting to see that the armor that the humans are using can easily nullify Demon powers, but can be nullified themselves by God powers. Hopefully we will learn the origin of the armor's powers, and why the Gods not only forbidden them, but didn't use them for their gains. "
  },
  {
   "score": 2,
   "id": "dgait6t",
   "pid": "t1_dg9zldl",
   "date": "2017-04-15 03:32:11",
   "depth": 1,
   "text": "I feel no sympathy for Azazel. He killed both Kaisar and Favaro fathers for his own amusement, serves him right."
  },
  {
   "score": 2,
   "id": "dgc6odb",
   "pid": "t1_dgait6t",
   "date": "2017-04-16 08:57:36",
   "depth": 2,
   "text": "Yea hes a hypocrite.  I feel a good deal of sympathy for his cause but he himself can go fuckin die for all I care."
  },
  {
   "score": 5,
   "id": "dga107h",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:43:02",
   "depth": 0,
   "text": "Animation is so damn gorgeous\n\n\nedit: omg that OP reminds me of Drifters one so awesome!"
  },
  {
   "score": 6,
   "id": "dga4im7",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 19:03:28",
   "depth": 0,
   "text": "[Rita's rocket punch is super effective](http://i.imgur.com/Mn394at.png)"
  },
  {
   "score": 4,
   "id": "dga8gr0",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 20:41:33",
   "depth": 0,
   "text": "Rita's hand throwing skill is upgraded. Able to throw two hands now."
  },
  {
   "score": 4,
   "id": "dgabdhb",
   "pid": "t1_dga8gr0",
   "date": "2017-04-14 22:04:57",
   "depth": 1,
   "text": "Zombie rocket punch!"
  },
  {
   "score": 6,
   "id": "dgahbaf",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 02:11:59",
   "depth": 0,
   "text": "* Hm, still not as thirsty as r/anime.\n* I hope Rita will keep delivering on the pun front. I like her little hamburger helper there.\n* The visuals are still fantastic, and the fight scenes do tons of eye-catching things. I hope the magic doesn't just become a game of paper scissors rock though."
  },
  {
   "score": 18,
   "id": "dg9wnur",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:07:04",
   "depth": 0,
   "text": "Sick OP. Existence was better though song-wise. \n\nAlso holy fuck, Muguro! Great fucking shot of him just owning everyone and getting Azazel back. Literally godly powers (''Holy Child''). I wonder where they will go with him. \n\nI'm really rooting for the demons now, Azazel goes for the more brutal approach of killing people to get across that demons are treated like trash. Might not be the best way, i could assume though that there is no other way as the king is completely focused on complete annihalation of the demons, what a fiend.\n\nKaisar is a little bitch, that's been made really clear here now. He clearly sees that this whole situation is wrong, yet he does nothing about it (scared of losing his standing? biased cause humans get killed, too?) \n\nReally good episode."
  },
  {
   "score": 10,
   "id": "dgaw1iu",
   "pid": "t1_dg9wnur",
   "date": "2017-04-15 10:13:22",
   "depth": 1,
   "text": "To be fair to Kaisar, the demon lecturing him about the moral high ground killed his father and Favaro's father just for his amusement."
  },
  {
   "score": 25,
   "id": "dg9zk6b",
   "pid": "t1_dg9wnur",
   "date": "2017-04-14 17:11:11",
   "depth": 1,
   "text": ">  yet he does nothing about it (scared of losing his standing? biased cause humans get killed, too?)\n\nI think it's mainly that he doesn't know what to do. I mean, in S1 all he ever wanted was to be a good, upstanding, chivalrous knight. I don't think he ever expected to be working for a king hell bent on enslaving all of the demons (and presumably all of the angels.)"
  },
  {
   "score": 4,
   "id": "dg9xah5",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:21:01",
   "depth": 0,
   "text": "Bomb ass opening. The red reminds me of Persona 5"
  },
  {
   "score": 3,
   "id": "dgal3c5",
   "pid": "t1_dg9xah5",
   "date": "2017-04-15 05:18:45",
   "depth": 1,
   "text": "The visuals were done by the same person as the Persona 5 opening."
  },
  {
   "score": 4,
   "id": "dgalpzl",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 05:42:33",
   "depth": 0,
   "text": "[Hamsa be like](http://imgur.com/a/ZDX50)"
  },
  {
   "score": 4,
   "id": "dgamw2l",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 06:23:06",
   "depth": 0,
   "text": "So how can Mugaro use his instrument thing without a windpipe ?"
  },
  {
   "score": 3,
   "id": "dgatxpv",
   "pid": "t1_dgamw2l",
   "date": "2017-04-15 09:24:28",
   "depth": 1,
   "text": "sheer force of will."
  },
  {
   "score": 11,
   "id": "dgau4mv",
   "pid": "t1_dgamw2l",
   "date": "2017-04-15 09:28:53",
   "depth": 1,
   "text": "You can still breath with a crushed windpipe. Mugaro's voice box is probably beyond repair though.\n\n"
  },
  {
   "score": 3,
   "id": "dgbdvbj",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 17:03:44",
   "depth": 0,
   "text": "I list my thoughts as they pop up, but I must say that Bahamut continues to surprise me with it's quality for a random card game anime. Seriously, for two seasons now it has had many moments that have surprised me with their originality for a fantasy setting or just direction/style for anime!\n\n* Plate armor actually works in a fantasy anime, what sorcery is this?\n\n* Human civilization where the \"king\" (Emperor I'd say) just marches his army into the strongholds both of Angels and Demons to wreck their shit is fucking BADASS\n\n* Kaisar has so far been a prime example of how a Lawful Good Paladin-type should be played. He doesn't go full Lawful Stupid when shown things that conflict his ideals, instead he argues about the methods how to fix them. Also the overall direction was 10/10 in the Demon Lab-scene.\n\n* I actually think it's interesting and funny how the MC reacts to all handsome males, since my thought throughout the series has been that everyone looks so fucking amazing that it's ridiculous. \n\n* Speaking of handsome males, the rag demon/Azale has great comedy moments when he's dragged down a notch by dense MC or otherwise.\n\n* I don't think I've heard VA like the female main's for a while, it's memorable and I like it.\n\n* Give a raise for the character designer, Rita's helping hand is the best character of the season!"
  },
  {
   "score": 1,
   "id": "dgcrye6",
   "pid": "t1_dgbdvbj",
   "date": "2017-04-16 16:47:46",
   "depth": 1,
   "text": "> Plate armor actually works in a fantasy anime, what sorcery is this?\n\nActually, I think it was pretty much sorcery. Their armor appears to be produce a shield from the green gems which protected them against Azazel's demonic powers. Presumably something they raided from the Angels."
  },
  {
   "score": 1,
   "id": "dgcs8zf",
   "pid": "t1_dgcrye6",
   "date": "2017-04-16 16:54:22",
   "depth": 2,
   "text": "Yeah the gems definitely played a part in it, also I imagine they are the reason why they can be stealthy with full armor."
  },
  {
   "score": 3,
   "id": "dgc6v87",
   "pid": "t1_dgbdvbj",
   "date": "2017-04-16 09:01:56",
   "depth": 1,
   "text": ">  MC reacts to all handsome males\n\nHaha its going to be a interesting character quork that ill be curious to see if she grows out of it or not."
  },
  {
   "score": 10,
   "id": "dg9v3lk",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 15:31:57",
   "depth": 0,
   "text": "Man this will be awesome. "
  },
  {
   "score": 3,
   "id": "dg9xk8s",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:26:56",
   "depth": 0,
   "text": "I have a hunch we're in for some severe [mood whiplash](http://tvtropes.org/pmwiki/pmwiki.php/Main/MoodWhiplash) at some point because of that ED. Mind the TVtropes link."
  },
  {
   "score": 3,
   "id": "dg9zegj",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:07:38",
   "depth": 0,
   "text": "well this seems even darker than the first season. excited to sse where it goes.  though what i REALLY want to find out is what happen to jean de arc since humans are fighting gods as well now"
  },
  {
   "score": 3,
   "id": "dgaht9x",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 02:38:41",
   "depth": 0,
   "text": "Damn, no way to can maintain this animation quality for 24 episodes"
  },
  {
   "score": 2,
   "id": "dgansn6",
   "pid": "t1_dgaht9x",
   "date": "2017-04-15 06:51:02",
   "depth": 1,
   "text": "Exactly what happened in season 1. Glorious recap episodes."
  },
  {
   "score": 3,
   "id": "dgalazn",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 05:27:19",
   "depth": 0,
   "text": "I missed my zombie loli."
  },
  {
   "score": 6,
   "id": "dg9zcy3",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:06:41",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 35,
   "id": "dga8l10",
   "pid": "t1_dg9zcy3",
   "date": "2017-04-14 20:44:54",
   "depth": 1,
   "text": "I prefer getting the tone rather than word for word translation."
  },
  {
   "score": -3,
   "id": "dgadiyy",
   "pid": "t1_dga8l10",
   "date": "2017-04-14 23:19:23",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 6,
   "id": "dgal4qn",
   "pid": "t1_dgadiyy",
   "date": "2017-04-15 05:20:20",
   "depth": 3,
   "text": "TL Note: Keikaku means plan.\n\n\nOn a serious note, translation means walking a fine line between meaning and tone. It was a pun in Japanese, so they made it a pun in English.\n\n\nI'm still not sure why he's a \"rag\" demon when they're obviously bandages (which is what they say in Japanese). They could have still made a pun, too (bandage/bondage). \n\n\nI remember the old days of wall-of-text translator's notes, and they were not pleasant.. If you're picky, I'd recommend avoiding subs and just listening to the Japanese, no offense intended."
  },
  {
   "score": 2,
   "id": "dg9w3xe",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 15:54:40",
   "depth": 0,
   "text": "Man, that OP is pretty great, oozes style. I don't know if its better than season 1's, just because of how well that one flowed for me, but its really nice in its own right."
  },
  {
   "score": 2,
   "id": "dga04rw",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:23:41",
   "depth": 0,
   "text": "Is this good? Is this the first season? What Genre is this?"
  },
  {
   "score": 3,
   "id": "dgadqzr",
   "pid": "t1_dga04rw",
   "date": "2017-04-14 23:27:58",
   "depth": 1,
   "text": "Watch the 2 episode shorts, too."
  },
  {
   "score": 5,
   "id": "dga1cu2",
   "pid": "t1_dga04rw",
   "date": "2017-04-14 17:51:00",
   "depth": 1,
   "text": "Pretty, it's the second season, I'd say it's the 'we made so much fucking money from the mobile game so let's dump a shit tons of money into the animation' genre."
  },
  {
   "score": 5,
   "id": "dga0dzr",
   "pid": "t1_dga04rw",
   "date": "2017-04-14 17:29:23",
   "depth": 1,
   "text": ">Is this good?\n\nSo far, it's interesting\n\n>Is this the first season?\n\nNope, sequel to [this](https://myanimelist.net/anime/21843/Shingeki_no_Bahamut__Genesis)\n\n>What Genre is this?\n\nSupernatural fantasy adventure"
  },
  {
   "score": 12,
   "id": "dga29z0",
   "pid": "t1_dga04rw",
   "date": "2017-04-14 18:11:45",
   "depth": 1,
   "text": "In addition to what others have told you already, please don't watch this until you have finished the first season. A lot of the interactions between Rita, Azazel, and Kaisar are not going to make sense unless you watch the first season first. Very important."
  },
  {
   "score": 2,
   "id": "dga30g2",
   "pid": "t1_dga29z0",
   "date": "2017-04-14 18:28:52",
   "depth": 2,
   "text": "I just got started on it, interesting is a good word to describe it. It seems very unique compared to what I usually watch."
  },
  {
   "score": 17,
   "id": "dga0bd8",
   "pid": "t1_dga04rw",
   "date": "2017-04-14 17:27:45",
   "depth": 1,
   "text": "It's good. It's the second season. Fantasy action adventure."
  },
  {
   "score": 2,
   "id": "dga1i26",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:54:12",
   "depth": 0,
   "text": "I'm probably the only one more interested in the background story rather than most of the characters. I'm always a sucker for good stories about inequity and racial segregation. I already know these themes won't be show in a thourough maner since the series have always been about adventure/fantasy but they are appreciated by yours truly.\n\nSo far I'm more interested in Nina and all about her dragon race. There has to be a big reason for being kept as a secret from humans & demons, and also there has to be a reaosn for Nina to be so far away from home and working in an enviroment surrounded by guys that force her to show her true dragon like self.\n\nWe've already seen Azazel as a pretty good antagonist in Genesis and so far I like his determination and hate for the human race makes him a very interesting character for the series. I'm also very interested in all the secrecy behind Mugaro, I'm guessing he'll play the role of a key character just as Amira did in genesis.\n\nKaizar is probably the least I'm interested in, I wasn't a huge fan of his role in genesis, he was a bit mutable and so easyly swept by women. So far he seems more determined as a knight in this season, so I'll probably have a change of heart depending on how his role goes on."
  },
  {
   "score": 1,
   "id": "dgb4fo3",
   "pid": "t1_dga1i26",
   "date": "2017-04-15 13:22:51",
   "depth": 1,
   "text": "> I'm probably the only one\n\nNaw man"
  },
  {
   "score": 2,
   "id": "dgb1vi7",
   "pid": "t1_dga1i26",
   "date": "2017-04-15 12:24:49",
   "depth": 1,
   "text": "It's kinda amazing how Kaizar is now all chill around the dude who's killed his father just for the lols"
  },
  {
   "score": 9,
   "id": "dga2gba",
   "pid": "t1_dga1i26",
   "date": "2017-04-14 18:15:49",
   "depth": 1,
   "text": "> So far I'm more interested in Nina and all about her dragon race. There has to be a big reason for being kept as a secret from humans & demons, and also there has to be a reaosn for Nina to be so far away from home and working in an enviroment surrounded by guys that force her to show her true dragon like self.\n\nPossibly because the most powerful being in existence, **Bahamut**, *whose mere signs of awakening was more powerful than the power of all the angels and all the demons combined*, **was a dragon**. **LORE IMPLICATIONS**"
  },
  {
   "score": 2,
   "id": "dga4tnu",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 19:10:59",
   "depth": 0,
   "text": "Nina's gonna be a goldmine for reaction faces. [Like so.](http://i.imgur.com/9t0uhrL.jpg)"
  },
  {
   "score": 2,
   "id": "dgai0p4",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 02:49:42",
   "depth": 0,
   "text": "Huh, so she comes from a village of human morphing dragons, then what's so special about her... \n\nNot sure what to think about the new OP. Though it really couldn't live up to the one in the first season.\n\nRita is awesome. Holy child is awesome.\n\nBUT.... WHERE. IS. FAVARO!?!? Make SnB great again!\n"
  },
  {
   "score": 1,
   "id": "dgb0sql",
   "pid": "t1_dgai0p4",
   "date": "2017-04-15 12:01:16",
   "depth": 1,
   "text": "The fact that she's a dragon is in itself special. Bahamut is a dragon, and was more powerful than all the angels and the demons combined."
  },
  {
   "score": 1,
   "id": "dgaiwbh",
   "pid": "t1_dgai0p4",
   "date": "2017-04-15 03:36:46",
   "depth": 1,
   "text": "She wasn't anything special back in her village, but among the people who didn't know about existence of these creatures she's certainly unique."
  },
  {
   "score": 1,
   "id": "dgaj191",
   "pid": "t1_dgaiwbh",
   "date": "2017-04-15 03:43:58",
   "depth": 2,
   "text": "Well, it is kind of curious how in a world of angels,demons,bahamuts and whatnot, no one (not even Azazel, the mastermind in S1) would know that such a village exists (or rather, that such human-morphing dragons exists, which is why he is in awe). \n\nAlso, Nina said she'd be sending money back home. Meaning the village she comes from has trading contacts with the human realm, or else how would she send her money, and what would they even do with human money if not buy human goods? Hence, someone should have been aware of that village. "
  },
  {
   "score": 2,
   "id": "dgajk6j",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 04:10:57",
   "depth": 0,
   "text": "I liked the episode, and stuff. Just...\n\nWhere is Favoro???"
  },
  {
   "score": 2,
   "id": "dgakavv",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 04:45:51",
   "depth": 0,
   "text": "\"I thought you were a rag demon not a nag demon\" Legendary status"
  },
  {
   "score": 1,
   "id": "dg9wvz7",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:12:03",
   "depth": 0,
   "text": "And I thought that Kuzu no Honkai have the best OP and ED of the year..."
  },
  {
   "score": 1,
   "id": "dg9ww79",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 16:12:12",
   "depth": 0,
   "text": "With so many things going on I really wonder what happened to Lucifer. In season 1 they implicated that he kind of had an idea of what was going on,  however they then proceeded to never show him again. It's also really unlikely that he just died in the raid on the demon city,  since he seemed like he still had a part to play. "
  },
  {
   "score": 1,
   "id": "dga2umj",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 18:24:59",
   "depth": 0,
   "text": "I can't say I'm a fan of the OP, but I DID find a way to make even someone like me enjoy it\n\n[Spoiler](/s \"LEDIAN LEDIAN LEDIAAAAAAN\")"
  },
  {
   "score": 0,
   "id": "dgag1vp",
   "pid": "t1_dga2umj",
   "date": "2017-04-15 01:07:15",
   "depth": 1,
   "text": "I think they were saying \"let it end\" not ledian. Unless i'm just a dense mothefugger."
  },
  {
   "score": 2,
   "id": "dgajdbp",
   "pid": "t1_dgag1vp",
   "date": "2017-04-15 04:01:25",
   "depth": 2,
   "text": "Yes they were. But that's not what it sounds like. That's my point."
  },
  {
   "score": 1,
   "id": "dgafksl",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 00:45:13",
   "depth": 0,
   "text": "Is there a possibility that there'll be different versions of the ed? Or atleast changes to it as the series goes?"
  },
  {
   "score": 1,
   "id": "dgag23j",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 01:07:32",
   "depth": 0,
   "text": "I was wondering why its called \"Virgin Soul\" but after watching two eps..... nina + all men in the anime.... now I know."
  },
  {
   "score": 1,
   "id": "dgah6il",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 02:05:05",
   "depth": 0,
   "text": "2 episodes in and we may already have the line of the season. \n\n> I thought you were a rag demon not a nag demon\n\nNina is a great mc, so much fun watching her do even mundane things like write and throw away a letter. \n\nDat opening doe, not the biggest fan of the song itself but the visuals are great (even if the director just repurposed the style from his Persona 5 op) "
  },
  {
   "score": 1,
   "id": "dgahne6",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 02:29:47",
   "depth": 0,
   "text": "The ED is so cute \n\n[](#hypeoverload)\n\nEdit: Its Daoko!!! no wonder it sounds so familiar"
  },
  {
   "score": 1,
   "id": "dgai65n",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 02:58:02",
   "depth": 0,
   "text": "I just love how the OP is fucking brutal and the ED is hilariously cheerful. This fucking show."
  },
  {
   "score": 1,
   "id": "dgaic7n",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 03:07:17",
   "depth": 0,
   "text": "Hmm.. I think nobody has mentioned it yet but I think the end of ED pretty much confirmed that [Virgin Soul spoiler... i think](/s \"Nina has a crush on the King\")"
  },
  {
   "score": 2,
   "id": "dgak1nv",
   "pid": "t1_dgaic7n",
   "date": "2017-04-15 04:34:11",
   "depth": 1,
   "text": "It's pretty obvious in [PV 3](https://www.youtube.com/watch?v=XSczPBZeNRc) Though we don't know if Charioce has hidden motivations;;;"
  },
  {
   "score": 1,
   "id": "dgd9fwj",
   "pid": "t1_dgak1nv",
   "date": "2017-04-17 00:51:37",
   "depth": 2,
   "text": "The king better not break her heart......"
  },
  {
   "score": 2,
   "id": "dgc7e7y",
   "pid": "t1_dgak1nv",
   "date": "2017-04-16 09:13:50",
   "depth": 2,
   "text": "Its going to be interesting as [Spoiler/speculation](/s \"Going to be interesting as it seems from the PV and the ED shes going to willingly turn herself into a dragon after a very heart warming scene.  Will he turn her in on the spot? or will he feel very conflicted about having to turn his ne love?  either way im excited to see the direction of this series.\"  )"
  },
  {
   "score": 1,
   "id": "dgd0rsp",
   "pid": "t1_dgc7e7y",
   "date": "2017-04-16 20:07:26",
   "depth": 3,
   "text": "Damn I never thought about that, hopefully it is hinting at the plot? I'm so sceptical about Charionce cause he seems like a manipulative type, all for his own cause. So what if she ends up turning out of anger or exreme sadness from him? Sigh, don't want that to happen to Nina;;;"
  },
  {
   "score": 2,
   "id": "dgd17xx",
   "pid": "t1_dgd0rsp",
   "date": "2017-04-16 20:18:20",
   "depth": 4,
   "text": "[Speculation](/s \"I believe were going to feel that way about him for most of the series until he starts hanging out with nina and then he suddenly becomes prince charming.  From there its a toss up in my mind on whether the King is actually evil or hes just a guy whos been wronged by the aweful oppression humans had to deal with under the Gods and demons.  Only time will tell.  \")"
  },
  {
   "score": 2,
   "id": "dgakbw0",
   "pid": "t1_dgak1nv",
   "date": "2017-04-15 04:47:08",
   "depth": 2,
   "text": "Yep. Plus I think he's [Virgin Soul spoilers. Probably.](/s \" \"main\" love interest due to its placement in the ED\"). I thought it was just a bait scene for the PV after watching the 1st episode due to her interactions with Azazel before noticing that in the ED."
  },
  {
   "score": 2,
   "id": "dgarwj2",
   "pid": "t1_dgakbw0",
   "date": "2017-04-15 08:37:09",
   "depth": 3,
   "text": " well, don't forget, the second PV for this show was basically all about some past relationship she had."
  },
  {
   "score": 1,
   "id": "dgbq0a6",
   "pid": "t1_dgarwj2",
   "date": "2017-04-15 22:13:53",
   "depth": 4,
   "text": "Hm? This [one](https://www.youtube.com/watch?v=VLGIo8PcoNk) ? I don't get what you mean, sorry"
  },
  {
   "score": 1,
   "id": "dgcap93",
   "pid": "t1_dgbq0a6",
   "date": "2017-04-16 10:26:04",
   "depth": 5,
   "text": "no no no, [this one](https://www.youtube.com/watch?v=XSczPBZeNRc)\n\n\n "
  },
  {
   "score": 2,
   "id": "dgd0hfw",
   "pid": "t1_dgcap93",
   "date": "2017-04-16 20:00:36",
   "depth": 6,
   "text": "Oh, that's PV3. The one we were discussing before;; as I've already linked that video. We don't know if this is gonna be set prior to the start of the series, but its unlikely? "
  },
  {
   "score": 1,
   "id": "dgaivaf",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 03:35:15",
   "depth": 0,
   "text": "fairly good ep. Still shocked that a random mobile game gets such a good anime series."
  },
  {
   "score": 1,
   "id": "dgajqjp",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 04:19:39",
   "depth": 0,
   "text": "I forgot how hype these openings were"
  },
  {
   "score": 1,
   "id": "dgal4n6",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 05:20:14",
   "depth": 0,
   "text": "So the demons are victims now? That's interesting."
  },
  {
   "score": 1,
   "id": "dgamgjg",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 06:08:48",
   "depth": 0,
   "text": "Is that you Ichigo Kurasaki. "
  },
  {
   "score": 1,
   "id": "dgan2fv",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 06:28:38",
   "depth": 0,
   "text": "I didn't think they could beat the first season's OP but they did it. "
  },
  {
   "score": 1,
   "id": "dgaomwo",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 07:15:08",
   "depth": 0,
   "text": "How weak are the demons and angels that one lone dragon-transforming human can rek what the angels and demons couldn't?"
  },
  {
   "score": 2,
   "id": "dgaqczu",
   "pid": "t1_dgaomwo",
   "date": "2017-04-15 08:00:19",
   "depth": 1,
   "text": "The humans seem to have gotten access to a power that lets them nullify and kill both demons and angles. Maybe it doesn't work on dragons."
  },
  {
   "score": 4,
   "id": "dgb0w0k",
   "pid": "t1_dgaomwo",
   "date": "2017-04-15 12:03:16",
   "depth": 1,
   "text": "There was also another dragon who wrecked the humans, angels, and demons - Bahamut. Makes sense that another dragon would be powerful as well."
  },
  {
   "score": 2,
   "id": "dgb14ux",
   "pid": "t1_dgb0w0k",
   "date": "2017-04-15 12:08:36",
   "depth": 2,
   "text": "Bahamut's a whole other kettle of fish.. for a start, it's massive as fuck.\n\nMC-Chan is a midget in comparison.\n\nFurthermore, is Bahamut really a dragon, or just a dragon-like entity? The wiki for the show seems to claim Bahamut is just a dragon-like entity of unimaginable power, rather than a dragon of unimaginable power..\n\nAlso, if every dragon was fuck-off powerful, you'd think there'd have been attempts to wipe them out.. or they'd have y'know, conquered the land, rather than sat hidden in a village that apparently isn't doing too well economically."
  },
  {
   "score": 1,
   "id": "dgb29l5",
   "pid": "t1_dgb14ux",
   "date": "2017-04-15 12:33:35",
   "depth": 3,
   "text": "Presumably Bahamut was an especially powerful dragon, not necessarily that all dragons were were as powerful as Bahamut. Bahamut is also definitely a dragon, not just a \"dragon-like entity\", especially if you read the description for his card in the Rage of Bahamut card game that the anime was loosely based on. \n\nJudging by the fact that they're in a hidden village and are trying to hide the fact that they're dragons when outside of the village, it might have to do with them trying to prevent the destructive potential of the dragons from being unleashed on the world, *à la* Bahamut. That's my theory, at least."
  },
  {
   "score": 5,
   "id": "dgapeq4",
   "pid": "t1_dgaomwo",
   "date": "2017-04-15 07:36:05",
   "depth": 1,
   "text": "Well, in the first season there was a dragon, who was just trying to wake up, that was killing them."
  },
  {
   "score": 1,
   "id": "dgaowh8",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 07:22:26",
   "depth": 0,
   "text": "SiM's new song is definitely nowhere near as hype as \"LET ME SEE THE SUN!\" It's very generic, infact.\n\nI like this season. It's much closer to an Anime than it is to the first season, which was more closer to a western epic. It was fun, but I like the digestable grander story in this."
  },
  {
   "score": 1,
   "id": "dgap9cg",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 07:32:11",
   "depth": 0,
   "text": "So many of my favourite shows came back this season im so fucking happy ! Favaro we are all waiting for you. Loving this season already."
  },
  {
   "score": 1,
   "id": "dgb2pq0",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 12:43:37",
   "depth": 0,
   "text": "What kind of instrument was that?"
  },
  {
   "score": 3,
   "id": "dgbi16w",
   "pid": "t1_dgb2pq0",
   "date": "2017-04-15 18:43:31",
   "depth": 1,
   "text": "Do you mean the one Mugaro was playing? That's probably an ocarina"
  },
  {
   "score": 1,
   "id": "dgbgqv5",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 18:12:17",
   "depth": 0,
   "text": "Azazel looks weak so far. \n\nUnexpected scene in the beginning to see dragon villages. She's not alone as dragon for sure."
  },
  {
   "score": 1,
   "id": "dgc7pky",
   "pid": "t3_65fnbn",
   "date": "2017-04-16 09:20:57",
   "depth": 0,
   "text": "Ahah, so I just realised something, [Spoiler for shingeki no bahamut:genesis](/s \"Nina is technically older than Arima\")"
  },
  {
   "score": 1,
   "id": "dgc8538",
   "pid": "t3_65fnbn",
   "date": "2017-04-16 09:30:30",
   "depth": 0,
   "text": "Wasn't really touched on too much but that ending scene with Azazel being saved by the holy child was superb animation and music to boot!"
  },
  {
   "score": 1,
   "id": "dgckfpd",
   "pid": "t3_65fnbn",
   "date": "2017-04-16 13:59:28",
   "depth": 0,
   "text": "**NECRO LOLI IS BACK!**\n\nAlso, how did Azazel get so weak?"
  },
  {
   "score": 1,
   "id": "dgclwqn",
   "pid": "t3_65fnbn",
   "date": "2017-04-16 14:31:33",
   "depth": 0,
   "text": "I think I figured out why I don't like Nina.\n\nShe is essentially an otaku fangirl from 2003 (I don't like the guys who act like this in anime either, but I seem to be able to avoid those by not watching isekai)\n\n I'm probably just gonna hold off til Favaro shows up, I think. My patience is thin.\n\n"
  },
  {
   "score": 1,
   "id": "dh9dbvh",
   "pid": "t3_65fnbn",
   "date": "2017-05-07 15:13:01",
   "depth": 0,
   "text": "Does anyone know the ending  cause it's melody delicious?"
  },
  {
   "score": 1,
   "id": "dgaiwf0",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 03:36:55",
   "depth": 0,
   "text": "Nina >>>>>>>>> Amira"
  },
  {
   "score": 1,
   "id": "dgam95x",
   "pid": "t3_65fnbn",
   "date": "2017-04-15 06:01:44",
   "depth": 0,
   "text": "For being the protagonist, Nina sure doesn't get much spotlight in the opening. Also, I can't seem to like her. Her character, her voice and especially her face are very annoying for some reason. \n\nAt least the story so far is interesting and the powers we've seen so far are also promising good fights in the future. I hope Kaisar and Azazel get more screentime than Nina not only in the OP, but also in the anime itself."
  },
  {
   "score": -2,
   "id": "dga17hb",
   "pid": "t3_65fnbn",
   "date": "2017-04-14 17:47:35",
   "depth": 0,
   "text": "So... I'm trying to enjoy the OP. I also didn't like the first OP (In general I dislike screamo/heavy metal) but I'd like to like this if it's actually... \"good\".\n\nSo to help me, for context, why do some of you guys like this song, or this kind of music in general? Whenever the unintelligible screamo bits happen it feels very distracting. It especially sucks because there's some nice tonality to the normal singing voice, which makes the screamo bits feel all the more obtrusive."
  },
  {
   "score": 3,
   "id": "dgadjct",
   "pid": "t1_dga17hb",
   "date": "2017-04-14 23:19:46",
   "depth": 1,
   "text": "I absolutely loved the first OP but I found this one a little lacking tbh. Seems a lot of people enjoy it though so it might just not be to my taste."
  },
  {
   "score": 7,
   "id": "dgafg5y",
   "pid": "t1_dga17hb",
   "date": "2017-04-15 00:39:17",
   "depth": 1,
   "text": "In this kind of music vocals are often viewed as a percussive instrument instead of a melodic one, and the melody usually is carried by the guitars."
  },
  {
   "score": 2,
   "id": "dgagsny",
   "pid": "t1_dgafg5y",
   "date": "2017-04-15 01:44:37",
   "depth": 2,
   "text": "Thank you, that's a kind of comment I was looking for =). It's a first step for me to understand it better."
  },
  {
   "score": 13,
   "id": "dga2bsp",
   "pid": "t1_dga17hb",
   "date": "2017-04-14 18:12:57",
   "depth": 1,
   "text": "As it turns out, people have different preferences in music. Some like screamo, some don't. That's just the way the world works."
  },
  {
   "score": -3,
   "id": "dga9lww",
   "pid": "t1_dga2bsp",
   "date": "2017-04-14 21:13:11",
   "depth": 2,
   "text": "But I'm not interested in that conclusion just yet. It may end up being my personal truth, but I haven't concluded as such yet. A person can learn to enjoy a wide variety of things beyond what they initially thought they liked, and they can change opinions about things they once thought immutable.\n\nI'm looking for contexts and understandings as to why exactly people enjoy this OP in specific so I can see if I can replicate those feelings. "
  },
  {
   "score": 5,
   "id": "dgaa3tn",
   "pid": "t1_dga9lww",
   "date": "2017-04-14 21:27:28",
   "depth": 3,
   "text": "You don't really need to understand why people like it in order for you to develop a like for it. Either you just like it or you don't. I personally don't like it because of the incessant noisy screaming, but if that is appealing to you, then it just is."
  },
  {
   "score": -2,
   "id": "dgaau45",
   "pid": "t1_dgaa3tn",
   "date": "2017-04-14 21:48:43",
   "depth": 4,
   "text": "I certainly don't \"need\" to understand, but I want to, and I think it is worth having this kind of conversation. "
  }
 ]
}