{
 "score": 537,
 "id": "6hoald",
 "num_comments": 225,
 "date": "2017-06-16 11:12:51",
 "comments": [
  {
   "score": 221,
   "id": "dizukrh",
   "pid": "t3_6hoald",
   "date": "2017-06-16 11:32:58",
   "depth": 0,
   "text": "Rita is smooth as fuck"
  },
  {
   "score": 111,
   "id": "dizwqkt",
   "pid": "t3_6hoald",
   "date": "2017-06-16 12:13:16",
   "depth": 0,
   "text": "Nina didn't deserve any of this.\n\n[](#elsieqq)\n\nRita still proving she is best girl tho."
  },
  {
   "score": 27,
   "id": "dj0pdtn",
   "pid": "t1_dizwqkt",
   "date": "2017-06-17 00:01:38",
   "depth": 1,
   "text": "Nina is too good for this world."
  },
  {
   "score": 34,
   "id": "dj0vz85",
   "pid": "t1_dj0pdtn",
   "date": "2017-06-17 05:19:27",
   "depth": 2,
   "text": "Nina is a really dumb cinnamon roll, too pure for this world."
  },
  {
   "score": 191,
   "id": "dizuykr",
   "pid": "t3_6hoald",
   "date": "2017-06-16 11:40:06",
   "depth": 0,
   "text": "Finally we have a FAVAROOOOOOOOOO."
  },
  {
   "score": 61,
   "id": "dj00ifw",
   "pid": "t1_dizuykr",
   "date": "2017-06-16 13:25:49",
   "depth": 1,
   "text": "Every week the moment draws near where we get an actual favaro and not an end-of-episode-corner favaro.\n\nHopefully, next week is going to be it. I know that's what I hoped this week, last week, and the week before the last was going to be, but I'm pretty sure that this time it's going to happen"
  },
  {
   "score": 147,
   "id": "dizv0rc",
   "pid": "t3_6hoald",
   "date": "2017-06-16 11:41:15",
   "depth": 0,
   "text": "I just realized this is going to be 24 episodes long!\n\n[](#scrumptiouslymoe)\n\nRita totally stole the show, thought I was expecting her to get the boys first.\n\nI feel bad for Nina, she must feel betrayed. Jeanne remaining firm in her belief, that's my girl!\n\nJesus, so many things happened in this episode and the beginning of the preview got me hyped!"
  },
  {
   "score": 9,
   "id": "dj0aqy8",
   "pid": "t1_dizv0rc",
   "date": "2017-06-16 17:05:30",
   "depth": 1,
   "text": "With her transformation controlled by her heart, I was expecting her to transform into some alternate rage dragon form on the spot from her broken heart.\n\nedit: grammar "
  },
  {
   "score": 8,
   "id": "dj0m6z7",
   "pid": "t1_dizv0rc",
   "date": "2017-06-16 21:59:58",
   "depth": 1,
   "text": "> I just realized this is going to be 24 episodes long!\n\n[MFW](https://media.tenor.com/images/daf4628e771a85f9bb25dfc16b43ffe4/tenor.gif)"
  },
  {
   "score": 18,
   "id": "dj00jex",
   "pid": "t1_dizv0rc",
   "date": "2017-06-16 13:26:20",
   "depth": 1,
   "text": "Same here, thought it was strange another whole episode in prison but then I looked it up and glad its 24 episodes."
  },
  {
   "score": 23,
   "id": "dj084ge",
   "pid": "t1_dizv0rc",
   "date": "2017-06-16 16:03:25",
   "depth": 1,
   "text": "> Rita totally stole the show, thought I was expecting her to get the boys first.\n\nWhy would she? Even she probably doesn't yet Favaro is there and Kaisar totally got on her bad side by not giving her her much anticipated proposal."
  },
  {
   "score": 6,
   "id": "dj0tynv",
   "pid": "t1_dj084ge",
   "date": "2017-06-17 03:49:40",
   "depth": 2,
   "text": "Hmm... Valid point. But neither she knew Jeanne was there so it looks like she only came for Nina?"
  },
  {
   "score": 32,
   "id": "dj0vvin",
   "pid": "t1_dj0tynv",
   "date": "2017-06-17 05:15:26",
   "depth": 3,
   "text": "she came for Nina first because Nina is more usefull against guards that Kaisar.\n\nShe is speedrunning the prison escape."
  },
  {
   "score": 35,
   "id": "dj0vxju",
   "pid": "t1_dj0vvin",
   "date": "2017-06-17 05:17:36",
   "depth": 4,
   "text": "Dude, Favaro put down 97 guards one time. Alone. When he was drunk."
  },
  {
   "score": 3,
   "id": "dj0w7nl",
   "pid": "t1_dj0vxju",
   "date": "2017-06-17 05:28:28",
   "depth": 5,
   "text": "Sorry i meant Kaisar, i edited that\n\nShe doesn't know Favaro is there, if she knew, she totally would go for them first."
  },
  {
   "score": 4,
   "id": "dj0wg7s",
   "pid": "t1_dj0w7nl",
   "date": "2017-06-17 05:37:26",
   "depth": 6,
   "text": "[](#fistbump)"
  },
  {
   "score": 2,
   "id": "dj0wkz4",
   "pid": "t1_dj0wg7s",
   "date": "2017-06-17 05:42:23",
   "depth": 7,
   "text": "I need like, all the context of the world.\n\ni don't know the anime, i don't know the GIF, and i don't know what is the context of the GIF"
  },
  {
   "score": 1,
   "id": "dj0xyvx",
   "pid": "t1_dj0wkz4",
   "date": "2017-06-17 06:28:14",
   "depth": 8,
   "text": "The girl with the ponytail is the biggest bro in anime.\n\n[Hibike light spoiler] (/s \"They are in a band (think classical music with lots of people), and the band is replacing people left and right who aren't good enough. Girl sitting is better than girl standing at music so she's replacing her. People are getting really salty about being replaced left and right, so girl sitting was really worried about this. She really wanna play but she's afraid the girl she replaces is going to be angry like the others, turn out no, she's a real bro, and through the rest of the show she remain one of the nicest people out there, always supportive and helpful.\")"
  },
  {
   "score": 2,
   "id": "dj0yblt",
   "pid": "t1_dj0xyvx",
   "date": "2017-06-17 06:38:47",
   "depth": 9,
   "text": "> The girl with the ponytail is the biggest bro in anime.\n\nBut... they both have ponytails...\n\nIn fact they look like the same person timetraveled to bro heself."
  },
  {
   "score": 1,
   "id": "dj0zo1v",
   "pid": "t1_dj0yblt",
   "date": "2017-06-17 07:16:41",
   "depth": 1,
   "text": "The one sitting usually doesn't have a ponytail, her hair is all fluffy and darker than the other one's hair.\n\n[like this](http://vignette2.wikia.nocookie.net/hibike-euphonium/images/c/c7/Kumi.jpg/revision/latest?cb=20160624214949)"
  },
  {
   "score": 3,
   "id": "dj0wpev",
   "pid": "t1_dj0wkz4",
   "date": "2017-06-17 05:46:52",
   "depth": 8,
   "text": "Simple fist bump, because we reached a mutually satisfying conclusion. It's from Hibike euphonium."
  },
  {
   "score": 79,
   "id": "dj068qk",
   "pid": "t1_dizv0rc",
   "date": "2017-06-16 15:22:11",
   "depth": 1,
   "text": "> Jeanne remaining firm in her belief, that my girl!\n\nWell last time she betrayed the gods she nearly ended the world. "
  },
  {
   "score": 28,
   "id": "dj06ezr",
   "pid": "t1_dj068qk",
   "date": "2017-06-16 15:26:02",
   "depth": 2,
   "text": "True... I'm just glad it's not going as Charioce would like it to, though I have to admit, I like him as a villain."
  },
  {
   "score": 70,
   "id": "dj06ub2",
   "pid": "t1_dj06ezr",
   "date": "2017-06-16 15:35:13",
   "depth": 3,
   "text": "Yeah Charioce is a great antagonist. The whole world (as far as we know) was divided between 3 factions Demons, Gods and Humanity. And humanity was essentially slaves to the Gods and used against the Demon faction. Charioce simply turned the Demons into slaves to be used against the Gods. \n\nI still wonder who his backers are though, no way he simply could have stumbled into some power that allowed him to rob temples of artefacts and powers. "
  },
  {
   "score": 6,
   "id": "dj0vqw1",
   "pid": "t1_dj06ub2",
   "date": "2017-06-17 05:10:19",
   "depth": 4,
   "text": "If you think about it, the irony is that places have switched, but stay the same\n\nGods replace Demons\n\nHumans replace Gods\n\nDemons replace Humans"
  },
  {
   "score": 22,
   "id": "dj0ccfg",
   "pid": "t1_dj06ub2",
   "date": "2017-06-16 17:44:37",
   "depth": 4,
   "text": "Humanity was in no way slaves to the gods. They had a choice to worship them and the gods protected them. They had great civilizations and kingdoms and such if you watched the first season, and as you an see here, the people are being to turn on Charioce for picking a fight with the gods. \nThe demons here are clearly slaves, was that in anyway how humanity was portrayed in season 1? No.\nSure the gods act superior and sometimes won't help humanity even when they could, but they didn't enslave humanity. "
  },
  {
   "score": 39,
   "id": "dj0dau3",
   "pid": "t1_dj0ccfg",
   "date": "2017-06-16 18:08:12",
   "depth": 5,
   "text": "They are slaves to the gods not in the ''slaves in chains'' types of slaves but through their devotion. Of course a lot of humans turned against Charioce, how many thousand of years have humanity worshipped the gods? Compare that to how few Charioce have ruled and it is no big surprise he got a lot of people who turned against him. \n\nThey enslaved them through the worship, in return the Gods protected them against the Demons. "
  },
  {
   "score": 11,
   "id": "dj0jq6x",
   "pid": "t1_dj0dau3",
   "date": "2017-06-16 20:44:49",
   "depth": 6,
   "text": "I'm a Christian and so I have a devotion to God, but I never see myself as a \"slave\" to Him. Devotion to your faith is not the same as enslavement.\n"
  },
  {
   "score": 1,
   "id": "dj0vslw",
   "pid": "t1_dj0jq6x",
   "date": "2017-06-17 05:12:16",
   "depth": 7,
   "text": "> I'm a Christian and so I have a devotion to God, but I never see myself as a \"slave\" to Him.\n\nDid you ever do something just because of god? Hate someone, act someone? think about something?\n\nthen yes, you are a slave of Christianity."
  },
  {
   "score": 6,
   "id": "dj10bvw",
   "pid": "t1_dj0jq6x",
   "date": "2017-06-17 07:34:16",
   "depth": 7,
   "text": "I'd say it's really nothing like the believe in our world religions. The \"enslavement\" in SnB is more than just through devotion. Angels are called gods, but they are just super powerful beings. Other than \"slaves\" you can call humanity a vassal of the Angels, which are more like a technically super advanced nation. Their enslavement is tangible through the dependency and governance of the Angels. The \"gods\" decide who they wage war against and grant them holy artifacts as they wish. \n\nThe Angels are prideful and think the humans are living above their status. But Charioce shows that humans can in fact be equal in power and reveals that the gods are simply false idols."
  },
  {
   "score": 34,
   "id": "dj0nf1m",
   "pid": "t1_dj0jq6x",
   "date": "2017-06-16 22:43:03",
   "depth": 7,
   "text": "... it totally is though (I'm not talking modern day sense because the belief in Catholicism/Christianity/other has split like crazy and there's too many different things people do, the setting is based medieval time)\n\nEspecially when you see that god is quite literally there (albeit stuck with Satan and Bahamut), you have angels and shit, fuck I'd have my fucking forehead on the ground hoping not to get absolutely slaughtered by them. The Angels/Gods pretty much controlled humanity, which is what subjugation is, which is what enslavement is. \n\n"
  },
  {
   "score": 3,
   "id": "dj0vu3c",
   "pid": "t1_dj0nf1m",
   "date": "2017-06-17 05:13:52",
   "depth": 8,
   "text": "Let's not forget the king was forced to have demons and zombies as guests because angels said it."
  },
  {
   "score": 71,
   "id": "dj02n36",
   "pid": "t3_6hoald",
   "date": "2017-06-16 14:07:38",
   "depth": 0,
   "text": "Lets see.. We have Literally Joan D'Arc, a Dragon Lady, a Bounty Hunter, a Knight, and a Zombie all breaking out of a heavily guarded Prison. This is going to be amazing."
  },
  {
   "score": 5,
   "id": "dja199v",
   "pid": "t1_dj02n36",
   "date": "2017-06-22 18:59:44",
   "depth": 1,
   "text": "This is the greatest D&D campaign ever!"
  },
  {
   "score": 10,
   "id": "dj0w1j4",
   "pid": "t1_dj02n36",
   "date": "2017-06-17 05:21:55",
   "depth": 1,
   "text": "> a Bounty Hunter\n\nThe slayer of the super dragon god you mean."
  },
  {
   "score": 70,
   "id": "dj0bm7n",
   "pid": "t1_dj02n36",
   "date": "2017-06-16 17:26:43",
   "depth": 1,
   "text": "I am not going to lie this sounds like a session of a table top game."
  },
  {
   "score": 14,
   "id": "dj0ph88",
   "pid": "t1_dj0bm7n",
   "date": "2017-06-17 00:05:54",
   "depth": 2,
   "text": "Or a Terry Pratchett book."
  },
  {
   "score": 18,
   "id": "dj0ouda",
   "pid": "t1_dj0bm7n",
   "date": "2017-06-16 23:38:37",
   "depth": 2,
   "text": "Sounds like an amazing start for a campaign"
  },
  {
   "score": 6,
   "id": "dj0w20u",
   "pid": "t1_dj0ouda",
   "date": "2017-06-17 05:22:27",
   "depth": 3,
   "text": "I dunno, no one died yet..."
  },
  {
   "score": 137,
   "id": "dizv258",
   "pid": "t3_6hoald",
   "date": "2017-06-16 11:41:57",
   "depth": 0,
   "text": "#Spec Ops Rita pulling some Splinter Cell shit over here.  \n\nRita and Rocky's infiltration of the prison was great, i cant wait for her to find Kaiser and Favaro, and then they can grab Nina and Jeanne and we will get our cooky pirate rescue!  We got a lot of it this ep but now to finish it next ep!  \n\nMan this season has just been really really good.  I cant wait for more of this.  \n\n**WE GOT A FAVARO!!!! AFTER CREDITS!!**  \n**[ALSO HOLY COW THAT ENDCARD ART HGNGGGGG!](http://i.imgur.com/bJtQgPC.png)**  \n\n[](#hnng)"
  },
  {
   "score": 4,
   "id": "dj0lpgw",
   "pid": "t1_dizv258",
   "date": "2017-06-16 21:44:14",
   "depth": 1,
   "text": "That Rory gif never gets old."
  },
  {
   "score": 17,
   "id": "dj03gxr",
   "pid": "t1_dizv258",
   "date": "2017-06-16 14:24:19",
   "depth": 1,
   "text": ">Spec Ops Rita\n\nJust don't let her touch the White Phosphorus....\n\nAlso that's not an endcard I wanted to see TBH :/ "
  },
  {
   "score": 3,
   "id": "dj0vx4p",
   "pid": "t1_dj03gxr",
   "date": "2017-06-17 05:17:08",
   "depth": 2,
   "text": ">Just don't let her touch the White Phosphorus....\n\n*drakengard 3 flashbacks*\n\nOH NOES."
  },
  {
   "score": 75,
   "id": "dizvm3e",
   "pid": "t1_dizv258",
   "date": "2017-06-16 11:52:20",
   "depth": 1,
   "text": ">ALSO HOLY COW THAT ENDCARD ART HGNGGGGG!  \n  \nI guess I can now add necrophilia as a fetish into my big fetish list as well."
  },
  {
   "score": 7,
   "id": "dj0lqhi",
   "pid": "t1_dizvm3e",
   "date": "2017-06-16 21:45:06",
   "depth": 2,
   "text": "Rica needs to be a shadowverse card and leader. I'll play whatever class she ends up being, which would 100% be shadows if she gets implemented. PLZ PLZ PLZ LET THERE BE AN ANIME EXPANSION!"
  },
  {
   "score": 24,
   "id": "dj02zy7",
   "pid": "t1_dizvm3e",
   "date": "2017-06-16 14:14:53",
   "depth": 2,
   "text": "Loli necrophilia*"
  },
  {
   "score": 34,
   "id": "dizvqu1",
   "pid": "t1_dizvm3e",
   "date": "2017-06-16 11:54:46",
   "depth": 2,
   "text": "Might i suggest [Sankarae](https://myanimelist.net/anime/11499/Sankarea) then for more zombie waifus.  "
  },
  {
   "score": 3,
   "id": "dj1mzic",
   "pid": "t1_dizvqu1",
   "date": "2017-06-17 16:07:26",
   "depth": 3,
   "text": "THANK YOU I FORGOT THE NAME OF THIS SHOW. I WATCHED IT LIKE 3 YEARS AGO!"
  },
  {
   "score": 4,
   "id": "dj24zo6",
   "pid": "t1_dj1mzic",
   "date": "2017-06-18 01:26:03",
   "depth": 4,
   "text": "Youre welcome?  \n\n[](#whowouldathunkit)"
  },
  {
   "score": 8,
   "id": "dizvztt",
   "pid": "t1_dizvqu1",
   "date": "2017-06-16 11:59:27",
   "depth": 3,
   "text": "I actually managed to read the whole manga, even before I started watching anime massively (it was a year ago and before starting with anime, I actually read different manga). It was a bit ridiculous, but had its cool moments. Anyway thx for the advice, though I can't find the time to finish watching some things I have already started, and also I don't even have time to get on discord these days, cause some hard time."
  },
  {
   "score": 42,
   "id": "dizyga2",
   "pid": "t3_6hoald",
   "date": "2017-06-16 12:45:42",
   "depth": 0,
   "text": "**Never enough Rita**. At least we get another variant of her theme to look forward to on the OST!\n\nGood grief, that endcard... ^^^^Welp, ^^^^I'm ^^^^going ^^^^to ^^^^hell"
  },
  {
   "score": 79,
   "id": "dizv28s",
   "pid": "t3_6hoald",
   "date": "2017-06-16 11:42:00",
   "depth": 0,
   "text": "moment of the week:\n\"FAVAROOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!!!!!!\""
  },
  {
   "score": 36,
   "id": "dizussa",
   "pid": "t3_6hoald",
   "date": "2017-06-16 11:37:06",
   "depth": 0,
   "text": "Nice episode. I wonder what's happening [there](http://i.imgur.com/rT27gZK.jpg) though, even Rita commented on it (who was awesome this episode). \n\nAlso interesting what [it means](http://i.imgur.com/sGqQ7Pt.jpg) and what Demon Division is. Charioce has found a new means to utilize and control demons?\n\nGlad Charioce - Nina plotline lives, which leaves us with the question whether Charioce has some kind of genuine interest in Nina or simply using her in his interests.\n\nAlso listen to preview, it's quite hype. "
  },
  {
   "score": 1,
   "id": "dj0jcxb",
   "pid": "t1_dizussa",
   "date": "2017-06-16 20:34:14",
   "depth": 1,
   "text": "> Nice episode. I wonder what's happening there  though, even Rita commented on it (who was awesome this episode).\n\nBetter not be copying Magi with using human sacrifice to create a giant magic spell..."
  },
  {
   "score": 1,
   "id": "dj1m5g6",
   "pid": "t1_dj0jcxb",
   "date": "2017-06-17 15:46:08",
   "depth": 2,
   "text": "He has enough with gladiators dying every day"
  },
  {
   "score": 1,
   "id": "dj51r9z",
   "pid": "t1_dizussa",
   "date": "2017-06-19 21:51:29",
   "depth": 1,
   "text": "Looks like a giant magic circle because of the glowing lines. I'm guessing the King's building a giant spell to shoot down ~~outer~~ heaven."
  },
  {
   "score": 17,
   "id": "dj0phxd",
   "pid": "t1_dizussa",
   "date": "2017-06-17 00:06:47",
   "depth": 1,
   "text": ">  I wonder what's happening there though\n\nA Death Star.\n\nProbaly."
  },
  {
   "score": 32,
   "id": "dj0cfn3",
   "pid": "t1_dizussa",
   "date": "2017-06-16 17:46:52",
   "depth": 1,
   "text": "Guy completely mocked her this episode, asking her to dance while she's standing there in heartbroken shock with a ball and chain on her foot. I don't think Nina's going to be in a forgiving mood for a while, especially now that she knows all the things he's done."
  },
  {
   "score": 31,
   "id": "dj0h8qn",
   "pid": "t1_dj0cfn3",
   "date": "2017-06-16 19:35:31",
   "depth": 2,
   "text": "Interesting I found that he didn't say it in a mocking tone. I rewatched that part like three times and it didn't come off that way but rather almost light hearted. He didn't do anything personality to Nina to make her truly hate him.If anything I think it would be more noble to see Nina change the king instead of out right hateing and oppsoing him. Love is wierd and crazy but I rather see Nina keep her love strong and help change someone because unlike most stories where to protagonists tries to change the antagonist perspective this series would be more appropriate for that. We have 13 more episodes so hopefully it can go in a good route"
  },
  {
   "score": 4,
   "id": "dj1i64v",
   "pid": "t1_dj0h8qn",
   "date": "2017-06-17 14:31:19",
   "depth": 3,
   "text": "> He didn't do anything personality to Nina to make her truly hate him\n\nBesides putting her in prison, but, you know, she will forgive him right? /s\n\nI don't think this ship will sail any longer unless a super villain appears, which I feel it will not."
  },
  {
   "score": 5,
   "id": "dj15yhe",
   "pid": "t1_dj0h8qn",
   "date": "2017-06-17 09:49:04",
   "depth": 3,
   "text": "Yeah, and when he asked her if she was enjoying prison it sounded as if he legitimately thought she might enjoy it, which she did in fact."
  },
  {
   "score": 5,
   "id": "dj1a4pv",
   "pid": "t1_dj15yhe",
   "date": "2017-06-17 11:22:26",
   "depth": 4,
   "text": "That's the exact tone I was getting. I honestly think that maybe he has spies keeping track on them. It's makes complete sense. His tone of voice even changed when he was talking to Nina and it didn't sound mocking at all. What was throwing me off in this scene was the music playing because it made everything thing feel positive and romantic. I think that is what the editor was trying to convey that this wasn't a mocking dialoge. If they wanted to show a more sinister tone they would have changed the music to emphasize the situation. Music has a huge part in contributing in what we should feel in a scene just go watch any video on YouTube talking about the importance of music in a film."
  },
  {
   "score": 19,
   "id": "dj0jmv5",
   "pid": "t1_dj0h8qn",
   "date": "2017-06-16 20:42:07",
   "depth": 3,
   "text": "The thing is Nina is very close to her friends, specifically El/Mugaro and the townspeople. She's also pure of heart, so she takes it personally that he's bullying and enslaving the demons. So, for her its personal, especially after she fancied herself \"in love\".\nThe problem is that Charioce has really crossed the line by the point. Especially as we know from the PV that he is going to go even further in his thirst for power. We know by the end the three races are going to eventually get along in some kind of truce, but I can't see Charioce being by the majority of our heroes or their peoples. I can see him eventually getting redemption through a last sacrifice, but that's about it at this point.\nTo me, the fact that he was so light hearted in such a serious situation, especially after having bullied and threatened Jeanne and knowing what the reveal was doing to Nina, he was definitely mocking. There were a lot of other things he could have said that would be better suited to the situation."
  },
  {
   "score": 8,
   "id": "dj0lnxb",
   "pid": "t1_dj0jmv5",
   "date": "2017-06-16 21:42:53",
   "depth": 4,
   "text": "I won't really  call that bulling someone lol. Nina can think simple minded sometimes that she simplfied it to bully tactics. He was bargening with Jeanne without using threats against her. He even gave her a chance to save El. I do like that Jeanne is sticking to her morals  because it shows string characterization. Jeanne decided on her own not to be loyal to the king but to the gods. Much like her real world counter part."
  },
  {
   "score": 48,
   "id": "dj00np4",
   "pid": "t1_dizussa",
   "date": "2017-06-16 13:28:37",
   "depth": 1,
   "text": ">I wonder what's happening there though, even Rita commented on it \n\nIt's pretty obvious ain't it? Shingeki no Bahamut is made in Japan. It's a Japanese cartoon. A Japanese cartoon is anime. And that means...\n\nSUPER ULTRA EPIC GIGANTIC MECHAS!!!!11111\n\nLast episode will be basically Nina-Godzilla vs. Cheetos-Ultramen. I just know it."
  },
  {
   "score": 6,
   "id": "dj06f0q",
   "pid": "t1_dj00np4",
   "date": "2017-06-16 15:26:03",
   "depth": 2,
   "text": "It will be the appearance of the magical big guy right? "
  },
  {
   "score": 32,
   "id": "dj008v0",
   "pid": "t3_6hoald",
   "date": "2017-06-16 13:20:42",
   "depth": 0,
   "text": "Expected Favaro and Kaisar to turn up to whole time during the conversation with Charioce. Oh well, we will likely get them next episode."
  },
  {
   "score": 13,
   "id": "dj06rt9",
   "pid": "t1_dj008v0",
   "date": "2017-06-16 15:33:42",
   "depth": 1,
   "text": "I know me too. Heck Azazel hasn't shown up since episode 8. The only characters that make an appearance every episode are Nina and Charoice."
  },
  {
   "score": 3,
   "id": "dj0rezz",
   "pid": "t1_dj06rt9",
   "date": "2017-06-17 01:37:16",
   "depth": 2,
   "text": "Hasn't Mugaro/El appeared every episode too? I think so... That's the three new main characters in every episode."
  },
  {
   "score": 1,
   "id": "dj19qeq",
   "pid": "t1_dj0rezz",
   "date": "2017-06-17 11:13:39",
   "depth": 3,
   "text": "I don't remember seeing El in episode 6 maybe I missed him...."
  },
  {
   "score": 32,
   "id": "dj034q8",
   "pid": "t3_6hoald",
   "date": "2017-06-16 14:17:31",
   "depth": 0,
   "text": "Thank you Rita for protecting that smile."
  },
  {
   "score": 56,
   "id": "dizvdto",
   "pid": "t3_6hoald",
   "date": "2017-06-16 11:47:59",
   "depth": 0,
   "text": "This wasn't the prison break episode I signed up for!it's gonna happen next episode right? I mean Rita is about to set Nina and Jeanne free on top of the next episode being titled *The Great Escape* so it **must** happen next! It's only been the main topic the past couple of episodes...\n\nBut man Nina has been making this show great; I was concerned over a new protagonist but her eccentric attitude during the attempted escape really makes her a joy to watch.\n\nI'm looking forward to [Kal] El opening a can of whoop ass! Although seems like Charoice has ideas of his own with some kind of secret weapon.\n\n "
  },
  {
   "score": 3,
   "id": "dj06m51",
   "pid": "t1_dizvdto",
   "date": "2017-06-16 15:30:18",
   "depth": 1,
   "text": "When I was watching this I was like yah kick some ass Nina! Yah Jeanne your almost there don't worry Rita is in that elevator and she her to save you. Lol I can't wait to see Jeanne face when she sees Rita. Doors open epic music stops... Oh it's Rit- Wait Charoice! I'm I going blind!! Wait a minute Nina is only 50ft away! Oh wait this is a dark place so his face might be covered by shadows again and also Nina is kind of far away...Watches Charoice walk inches from Nina. Wait What! I was not expecting this Right now!  I love this! Maybe she won't recognize him without the glasses.....never mind.\n\nThis made the episode even better because I was not expecting this surprise."
  },
  {
   "score": 30,
   "id": "dj04g8k",
   "pid": "t1_dizvdto",
   "date": "2017-06-16 14:44:28",
   "depth": 1,
   "text": "I'm thinking it's probably more like [Micha] El"
  },
  {
   "score": 1,
   "id": "dj0jn0q",
   "pid": "t1_dj04g8k",
   "date": "2017-06-16 20:42:14",
   "depth": 2,
   "text": "I know that fits better but I was going for a terrible Superman reference. "
  },
  {
   "score": 18,
   "id": "dj0ezxu",
   "pid": "t1_dj04g8k",
   "date": "2017-06-16 18:39:44",
   "depth": 2,
   "text": "Could be any El. [Gabri]El, [Rapha]El, [Rami]El, El [Magnifico], El[Lis] from Left 4 Dead 2...."
  },
  {
   "score": 16,
   "id": "dj0m5rg",
   "pid": "t1_dj0ezxu",
   "date": "2017-06-16 21:58:48",
   "depth": 3,
   "text": "El in Hebrew is a word used to refer to God. All those names that end with El are because they are an actual sentence/phrase that has to do with God."
  },
  {
   "score": 33,
   "id": "dj0hefh",
   "pid": "t1_dj0ezxu",
   "date": "2017-06-16 19:39:44",
   "depth": 3,
   "text": "El [Chapo]"
  },
  {
   "score": 11,
   "id": "dj0jbrm",
   "pid": "t1_dj0hefh",
   "date": "2017-06-16 20:33:17",
   "depth": 4,
   "text": "[Pablo] El[scobar]"
  },
  {
   "score": 58,
   "id": "dizzq2d",
   "pid": "t3_6hoald",
   "date": "2017-06-16 13:10:31",
   "depth": 0,
   "text": "It's raining lolis!\n\nLoli Poppins! (that sounds wrong)"
  },
  {
   "score": 27,
   "id": "dj047mi",
   "pid": "t3_6hoald",
   "date": "2017-06-16 14:39:33",
   "depth": 0,
   "text": "i wanted nina to fuckin get mad and transform into a dragon"
  },
  {
   "score": 19,
   "id": "dj0unc7",
   "pid": "t1_dj047mi",
   "date": "2017-06-17 04:23:14",
   "depth": 1,
   "text": "> i wanted nina to fuck\n\nDon't we all?"
  },
  {
   "score": 10,
   "id": "dj0w0fn",
   "pid": "t1_dj0unc7",
   "date": "2017-06-17 05:20:46",
   "depth": 2,
   "text": "she wants the most "
  },
  {
   "score": 28,
   "id": "dj0dc2s",
   "pid": "t3_6hoald",
   "date": "2017-06-16 18:09:04",
   "depth": 0,
   "text": "**I almost thought Jean was gonna get axed then and there if she didn't comply.**\n\n[](#sweating)"
  },
  {
   "score": 6,
   "id": "dj0k8he",
   "pid": "t1_dj0dc2s",
   "date": "2017-06-16 20:59:30",
   "depth": 1,
   "text": "I was actually hoping the scene would play out like that. Just a stab and toss her off the walk way to really twist the dagger in nina's hear but I'm a massocist."
  },
  {
   "score": 1,
   "id": "dj401ry",
   "pid": "t1_dj0k8he",
   "date": "2017-06-19 09:11:26",
   "depth": 2,
   "text": "I think you mean sadist unless you want to be Nina in your scenario"
  },
  {
   "score": 1,
   "id": "dj48r4w",
   "pid": "t1_dj401ry",
   "date": "2017-06-19 11:48:58",
   "depth": 3,
   "text": "Oh it would have caused me distress rather than enjoyment but that can help the enjoyment of a story. "
  },
  {
   "score": 24,
   "id": "dizx0bo",
   "pid": "t3_6hoald",
   "date": "2017-06-16 12:18:19",
   "depth": 0,
   "text": "Oh shit. The long awaited prison break is finally happening next week! I imagined it's going to be a good one. HYPE!!\n\nAlso best girl Rita is just great this episode."
  },
  {
   "score": 8,
   "id": "dj01fo8",
   "pid": "t1_dizx0bo",
   "date": "2017-06-16 13:43:49",
   "depth": 1,
   "text": "Finally! It has been 3000 years! "
  },
  {
   "score": 23,
   "id": "dj07py0",
   "pid": "t3_6hoald",
   "date": "2017-06-16 15:54:31",
   "depth": 0,
   "text": "That FAVARO! at the end by Kaisar really is why I fell in love with this anime."
  },
  {
   "score": 61,
   "id": "dizy0hj",
   "pid": "t3_6hoald",
   "date": "2017-06-16 12:37:22",
   "depth": 0,
   "text": "*\"Kept you waiting, huh?\"* - Rita\n\nLove watching Rita just stealthing her way through the prison cells without even saying *a single word*. I'm really excited to see the Gods crush Charioce forces using ~~Mugaro~~ El. And with the main gang getting out of prison (hopefully) next week, maybe they can finally kick him off of his throne."
  },
  {
   "score": 3,
   "id": "dj0tslf",
   "pid": "t1_dizy0hj",
   "date": "2017-06-17 03:41:04",
   "depth": 1,
   "text": "You know? This is precissely why anime original series are better than manga/LN adaptations. Let's imagine this scene as manga adaptation. Guards would be yelling nonsense (like describing what Rita just did) like in some retarded JoJo parody."
  },
  {
   "score": 15,
   "id": "dj04kbm",
   "pid": "t1_dizy0hj",
   "date": "2017-06-16 14:46:47",
   "depth": 1,
   "text": ">Love watching Rita just stealthing her way through the prison cells without even saying a single word.\n\n\nWell she said  \"What is that king up to\" though"
  },
  {
   "score": 34,
   "id": "dj0osrz",
   "pid": "t1_dj04kbm",
   "date": "2017-06-16 23:36:45",
   "depth": 2,
   "text": "[She didn't **say a word**](#shhbabe)"
  },
  {
   "score": 2,
   "id": "dj0zow5",
   "pid": "t1_dj0osrz",
   "date": "2017-06-17 07:17:19",
   "depth": 3,
   "text": "Perfect comment."
  },
  {
   "score": 28,
   "id": "dj07cvb",
   "pid": "t1_dizy0hj",
   "date": "2017-06-16 15:46:31",
   "depth": 1,
   "text": "I don't think it will be that simple. Theres 13 episodes to go."
  },
  {
   "score": 8,
   "id": "dj0ot99",
   "pid": "t1_dj07cvb",
   "date": "2017-06-16 23:37:17",
   "depth": 2,
   "text": "OH SHIT I forgot that this is a 24 episode show. "
  },
  {
   "score": 109,
   "id": "diztkhy",
   "pid": "t3_6hoald",
   "date": "2017-06-16 11:14:31",
   "depth": 0,
   "text": "holy shit the lil nigga speaked"
  },
  {
   "score": 14,
   "id": "dj010nd",
   "pid": "t1_diztkhy",
   "date": "2017-06-16 13:35:38",
   "depth": 1,
   "text": "He spoke last week too during the flashback. He just took a vow of silence after his mother was taken into custody."
  },
  {
   "score": 14,
   "id": "dj0ch93",
   "pid": "t1_dj010nd",
   "date": "2017-06-16 17:47:58",
   "depth": 2,
   "text": "No, the slavers crushed his throat, you see him getting healed of that this episode when he turns into his god form."
  },
  {
   "score": 60,
   "id": "dj019au",
   "pid": "t1_dj010nd",
   "date": "2017-06-16 13:40:21",
   "depth": 2,
   "text": "He had his vocal cords destroyed by Jeanne presumably before she clipped his wings. You can see a spot on his neck get healed when the angels do their thing to him. "
  },
  {
   "score": 1,
   "id": "dj01l4u",
   "pid": "t1_dj019au",
   "date": "2017-06-16 13:46:45",
   "depth": 3,
   "text": "Ah, you're right. I was actually wondering what was that about."
  },
  {
   "score": 18,
   "id": "dj0cisk",
   "pid": "t1_dj019au",
   "date": "2017-06-16 17:49:02",
   "depth": 3,
   "text": "I think it was a slaver who did that. You never see Jeanne do such a thing and she wouldn't need to. In fact, it would interfere with him asking for help later as she told him to do."
  },
  {
   "score": 49,
   "id": "dj02n5z",
   "pid": "t1_dj019au",
   "date": "2017-06-16 14:07:41",
   "depth": 3,
   "text": "I thought Azazel said he had his throat crushed by a slaver?"
  },
  {
   "score": 1,
   "id": "dj06a9p",
   "pid": "t1_dj02n5z",
   "date": "2017-06-16 15:23:08",
   "depth": 4,
   "text": "And he also thought he was a demon who got his wings clipped by the slavers. "
  },
  {
   "score": 59,
   "id": "dj037al",
   "pid": "t1_dj02n5z",
   "date": "2017-06-16 14:18:58",
   "depth": 4,
   "text": "Azazel only found Mugaro in shackles with his throat crushed and wings clipped, he'd logically assume it was slavers who had been shown to torture readily. But it makes for Jeanne to do it, to keep Mugaro from crying out in pain from the wing clipping and to keep him from outing himself. \n\n... I wonder if Mugaro grew attached to Azazel because Azazel was also once an angel. "
  },
  {
   "score": 4,
   "id": "dj1a8dj",
   "pid": "t1_dj037al",
   "date": "2017-06-17 11:24:43",
   "depth": 5,
   "text": "I hope that Mugaro/El resolves to save Azazel as well. I'm sure he's not mentioning it aloud, because it'd be suspicious if they knew he was attached to a demon."
  },
  {
   "score": 34,
   "id": "dj06d2s",
   "pid": "t1_dj037al",
   "date": "2017-06-16 15:24:51",
   "depth": 5,
   "text": "Jeanne also told him trust his rescuer. \n"
  },
  {
   "score": 13,
   "id": "dj0ux8g",
   "pid": "t3_6hoald",
   "date": "2017-06-17 04:35:48",
   "depth": 0,
   "text": "That is such a chill prison"
  },
  {
   "score": 5,
   "id": "dj1acz6",
   "pid": "t1_dj0ux8g",
   "date": "2017-06-17 11:27:34",
   "depth": 1,
   "text": "Why would they even want to leave? "
  },
  {
   "score": 3,
   "id": "dj1mu54",
   "pid": "t1_dj1acz6",
   "date": "2017-06-17 16:03:37",
   "depth": 2,
   "text": "bad food, no other hobbies"
  },
  {
   "score": 39,
   "id": "dj00cmv",
   "pid": "t3_6hoald",
   "date": "2017-06-16 13:22:45",
   "depth": 0,
   "text": "I wonder if after getting heartbroken like that Nina will stop going doki-doki over appearances at last and somehow learn to control her dragon-ification.\n\nAlso, I can't be the only one who noticed the king knows he fucked up.\n\n\"She has a kid? And the kid can disable my totally broken armor equip? Shit, mate! Kill the kid already\"\n\n\"Fuck, the kid escaped.\"\n\n\"Damn it, woman! Where is the kid?! Where's the kid?! ... ok, whatever. I'll just lock you up in case the kid shows up.\"\n\n\"Shit, the kid is back. Whatever happens find the kid and don't let the gods get the kid.\"\n\n\"GODS FUCKING DAMN IT. What did I fucking tell you. What did I tell you?! Shit. Lock everybody up!\"\n\n\"Oh yeah? You gods want ur stuff back?\" \\* looks at public \\* \"Uh...\" \\* sweats profusely \\* \"Fight for it! LOL! Haha. I'm great. I'm a great king.\"\n\n\"Shit, Jeanne, the gods be back, they got ur kid. pls stop them! U gotta stop them! They will wreck shit! Also the public is hating on me now. Say something. You gotta help me out here!\"\n\n\"Ok, fine. I'll let you live. Just in case I can still use you to stop the game-breaking god-kid later.\""
  },
  {
   "score": 17,
   "id": "dj05r5q",
   "pid": "t1_dj00cmv",
   "date": "2017-06-16 15:11:34",
   "depth": 1,
   "text": "I don't think he thinks he screwed up because it looks like he has been preparing for this especially with giant ass weapon he has being built. I think the reason why he has not out right declared war on the gods is because alot of the humans still worship them. If anything Charoice was running a well oiled machine and El is literally the wrench that got thrown into it. That shifting around of Charoice's plan is something i don't think people realize is a development of his character. Yah he could just out right go to watch with the gods and be like screw everyone else but I don't think he wants to get a bunch of people killed. This was like the third time he asked Jean for her support and she said no because it's against her very being. However this is a little confusing on Jean part because she wants to get El back and she had the chance to walk freely away and get El back. I mean she is going to have to do it anyways. Sometimes I think she likes gods more than humans and I think that might be her down fall."
  },
  {
   "score": 1,
   "id": "dj6oa17",
   "pid": "t1_dj05r5q",
   "date": "2017-06-20 20:19:04",
   "depth": 2,
   "text": "Yeah there's no way that thing isn't just a giant philosopher's stone ritual he's been keeping in the basement."
  },
  {
   "score": 9,
   "id": "dj0ju6y",
   "pid": "t1_dj05r5q",
   "date": "2017-06-16 20:48:01",
   "depth": 2,
   "text": "Why should Jeanne believe Charioce, he's forcing her to choice between her child and her faith. Also, he himself has said that he's going to kill her son in front of her and has had his men hunt her and El down with a \"kill on sight\" edict. Why should she believe anything he says?"
  },
  {
   "score": 3,
   "id": "dj0lq2f",
   "pid": "t1_dj0ju6y",
   "date": "2017-06-16 21:44:44",
   "depth": 3,
   "text": "The king is many things but I don't think he is a liar and Its shown now that he actually could use Jeanne."
  },
  {
   "score": 6,
   "id": "dj0txkr",
   "pid": "t1_dj0lq2f",
   "date": "2017-06-17 03:48:08",
   "depth": 4,
   "text": "If he's not a liar, then he also didn't lie about promising to kill her son in front of her. But anyway, he has lied before. His whole \"Chris\" deception was a lie."
  },
  {
   "score": 1,
   "id": "dj1jhos",
   "pid": "t1_dj0txkr",
   "date": "2017-06-17 14:53:34",
   "depth": 5,
   "text": "I don't find the whole Chris thing all that bad. (that's what he called himself when he pretended to be a commoner, right?)\n\nMaybe he likes to get a view on how the regular citizens live and feel?\n\nA character from the manga Kingdom, Mougou, who is a general in the Qin army, likes to dress up like a common foot soldier when he gets stressed. The two characters are really different, but's a similar example."
  },
  {
   "score": 1,
   "id": "dj1alr7",
   "pid": "t1_dj0txkr",
   "date": "2017-06-17 11:32:58",
   "depth": 5,
   "text": "Yah I'm not going to argue on him telling her that he is going to kill her son but that was before the situation changed and if he didn't change his plans that wouldn't be very smart. When I think of a liar I mean the deseptive type looking out to manipulate people like how Gabriel was handling El. She wasnt out right lieing to him but manipulating a young boy which is still a form of a lie. Keeping a secret about your self is not rely a lie  and Charoice's doesn't use his descise to do anything other than hide his identity but not out right manipulate people's way of thinking or actions."
  },
  {
   "score": 12,
   "id": "dj06bhu",
   "pid": "t1_dj05r5q",
   "date": "2017-06-16 15:23:53",
   "depth": 2,
   "text": "> However this is a little confusing on Jean part because she wants to get El back and she had the chance to walk freely away and get El back\n\nJean believes the gods above all else. El is with the gods. Therefore El is safe. Is what I'd to believe was her train of thought."
  },
  {
   "score": 13,
   "id": "dizxs5y",
   "pid": "t3_6hoald",
   "date": "2017-06-16 12:33:03",
   "depth": 0,
   "text": "Next episode is going to be really fun!\n\n\nLove the characters in this show!"
  },
  {
   "score": 3,
   "id": "dj01e7k",
   "pid": "t1_dizxs5y",
   "date": "2017-06-16 13:43:02",
   "depth": 1,
   "text": "Inb4 another hurdle in the escape plan. Please don't jinx it."
  },
  {
   "score": 23,
   "id": "dj05fmz",
   "pid": "t3_6hoald",
   "date": "2017-06-16 15:04:41",
   "depth": 0,
   "text": "But officer, she's over a thousand years old and she's also a [zombie](http://imgur.com/I6DZdsj.jpg)\n\nMan, they don't build guards like in the [old days](http://imgur.com/L89lM6X.jpg) do they?\n\n[Dat Smug face](http://imgur.com/IT2Nkao.jpg) ( ͡° ͜ʖ ͡°)\n\n[The Saint](http://imgur.com/dzqmNZg.jpg) can face huge abominations like a Bahamut, but she's afraid of spiders, sounds legit.\n\nDamn, [Sofiel](http://imgur.com/G5qnNMe.jpg) makes me wonder why do I waste my time watching Sin Nanatsu no Taizai.\n\nHope someone does a quick Kumiko type clip about all the [Nina noises](http://imgur.com/QgC0Wmy.jpg)\n\nSummarizing, I can't say I liked the failed [Prison Break](http://www.imdb.com/title/tt0455275/) but I get it's all part of the plan to make Rita Poppins shine in this episode (and damn she's quite resourceful along Rocky).\n\nPoor Mugaro, I liked him better when he couldn't speak and wore girly clothes. Heh, I was questioning how could it be possible for the angels to release his full power and would still leave his chords damaged. I got my answer a few seconds later.\n\n"
  },
  {
   "score": 5,
   "id": "dj4e570",
   "pid": "t1_dj05fmz",
   "date": "2017-06-19 13:25:51",
   "depth": 1,
   "text": "Sofiel probably has the best animated rack I've seen since Cowboy Bebop."
  },
  {
   "score": 1,
   "id": "djqxp6c",
   "pid": "t1_dj4e570",
   "date": "2017-07-03 18:26:43",
   "depth": 2,
   "text": "Do yourself a favor and watch gunbuster. "
  },
  {
   "score": 1,
   "id": "djr7a8u",
   "pid": "t1_djqxp6c",
   "date": "2017-07-03 22:40:09",
   "depth": 3,
   "text": "^^^Gunbuster ^^^is ^^^older ^^^than ^^^Cowboy ^^^Bebop"
  },
  {
   "score": 2,
   "id": "djs4z0i",
   "pid": "t1_djr7a8u",
   "date": "2017-07-04 14:06:01",
   "depth": 4,
   "text": "Yeah...\n\nIt was the origin of the gainax bounce, so I thought you might enjoy it?"
  },
  {
   "score": 1,
   "id": "djs56hz",
   "pid": "t1_djs4z0i",
   "date": "2017-07-04 14:10:30",
   "depth": 5,
   "text": "You thought correctly, but that would technically make Cowboy Bebop the best animated rack I've seen since Gunbuster, no?"
  },
  {
   "score": 1,
   "id": "djs5bf0",
   "pid": "t1_djs56hz",
   "date": "2017-07-04 14:13:25",
   "depth": 6,
   "text": "OH. Ah, haha-thought you hadn't seen gunbuster at all"
  },
  {
   "score": 13,
   "id": "dj07jru",
   "pid": "t1_dj05fmz",
   "date": "2017-06-16 15:50:47",
   "depth": 1,
   "text": "I think Mugaro/El will realize he's being used pretty quickly"
  },
  {
   "score": 3,
   "id": "dj8gpsv",
   "pid": "t1_dj07jru",
   "date": "2017-06-21 21:29:15",
   "depth": 2,
   "text": "Pretty sure he already realized it. Yes frowning and looks upset in almost every scene we see him in, Sofiel barely managed to get him to trust her and even she looked a bit unsettled with Gabriel's blatant information and El like Nina seems to care more about the individuals close to him then some bs goal like correcting humanity. \n\nIf anything he's using them to get back his mother, Azazel and the rest."
  },
  {
   "score": 34,
   "id": "dj02add",
   "pid": "t3_6hoald",
   "date": "2017-06-16 14:00:24",
   "depth": 0,
   "text": "Anyone else rooting for Charioce XVII in this war?"
  },
  {
   "score": 2,
   "id": "dj0v6jq",
   "pid": "t1_dj02add",
   "date": "2017-06-17 04:47:13",
   "depth": 1,
   "text": "I see him more as a King Zheng (Ei Sei in Kingdom) of Qin type. Rules with force to conquer everything to end the endless war around him, and to unify China (in this case heaven/Earth). Trying make it so mankind can evolve and develop new technologies in peace. (Though this is historically more likely for it all to fall apart in future generations)\n\nIt's more an ends justify the means type deal."
  },
  {
   "score": 2,
   "id": "dj0plpo",
   "pid": "t1_dj02add",
   "date": "2017-06-17 00:11:31",
   "depth": 1,
   "text": "Well, I'm with him up to the slavery part.\n\n[That's a dick move](https://www.youtube.com/watch?v=rWY47bW8K3s)"
  },
  {
   "score": 2,
   "id": "dj1alz9",
   "pid": "t1_dj0plpo",
   "date": "2017-06-17 11:33:06",
   "depth": 2,
   "text": "Demons atoning for their past sins. "
  },
  {
   "score": 3,
   "id": "dj0b7jr",
   "pid": "t1_dj02add",
   "date": "2017-06-16 17:16:47",
   "depth": 1,
   "text": "He's basically playing the neutral route of a Shin Megami Tensei game."
  },
  {
   "score": 4,
   "id": "dj0wtju",
   "pid": "t1_dj02add",
   "date": "2017-06-17 05:51:00",
   "depth": 1,
   "text": "Yes, brother. For the glory of the humankind!"
  },
  {
   "score": 5,
   "id": "dj0kpso",
   "pid": "t1_dj02add",
   "date": "2017-06-16 21:13:42",
   "depth": 1,
   "text": "Nah. Still waiting for Bahamut to revive. The one true god^zilla"
  },
  {
   "score": 18,
   "id": "dj0b9fp",
   "pid": "t1_dj02add",
   "date": "2017-06-16 17:18:05",
   "depth": 1,
   "text": "Not really, as much as the Gods are toying with a nephalem, Charioce has been show to be an authoritarian who cares nothing for the people. The Gods maybe lazy at best, and willfully neglectful at worst, but Charioce invaded them, and attacked him. And Azazel is too much in favor of directly flipping the status quo."
  },
  {
   "score": 67,
   "id": "dj081c4",
   "pid": "t1_dj02add",
   "date": "2017-06-16 16:01:26",
   "depth": 1,
   "text": "I AM. SINCE EP1.\n\nHere are my reasons:\n\n1. The Gods are lazy as fuck and comes off as giving no fucks about humanity unless they pray to them. Remember Season 1? Yeah. Way to neglect Jeanne when she was in trouble and let her get corrupted. The only God to have realized they fucked up was Michael. And that was too late by then and he died. Also judging from this episode, Gabriel proves to be no different than humans who would use children as weapons for their own ends. Like how a terrorist would make a child fight in a pointless war. And considering they don't really care much for humanity as shown so far in the series, I simply can't root for them.\n\n2. Demons have been toying with humans' lives since time immemorial. Azazel is guilty of this. Even the demon chick that got squashed is guilty of this. Yes he does seem sympathetic to his cause with killing off slave traders and saving innocent demon lives, but I fully cannot root for them. Why? Here's why. In his Shadowverse lore and lines in that game, he views humans as nothing more than inferiors. Which explains why he treats humans like crap and play with them like ants on an hill. Remember that whole thing with Favaro's and Kaisar's dad? Yeah...\n\nIn my reckoning, Azazel is just butthurt that humans can now fuck over the demon race and it rids him of his fun to toy with them. That and his wounded pride that the race he once called inferiors can actually bite back thanks to Charioce.\n\nBut wait? What about Belphegor? She was so hot! She is waifu and doesn't deserve to be squashed like a bug! Yeah... NO.\n\nIn her lore, she is a demon that tricks humans by giving them gold only to screw them over and it is heavily implied that she consumes their souls. So despite her small role in the series, she is no different than Azazel himself. ~~INB4 someone says they don't mind having their soul consumed because they are thirsty as fuck for pussy, legs, tits and ass.~~ If you ask me she got what was coming to her after god knows how many years of playing with humans' lives.\n\nAlso keep in mind that Shadowverse is a game made by Cygames, who also created Rage of Bahamut the mobile game, which this series is based off on, so my points about demons are valid since the claims came from an official source.\n\nNow you may wondering whoever was bothered to read this post before down-voting it:\n\n\"But Charioce is an asshole! WHY THE FUCK ARE YOU ROOTING FOR A GIANT DOUCHE LIKE HIM?! He ruined Jeanne's and El's lives! They just wanted to live in peace! GTFO I AM DOWNVOTING YOUR ASS!\"\n\nKeep in mind this. Charioce is a king that simply wants to place humanity on top in a fantasy world where they are inferiors to other magical races. What is wrong with that? Nothing. But it is an unreachable dream that cannot be made without any sacrifices. I do agree with Kaisar's ideology, but it is simply naive as Charioce points it. That and would you really expect a race that treats humans like inferiors have them stand as equals? OF COURSE NOT. Demons like Azazel would just LOL at humanity's faces and continue what he has been doing before Charicoe and his army went to hell. What about Gods? They will simply say no. Just like how they rejected Charioce's request for power to protect humanity. Heck the gods probably wouldn't even be fighting humans if they just given it to him! Some allies they are! Point is, humans are just getting caught in the middle in the war between gods and demons and unlike the other king who was a mama's boy who did NOTHING to change humans' position, Chris actually DOES SOMETHING. So you cannot simply write off Charioce being a bad person and put it at that. So his actions are JUSTIFIED. I would even add that Charioce is doing arguably the wrong thing for the right reasons, while someone like Azazel is doing the right thing for wrong reasons.\n\nNow what about Jeanne and El? Yes, it is a shame that El is taken into it and is now being used by the gods as a weapon. But consider this. After achieving so much for his kingdom in a matter of years, Charioce finds a threat that will put all his hard work to the gutter and making humans be the bitches of both gods and demons. So as a leader in charge of humanity's future and faced with a problem what does he do? GET RID OF THE PROBLEM LIKE A NORMAL PERSON WOULD WHEN FACED WITH A DILEMMA.\n\nHe could have had them arrested instead, but Jeanne was a saint, there was no way she was just going to yield to a king who attacked the holy temples. Also Charioce attacking Cocytus (the equivalent of hell in this series) and the holy temples, is tantamount to waging war against them. So in a war-like situation there is bound to be collateral damage and El was just unfortunate to be one, like the other innocent demons that got captured by humans, had he not unlocked his special abilities to deactivate the magically enhanced armor. \n\nAnd there was just no way Charioce could have just told his Onyx Guards this:\n\n\"If that angel with the big tits hides and is using a human household as a shelter, please be nice to the humans, but make sure you capture the angel!\". Yeah because people who are still worshiping gods would just comply with such a request! /s \n\nWith that said, Charioce cannot fully control people and have them be nice to others, otherwise, he can't accomplish anything by being nice. So he has to be an asshole if need be. \n\nI simply cannot understand how people would give praise to other characters such as Lelouch who does cross the line to achieve his ends, while Charioce well just gets treated like a villain and leave it at that. They both do evil things for a good cause. Though granted there are a few people who are curious about his backstory. Shame not a lot of discussion about these topics, since it's mostly just about waifus and feels from what I have seen thus far. Because from what is shown so far, in this series, as per the lyrics of the first opening: the world is black and white but the world is so gray. What more describe the situation between the three races?\n\nTLDR; Charioce is sexiest villain of all time and he is not really evil. He does arguably wrong things for the right reasons, compared to Azazel who does the right things for the wrong reasons, minus the fact that he was willing to put innocent lives in danger like he did with attempting to use Nina an innocent bystander as a weapon. Also the gods should have just given Charioce power if they really are allies and understand that the king simply doesn't want people to be collateral damage as a result of the feud between gods and demons. Simply surviving at the mercy of gods and demons isn't fair, so Charioce is motivated by good reason. At least what is shown thus far."
  },
  {
   "score": 0,
   "id": "dj0qnv8",
   "pid": "t1_dj081c4",
   "date": "2017-06-17 01:00:21",
   "depth": 2,
   "text": "Charioce is a fucking fascist and should be sued for letting his thugs attack those innocent protesters."
  },
  {
   "score": 2,
   "id": "dj0c58y",
   "pid": "t1_dj081c4",
   "date": "2017-06-16 17:39:31",
   "depth": 2,
   "text": "I love reading long things like this that go into depth thank you! I agree on a lot of things on what you have to say. The community is really decided on this topic lol. It's like we are fighting our own little war"
  },
  {
   "score": 5,
   "id": "dj0g6zq",
   "pid": "t1_dj0c58y",
   "date": "2017-06-16 19:07:11",
   "depth": 3,
   "text": "Yeah lol. Refreshing the page five minutes after I posted just to see if there are replies I can reply to and already a downvote without any counter arguments as to why my reasoning is bad or any criticism or corrections on my post haha. \n\nI am simply putting out my thoughts on a character/episode since that's the whole supposed point of this thread so I felt like I should just put my thoughts as well. There are things to talk about this series, and since no one has stated any topics for discussion despite the thread being called \"Shingeki no Bahamut: Virgin Soul - Episode 11 discussion\". \n\nAll I could see were comments that don't really start any discussion other than glorifying a zombie loli, among others that don't really start discussions. Really I just felt that it was disingenuous when all of them are comments that don't really start a DISCUSSION, which should really be an exchange of ideas and thoughts about the episode and series overall thus far. Which should come with it an analysis on story, setting, and character. At least that's what I think it should be."
  },
  {
   "score": 6,
   "id": "dj0hva8",
   "pid": "t1_dj0g6zq",
   "date": "2017-06-16 19:52:33",
   "depth": 4,
   "text": "I wasn't expecting this war to come in the middle but rather in the last 6 episodes. It's been a really good build up and I'm glad it's happening now.\n\n\nI can't even fathom the ending of this series. That's really rare for anime for me! Some people are saying someone needs to die. Most of them are saying Charoice but I don't see him dieing at all. If that's the case then he needs to change a little( not saying that he has to to make me like him) in appraoch with godS demons but I don't see that happening. God's will never want to be see humans on top let alone as Thier equals it's just not in Thier nature. You can surpress the demons as you seen this season. But the gods there is no way. Everyone is going to want the human king dead. It's either Charoice comes out on top or he dies.\nOR Bahamut comes back.....and everyone works together which I hope does not happen.\nAlso the screen writer for this show she also worked on alot of Japanese drama shows that's why they are interesting."
  },
  {
   "score": 2,
   "id": "dj1oi36",
   "pid": "t1_dj0hva8",
   "date": "2017-06-17 16:46:05",
   "depth": 5,
   "text": "> OR Bahamut comes back.....and everyone works together which I hope does not happen.\n\nIf that happens, then nothing will be achieved and history will repeat itself. Plus it would be forced to have them work together for again, the sake of survival. It wouldn't really make way for the three races to understand one another. And a demon or god might pull a Charioce and enforce their own definition of justice at the cost of the other races' expense, once Bahamut has been taken care of.\n\nBut then again... the title is RAGE OF BAHAMUT, so probably Bahamut might appear in the series in some form or another."
  },
  {
   "score": 3,
   "id": "dj24frm",
   "pid": "t1_dj1oi36",
   "date": "2017-06-18 00:59:18",
   "depth": 6,
   "text": "I always thought that Charoice might represent Bahamut in this series. I thought that would be a better thing than having Bahamut reappearing or something and there are some parallels between them. Ifhe does appear again then it's going to lower my opinion of this show. Which I really don't want to because I really love it. This show is clearly more about Character relations rather than saving the day."
  },
  {
   "score": 6,
   "id": "dj0ug3x",
   "pid": "t1_dj081c4",
   "date": "2017-06-17 04:13:46",
   "depth": 2,
   "text": "> Also keep in mind that Shadowverse is a game made by Cygames, who also created Rage of Bahamut the mobile game, which this series is based off on, so my points about demons are valid since the claims came from an official source.\n\nNot exactly, in RoB lore Belphegor aided humanity. "
  },
  {
   "score": 2,
   "id": "dj1q9wa",
   "pid": "t1_dj0ug3x",
   "date": "2017-06-17 17:32:53",
   "depth": 3,
   "text": "I don't know why you responded to me with a quote that refers to me using Shadowverse as a source of my claims, with a claim that seems to be replying to my claim that Belphegor tricks humans. But regardless I will address the thing with Shadowverse and my claim about Belphegor not exactly aiding humanity. \n\nShadowverse is a game created by Cygames. Shadowverse uses cards from the Rage of Bahamut mobile game. Rage of Bahamut was also created by Cygames. What else could it be but an official source?\n\nNow for the Belphegor part.\n\n[Here](https://shadowverse.gamepress.gg/card/belphegor) is her Shadowverse lore. Feel free to read it but I will also put in a shortened version of the lore from Shadowverse:\n\nBelphegor doesn't care about gold, so she gives it to humans in exchange for something (their soul). Judging from the text, it seems that Belphegor is TRICKING humans by luring them with gold without any prior knowledge of what's at stake.\n\nNow since you mentioned RoB lore, I searched up her lore in RoB and here is what I found from this [website](http://wiki.rageofbahamut.com/Belphegor). Below are what I picked up from reading her RoB lore.\n\nHer stage 1 card notes that humans knew about demonic forces. Demons viewed humans as unreliable and undeserving of any happiness. If I have to guess why the creators would put this piece of info in her card, strongly suggests that she along with other demons viewed humans as such.\n\nHer stage 2 cards speak of a demon. Because it is on her card, the demon in question must be her. In this card, it is said that Belphegor possesses knowledge that led unlucky humans to ruin.\n\nHer stage 3 card notes that in exchange for knowledge she wanted humans to partake in blood sacrifices, and the ones involved with her were eager to do so.\n\nAnd finally her stage 4 card notes that humans agreed with the terms of gaining knowledge, which seem to back up the claim in her stage 3 card that humans were still willing to partake blood sacrifices. But it is also added that the reason why Belphegor would collaborate with humans is beyond human comprehension.\n\nSo in conclusion, Belphegor is in many ways, similar to Azazel. In her case, if I were to put both games' lores into consideration, she offers humans knowledge and gold in exchange for someone's soul. Similar to how Favaro's dad's friend got involved with the demon to get rid of both Kaisar's and Favaro's fathers and get demonic powers in exchange. Shadowverse makes it sound like she is tricking the humans, but with RoB lore in consideration, it seems that she just wants a soul, which involved blood sacrifices. Considering that she believes that humans don't deserve any happiness, she makes it a game to get someone's soul by getting involved with shady humans like the friend of Favaro's dad, who are more than willing to sacrifice people. This also led humans involved to ruin. The reason for this is implied to be that she believes that all humans are the same and don't deserve happiness. Kind of like a xenophobic person who believes that all Muslims are terrorists and so puts them all into one group. Except she is probably much more worse by getting involved with people who are evil by making them partake in her sacrifices so that she would bestow unto them knowledge, at the expense of someone's soul, who may be an innocent one. So ultimately she is not only leading people into ruin, but she is also giving bad people gold and knowledge at the expense of human souls. So in what way is she really aiding humanity? Because I do not see it. If anything it's like saying that Favaro's and Kaisar's fathers' killer is aiding humanity, based on what you claimed at least."
  },
  {
   "score": 7,
   "id": "dj0u8tr",
   "pid": "t1_dj081c4",
   "date": "2017-06-17 04:03:53",
   "depth": 2,
   "text": "> Way to neglect Jeanne when she was in trouble and let her get corrupted.\n\nOh man, you seem to forgot what all angels were doing back then. All of them were occupied maintaining this big ass barrier around Bahamut (some of them even died from exhaustion) so they simply didn't knew king lost his mind and wanted to burn Jeanne alive. Gabriel is a manipulative bitch though, you have a point."
  },
  {
   "score": 3,
   "id": "dj1r2xg",
   "pid": "t1_dj0u8tr",
   "date": "2017-06-17 17:54:27",
   "depth": 3,
   "text": "True, but Jeanne was praying. And IIRC Jeanne has a connection with the angels, so they should be able to hear her message. At the very least Michael and/or any of the angels should have responded to her plight. In S1 in the scene where Uriel was getting fed with grapes by little angels while she, Gabriel, Rafael and Michael were talking, the angels said something along the lines that they shouldn't really aid humans TOO MUCH. Not saying that they don't. They do, but they don't want to FULLY aid them like equals. This makes them willfully neglectful. Michael when dying expressed his regret that the gods failed their allies by viewing them as being below them instead of allies as they did years ago before Bahamut was sealed. So even Michael admits that the angels stopped viewing humans, their supposed allies as their equals. Gabriel seemed to be the kind of individual who is no different from a demon that views humans as inferior, and the other Angels seem to share the view, except Michael."
  },
  {
   "score": 6,
   "id": "dj0supy",
   "pid": "t1_dj081c4",
   "date": "2017-06-17 02:51:17",
   "depth": 2,
   "text": "I think the reason why people can forgive people like lelouch is because we followed his adventures from the beginning and we know what he had to do to achieve his goal.  I.E. we grew attached to him which when you grow attached to someone it doesn't matter if there literally hitler we will probably find a way to justify there actions.  Another example is legands of the Galatic Heroes which barring a couple of people everyone does some pretty messed up shit.  But we can forgive them because we like them.\n\nChris we just dont know.  \n\nAs for his cause I agree.  the Gods and demons were dicks to humans and they deserve everything that is coming towards them barring the slavery as we can all agree thats just wrong.  \n\nThis entire situation reminds me of another show [Spoiler](/s \"shinki yori\") in it the exact same situation happens.  even though the lessor vassal lost I was still not mad at how far they fought to obtain there freedom."
  },
  {
   "score": 7,
   "id": "dj1ourq",
   "pid": "t1_dj0supy",
   "date": "2017-06-17 16:55:18",
   "depth": 3,
   "text": "Yes it does have a different impact because Lelouch was the protagonist of his series, whereas Charioce is the antagonist of his series. Nonetheless they are still both characters that are very similar.  \n\nIn fact if Nina wasn't the protagonist and it was Charioce instead, people might root for him. But then again people were more or less expecting Kaisar and Favaro to be the main characters again and have Kaisar scream \"FAVARO!!!\" because it was funny back then. So it makes me wonder if people actually care about good storytelling. That or they just want a repeat of a similar story like in S1 and have RoB pull a Star Wars EP7 which was just a recycled version of Star Wars EP4. Because so far, this series hasn't been bad, though Nina does kind of annoy me slightly at times. Still it's not that big of a problem.\n\nAlso it is very rare if at all, we get to have a villain be presented properly as a person rather than in the last minute or never at all, like in most anime nowadays. So I am hoping that maybe Charioce takes the center stage in the second cour and have Nina be the decoy protagonist in this series. That way we get to learn more from him as a character."
  },
  {
   "score": 12,
   "id": "dj0bfro",
   "pid": "t1_dj081c4",
   "date": "2017-06-16 17:22:19",
   "depth": 2,
   "text": "Seems to me like humanity was doing fine in season 1 without having to pull this shit though. The gods gave them the power to fend off demons(see how well Azazel's attack went) and things seemed pretty peaceful. There was no need to steal the god's powers and certainly no need to enslave literally all demons."
  },
  {
   "score": 7,
   "id": "dj0dht5",
   "pid": "t1_dj0bfro",
   "date": "2017-06-16 18:13:08",
   "depth": 3,
   "text": "True, but remember how during S1 when supposedly it was a time after Bahamut had its rampage 1000 years ago? And despite the team up between the 3 races, gods and demons are still in conflict? With humans being caught in the middle. I still remember when Azazel was made aware of the God Key theft and intended to get it for the demons, strongly suggesting that despite them uniting once, there still exist a power struggle between them. And humans who revere the gods are still getting affected. So we can't really say that it was peaceful, between the three races. And they were simply surviving as Charioce pointed out to Kaisar when faced with his ideology. \n\nYes there was no need to steal the god's powers. But, like I said, perhaps the gods should have just given the humans that power, and from what is shown thus far, should have just been given to Charioce IMO. Considering from what his motivations that are known thus far. But granted we still don't know the full nature of this \"power\" so the gods' decision to not simply hand it over could be justified when it will be revealed. And I am simply stating my current opinion with what is shown in the show thus far.\n\nThe demons on the other hand, well are just arrogant, using Azazel as a prime example. But there hasn't been much fleshing out made for demons so far (aside from Azazel who is hard to root for), and the attack that the demon had 7 years ago before S2 when a demon attacked a poor village and killed a little girl makes it harder to sympathize. We can see them suffering which makes the viewer feel sad for them, but IMO the show has yet to show a demon's POV other than Azazel which would paint them as being the same as humans. At the very least though, we can see some humans feeling uneasy with the inhumane treatment the demons have been getting, so it's something I guess, which could allow for humans and demons to understand each other. Kind of like how the Jews were treated in WWII, where not all Germans were sympathetic to the Nazi cause and viewed the Jews as being equal as such."
  },
  {
   "score": 29,
   "id": "dj0blmy",
   "pid": "t1_dj081c4",
   "date": "2017-06-16 17:26:20",
   "depth": 2,
   "text": "Charioce's kingdom is a good one. And I understand that all he did, he did for the betterment of humanity (as far as we know). But slavery, torture, and systemic oppression is where it crosses the line for me tbh. The demons and the gods weren't the best to humanity, but there has to be a way of combating that without enslaving an entire species.\n\nAlso, there is a thing as too much war. Once you alienate 2 races who are, let's face it, stronger than humanity as a whole, a kingdom that was laid on a foundation of their civil unrest and hatred is not going to last long at all.\n\n"
  },
  {
   "score": 13,
   "id": "dj0fie6",
   "pid": "t1_dj0blmy",
   "date": "2017-06-16 18:49:19",
   "depth": 3,
   "text": "Yes, I agree with your points. Also Charioce can be arrogant, which can be a factor that could lead to his possible most likely defeat by the end of the series. Unless Charioce makes a reform on his policies and if a huge chunk of the population start to sympathize with the demons and make protests for change, it would only be a matter of time when demons will start rebelling and make the kingdom crumble. But with way things are, something significant will have to happen to convince him otherwise. Which is why I think for now, Charioce needs to get more power for humans from the gods to stand above them. But so far, the humans are still in a barbaric mind set like that of Ancient Rome. Heck they even hold gladiatorial fights like those of Ancient Rome, where instead of foreigners fighting, it's demons instead. And Emperors back then have to appease the masses. So I assume Charioce has to do the same for his people. But so far, there has only been a few people who stood up to Charioce as seen in the latest episode. And that simply isn't enough to make him change his mind IMO, since it has to be a majority, so having knights deal with them for now at least is still somehow justified, since they will be labelled as mere rebels and outlaws. We can see people feeling uneasy about demons being abused, so there is perhaps potential in-universe for the three races to co-exist despite the skirmishes in the past. \n\nWe should also remember the setting of the series. Considering slavery is a thing in the story and gladiatorial fights are being held, we can say for certainty they don't have a system that is the equivalent of human rights which was established after WWII. They haven't really have had a major conflict like in our world such as WWI and WWII, so IMO there has to be war to force all races in that world to realize that despite differences they can co-exist.  And we can't really use Bahamut's rampages as an example, because the three races are just fighting together for survival, as already pointed out by Charioce, as it is just like trying to survive in a major disaster and needing as much help as needed as possible and having to rely on other races out of desperation. This is where Kaisar missed the mark on his reasoning, which most likely didn't convince Charioce to change his ways."
  },
  {
   "score": 26,
   "id": "dj0a2va",
   "pid": "t1_dj02add",
   "date": "2017-06-16 16:49:10",
   "depth": 1,
   "text": "Eh all sides are flawed, it'd probably be best to have a less arrogant leader of men who didn't see it as his own personal mission to stir the shit of fate and see where it led. He strikes me as the guy who would have agreed to unleash Bahamut upon the world were he a demon. The current leader of the Gods on the other hand is manipulating a bonafide WMD with the emotional maturity and reasoning of a teenager, which strikes me as grossly incompetent.\n\nUltimately losses on both sides with a peace struck afterwards would be the best outcome but nobody would be able to lead the humans and make peace with angels and devils at the same time because of how unpopular that would be once people forgot the horrors of war. \n\nSo seeing as everything is screwed in the long run at this point anyway I'd rather his smug ass gets kicked to the curb."
  },
  {
   "score": 38,
   "id": "dizzind",
   "pid": "t3_6hoald",
   "date": "2017-06-16 13:06:30",
   "depth": 0,
   "text": "Ravioli ravioli don't lewd the zombie loli. That end card is just too good. I wouldn't be surprised if Favaro has an escape plan of his own. "
  },
  {
   "score": 27,
   "id": "dj00aax",
   "pid": "t1_dizzind",
   "date": "2017-06-16 13:21:28",
   "depth": 1,
   "text": "I wouldn't be surprised if they have a tense escape and as they exit the prison Favaro(with Kaisar) is there and says \"You took your sweet time\"."
  },
  {
   "score": 24,
   "id": "dj00yw7",
   "pid": "t1_dj00aax",
   "date": "2017-06-16 13:34:43",
   "depth": 2,
   "text": "And we get our triple shot of \"FAVARO?!?!\" from Jeanne, Rita, and Nina\n\n [**I believe**](#excitedyui)"
  },
  {
   "score": 11,
   "id": "dj07xlz",
   "pid": "t3_6hoald",
   "date": "2017-06-16 15:59:11",
   "depth": 0,
   "text": "WAIIIIT, WAIT, WAIT!\nWhen Nina menthioned Kaisar could probably trigger her transformation and her now having learned the truth about Charioce, could we probably be up for a Kaisar x Nina x Rita love triangle?"
  },
  {
   "score": 2,
   "id": "dj0c8il",
   "pid": "t1_dj07xlz",
   "date": "2017-06-16 17:41:52",
   "depth": 1,
   "text": "I was thinking the same but she was like \"maybe\" afterwards meaning she it's less likely that he could. If that where the case then all she had to do was look at Kaiser when they where getting g Thier sentences from the king."
  },
  {
   "score": 12,
   "id": "dj0omiu",
   "pid": "t1_dj07xlz",
   "date": "2017-06-16 23:29:42",
   "depth": 1,
   "text": "You forget Favaro with his hair down also triggers it..."
  },
  {
   "score": 9,
   "id": "dj0sw1n",
   "pid": "t1_dj0omiu",
   "date": "2017-06-17 02:53:22",
   "depth": 2,
   "text": "but favarro's already taken by bahamut itself."
  },
  {
   "score": 17,
   "id": "dj0t188",
   "pid": "t1_dj0sw1n",
   "date": "2017-06-17 03:00:58",
   "depth": 3,
   "text": "Favaro:  \"My Waifu is a world destroying Dragon.\"  \n\nEvery other married man:  \"Mine too...\"  \n\n[](#urbansmile)"
  },
  {
   "score": 18,
   "id": "dj0dsqm",
   "pid": "t1_dj07xlz",
   "date": "2017-06-16 18:18:44",
   "depth": 1,
   "text": "I think it was more that she knows it's triggered in the past by handsome men, and Kaisar is handsome. But then she qualifies it, because she isn't sure since what happened with Azazel."
  },
  {
   "score": 10,
   "id": "dizx7n8",
   "pid": "t3_6hoald",
   "date": "2017-06-16 12:22:11",
   "depth": 0,
   "text": "Next week is gonna be amazing. I've been waiting for Favaro's return all season, I really hope we get to see him doing Favaro things again next week. I'll shed a silent tear if we don't."
  },
  {
   "score": 7,
   "id": "dizztli",
   "pid": "t3_6hoald",
   "date": "2017-06-16 13:12:31",
   "depth": 0,
   "text": "I would have done the same thing as Jeanne when she saw that strange-looking spider. "
  },
  {
   "score": 7,
   "id": "dj05oaa",
   "pid": "t3_6hoald",
   "date": "2017-06-16 15:09:49",
   "depth": 0,
   "text": "Rita best girl"
  },
  {
   "score": 11,
   "id": "dj02no6",
   "pid": "t3_6hoald",
   "date": "2017-06-16 14:07:58",
   "depth": 0,
   "text": "I wanna know more about Charioce PRONTO! By far the most intriguing one here."
  },
  {
   "score": 5,
   "id": "dj02tm3",
   "pid": "t3_6hoald",
   "date": "2017-06-16 14:11:21",
   "depth": 0,
   "text": "so happy that there are going to be 24 episodes of this!"
  },
  {
   "score": 4,
   "id": "dj05i4x",
   "pid": "t3_6hoald",
   "date": "2017-06-16 15:06:10",
   "depth": 0,
   "text": "Every dam Friday I watch Snb after watching Berserk and truly appreciate how spoiled we are by based MAPPA.\n\nAlso FAVAROOOOOOOOOOO! "
  },
  {
   "score": 3,
   "id": "dj0gc6t",
   "pid": "t3_6hoald",
   "date": "2017-06-16 19:10:59",
   "depth": 0,
   "text": "I'm going to need a clean version of the end card!\n\nRita showing us once again why she's best girl."
  },
  {
   "score": 3,
   "id": "dj4e8f2",
   "pid": "t1_dj0gc6t",
   "date": "2017-06-19 13:27:26",
   "depth": 1,
   "text": "Son, there nothing clean about that end card."
  },
  {
   "score": 4,
   "id": "dj0m1iw",
   "pid": "t3_6hoald",
   "date": "2017-06-16 21:54:56",
   "depth": 0,
   "text": "Never give a Dragonkin a ball chained to her legs, or you'll get served in style."
  },
  {
   "score": 3,
   "id": "dj0vht1",
   "pid": "t3_6hoald",
   "date": "2017-06-17 05:00:04",
   "depth": 0,
   "text": "My only problem with the show so far is how are they going to explain that in the very first episodes we were shown Azazel and Mugaro literally entering the Colosseum to clear the mess and Mugaro used his power to do that yet somehow Chaorioce was completely oblivious to that matter.\n&nbsp;\n\nHow does that even work, did they just think \"oh he has a cool power w/e\" or what?"
  },
  {
   "score": 3,
   "id": "dj24s5i",
   "pid": "t1_dj0vht1",
   "date": "2017-06-18 01:15:43",
   "depth": 1,
   "text": "Demons have various powers."
  },
  {
   "score": 4,
   "id": "dj0zd6t",
   "pid": "t3_6hoald",
   "date": "2017-06-17 07:08:32",
   "depth": 0,
   "text": "Rita is such a bad ass."
  },
  {
   "score": 5,
   "id": "dj1abep",
   "pid": "t3_6hoald",
   "date": "2017-06-17 11:26:37",
   "depth": 0,
   "text": "The goth loli has landed. Prison break is now in progress. \n\nPretty bad though, they didn't show Favaro's escape shenanigans. Saving the best for later? FUCK THAT. I WANT IT NOW! \n\nAlso, with each episode, I like Charioce more. The angels pretending like the human kingdom is in chaos. It's quite the contrary, thanks to Charioce, they found peace from being the demon's prey. \n\nThe angels just don't like having their toys stolen and authority questioned. "
  },
  {
   "score": 8,
   "id": "dj044tf",
   "pid": "t3_6hoald",
   "date": "2017-06-16 14:37:56",
   "depth": 0,
   "text": "Villagers say it didn't use to be so dangerous.\n\nYou know.\n\nBack in the day the demons were attacking the city.\n\n\nEdit:\nAlso kinda hoping the gods get stomped.\n\n"
  },
  {
   "score": 3,
   "id": "dj0cia6",
   "pid": "t3_6hoald",
   "date": "2017-06-16 17:48:41",
   "depth": 0,
   "text": "In my opinion one of the most beautiful anime. I need wallpapers from the OP!!"
  },
  {
   "score": 3,
   "id": "dj0f7sl",
   "pid": "t3_6hoald",
   "date": "2017-06-16 18:43:34",
   "depth": 0,
   "text": "Jeanne's little moment with the spider was out of left field but adorable! The expectation was that a great warrior such as Jeanne would regard the spider as a tool in their plan to get through the guards but no it was just a simple freak out. I wish we heard her scream though, I bet it'd be cute.\n\nRita though, being best girl as always.\n\nAlso I'm convinced there's an unspoken price to El joining the gods. First time I ever told to a trap character \"It's a trap!\"."
  },
  {
   "score": 3,
   "id": "dj0it8u",
   "pid": "t3_6hoald",
   "date": "2017-06-16 20:19:00",
   "depth": 0,
   "text": "I hope Mugaro will save Azazel while he's(?) at it. Then the scene will be similar to how Azazel saved Mugaro before. The gods then will complain why Mugaro saved a demon then Mugaro defends Azazel since he was the one who saved him(?) before. Inb4 the gods and demons will join forces in the war."
  },
  {
   "score": 3,
   "id": "dj0j163",
   "pid": "t3_6hoald",
   "date": "2017-06-16 20:25:03",
   "depth": 0,
   "text": "well u guys should realize that Nina didnt blushed even a lil bit when Azazel trying to KISS n hugging her multiple times after she met Chris\n\nbut then in this ep u can see how she blushed so hard when Charioce getting closer to her even when that moment she didnt know that Charioce is Chris, yup even before she knew his identity, that is some attraction she actually has for him imo just wow xD"
  },
  {
   "score": 3,
   "id": "dj0lr49",
   "pid": "t3_6hoald",
   "date": "2017-06-16 21:45:41",
   "depth": 0,
   "text": "On one side I was super hyped seeing Mugaro's magical ~~girl~~ boy transformation and hearing him talk again, but on the other it's so sad that they are manipulating him in some way. I just want him and Jeanne to be together again.   \n   \nI don't know if I have mentioned it before but I absolutely adore the female characters from Bahamut. I have really been enjoying Nina's and Jeanne's interactions. Jeanne is specially interesting and we have seen many facets of her persoality; we have also seen her as a knight, a leader, a woman living a single life and a mother. I think that complexity came to light in the scene with Charioce, where she has to decide between the lives of many, including her son, and also her devotion to the gods and basically letting Charioce win. I will admit I was really hoping Nina would turn into a dragon and beat the fuck out of Charioce, though... so I am a little disappointed. It is absolutely understandable that she would be in shock, though, it's just a little sad to see both her and Jeanne so defeated. \n  \nCharioce is a piece of shit. I love him, but he's a piece of shit. I still want either Nina, Jeanne or Mugaro to give him a beating. Rita and Rocky are awesome and I love that she went to save Nina before Kaiser lol.  \n  \nThat Favaro and Kaisar preview, though, ahaha they are precious."
  },
  {
   "score": 3,
   "id": "dj0scq2",
   "pid": "t3_6hoald",
   "date": "2017-06-17 02:24:47",
   "depth": 0,
   "text": "Can we take a moment to talk about how good the antagonist is?\n\nHis goal of freeing humans from the yoke of gods and the fear of demons is a righteous one. And in this episode, he even has in mind to avoid a costly war. The right thing to do for Jeanne was to accept in that case.\n\nSure, he loses our sympathy by enslaving demons and condoning terrible horrors. But he's a very interesting villain."
  },
  {
   "score": 3,
   "id": "dj16m8v",
   "pid": "t1_dj0scq2",
   "date": "2017-06-17 10:04:08",
   "depth": 1,
   "text": "> And in this episode, he even has in mind to avoid a costly war. The right thing to do for Jeanne was to accept in that case.\n\nTo be fair the only reason there is going to be a war in this case is because he began to slaughter them first, tried to have Jeanne's child killed and then locked her up.\n\nHe isn't freeing the humans in this case as the gods here don't rule or really interfere with humans. He wants to replace them, he wants to rule all three races himself and he's willing to imprison, torture and kill demons, gods and humans alike to get what he wants."
  },
  {
   "score": 1,
   "id": "dj23u8h",
   "pid": "t1_dj16m8v",
   "date": "2017-06-18 00:31:18",
   "depth": 2,
   "text": "> He isn't freeing the humans in this case as the gods here don't rule or really interfere with humans. He wants to replace them, he wants to rule all three races himself and he's willing to imprison, torture and kill demons, gods and humans alike to get what he wants.\n\nMaybe you're right, but I don't think we know enough of his motivations and his backstory to assert that with this certainty.\n\nThe gods did require worship from the humans in order to protect them from demons. They were content to let this tree-way situation degenerate because it suited them. The events of the first season are directly their fault. Yes, Charioce wants humans to be as powerful as gods and demons, to be free of this imposed servitude. Because yes, it's servitude when you have no choice but to rely of powerful beings for your protection. That's basically what medieval society was about (the serfs devoted their life to their lord, in exchange for protection)."
  },
  {
   "score": 2,
   "id": "dj07lxh",
   "pid": "t3_6hoald",
   "date": "2017-06-16 15:52:05",
   "depth": 0,
   "text": "This season didn't let me down for a single episode. Today's episode was also great :D"
  },
  {
   "score": 2,
   "id": "dj0fvfl",
   "pid": "t3_6hoald",
   "date": "2017-06-16 18:58:43",
   "depth": 0,
   "text": "behind by a week. just wanted to comment about last week......holy fuck!"
  },
  {
   "score": 2,
   "id": "dj0zovr",
   "pid": "t3_6hoald",
   "date": "2017-06-17 07:17:18",
   "depth": 0,
   "text": "honestly... when nina say \"i transform to be a dragon when my heart doki-doki\". \ni thought when they have in trouble jeanne will take initiative to kiss nina to transform her.\n\nthen i realize it just my brain system from detecting yuri signal."
  },
  {
   "score": 2,
   "id": "dj13n61",
   "pid": "t3_6hoald",
   "date": "2017-06-17 08:55:28",
   "depth": 0,
   "text": "What the fuck is Charioce's deal with Nina? I thought he was interested in her too but then he goes and lock her up in a cell, and if that wasn't enough he taunts her like a dick and breaks her heart. (He was mocking her, right? I'm not sure what his intention was with that line...)\n\nFAVAROOOOO!"
  },
  {
   "score": 2,
   "id": "dj43jjy",
   "pid": "t3_6hoald",
   "date": "2017-06-19 10:14:03",
   "depth": 0,
   "text": "My boy Charioce best destroy those gods. Stop praying and take action. "
  },
  {
   "score": 1,
   "id": "dizzhku",
   "pid": "t3_6hoald",
   "date": "2017-06-16 13:05:54",
   "depth": 0,
   "text": "Gotta win their hearts and minds Gods. "
  },
  {
   "score": 1,
   "id": "dizzwh9",
   "pid": "t3_6hoald",
   "date": "2017-06-16 13:14:03",
   "depth": 0,
   "text": "Lets go Rita and her hand! Love the hand, wish I had a pet one. Looks like they'll finally be out of their cells next week."
  },
  {
   "score": 1,
   "id": "dj0665j",
   "pid": "t3_6hoald",
   "date": "2017-06-16 15:20:37",
   "depth": 0,
   "text": "Dang Gabriel talk about playing a kid like a damn fiddle! \nThis was a good episode that ended up making me really sad at the end with Nina finding out her crush was really the guy she despises. I think she is more confused than heart broken and think she will be back in her feet next episode!\nThe only thing that will get me made at the writers if they don't go some where with that relationship because it would make no since to set it all up just for it to disappear.\nI thought about it alot and it would make no sense in anyway to set Nina liking the antagonist other than it leading to some where. She could have fallen in love with anybody in this series and it would have done the same effect with her dragon morphing. \nThe relationship doesn't make sense to make her hate him because​ she already did or to learn a lesson which doesn't make a while lot of sense. There has to be a story with it because this was set up sense ep 3.\nSo please writes give me something that will satisfy!"
  },
  {
   "score": 1,
   "id": "dj08ftn",
   "pid": "t3_6hoald",
   "date": "2017-06-16 16:10:38",
   "depth": 0,
   "text": "the Favaroooooo at the end was completely worth it!\n\nPlus a very good and unsuccessful prison escape that I hope will be successful in the next episode."
  },
  {
   "score": 1,
   "id": "dj0jfip",
   "pid": "t3_6hoald",
   "date": "2017-06-16 20:36:15",
   "depth": 0,
   "text": "Having it be Charioce in the elevator instead of Nina was a nice twist on my expectations. "
  },
  {
   "score": 1,
   "id": "dj0ln8w",
   "pid": "t3_6hoald",
   "date": "2017-06-16 21:42:16",
   "depth": 0,
   "text": "FAVAROOOOOOOOOO!!!!!!!!\n\nAlso, YAY TO MORE RICA!"
  },
  {
   "score": 1,
   "id": "dj0uh0u",
   "pid": "t3_6hoald",
   "date": "2017-06-17 04:14:58",
   "depth": 0,
   "text": "I just realized that nina looses one of her lives every time the ed ends lmao \n\nRita was todays mvp\n\nand the endcard [](#squee)"
  },
  {
   "score": 1,
   "id": "dj0uwzn",
   "pid": "t3_6hoald",
   "date": "2017-06-17 04:35:30",
   "depth": 0,
   "text": "Finally binged this season and god damn AOTY so far. All the side characters last season were actually made important. Nina>Amira. I do miss the usual Favarro focus but this has all been done so well, the plot is way more compelling than \"an ancient evil awakens\"."
  },
  {
   "score": 1,
   "id": "dj11a9p",
   "pid": "t3_6hoald",
   "date": "2017-06-17 07:58:45",
   "depth": 0,
   "text": "This episode is amazing because of Rita."
  },
  {
   "score": 1,
   "id": "dj67wrh",
   "pid": "t3_6hoald",
   "date": "2017-06-20 14:53:28",
   "depth": 0,
   "text": "Nina is so annoying."
  },
  {
   "score": 1,
   "id": "djc416a",
   "pid": "t3_6hoald",
   "date": "2017-06-24 03:09:24",
   "depth": 0,
   "text": "The angels are evil af. I have been calling it for episodes comparing it to the whole amira suffering train. It's obvious but I just want to call on it because fuck the gods"
  },
  {
   "score": 1,
   "id": "dj08jmh",
   "pid": "t3_6hoald",
   "date": "2017-06-16 16:13:02",
   "depth": 0,
   "text": "Great series, I feel like its so underated especially this season, its amazing, apart from the useless sterotypical loli that are put in every series"
  },
  {
   "score": 5,
   "id": "dj0uyy2",
   "pid": "t1_dj08jmh",
   "date": "2017-06-17 04:38:00",
   "depth": 1,
   "text": ">Rita is useless\n\nYou take that back!"
  },
  {
   "score": 0,
   "id": "dj09dzo",
   "pid": "t3_6hoald",
   "date": "2017-06-16 16:32:57",
   "depth": 0,
   "text": "Humans got their instability and desobey the gods, so we have to fuck them up, haha and there's people who think charioce isn't right "
  },
  {
   "score": 2,
   "id": "dj1aje9",
   "pid": "t1_dj09dzo",
   "date": "2017-06-17 11:31:29",
   "depth": 1,
   "text": "Charioce didn't even feel like attacking the angels, out of the kindness of his heart, he just wanted to get rid of the humanity's threat, the demons. Now he'll be just self-defending now against those blood thirsty angels. \n\nHe's a saint. \n\nCharioce did nothing wrong. "
  }
 ]
}