{
 "score": 705,
 "id": "6hflpu",
 "num_comments": 393,
 "date": "2017-06-15 08:10:43",
 "comments": [
  {
   "score": 316,
   "id": "dixygrp",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 08:51:48",
   "depth": 0,
   "text": "Yes, Katou, you *should*. "
  },
  {
   "score": 139,
   "id": "diylx4w",
   "pid": "t1_dixygrp",
   "date": "2017-06-15 16:04:06",
   "depth": 1,
   "text": "Katou best girl 2017, calling it now."
  },
  {
   "score": 14,
   "id": "diynu3a",
   "pid": "t1_diylx4w",
   "date": "2017-06-15 16:46:30",
   "depth": 2,
   "text": "As much as I'd love for that to be there's another \"megumi\" that's quite popular right now."
  },
  {
   "score": 68,
   "id": "diz1bgw",
   "pid": "t1_diylx4w",
   "date": "2017-06-15 22:29:24",
   "depth": 2,
   "text": "2018 Bruh.\n\nIt's going to be a Re:Zero vs. Konosuba brawl this year."
  },
  {
   "score": 1,
   "id": "dj015is",
   "pid": "t1_diz1bgw",
   "date": "2017-06-16 13:38:17",
   "depth": 3,
   "text": "[When you think your favorite girl still has a chance.](http://i.imgur.com/RiHMl6L.png)"
  },
  {
   "score": 1,
   "id": "dizs0ne",
   "pid": "t1_diz1bgw",
   "date": "2017-06-16 10:46:40",
   "depth": 3,
   "text": "Don't matter what happens on the popularity polls. Katou is still the way and life."
  },
  {
   "score": 21,
   "id": "diz2e6m",
   "pid": "t1_diz1bgw",
   "date": "2017-06-15 23:05:34",
   "depth": 3,
   "text": "Re:Zero aired 2016 though, how could any heroine from that anime come up as best girl 2017??"
  },
  {
   "score": 1,
   "id": "dj0sv4h",
   "pid": "t1_diz2e6m",
   "date": "2017-06-17 02:51:56",
   "depth": 4,
   "text": "There's a 1 year wait period before you can vote for a character. Most likely to stop people being hasty and making everything messy."
  },
  {
   "score": 12,
   "id": "diz3pbw",
   "pid": "t1_diz2e6m",
   "date": "2017-06-15 23:54:11",
   "depth": 4,
   "text": "He is probably referring to the current 'best girl' contest that is being dominated by Re:Zero and Konosuba characters."
  },
  {
   "score": 6,
   "id": "diz4jww",
   "pid": "t1_diz3pbw",
   "date": "2017-06-16 00:29:04",
   "depth": 5,
   "text": "\"best girl\" in BIG quotation marks"
  },
  {
   "score": 10,
   "id": "dizy6wo",
   "pid": "t1_diz4jww",
   "date": "2017-06-16 12:40:43",
   "depth": 6,
   "text": "It's a popularity contest like any opinion poll.\n\nThe only way to find a \"Best\" is by setting measurable parameters or a panel of judges. That's why there's always so much salt when a well-developed but not popular girl loses."
  },
  {
   "score": 8,
   "id": "dj0syvb",
   "pid": "t1_dizy6wo",
   "date": "2017-06-17 02:57:30",
   "depth": 7,
   "text": "> setting measurable parameters\n\n[] Is Holo\n\n[] Is Not Holo\n\nWhere is your god now?"
  },
  {
   "score": 36,
   "id": "diz3ppk",
   "pid": "t1_diz2e6m",
   "date": "2017-06-15 23:54:40",
   "depth": 4,
   "text": "Because there's supposedly a participation ban for girls from animes shown 1 year before this year's Best Girl Contest so technically, girls up to Winter season of 2016 are the only ones who are \"qualified\" to join the 2017 Best Girl contest.\n\nBut since season 1 of Saekano was aired in Winter 2015, they qualify. But they have recency bias on their side to boot due to the currently airing anime.\n\nSo without this season 2 of Saekano, Megumi Katou should have been soooo 2015 compared to Re:Zero girls that aired in the Spring and Summer of 2016.\n\nEDIT: Nevertheless, will Vote for Katou all the way and sink with her when she meet the crowd favorites."
  },
  {
   "score": 295,
   "id": "diyewo1",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 13:44:11",
   "depth": 0,
   "text": "And after 20 minutes katou appears 10 seconds and steals the show, declaring that she is best girl... gotta love her.."
  },
  {
   "score": 20,
   "id": "dj0ehbc",
   "pid": "t1_diyewo1",
   "date": "2017-06-16 18:30:29",
   "depth": 1,
   "text": "40 minutes, she wasn't in the last episode."
  },
  {
   "score": 68,
   "id": "dizrxzp",
   "pid": "t1_diyewo1",
   "date": "2017-06-16 10:45:21",
   "depth": 1,
   "text": "I could see almost too clearly that the 23 minute's worth of budgeting was all spent on the 3 seconds of Katou's face. A1 sure knows their priorities."
  },
  {
   "score": 1,
   "id": "dj2nsx4",
   "pid": "t1_dizrxzp",
   "date": "2017-06-18 11:13:18",
   "depth": 2,
   "text": "Yeah, the animation quality has been all over the place this season :/ First episode looked out of this world amazing, everything after that... well..."
  },
  {
   "score": 225,
   "id": "diyzq9v",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 21:39:49",
   "depth": 0,
   "text": "I'm going to defend Aki and say that he is actually not a bad director and in fact a decent one.\n\n\n\nIt does not help that he had no Idea that his creators needed a sadist producer to push themselves.\n\n\n\n\nSecond, He know himself he was a newbie so he had no plan to approach Eriri and Utaha the same way Akane did.\n\n\n\nThird, Utaha and Eriri arent paid and so again he had no reason and motivation to demand more from them.\n\n\n\nFourth, Tomoya is the kind of guy that needs people can work under minimal supervision under his command. If you think about its the two girls that had the problem and self inflicted crisis, not tomoya.\n\n\n\nLong story short, I dont get the blame that utaha and eriri putting on Tomoya about how bad he is as a producer.. "
  },
  {
   "score": 1,
   "id": "diz7xqn",
   "pid": "t1_diyzq9v",
   "date": "2017-06-16 03:03:53",
   "depth": 1,
   "text": "Mhmm tbh in just regards to making your co workers work he's not doing very well. But that's based on the idea that a good producer will make everyone work. There's a lot of more duties, but that's one of them imo.\n\nThing is that he was carried by people far more skilled than him. He basically didn't really do anything (Overexagerating, he did push Utaha and wrote part of the story). And that was enough for Cherry Blossoms. He's not bad looking at it from the outside, but in comparison to the giants he's working with he's bad."
  },
  {
   "score": 3,
   "id": "dj5h8ep",
   "pid": "t1_diyzq9v",
   "date": "2017-06-20 07:00:17",
   "depth": 1,
   "text": "> creators needed a sadist producer to push themselves.\n\nMakes one wonder if Steve Jobs was not such an asshole at Apple, whether all of those popular products would have been made or not?"
  },
  {
   "score": 6,
   "id": "dizubhn",
   "pid": "t1_diyzq9v",
   "date": "2017-06-16 11:28:15",
   "depth": 1,
   "text": "I think most of a producer's job is identifying and putting together talent. Yes motivating is part of it, but honestly if the people underneath him are prfessional that shouldnt be the main crux of his job. "
  },
  {
   "score": 32,
   "id": "diz6e4p",
   "pid": "t1_diyzq9v",
   "date": "2017-06-16 01:51:00",
   "depth": 1,
   "text": "It didn't feel like blame to me. They're saying that he doesn't get the best out of his creators, which has been shown to be true. They're not judging him, just stating facts that affects Utaha and Eriri on a professional level."
  },
  {
   "score": 1,
   "id": "dj0fva8",
   "pid": "t1_diz6e4p",
   "date": "2017-06-16 18:58:35",
   "depth": 2,
   "text": "Doesn't get the best but made the best VN of the year?"
  },
  {
   "score": 2,
   "id": "dj0lib4",
   "pid": "t1_dj0fva8",
   "date": "2017-06-16 21:37:44",
   "depth": 3,
   "text": "Okay but in the process Eriri almost lost her ability to draw/paint and Aki could do nothing to fix it. Just bc they made a good product does not mean that your producer is good for you/your career in the long run"
  },
  {
   "score": 3,
   "id": "dj0nfgn",
   "pid": "t1_dj0lib4",
   "date": "2017-06-16 22:43:28",
   "depth": 4,
   "text": "That was because of a character flaw of her own. Aki had plenty of his own, and should have enforced the deadlines more, but he would have learned from that."
  },
  {
   "score": 37,
   "id": "diza9eo",
   "pid": "t1_diz6e4p",
   "date": "2017-06-16 04:39:28",
   "depth": 2,
   "text": "\"I suck at my job so the problem is definitely my boss and I dont have anything to do with it\""
  },
  {
   "score": 18,
   "id": "dizahpc",
   "pid": "t1_diza9eo",
   "date": "2017-06-16 04:47:23",
   "depth": 3,
   "text": "More like \"I suck at my job, I'd better find another one\"."
  },
  {
   "score": 2,
   "id": "dj0dc7q",
   "pid": "t1_dizahpc",
   "date": "2017-06-16 18:09:10",
   "depth": 4,
   "text": "who needs them? Tomoya will find another and better talents he did it once  ^^"
  },
  {
   "score": 17,
   "id": "dizc4x3",
   "pid": "t1_diz6e4p",
   "date": "2017-06-16 05:37:28",
   "depth": 2,
   "text": "I think he does push the creators to do their best work, he just felt guilty and stopped pushing them for a few months, and didn't realize that they actually preferred to work that way."
  },
  {
   "score": 6,
   "id": "dj1z8wy",
   "pid": "t1_dizc4x3",
   "date": "2017-06-17 21:38:29",
   "depth": 3,
   "text": "Yeah, that was the point of Eriri's big flashback scene. Rinri-kun just couldn't deal with the consequences of his actions, and viewed the two as friends rather than employees, screwing everyone, collectively, over with regard to Comiket, the compensation for their time, etc."
  },
  {
   "score": 19,
   "id": "dizcwti",
   "pid": "t1_diyzq9v",
   "date": "2017-06-16 05:55:56",
   "depth": 1,
   "text": "The part about them not being paid. If I remember right, they're splitting the profits from the sales."
  },
  {
   "score": 92,
   "id": "dizbz0q",
   "pid": "t1_diyzq9v",
   "date": "2017-06-16 05:33:19",
   "depth": 1,
   "text": "I don't think the creators needed a sadist producer, and I think the reason why Akane is going after fresh talent is because she's destroyed everyone else that she worked with. The problem is that Tomoya is trying to be a friend and a producer at the same time, and whenever those two roles come into conflict, he chooses to be a friend first and producer second. So he eats up Eriri's excuses about the artwork and lets her work slide for weeks and then months, because that's what a friend would do.\n\nWhat Eriri and Utaha need is a producer that pushes them to do better work without burning out in the process. That describes neither Tomoya nor Akane, and if they're going to choose one or the other, they're going to choose Akane because they can't look themselves in the mirror if they slack off."
  },
  {
   "score": 4,
   "id": "dj22fhk",
   "pid": "t1_dizbz0q",
   "date": "2017-06-17 23:30:25",
   "depth": 2,
   "text": "> lets her work slide for weeks and then months, because that's what a friend would do.\n\nI'm not sure I agree with that. Some times you need your friends to tell you the harsh truths.\n\nThis hits close to home but if you're supposed to be a creator, you gotta create *every day* even if it's shit. "
  },
  {
   "score": 5,
   "id": "dj2ctul",
   "pid": "t1_dj22fhk",
   "date": "2017-06-18 06:54:18",
   "depth": 3,
   "text": "That's splitting hairs... sure it's not what *perfect* friend would do, it's just what a friend would do."
  },
  {
   "score": 24,
   "id": "dj073ed",
   "pid": "t1_dizbz0q",
   "date": "2017-06-16 15:40:42",
   "depth": 2,
   "text": "Yeah, Akane may not be great but she does light a fire under their butts. Basically, the perfect producer would be someone that could be a friend outside work but be willing to put their feet to the fire to still meet a deadline."
  },
  {
   "score": 139,
   "id": "diy0q1n",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 09:31:30",
   "depth": 0,
   "text": "I really hope this gets a third season. After reading summaries of the light novels i don't really like the idea of what will probably be the ending of this season being the last we see of this series in anime form. "
  },
  {
   "score": 1,
   "id": "dizs2tn",
   "pid": "t1_diy0q1n",
   "date": "2017-06-16 10:47:45",
   "depth": 1,
   "text": "I think they will be going original on this. On the LN katou did not do this."
  },
  {
   "score": 9,
   "id": "diybpld",
   "pid": "t1_diy0q1n",
   "date": "2017-06-15 12:46:12",
   "depth": 1,
   "text": "Where can I find the summaries ?"
  },
  {
   "score": 100,
   "id": "diygw0s",
   "pid": "t1_diybpld",
   "date": "2017-06-15 14:21:53",
   "depth": 2,
   "text": "Huge spoilers in all of these links for way beyond the current anime. I can't find volumes 1-5 but they might be somewhere. All of that is covered in the anime anyway. \n\nVolume 6: http://msnkkan.blogspot.com/2014/04/do-you-remember-love.html?m=1\n\nVolume 7: http://msnkkan.blogspot.de/2014/12/last-note-first-trip.html?m=1\n\nVolume 8: https://magnavalon.wordpress.com/2015/07/20/saekano-volume-8-a-new-beginning/\n\nVolume 9: https://www.reddit.com/r/Saekano/comments/449fw0/spoilers_saenai_heroine_no_sodatekata_volume_9/\n\nVolume 10: https://magnavalon.wordpress.com/2016/07/20/saekano-volume-10/\n\nVolume 11: https://magnavalon.wordpress.com/2016/11/19/saekano-volume-11-blessing/\n\nVolume 12: https://magnavalon.wordpress.com/2017/03/17/saekano-volume-12/\n\nI'm pretty sure those are the exact ones i read, all from google. magnavalon seems to be a good site for them in general. "
  },
  {
   "score": 1,
   "id": "dizngb9",
   "pid": "t1_diygw0s",
   "date": "2017-06-16 09:24:33",
   "depth": 3,
   "text": "second season will probably end with what volume?"
  },
  {
   "score": 3,
   "id": "dizoyki",
   "pid": "t1_dizngb9",
   "date": "2017-06-16 09:51:36",
   "depth": 4,
   "text": "[My personal guess is the end of volume 7 because](/s \"That is when Tomoya catches up to Eriri and Utaha at the train station where they are going to work on their new game. Good convo, sort of making up and there is a kissing scene. \")"
  },
  {
   "score": 1,
   "id": "diz5uwp",
   "pid": "t1_diygw0s",
   "date": "2017-06-16 01:26:46",
   "depth": 3,
   "text": "this is what i neededd thanks\n"
  },
  {
   "score": 1,
   "id": "diz4mpf",
   "pid": "t1_diygw0s",
   "date": "2017-06-16 00:32:27",
   "depth": 3,
   "text": "Thank you !!"
  },
  {
   "score": 3,
   "id": "diylzxq",
   "pid": "t1_diygw0s",
   "date": "2017-06-15 16:05:43",
   "depth": 3,
   "text": "Thanks mate"
  },
  {
   "score": 3,
   "id": "dizwjgq",
   "pid": "t1_diygw0s",
   "date": "2017-06-16 12:09:32",
   "depth": 3,
   "text": "yeah i gotta save these just in case no season 3 :/\n"
  },
  {
   "score": 6,
   "id": "diy14jy",
   "pid": "t1_diy0q1n",
   "date": "2017-06-15 09:38:30",
   "depth": 1,
   "text": "I agree, but I've heard its sort of rare for these anime adaptations of LNs to get more than these two seasons?\n\nSorry if I'm totally wrong, I just started watching more anime recently and just found about LNs in general."
  },
  {
   "score": 3,
   "id": "diz428p",
   "pid": "t1_diy14jy",
   "date": "2017-06-16 00:08:28",
   "depth": 2,
   "text": "Yeah, since the main reason LNs get adapted is to increase LN sales. Check Konosuba."
  },
  {
   "score": 3,
   "id": "diz3v0f",
   "pid": "t1_diy14jy",
   "date": "2017-06-16 00:00:21",
   "depth": 2,
   "text": "well mostly because you can tell 10-12 volumes of LN in about 24 episodes depending on how dense each volume is and there is nothing to tell after that...though we can always hope that it gets the Oreimo treatment where they wrap it up via 5 or so additional episodes released elsewhere...."
  },
  {
   "score": 50,
   "id": "diy195g",
   "pid": "t1_diy0q1n",
   "date": "2017-06-15 09:40:46",
   "depth": 1,
   "text": "Sadly it most probably won't get a third season as volume 13 is the last volume of the LN.\n\nUnless it's something that the creator wants, there's no real reason to make anime adaptation of a finished series. "
  },
  {
   "score": 1,
   "id": "dizhsvt",
   "pid": "t1_diy195g",
   "date": "2017-06-16 07:39:41",
   "depth": 2,
   "text": "I fucking HATE that about this idnustry.\n\nwas there any similar novel that they adapted fully?\n"
  },
  {
   "score": 1,
   "id": "dizg740",
   "pid": "t1_diy195g",
   "date": "2017-06-16 07:08:05",
   "depth": 2,
   "text": "I disagree. \n\nWhat makes you so confident that there won't be a third season? Are you forgetting Shakugan no Shana (3 seasons) and Zero no Tsukaima (4 seasons)?\n\nOK, let's ignore ZnT's original anime ending, which was forgettable (not to mention the series suffers from Creator Existential Failure, as its author sadly passed away before he could complete his story). \n\nThe Shana anime made an effort to finish the story, which coincides with the completion of the novel. \n\nSo I don't see why they can't go for such an approach, to make a third season to occur at the same time as the novel itself wraps up. This would be even easier as Maruto writes for both the novel AND the anime adaptation script."
  },
  {
   "score": 14,
   "id": "diy7luf",
   "pid": "t1_diy195g",
   "date": "2017-06-15 11:32:29",
   "depth": 2,
   "text": "[](#makicry)\n\nWhat if they released a couple of OVAs to bring the story to a conclusion?"
  },
  {
   "score": 26,
   "id": "diy92rq",
   "pid": "t1_diy7luf",
   "date": "2017-06-15 11:58:45",
   "depth": 3,
   "text": "No thanks... a few side story / original OVAs are fine, but for a proper conclusion, I would rather wait for a S3 even if it doesn't materialize any time soon if ever.\n\n* S1 + S2 adapted vol 1-7 + GS1, eight volumes\n* Materials remaining: vol 8-13 + GS2 + GS3, eight volumes\n\nSo you will need at least 24 \"OVA\" episodes to \"bring the story to a conclusion\".  Unlikely right? So I would rather them not to rush it and waste the source materials on 4 or 5 OVA episodes."
  },
  {
   "score": 2,
   "id": "dizk99j",
   "pid": "t1_diy92rq",
   "date": "2017-06-16 08:25:53",
   "depth": 4,
   "text": "What's a GS?"
  },
  {
   "score": 1,
   "id": "dizlmkl",
   "pid": "t1_dizk99j",
   "date": "2017-06-16 08:51:10",
   "depth": 5,
   "text": "Girls Side volumes, side stories or main story told from girls' POV, such as the interactions between Utaha and Eriri in episode 1, 9 and 10."
  },
  {
   "score": 10,
   "id": "diyheur",
   "pid": "t1_diy195g",
   "date": "2017-06-15 14:32:04",
   "depth": 2,
   "text": "Idk exactly how anime creation/LN sales work but maybe if the show is popular and if there is a surge in LN sales after this season is over maybe they will make a third. "
  },
  {
   "score": 24,
   "id": "diys7q2",
   "pid": "t1_diyheur",
   "date": "2017-06-15 18:28:28",
   "depth": 3,
   "text": "I sometimes wonder if they intentionally don't finish the series so that people will have to buy the LN to see the end. I feel like most people wouldn't go back to read the LN if they already saw the ending in the anime. A lot of people that do pick up the LNs (or manga) often pick up from where the anime left off instead of reading from the beginning."
  },
  {
   "score": 3,
   "id": "diznyp7",
   "pid": "t1_diys7q2",
   "date": "2017-06-16 09:33:42",
   "depth": 4,
   "text": "> A lot of people that do pick up the LNs (or manga) often pick up from where the anime left off instead of reading from the beginning.\n\nI don't know how many statistics you used or which source, or if you use only your own behavior as a base for this, I could argue against it with the sales of Eromanga-Sensei, which is a really close adaption to the LN.\n\nThe LN is since the second week in the charts of MAL for LNs with sales around 3000 for the first volume, and with passing weeks, the next LN volumes (1-4) got also some bonus sales around 3000, and with that, the first volumes sold in the last weeks around 50000 extra volumes, and reached 150000 sales for the first volume. \n\nSo it looks like that they started to buy it from the first one.\n\nNow we can look out for a change in the buying behavior after the last episode, which will end with volume 4, so that the fifth volume should have a more massive boost than the volumes before.\n"
  },
  {
   "score": 1,
   "id": "dizvg3n",
   "pid": "t1_diznyp7",
   "date": "2017-06-16 11:49:11",
   "depth": 5,
   "text": "I'm only basing this on anecdotal experience from people on this subreddit posting about where LN/manga pick up. I do realize that this may not really sample of the larger community here which in turn is not a good sample of people living in Japan. So if the data suggests that sales of the early volumes of a LN/manga increases more strongly than the volumes where the adaption leaves off, then I'm probably wrong.\n\nThinking back on it now it is probably more likely that the people funding the anime find the ROI for later seasons doesn't justify creating them instead of deliberately not ending them. I'm kinda curious on how LN sales were affected by the three seasons of shakugan no Shana, because this is the only series, I know of, that received a third season to finish the series."
  },
  {
   "score": 1,
   "id": "dizvyn4",
   "pid": "t1_dizvg3n",
   "date": "2017-06-16 11:58:47",
   "depth": 6,
   "text": "Not a third season, but Oregairu is also fully adapted, also OreImo, Monogatari is on the way, the same could go with SAO, and I think there could be some more fully adapted ones. It is not that there aren't any fully adapted ones."
  },
  {
   "score": 29,
   "id": "diz3oe7",
   "pid": "t1_diys7q2",
   "date": "2017-06-15 23:53:10",
   "depth": 4,
   "text": "That's actually why they adapt LNs. To increase LN/manga sales."
  },
  {
   "score": 20,
   "id": "dj0fwxp",
   "pid": "t1_diz3oe7",
   "date": "2017-06-16 18:59:52",
   "depth": 5,
   "text": "Sucks for english speakers since hardly any LNs get translated.."
  },
  {
   "score": 3,
   "id": "djfnbbv",
   "pid": "t1_dj0fwxp",
   "date": "2017-06-26 13:49:20",
   "depth": 6,
   "text": "Saekano is getting trasnlated atleast."
  },
  {
   "score": 2,
   "id": "djfqjyp",
   "pid": "t1_djfnbbv",
   "date": "2017-06-26 14:51:10",
   "depth": 7,
   "text": "Yeah, slowly, hopefully won't get dropped."
  },
  {
   "score": 156,
   "id": "diycgia",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 12:59:24",
   "depth": 0,
   "text": "Honestly out of most of the male leads in the past few years, tomoya seems to be the kindest most honest one of them all. Like he feels like such a true kind friend. I wish he was my best friend (cries in corner)"
  },
  {
   "score": 1,
   "id": "dj172i7",
   "pid": "t1_diycgia",
   "date": "2017-06-17 10:14:24",
   "depth": 1,
   "text": "Too bad he doesn't have any friends expect someone random background character :( Besides, the first time Tomoya gets betrayed is probably most of his fault too. Okay, they get busted and the people start talking behind their back. Tomoya, as the idiot he is, thinks that by continuing to be himself without any concern to the other people that people will still like him for it. He doesn't care about the social anxiety that Eriri must have had, he doesn't care how people view him. While in most cases \"being yourself\" is viewed as a good thing, in this time all it did was further isolate Tomoya. If he could have just talked with Eriri on his own time, and acted like a normal human being at school, none of this would have happened. He fails to understand the people around him and refuses to change. So in other words, this is Tomoya's problem. Not Eriri. "
  },
  {
   "score": 61,
   "id": "dizyb8x",
   "pid": "t1_diycgia",
   "date": "2017-06-16 12:43:00",
   "depth": 1,
   "text": "> tomoya \n\nWait a minute...\n\nTomo**y**a... greatest friend... sacrifices...\n\n[**TOMODA!!!**](#TOMODA)"
  },
  {
   "score": 14,
   "id": "dj25bn8",
   "pid": "t1_dizyb8x",
   "date": "2017-06-18 01:42:28",
   "depth": 2,
   "text": "OH MY GOD."
  },
  {
   "score": 35,
   "id": "dizw76c",
   "pid": "t1_diycgia",
   "date": "2017-06-16 12:03:10",
   "depth": 1,
   "text": "He gets a lot of hate in this sub though. "
  },
  {
   "score": 79,
   "id": "dizww5e",
   "pid": "t1_dizw76c",
   "date": "2017-06-16 12:16:08",
   "depth": 2,
   "text": "I find it ridiculous how much hate he gets is just some kid trying to make a game with friends he sees as talented. He isn't a professional game director. He isn't someone who has studied game development and he certainly had no experience before this making games. He is just some guy trying to make his dream come true yet the people on this sub hate him for trying to do it because he has no idea how to do it."
  },
  {
   "score": 9,
   "id": "dj0tnef",
   "pid": "t1_dizww5e",
   "date": "2017-06-17 03:33:44",
   "depth": 3,
   "text": "I was indifferent to Tomoya all the way from the start up until episode 5/6 of S2. He wasn't great, but he had some entertaining scenes with the other characters, being both a decent straight man and funny man.\n\nI could still deal with the whole Eriri breakdown buildup, even if it made me feel a bit uncomfortable. But I could not for the life of me put aside him ignoring the phone call from Katou. The fiasco of their makeup (not talking to her for 2 months, and that convoluted apology) did not help him win back points for me.\n\nWe don't hate him cause he doesn't know how to make his dream come true, we hate him because there's some ridiculously idiotic things he's done we cannot get over."
  },
  {
   "score": 7,
   "id": "dj10rcz",
   "pid": "t1_dj0tnef",
   "date": "2017-06-17 07:45:24",
   "depth": 4,
   "text": "You are holding a 16-yr old to really high standards. "
  },
  {
   "score": 3,
   "id": "dj1pepx",
   "pid": "t1_dj10rcz",
   "date": "2017-06-17 17:09:48",
   "depth": 5,
   "text": "Even if people make the wrong decisions and go about doing stupid mistakes, there is at least a flow of logic you can follow, even if you might not sympathise with it (e.g. This guy hangs out with my girlfriend a lot, I hate him and I want to kill him so I will).\n\nLet me list out his shit again.\n\n* The whole mess with Katou could've been avoided if he had _just answered his phone_\n* He does nothing for _2 months_\n* His apology plan _makes no sense at all_. All he had to do was sincerely apologise to Katou, which he does at the end for 2:15mins.\n\nThe apology goes for the full half of the episode, when the part he should've straight out said was a mere fraction of that. The previous episode (episode 7) was dedicated to nothing as well.\n\nThe narrative not only makes no sense, it unnecessarily pads out the length of the series as well. His age is completely irrelevant here."
  },
  {
   "score": 32,
   "id": "dj06zv7",
   "pid": "t1_dizww5e",
   "date": "2017-06-16 15:38:35",
   "depth": 3,
   "text": "Also, I could understand not taking the chance to go into relationships either. He seems the type that's scared to take that step and having past issues with one girl clearly interested in him that he hasn't completely forgiven her for and being a little put off by how aggressively the other is pursuing him makes a lot of sense to me."
  },
  {
   "score": 40,
   "id": "diz48un",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 00:16:02",
   "depth": 0,
   "text": "[I see your Rokudenashi product placement](https://i.imgur.com/I9jcAOT.png)"
  },
  {
   "score": 5,
   "id": "dj3oavm",
   "pid": "t1_diz48un",
   "date": "2017-06-19 04:35:08",
   "depth": 1,
   "text": "Wow how did I even miss that! \n\nYou have a good eye!"
  },
  {
   "score": 34,
   "id": "diz34ql",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 23:32:18",
   "depth": 0,
   "text": "Kurehito Misaki's [art](http://imgur.com/ox6Uprk.png) is top notch. Pretty funny to see Eriri to be able to draw like that.\n\n[More](http://imgur.com/a/lM3tw) Utaha with the legs :D"
  },
  {
   "score": 1,
   "id": "dizbnx0",
   "pid": "t1_diz34ql",
   "date": "2017-06-16 05:24:24",
   "depth": 1,
   "text": "Masterpiece arts. That Utaha image can be put into a Dakimakura."
  },
  {
   "score": 2,
   "id": "dj8p8u2",
   "pid": "t1_diz34ql",
   "date": "2017-06-22 02:55:41",
   "depth": 1,
   "text": ">Kurehito Misaki's [art](http://imgur.com/ox6Uprk.png)\n\nI want that on my wall \\*_\\* \n\nIs there a place I can download it in high resolution to print it? Or do I ask Misaki to make me one?!   "
  },
  {
   "score": 2,
   "id": "dj8r6z6",
   "pid": "t1_dj8p8u2",
   "date": "2017-06-22 04:18:31",
   "depth": 2,
   "text": "Here are some images on [danbooru](https://danbooru.donmai.us/posts?utf8=%E2%9C%93&tags=misaki_kurehito+order%3Afavcount+&ms=1). Some (looks like from Saekano BD posters) are hi-res 4k x 3k. He has multiple artbooks. The BD will probably has some posters too."
  },
  {
   "score": 10,
   "id": "diza4a5",
   "pid": "t1_diz34ql",
   "date": "2017-06-16 04:34:30",
   "depth": 1,
   "text": "Thanks, I was looking for that sketch stitch. Ctrl+F'd stitch but I couldn't find one before you posted.\n\nSo Eriri's the in-universe Misaki, I hadn't noticed since I marathoned through really quickly until last week. His art now is also a step above some of the older artworks I've saved years ago, especially with that sketch you stitched. It's so perfect how everything flows fluidly, the cloth's texture, the interplay between the shadows and the washed out light---it's so *perfect*.\n\nI hope to they release a new Misaki Kurehito artbook that includes all his new works, instead of the [old one that only included works from 2005 to 2010](https://otakumode.com/shop/526f358c4208ec1e5b00003b/Cradle-Misaki-Kurehito-Art-Book)."
  },
  {
   "score": 2,
   "id": "dizb0ds",
   "pid": "t1_diza4a5",
   "date": "2017-06-16 05:04:32",
   "depth": 2,
   "text": "Making these stitches is pretty easy, I just screenshot and put them into [ICE](https://www.microsoft.com/en-us/research/product/computational-photography-applications/image-composite-editor/) lol, no skills involved.\n\nPretty great to see Utaha touched with Eriri's [art](https://blog.meap.ovh/user/pages/01.blog/saenai-heroine-no-sodatekata-e01-stitches/Saekano%20S02E01%20stitched%20gimped%20crushed.png) again just like when they first met. Eriri changed a lot with her [new](http://imgur.com/a/lyQc9) style now which should be Misaki's. I wonder if they will release the game art, maybe as bonus contents for the bluray.\n\nI only got into anime recently so didn't know much about him but as soon as I saw his saekano ln covers, I'm done and got deep into the series and his art now."
  },
  {
   "score": 2,
   "id": "dj1rpw9",
   "pid": "t1_dizb0ds",
   "date": "2017-06-17 18:11:46",
   "depth": 3,
   "text": "Katou gonna be needing all the support next round against Illya, then Saber and probabaly Kiryuin. In the best girl contest."
  },
  {
   "score": 51,
   "id": "diyvqas",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 19:54:05",
   "depth": 0,
   "text": "[dat fujoshi stare](http://imgur.com/a/wZIC2)"
  },
  {
   "score": 3,
   "id": "dj0ac4v",
   "pid": "t1_diyvqas",
   "date": "2017-06-16 16:55:27",
   "depth": 1,
   "text": "amidst all the drama, I needed that laugh"
  },
  {
   "score": 19,
   "id": "diz92ny",
   "pid": "t1_diyvqas",
   "date": "2017-06-16 03:54:13",
   "depth": 1,
   "text": "[](#fujostare)"
  },
  {
   "score": 52,
   "id": "dizfdjy",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 06:51:13",
   "depth": 0,
   "text": "#**ALL HAIL BEST GIRL KATOU.**\n\nShe's seemingly reverted back to her Bob Cut, yet this is no ordinary Bob Cut. \n\nMuch like those MMORPGs with their \"Transcendent Class\", where you seemingly \"revert\" back to your original \"Noob Class\" when you hit Level 99, but this is a \"Super Noob\" that unlocks even more Godly abilities.\n\nOh, and this episode is supposed to be about how Utaha and Eriri now seem resigned to losing the shipping war, and have now embraced their own yuri ship instead to console each other's tears. /s"
  },
  {
   "score": 11,
   "id": "dizkjzb",
   "pid": "t1_dizfdjy",
   "date": "2017-06-16 08:31:19",
   "depth": 1,
   "text": "Utaha x Eiri, and Kato wins the shipping war.  I say everybody wins"
  },
  {
   "score": 199,
   "id": "dixywxm",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 08:59:39",
   "depth": 0,
   "text": "Making Utaha shoulder everything was cowardly of Eriri. It basically the second time she betrays Tomoya too.\n\n[](#katoupout)\n\nAlso, I do not agree that creative types always need pressure to improve themselves. Sure, it may get some slackers going, but this part seems to be forced to fit with the Japanese narrative. After all, they have a very competitive culture. Furthermore, the anime and games industry works them to death. \n\nHowever, the great artists and visionaries of History have often achieved their masterpieces from inspiration and passion, rather than being compelled to to so. Overworking an artist, from my experience, leads to bland, repetitive and sometimes even mediocre work.\n\n"
  },
  {
   "score": 8,
   "id": "diz69y6",
   "pid": "t1_dixywxm",
   "date": "2017-06-16 01:45:50",
   "depth": 1,
   "text": "I don't get all this talk about \"betraying\". I mean, I get it from the characters in-universe, not from the fans who repeat it all the time. It's not like they were engaged or something. Sure, it's Japan, but most people on Reddit are from the US, so they should understand that people in a team come and go and don't necessarily stay at the same place all their life.\n\nAs for the delivery, Eriri didn't voluntarily made Utaha shoulder it - Aki just happened to as her first. Yes, she should have warned him beforehand. But, first, the blame lies with Akane who should have gone through their producer instead of making them take the blame, and second, given Tomoya's overreaction, I understand that they were afraid of bringing him the news.\n\nUtaha felt very bad when she had to tell Tomoya. Eriri would have been completely broken, given that she is much less resilient.\n\n-\n\nAnd whether the pressure is required or not in the real world is, within the story, not really relevant because we saw that it was, indeed, what Eriri needed."
  },
  {
   "score": 12,
   "id": "dizyo4e",
   "pid": "t1_diz69y6",
   "date": "2017-06-16 12:49:52",
   "depth": 2,
   "text": "Because of the way it was done, that is the betrayal. As that one random dude said, she should have gone to the leader of the team to ask to contact the artists themselves, not poach them. And they should have given their answer to both in advance, instead of been like \"Bitch WE ARE OUT!\". \n\nHow is this hard to get? Yes teams come and go, but a team disassembling itself like this is a signal that shit is going down and not in a nice way. \n\nWe understand they had to do it, and we can also dislike it."
  },
  {
   "score": 8,
   "id": "diyq88p",
   "pid": "t1_dixywxm",
   "date": "2017-06-15 17:41:36",
   "depth": 1,
   "text": "True, but she's not getting any inspiration or drive from Aki. She knows the other option is extreme, but she knows that working for Aki will kill her creative spirit. It would leave her unsatisfied.\n\nShe's excited to work on such a long running series and knows it will drive her to do better, and her breakdown is her realizing that she'll have to no longer work for Aki to do that. Also it's not like she left him in the lurch right in the middle of the project, she turned down a project that she knew wouldn't challenge her in the least.\n\nAlso, it's not like she never wants to be friends with him ever again, she wants to work on other things to improve her skill. If this breaks them apart as friends it'll be kind of extreme."
  },
  {
   "score": 3,
   "id": "dizyhjy",
   "pid": "t1_diyq88p",
   "date": "2017-06-16 12:46:24",
   "depth": 2,
   "text": "Fuck her, she made her choice. She can't have friendship pulling shit like that."
  },
  {
   "score": 16,
   "id": "diz2kf7",
   "pid": "t1_diyq88p",
   "date": "2017-06-15 23:11:43",
   "depth": 2,
   "text": "Extreme was the way that she didn't even mentioned the fact that she joined another circle for a whole month to her best friend. I wouldn't like a friendship like this. "
  },
  {
   "score": 3,
   "id": "diz4fd6",
   "pid": "t1_dixywxm",
   "date": "2017-06-16 00:23:40",
   "depth": 1,
   "text": "It's kinda hard to say why overworking an artist is a wrong thing to do in this modern era where creatives and artist can comes up anywhere and anytime. \n\nHonestly right now artist cant *live* without working like every field there is, waiting for inspiration is something that is very dumb to do, overworking our passion to improve oneself infact is the best way for us to be accepted by others in this era. And I believe great artists in history does have always been trying to improve themselves. So it's not really wrong to overwork an artist, however it is wrong to keep them doing the same thing without improving anything. (Like Eriri tries another method to make her art even better, but she stopped drawing, lying that shes in a slump when actually shes just need more motivation and practice to make it happen)."
  },
  {
   "score": 1,
   "id": "dizwyul",
   "pid": "t1_diz4fd6",
   "date": "2017-06-16 12:17:33",
   "depth": 2,
   "text": "Why are people calling artists/creators \"creatives\"? I've never seen anyone refer to them as this before Crunchyroll's subs for this anime. In the anime I'm pretty sure they're actually saying \"creator\" too! Using the adjective that describes the noun instead of the noun itself just seems bizarre, but hey it's in the dictionary so who cares!"
  },
  {
   "score": 1,
   "id": "dj0lud2",
   "pid": "t1_dizwyul",
   "date": "2017-06-16 21:48:31",
   "depth": 3,
   "text": "At least in my country uses that word to refer someone who has the ideas and artist is the ones whose practically doing them. Not all artist are creative but all creatives are artists I think. Like I said \"artist who just doing the same thing over and over is shit\",  creating something new is what these creatives are.called. Sorry for bad engrish Im Asian"
  },
  {
   "score": 8,
   "id": "dizav77",
   "pid": "t1_dixywxm",
   "date": "2017-06-16 04:59:55",
   "depth": 1,
   "text": "> Making Utaha shoulder everything was cowardly of Eriri.\n\nWhat? It was the other way around. Utaha basically just told Eriri \"I want to do this and if I can't it's your fault, so now you have to decide if you're doing it or not, but make sure you remember that I want to.\""
  },
  {
   "score": 16,
   "id": "diy12qt",
   "pid": "t1_dixywxm",
   "date": "2017-06-15 09:37:37",
   "depth": 1,
   "text": ">the great artists and visionaries of History have often achieved their masterpieces from inspiration and passion, rather than being compelled to to so\n\nThis gave me an epiphany: What if the Mona Lisa was actually made because the very same lady basically whipped Leonardo da Vinci into  making it?"
  },
  {
   "score": 3,
   "id": "dj05zes",
   "pid": "t1_diy12qt",
   "date": "2017-06-16 15:16:31",
   "depth": 2,
   "text": "It was a commissioned painting, so there's a decent chance"
  },
  {
   "score": 10,
   "id": "diy4sa6",
   "pid": "t1_diy12qt",
   "date": "2017-06-15 10:42:54",
   "depth": 2,
   "text": "Her smile holds many secrets, you may be on to something."
  },
  {
   "score": 63,
   "id": "diyfz2h",
   "pid": "t1_dixywxm",
   "date": "2017-06-15 14:04:15",
   "depth": 1,
   "text": "The idea that great artists work on inspiration and passion is the big lie we tell ourselves about art. It's a romantic story but it's not true.  Artists who wait for the right inspiration are the ones who are bland, repetitive, and mediocre, because they aren't consistent enough to do good work, and they're not prolific enough to find the best creative ideas. Creativity (and by \"creativity\" I'm talking about finding new and interesting ideas) tends to come with experience, and experience comes from working a lot over a long period of time on challenging products. Experience does not come from waiting for inspiration.\n\nThis has been studied time and time again. Malcolm Gladwell talks about the 10,000 hours you need to spend in order to achieve mastery in a field. Obviously 10,000 hours is not enough, there are other things you need too, but the 10,000 hours is necessary.  You don't get that if you rely only on inspiration and passion, because inspiration and passion come and go.  You need a work ethic that stays with you week after week. Either you need the self-discipline to keep that up or you need pressure from the outside.\n\nDo some historical research into the daily lives of famous artists and you'll find a shocking number of them were workaholics, and the ones that weren't talk about how important it is to work every day, whether or not they feel inspired.\n\nEriri would not get better if she took her sweet time to do art.\n\nPersonally, I've done my best creative work under external pressure, and many of the people I know who do anything creative say the same thing."
  },
  {
   "score": 6,
   "id": "diz71rg",
   "pid": "t1_diyfz2h",
   "date": "2017-06-16 02:21:35",
   "depth": 2,
   "text": "You, my dude, know your shit. Most of creative work comes from that large mental library of references stocked up in your head and then testing it again and again on the field. \n\nOh course, I only do the \"waiting until best oppurtunity thing\" is when my brain/body is so tired that my access that mental library. THATS when, I take a break and wait for a spike of inspiration."
  },
  {
   "score": 17,
   "id": "diymo7k",
   "pid": "t1_diyfz2h",
   "date": "2017-06-15 16:20:33",
   "depth": 2,
   "text": "> \n> \n\nIt's true that the greatest artists ever alive are all workaholics and have strong ethics and self-discipline. However, it's not the same as having someone insult you and doing it because your pride is hurt. Self-discipline and a strong will to improve oneself comes from the greatest of passions and love for the craft itself. It's because one has such great passion that he/she will find a way to keep up his/her quality.\n\nIMO, consistency is not pressure, and artists need to be consistent, but not be pressurized all the time (i.e. a writer works for 6 hours every day, not 100 hours a week)."
  },
  {
   "score": 1,
   "id": "diztwb4",
   "pid": "t1_diymo7k",
   "date": "2017-06-16 11:20:33",
   "depth": 3,
   "text": "Becaus there are no music or book one hit wonders. "
  },
  {
   "score": 26,
   "id": "diynxvi",
   "pid": "t1_diymo7k",
   "date": "2017-06-15 16:48:52",
   "depth": 3,
   "text": "That's the lie—people think that as long as you have passion, it's enough. People think that somehow self-discipline comes from passion. It's simply not true. Self-discipline is something else entirely, it's something that keeps you going even when your passion is gone, because passion is only a feeling, and you're human, you can't just continue to feel the same feeling forever. Our bodies and minds aren't set up to make us passionate long enough to be successful artists.\n\nThe ones that succeed have something else that's not passion, they have discipline and a work ethic. Eriri had stopped drawing because the passion was gone, and Tomoya accepted her excuses. In order to grow as an artist, she needs to develop the discipline to keep drawing even when the passion is gone, and Tomoya isn't helping her, he's enabling her to continue to make excuses. Akane isn't accepting Eriri's excuses, and will demand that she works, which is what Eriri needs.\n\nBecause you're not born with self-discipline, you have to develop it.\n\nThis makes some people uncomfortable, the idea that artists are often better off with a little bit of pressure. Pressure doesn't mean 100 hours a week. It means that you can't just throw away your work and start over because you don't like it. It means that you can't take the day off because you're not inspired. Pressure means that you have to develop the discipline to keep creating, consistently, to keep working and keep improving.\n\nNot everyone needs pressure, but lots of people do."
  },
  {
   "score": 38,
   "id": "diyk5bx",
   "pid": "t1_diyfz2h",
   "date": "2017-06-15 15:26:47",
   "depth": 2,
   "text": "People throw out the Malcom Gladwell 10000 hour quote a lot but that's highly simplified.  Most importantly, just putting in the hours by going through the motions isn't sufficient because not all hours are equivalent.  I've seen people sink a thousand hours into a game, only to be surpassed by people who've put in a tenth as much time simply because the latter were that much more effective with their time.  Also, not all fields are equal and some require far, far more training and effort than others.\n\nStill, the point does stand that you need to put in the time and effort.\n\nWhat someone considers their best work might not be the same as what others consider their best work.  From what I've observed at least, people tend to overvalue what they've done under pressure.  The logo and T-shirt design that took three weeks of constant work with to get just right with a strict deadline and external forces breathing down their necks... outsold by and not regarded as highly as the ones thrown together on a whim (and I've been on both sides of this).  I think people want all their effort and sacrifice to mean something so they put more value into it than an external observer would.  Of course, what's more important are the years of training that go into developing the skills needed to make either of them."
  },
  {
   "score": 14,
   "id": "diyl67v",
   "pid": "t1_diyk5bx",
   "date": "2017-06-15 15:48:18",
   "depth": 3,
   "text": "I think you're thinking of the misquoted version of Malcolm Gladwell, which says that 10,000 hours will make you an expert. It's not a perfect rule for sure, but that's pop psychology for you.\n\nI've also seen the same thing you're talking about happen with games all the time. Most of the games I've finished I've put in maybe 40 to 150 hours, and all of them I finished with some kind of external pressure to finish quickly. I've literally not finished a game without time pressure in the last five years, and that's certainly with over a thousand hours put in. It seems pretty common among people I know, too, that without a deadline you just end up trying to do everything and in the end you don't finish the game. What a waste of time.\n\nThat's a good point that what people consider their best work is not what others consider their best work. Artists are generally not that great at figuring out what their best stuff is. It makes sense--if you're a musician, it's hard to listen to a song you write without hearing the perfect version of it in your head. And if art is a form of communication, criticism is a form of dialogue."
  },
  {
   "score": 3,
   "id": "diymrlg",
   "pid": "t1_diyl67v",
   "date": "2017-06-15 16:22:38",
   "depth": 4,
   "text": "I was speaking mostly of competitive games (League, OW, etc) and was using them to talk about correlating hours played with skill so finishing the game didn't really cross my mind.\n\nIt's been a while since I played a game that had an ending as such but back when I did play those games I knew people who played them in all sorts of ways with and without deadlines and I'm not sure I could have made any sort of generalization about them."
  },
  {
   "score": 2,
   "id": "diyneon",
   "pid": "t1_diymrlg",
   "date": "2017-06-15 16:37:03",
   "depth": 5,
   "text": "Ah, I was talking about creating games. Finishing = shipping the game to players."
  },
  {
   "score": 3,
   "id": "diyownh",
   "pid": "t1_diyneon",
   "date": "2017-06-15 17:10:45",
   "depth": 6,
   "text": "Ah, the 40-150 hours threw me off there since that's a typical completion time for certain sorts of RPGs."
  },
  {
   "score": 1,
   "id": "dizbmhw",
   "pid": "t1_diyownh",
   "date": "2017-06-16 05:23:15",
   "depth": 7,
   "text": "It's also the amount of time you have available to make a game for most game jams, from a single weekend without much sleep (40 hours) to about a month while keeping your day job (150 hours)."
  },
  {
   "score": 97,
   "id": "diy3cjg",
   "pid": "t1_dixywxm",
   "date": "2017-06-15 10:17:28",
   "depth": 1,
   "text": "Never mind being his number one, even being on speaking terms with him after the shit she's pulled...\n\nNot just art but really in any field, people who aren't self-motivated to improve and push their own limits aren't the people who end up being spoken of as one of the greats.\n\nOverworking someone can be downright counterproductive because depending on how hard they're pushed it doesn't just lead to mediocre work but to an increase in mistakes, things that need rework, and stuff that simply isn't usable."
  },
  {
   "score": 1,
   "id": "dj17kao",
   "pid": "t1_diy3cjg",
   "date": "2017-06-17 10:25:32",
   "depth": 2,
   "text": "Too bad he doesn't have any friends expect someone random background character :( Besides, the first time Tomoya gets betrayed is probably most of his fault too. Okay, they get busted and the people start talking behind their back. Tomoya, as the idiot he is, thinks that by continuing to be himself without any concern to the other people that people will still like him for it. He doesn't care about the social anxiety that Eriri must have had, he doesn't care how people view him. While in most cases \"being yourself\" is viewed as a good thing, in this time all it did was further isolate Tomoya. If he could have just talked with Eriri on his own time, and acted like a normal human being at school, none of this would have happened. He fails to understand the people around him and refuses to change. So in other words, this is Tomoya's problem. Not Eriri. \n\nHell, if I met someone who was such a failure at adapting to society, I probably would have abandoned him too. "
  },
  {
   "score": 1,
   "id": "diz614o",
   "pid": "t1_diy3cjg",
   "date": "2017-06-16 01:34:35",
   "depth": 2,
   "text": "She couldn't be his number one either if she can't draw."
  },
  {
   "score": 31,
   "id": "diy7fmf",
   "pid": "t1_diy3cjg",
   "date": "2017-06-15 11:29:27",
   "depth": 2,
   "text": "Exactly. The motivation has to come from within oneself. Sure, one can't always purse one's passion. Yet, doing something just the the sake of it will never tap into the full potential of the individual.\n\n[](#feelingloved)\n\n"
  },
  {
   "score": 16,
   "id": "diyh18z",
   "pid": "t1_diy7fmf",
   "date": "2017-06-15 14:24:38",
   "depth": 3,
   "text": "After watching this episode, do you still think Eriri has no intrinsic motivations to push herself? Not defending how she handled the communication with Tomoya, just that I totally do not see her drawing \"for the sake of it\". She clearly loves drawing, has a strong will to improve herself, gave her 120% in her latest attempt and is delighted and proud of her new creation, throughout the whole process she was not drawing just to win Tomoya's approval, which was her primary motivation before this point, wouldn't we say she is finally tapping into her full potential?"
  },
  {
   "score": 25,
   "id": "diyuqf4",
   "pid": "t1_diyh18z",
   "date": "2017-06-15 19:30:00",
   "depth": 4,
   "text": "She stopped drawing because MC said she became his no. 1."
  },
  {
   "score": 150,
   "id": "dixyqnn",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 08:56:37",
   "depth": 0,
   "text": "Don't try to trick me. This season already ended after 8 episodes."
  },
  {
   "score": 1,
   "id": "dizs4n8",
   "pid": "t1_dixyqnn",
   "date": "2017-06-16 10:48:39",
   "depth": 1,
   "text": "Just wait for it, another ep. 8 is coming."
  },
  {
   "score": 38,
   "id": "diycteb",
   "pid": "t1_dixyqnn",
   "date": "2017-06-15 13:05:51",
   "depth": 1,
   "text": "I honestly didn't even watch episode 9 yet cause i happened to open the discussion thread and read some of the discussions on it. There has been just too much drama this season and it feels such a different show from season 1. For me, the way the Utaha ship went down was such a sad scene that i just gave up on the season. Watched a few episodes after it but it's just been constant drama going on."
  },
  {
   "score": 2,
   "id": "diz3tqy",
   "pid": "t1_diycteb",
   "date": "2017-06-15 23:58:59",
   "depth": 2,
   "text": "I agree. It's the same as Oregairu. First season was lighthearted SoL with some comedy a bit of drama sprinkled on top.\n\nAnd the second seasons turn it into a drama that changes the theme of the show to almost indistinguishable degree. I think Oregairu did it fairly wel. Saekano not so much. "
  },
  {
   "score": 1,
   "id": "diytyk3",
   "pid": "t1_diycteb",
   "date": "2017-06-15 19:11:05",
   "depth": 2,
   "text": "Same! I often open the discussion threads prior to watching for these kinds of shows to get a sort of sneak peak at what's in store. I didn't like the drama that seemingly unfolded so I haven't watched it yet, nor have I watched 10. Not sure if I'll get around to it. "
  },
  {
   "score": 4,
   "id": "dizcihr",
   "pid": "t1_diytyk3",
   "date": "2017-06-16 05:46:36",
   "depth": 3,
   "text": "If you read the thread, you will find very polarizing opinions. For this type of show, I think it's worth checking out yourself with as little preconception as possible to form your own opinion. However if you have hesitation about drama, I would recommend waiting another week and watch 9 to 11 together, which would wrap up the entire conflict."
  },
  {
   "score": 2,
   "id": "dizls8e",
   "pid": "t1_diycteb",
   "date": "2017-06-16 08:54:03",
   "depth": 2,
   "text": "After this episode, I honestly don't know why I was ever on the Utaha x Tomoya ship. It's Utaha x Eriri all the way for me now "
  },
  {
   "score": 3,
   "id": "dizmdqs",
   "pid": "t1_dizls8e",
   "date": "2017-06-16 09:05:00",
   "depth": 3,
   "text": "I still feel that the Utaha ship was forcefully sunk. Utaha and Tomoya have so much history whereas Katou's interactions with Tomoya have never been that noteworthy."
  },
  {
   "score": 1,
   "id": "dizntg9",
   "pid": "t1_dizmdqs",
   "date": "2017-06-16 09:31:04",
   "depth": 4,
   "text": "Yeah, I don't like Katou. I mean I like her as a character fine, but as a love interest? She has the most shallow connection to Tomoya out of all of them. He saw her look hot, that was literally it. But it's fine, Tomoya doesn't deserve Utaha. "
  },
  {
   "score": 18,
   "id": "diyrov7",
   "pid": "t1_diycteb",
   "date": "2017-06-15 18:15:46",
   "depth": 2,
   "text": "I'm enjoying it now a lot more than season 1. At least something is happening to move the plot than some mindless fanservice and small progression that will go nowhere. "
  },
  {
   "score": 12,
   "id": "dizf1ve",
   "pid": "t1_diyrov7",
   "date": "2017-06-16 06:44:21",
   "depth": 3,
   "text": "I'm enjoying this season for different reasons than the first season. I liked the meta-ness of Season 1, and loved the humor. With this season, the drama is top notch without losing the identity of the first season. One of my favorites"
  },
  {
   "score": 2,
   "id": "dj0pkr3",
   "pid": "t1_dizf1ve",
   "date": "2017-06-17 00:10:19",
   "depth": 4,
   "text": "I'm glad someone else feels this way.  Both seasons have different strengths and I'm enjoying season 2's more serious and plot heavy story."
  },
  {
   "score": 71,
   "id": "diydh6c",
   "pid": "t1_diycteb",
   "date": "2017-06-15 13:17:49",
   "depth": 2,
   "text": "The worst part of this season is that the drama feels incredibly inorganic as it mostly sprouts from these weird philosophies on being a \"creative\"\n\nThis season has ruined most of the characters for me."
  },
  {
   "score": 0,
   "id": "diz8zg6",
   "pid": "t1_diydh6c",
   "date": "2017-06-16 03:50:39",
   "depth": 3,
   "text": "Yeah, the overdramatised reactions made me honestly cringe so hard this episode, made it really hard to watch the episode, was constantly wanting to just drop it."
  },
  {
   "score": 1,
   "id": "dj56if9",
   "pid": "t1_diydh6c",
   "date": "2017-06-20 00:43:23",
   "depth": 3,
   "text": "Few days late, but same.  It's so weird... it's like there's a void in my fragile ol heart now.  Development should be natural for an Anime, but all of this is really hitting me hard.  I guess it's doing its job?"
  },
  {
   "score": 3,
   "id": "diydw4l",
   "pid": "t1_diydh6c",
   "date": "2017-06-15 13:25:25",
   "depth": 3,
   "text": "Yes. I loved S1 and was really looking forward to S2.\n\nWell, at least I won't be sad if/that there won't be a S3."
  },
  {
   "score": 9,
   "id": "diyfp3t",
   "pid": "t1_diydh6c",
   "date": "2017-06-15 13:59:05",
   "depth": 3,
   "text": "Completely agree with you. In no way does it feel natural. It reminds me of Oregairu all over again with the forced teen dramas."
  },
  {
   "score": 48,
   "id": "diymw0u",
   "pid": "t1_diyfp3t",
   "date": "2017-06-15 16:25:23",
   "depth": 4,
   "text": "It was hinted from the beginning of this anime that drama was going to happen. Even episode 0 from the first season dropped hints when Katou was all happy and like \"I hope our circle always stays together!\", or when Tomoya was worried that Eriri was going to leave him again. So I don't understand why people are suprised about this. Problem is you guys had different expectations because you believed Saekano was going to be nothing more than a comedy harem, that's why you ignored all hints."
  },
  {
   "score": 1,
   "id": "dizysob",
   "pid": "t1_diymw0u",
   "date": "2017-06-16 12:52:20",
   "depth": 5,
   "text": "That we saw something happening, doesn't mean we don't have to feel strongly about it, this ties in with spoilers and how people believe it will somehow affect their enjoyment."
  },
  {
   "score": 8,
   "id": "diz3n4x",
   "pid": "t1_diymw0u",
   "date": "2017-06-15 23:51:45",
   "depth": 5,
   "text": "I'm in the opposite boat - I picked up saekano in my phase of \"trying to watch more romance anime\" and I have been hate-watching this show for basically one and a half seasons.\n\nIt's been in the same basket as The World God Only Knows was for the first two whole seasons. So far it's been a self-aware parody that plays into all the stereotypes it criticizes and only uses Kato as lampshade hanging. Every week I watch a new episode expecting to be disappointed with the faint glimmer of hope (represented usually by Kato) that in some far off future it decides to become not-just-self-aware-trash.\n\nRecent events are what I've been waiting for. The moment the anime title dropped and we entered the second act of this play I'm finally looking forward to watching this show."
  },
  {
   "score": 5,
   "id": "diz9v2h",
   "pid": "t1_diz3n4x",
   "date": "2017-06-16 04:25:02",
   "depth": 6,
   "text": "I could recommend you Mashiro Iro Symphony. It's a great harem (in fact it's my favorite romance anime) and on top of that the guy picks a girl without leaving the ending open. "
  },
  {
   "score": 3,
   "id": "diza25h",
   "pid": "t1_diz9v2h",
   "date": "2017-06-16 04:32:19",
   "depth": 7,
   "text": "Cool, thanks. I'll keep it in mind. I'm not a big fan of harems in the first place in comparison to traditional romance. My favourite harem and one of the few I actually like is Yamada-kun and the 7 Witches which is similar to how you describe Mashiro Iro Symphony. \n\nI remember the sell I got for Saekano at the time was \"oh, it's parodying that stuff, you'll love it\"."
  },
  {
   "score": 2,
   "id": "dj0pjah",
   "pid": "t1_diza25h",
   "date": "2017-06-17 00:08:31",
   "depth": 8,
   "text": "I have to interject and say I don't think Mashiro Iro Symphony is a good anime. And this is coming from a harem lover. It does two things that most harems don't in that the MC does actually date one of the girls by show's end and that [shipping spoilers](#s \"the first girl/tsundere doesn't win\"). Sadly the last twist felt kind of inorganic. More importantly, I found the characters generic, particularly the MC."
  },
  {
   "score": 2,
   "id": "dizajnl",
   "pid": "t1_diza25h",
   "date": "2017-06-16 04:49:18",
   "depth": 8,
   "text": "I personally like Saekano because it's refreshing to see a character like Katou, who would be a background character or a love interest whith zero chance to win in most harems, to be the heroine."
  },
  {
   "score": 29,
   "id": "diyvq4i",
   "pid": "t1_diymw0u",
   "date": "2017-06-15 19:53:58",
   "depth": 5,
   "text": "Exactly, Saekano isn't your typical harem rom-com show, there are reasons for its popularity. Characters have actual developments and plausible reasons behind their actions which make it interesting than a majority of shallow harem there are on the market."
  },
  {
   "score": 2,
   "id": "dizytvs",
   "pid": "t1_diyvq4i",
   "date": "2017-06-16 12:53:02",
   "depth": 6,
   "text": "> Exactly, Saekano isn't your typical harem rom-com show\n\nI think A LOT of people shat on it exactly because of this reason. Because that was S1."
  },
  {
   "score": 10,
   "id": "diz85k0",
   "pid": "t1_diydh6c",
   "date": "2017-06-16 03:14:11",
   "depth": 3,
   "text": "Afaik the term the Japanese use is creator. So basically being a content creator. \n\nIdk, maybe it's because I'm a (shitty) artist, but I can totally get behind the philosophies. It's not about being a good artist, it's about being a better artist than others. And if you have to be better than everyone, you'll have to become the best. For every competitive environment the skill floor needed to produce something of value keeps rising. An example would be pro gaming, the needed amount of skill required to be useful as a pro keeps getting higher since everyone gets more experience with the game. \n\nLike Eriri's frustration is not only because she was in a slump, but also that Akane which she doesn't care much for was able to get her out of the slump while Tomoya who she cares for a lot wasn't. One could argue that it wasn't Tomoya's job to get her out of the slump, but Akane did anyway and the results speak for themselves.\n\nA lot of creators need motivation to work, for better or worse. E.g. another anime about creators this season is Eromanga sensei. Yamada elf talks about requiring burning motivation to work properly, while Masamune is all about having to work regardless of motivation. Both types exist and both types have succeeded."
  },
  {
   "score": 35,
   "id": "diyhedc",
   "pid": "t1_diydh6c",
   "date": "2017-06-15 14:31:48",
   "depth": 3,
   "text": "To be fair the japanese manga industry really can be that brutal (having to pretty much give your life for the project), nonetheless it really disconnects me as it is incredibly unrelatable for most westerners that dont value their work as the most important thing in life"
  },
  {
   "score": 13,
   "id": "diyhpwd",
   "pid": "t1_diyhedc",
   "date": "2017-06-15 14:38:01",
   "depth": 4,
   "text": "> To be fair the japanese manga industry really can be that brutal\n\nWell its a real good thing this just a doujin team not working for profit or livelihood and the manga industry isn't involved whatsoever.\n\nAnd that \"giving your life to the project\" in the manga industry has more to do with being overworked and under tight schedules, compared to the ideological bullshit presented in this series."
  },
  {
   "score": 1,
   "id": "diyk2gl",
   "pid": "t1_diyhpwd",
   "date": "2017-06-15 15:25:10",
   "depth": 5,
   "text": "[deleted]"
  },
  {
   "score": 7,
   "id": "diykaoa",
   "pid": "t1_diyk2gl",
   "date": "2017-06-15 15:29:47",
   "depth": 6,
   "text": "The ideology being spewed by eriri and utaha has lasted a lot longer than when they got the job offer, which is for a video game.\n\n>I mean, people wouldnt overwork so often if they cared as much about their jobs as us westerners right?\n\nI really don't know what you are trying to say with these comments. Japans workforce has an unhealthy but effective culture of overworking and focusing 100% on work.\n\nThis philosophy, while it can certainly be \"analyzed\" as related to the problems presented in this series, is not directly related. I don't care for fan interpretations and meaning derived from analysis."
  },
  {
   "score": 11,
   "id": "dj06185",
   "pid": "t1_diyhpwd",
   "date": "2017-06-16 15:17:35",
   "depth": 5,
   "text": "The new project is definitely professional and within the industry and not a doujin anything"
  },
  {
   "score": 31,
   "id": "diz6cmj",
   "pid": "t1_diycteb",
   "date": "2017-06-16 01:49:08",
   "depth": 2,
   "text": "Personally I loved the last two episodes more than any other pair of consecutive episodes this season. But that might just be me, because I haven't seen Utaha and Eriri grow a pair of horns and turn into demons, unlike most other commenters."
  },
  {
   "score": 32,
   "id": "dixzv66",
   "pid": "t1_dixyqnn",
   "date": "2017-06-15 09:16:28",
   "depth": 1,
   "text": "This is just a fanmade episode lol"
  },
  {
   "score": 107,
   "id": "diyif2q",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 14:51:36",
   "depth": 0,
   "text": "I find it quite funny how so many people don't like the development.\n\nSaekano is by far my favourite anime of the season and has certainly not let me down. The drama and issues the characters face was imo well foreshadowed with e.g. the dialogue in showing that the characters know a lot and have circumstances that the viewer don't know too well.\n\nI have literally never been so sad that I can't read Japanese since I bought all the light novels avaiable at the time I was in JP."
  },
  {
   "score": 13,
   "id": "diz3x50",
   "pid": "t1_diyif2q",
   "date": "2017-06-16 00:02:46",
   "depth": 1,
   "text": "I like the development too. Tomoya had it comming. But I can't help but feel like intensity of the drama is too forced."
  },
  {
   "score": 10,
   "id": "diz6k3f",
   "pid": "t1_diz3x50",
   "date": "2017-06-16 01:58:43",
   "depth": 2,
   "text": "Yep, a change was needed on Tomoya's side in order to make a new game happen. And he didn't change, so his creators moving on their own made sense."
  },
  {
   "score": 22,
   "id": "diz1o94",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 22:41:11",
   "depth": 0,
   "text": "For Katou to cut her hair short again... Shit really hit the fan with Utaha and Eriri..."
  },
  {
   "score": 57,
   "id": "diz57t4",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 00:57:59",
   "depth": 0,
   "text": "Goddamn. This got me right in the feels...I feel betrayed man. Like I get that both Eriri and Utaha want to advance but at the cost of betraying their beloved MC not cool man, not cool at all. I had a similar situation happen to me IRL and it felt horrible. And the sad part is I am digging the emotions, I came on Saekano for all the fun and games (and ecchi moments) but now it turned into a drama which the producers did a damn good job of. \n\n[](#comfortfood)\n\nTo all my fellow Utaha-shippers I will support Utaha, but I do not condone her actions. It would be an honor to sink alongside with all of you. \n\n[](#takaradasalute)\n\nTo the Katou-shippers, I wish you the best of luck. \n\n[](#meguminthumbsup)"
  },
  {
   "score": 1,
   "id": "dj17fec",
   "pid": "t1_diz57t4",
   "date": "2017-06-17 10:22:32",
   "depth": 1,
   "text": "Fuck the MC, he's an autistic piece of shit with no future. I still wonder why any of these people actually want such a failure. "
  },
  {
   "score": 10,
   "id": "dizd0e3",
   "pid": "t1_diz57t4",
   "date": "2017-06-16 05:58:09",
   "depth": 1,
   "text": "As a Megumi fan, respect for your objective assessment of girls and strong dedication to Utaha. I don't know about other people, but I think flawed heroines are still lovely. She deserves better."
  },
  {
   "score": 18,
   "id": "dizcbee",
   "pid": "t1_diz57t4",
   "date": "2017-06-16 05:41:52",
   "depth": 1,
   "text": "Kato was always best girl, her \"victory\" is well deserved"
  },
  {
   "score": 21,
   "id": "diz9z5d",
   "pid": "t1_diz57t4",
   "date": "2017-06-16 04:29:10",
   "depth": 1,
   "text": "Another comrade to go down with, let us crack open a cold one for Kato's victory at the very least"
  },
  {
   "score": 44,
   "id": "diz7xhf",
   "pid": "t1_diz57t4",
   "date": "2017-06-16 03:03:33",
   "depth": 1,
   "text": "No need for luck, she's already won by default. I salute you sir as you valiantly choose to sink with your ship"
  },
  {
   "score": 77,
   "id": "diyer3e",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 13:41:14",
   "depth": 0,
   "text": "I honestly don't know what other show has made me feel this betrayed. Utaha and Eriri basically nuked themselves and the SS Katou is the only thing left."
  },
  {
   "score": 0,
   "id": "diz5cq1",
   "pid": "t1_diyer3e",
   "date": "2017-06-16 01:04:04",
   "depth": 1,
   "text": "TOP 10 BETRAYALS right there"
  },
  {
   "score": 110,
   "id": "diz4nug",
   "pid": "t1_diyer3e",
   "date": "2017-06-16 00:33:49",
   "depth": 1,
   "text": "That's what I like about it though. They are real people pursuing their dreams instead of throwing away their professional career chasing a boy lol."
  },
  {
   "score": 1,
   "id": "dj1o55i",
   "pid": "t1_diz4nug",
   "date": "2017-06-17 16:36:50",
   "depth": 2,
   "text": "Except her only goal is to be the artist that Tomoya wanted her to be. Honestly if it wasn't for that I'd be ok with it, but you can't act like she's doing it for her own dream when she revolves the whole thing around Tomoya. "
  },
  {
   "score": 4,
   "id": "dj07fnn",
   "pid": "t1_diz4nug",
   "date": "2017-06-16 15:48:14",
   "depth": 2,
   "text": "And honestly, it's more how they went about it then anything. Tomoya would have been supportive if they had said they had gotten this offer and wanted to pursue it. And yes, on some level this is both of them accepting they will never win, which is nice to see given how rare we see such things. But, they all consider each other friends. Tomoya deserved better than to find out a month after the fact. Then again, Megumi deserved better than having to wait over a month for an apology."
  },
  {
   "score": 21,
   "id": "dizj8e8",
   "pid": "t1_diz4nug",
   "date": "2017-06-16 08:06:45",
   "depth": 2,
   "text": "Why is your reply so hard to understand really. Also I missed the part why everybody so frustrated with \"drama\"? It's young people choosing career over friends, this should be hard to do it right?\n\nI think in the end people are just frustated with their sinking ships."
  },
  {
   "score": 2,
   "id": "dizp85k",
   "pid": "t1_dizj8e8",
   "date": "2017-06-16 09:56:19",
   "depth": 3,
   "text": "I'm not frustrated with the ships because I've never liked Utaha or Eriri. That being said, I still feel the drama these latest episodes is incredibly forced and doesn't feel natural."
  },
  {
   "score": 34,
   "id": "diyj5t8",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 15:06:32",
   "depth": 0,
   "text": "So I guess both Utaha and Eriri left Tomoya's group because they feel they can't grow anymore in a creative standpoint. They might've reached their ceiling with Tomoya, I believe. So because of that, they moved on with Akane Kosaka to bigger and better things. By the way, Eriri's change of expression from cheerful laughter to gut-wrenching sadness looked sorrowful.\n\nOf course Tomoya is going to feel crushed about this, even if he didn't show his true emotions to Iori. And then in comes Katou to the rescue.\n\nI'm psyched for the next episode! [Do it, Tomoya.](https://i.imgur.com/L5KKlZq.gifv)"
  },
  {
   "score": 9,
   "id": "diz73gr",
   "pid": "t1_diyj5t8",
   "date": "2017-06-16 02:23:44",
   "depth": 1,
   "text": "not only they feel they can't grow anymore but also it's a big chance. The game Akane's going to make is something like Final Fantasy series, a 20 years old series game "
  },
  {
   "score": 16,
   "id": "dizcs8i",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 05:52:59",
   "depth": 0,
   "text": "This is the best harem show I've ever seen. Straight up."
  },
  {
   "score": 78,
   "id": "diys0a3",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 18:23:25",
   "depth": 0,
   "text": "Ok, 2 things I have to rant about.\n\n1 - Seriously, fuck Eriri and Utaha as friends. Sure, you might want to follow a different path to improve and what not, that is noble, but it is a HUGE dick move to have taken part in something for some time with someone you consider your friend and don't even have the courtesy of telling him and instead waste 1 month where he doesn't even know what is going on and just drop a bomb on him. \n\nNo wonder he doesn't feel happy about their opportunity. Also, no wonder Katou is better than the other 2, she at least had the guts of telling him face to face before making any decision.\n\n2 - Does anyone else think that Eriri running in the OP looks absolutly hilarious and retarded? Everytime it comes up I can't help but laugh, the animation is so weird and stiff."
  },
  {
   "score": 1,
   "id": "dj2ovg6",
   "pid": "t1_diys0a3",
   "date": "2017-06-18 11:37:51",
   "depth": 1,
   "text": "that part in the OP always triggers me :p"
  },
  {
   "score": 2,
   "id": "dj2rmd8",
   "pid": "t1_diys0a3",
   "date": "2017-06-18 12:39:17",
   "depth": 1,
   "text": ">it is a HUGE dick move to have taken part in something for some time with someone you consider your friend and don't even have the courtesy of telling him and instead waste 1 month where he doesn't even know what is going on and just drop a bomb on him. \n\n>*Tomoya also took 2 months to make up with Katou*\n\nI think I'm starting to see a pattern with the characters here.\n\nKatou is the only one who doesn't fall into this pattern. More evidence that Katou is best girl."
  },
  {
   "score": 1,
   "id": "dj01652",
   "pid": "t1_diys0a3",
   "date": "2017-06-16 13:38:37",
   "depth": 1,
   "text": "I think 1 is the comment I most agree with in this thread. I support them following a lucrative path to expand their careers as it's unlikely that Aki would lead them to huge sales and popularity. But it's not okay to keep something this big a secret from someone you consider a friend."
  },
  {
   "score": 4,
   "id": "dj0m1lt",
   "pid": "t1_diys0a3",
   "date": "2017-06-16 21:55:01",
   "depth": 1,
   "text": "1 - I mean, couldn't it also be said that he wasted their two months since the winter comitek (as well as wasted a lot of their effort by not submitting their work - asked Iori to stay while he left, asked Megumi to come, etc). I don't really get why they're considered to have wasted his time. They're the creatives and the producer decided to not communicate with them for 2 months about his plans. It felt somewhat presumptuous of Aki to just assume that he could make those two wait without saying anything to them about future plans until the minute he brought the proposal to them. He could have made it clear that he wanted to start a new project, but didn't say anything to them, while also leaving Eriri in a state where she almost couldn't draw again for months. I agree they should have said something after accepting Akane's proposal, but it's not like they were they only ones in the wrong here. "
  },
  {
   "score": 19,
   "id": "diz6il2",
   "pid": "t1_diys0a3",
   "date": "2017-06-16 01:56:48",
   "depth": 1,
   "text": "They weren't engaged in anything, though. They did complete the first game, and didn't agree on making a second one.\n\nAs for not telling him sooner I would blame them more if, when Aki learned the news from Utaha, he didn't react like someone said they had shot his family. If I had a friend reacting that bad, I wouldn't want to involve him more than necessary in this kind of matter either."
  },
  {
   "score": 3,
   "id": "dj050b0",
   "pid": "t1_diz6il2",
   "date": "2017-06-16 14:55:53",
   "depth": 2,
   "text": "They were still part of the group. At least say, it was fun but I want to try something else."
  },
  {
   "score": 12,
   "id": "dizm07u",
   "pid": "t1_diz6il2",
   "date": "2017-06-16 08:58:03",
   "depth": 2,
   "text": "Yeah, I don't get the hate for their decision. They don't owe Tomoya shit "
  },
  {
   "score": 1,
   "id": "djpqoiz",
   "pid": "t1_dizm07u",
   "date": "2017-07-03 00:10:58",
   "depth": 3,
   "text": "Utaha and Eriri are also looking to go professional in those fields, and Tomoya is just playing after school. They really had to take that big opportunity when it presented itself. "
  },
  {
   "score": 7,
   "id": "dj0525s",
   "pid": "t1_dizm07u",
   "date": "2017-06-16 14:56:56",
   "depth": 3,
   "text": "They don't owe him to stay, sure, but the very least they could do is telling him, not dropping the bomb 1 month after."
  },
  {
   "score": 1,
   "id": "dj08wrf",
   "pid": "t1_dj0525s",
   "date": "2017-06-16 16:21:37",
   "depth": 4,
   "text": "I don't really get that logic. It was a bomb either way, and they haven't been talking. What difference does it make that they waited a month? They probably would have told him right away if he had been talking to them "
  },
  {
   "score": 30,
   "id": "diywusb",
   "pid": "t1_diys0a3",
   "date": "2017-06-15 20:21:58",
   "depth": 1,
   "text": "yea she looks shes dab running"
  },
  {
   "score": 37,
   "id": "diy252o",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 09:56:12",
   "depth": 0,
   "text": "I thought the Eriri crying scene was one of the better crying scenes I have watched in a while.\n"
  },
  {
   "score": 26,
   "id": "diy81pg",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 11:40:24",
   "depth": 0,
   "text": "I love that yuri fangirl at the counter is back with an annoyed look as nothing is happening :DDDDD"
  },
  {
   "score": 16,
   "id": "diz4igr",
   "pid": "t1_diy81pg",
   "date": "2017-06-16 00:27:21",
   "depth": 1,
   "text": "yaoi*"
  },
  {
   "score": 15,
   "id": "diz4ske",
   "pid": "t1_diz4igr",
   "date": "2017-06-16 00:39:34",
   "depth": 2,
   "text": "I must have gotten distracted by all that UtahaXEriri present in the episode :D"
  },
  {
   "score": 12,
   "id": "dj1ds22",
   "pid": "t3_6hflpu",
   "date": "2017-06-17 12:46:25",
   "depth": 0,
   "text": "This threads are like this:\n\n* SIDE A: Ouch!, Feeling betrayed by Utaha and Eriri after all this time and after all they went through in this one and a half season.... \n* SIDE B: But.... they need to go with Akane because their careers are important and this is a great project. \n* SIDE A: Yes, we understand that... but they shouldn't have done it like this, behind Tomoya and/or Katou's back. \n* SIDE B: But, this is a great project, it's the best thing for them and obviously they'd choose their careers first!.  \n* SIDE A: Yes, we understand that... but they shouldn't have leave like this...\n* SIDE B: But this is a great project, it's their careers, every creator would leave!. \n* SIDE A: Yes... we understand that... but not leave the way they did!. \n* SIDE B: But this is a great project, it's their careers and every.....\n* and so on... on... on... and on... and on... "
  },
  {
   "score": 15,
   "id": "diy13b1",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 09:37:54",
   "depth": 0,
   "text": "So no season 3 confirmed? It's seems like the story is going towards the original ending."
  },
  {
   "score": 34,
   "id": "diy1qvi",
   "pid": "t1_diy13b1",
   "date": "2017-06-15 09:49:19",
   "depth": 1,
   "text": "Not likely an original ending.  Vol 7 is a natural point to wrap up the season.  It officially wrap up the \"first half\" of the LN anyways.\n\nIt still leaves the possibility of S3 open."
  },
  {
   "score": 1,
   "id": "diyyq3k",
   "pid": "t1_diy1qvi",
   "date": "2017-06-15 21:11:19",
   "depth": 2,
   "text": "Why cant it be a berserk 1997 anime type ending \nThey basically pulled a sopranos type ending"
  },
  {
   "score": 3,
   "id": "diy355e",
   "pid": "t1_diy1qvi",
   "date": "2017-06-15 10:13:51",
   "depth": 2,
   "text": "Can you tell me what happens? I don't mind being spoiled, I'm definitely curious how they are going to do the new game."
  },
  {
   "score": 5,
   "id": "diy3ha9",
   "pid": "t1_diy355e",
   "date": "2017-06-15 10:19:50",
   "depth": 3,
   "text": "[Well](/s \"with Eriri and Utaha leaving, Tomoya started rebuilding the circle with Katou's support.  Michiru stays on to help with music.  He also recruited Iori and his sister Izumi as the new project manager and illustrator respectively. He is more dedicated to writing script and leaving the project management to Katou and Iori, who can handle it better.\")"
  },
  {
   "score": 1,
   "id": "dizndgm",
   "pid": "t1_diy3ha9",
   "date": "2017-06-16 09:23:06",
   "depth": 4,
   "text": "So do they come back to the circle?"
  },
  {
   "score": 3,
   "id": "dizonvq",
   "pid": "t1_dizndgm",
   "date": "2017-06-16 09:46:14",
   "depth": 5,
   "text": "[They](/s \"started working for Akane, but still on good speaking terms with the Blessing Software team throughout the story. After dealing with various issues in both teams, by vol 12 Eriri and Utaha rejoined the Blessing Software. Vol 13 is the last volume due to releaee later this year.\")"
  },
  {
   "score": 11,
   "id": "diy3psf",
   "pid": "t1_diy355e",
   "date": "2017-06-15 10:24:01",
   "depth": 3,
   "text": "[LN reader here.](/s \"No idea tbh. They skipped a bonding moment between Kato and Tomoya with basically Tomoya declaring to Kato that she is his best partner and main heroine forever and then breaking down crying due to what Utaha and Eriri did. Then Eriri has a confrontation with Kato and Kato is fucking pissed at Eriri for hurting Tomoya. Like Kato was seriously pissed and I hope it gets animated. This doesn't end well and the two are no longer friends Then it should be a scene with Tomoya meeting with the other 2 girls in a train station as they depart to work for Akane. Utaha then steals Aki's first kiss and takes away his glasses. Tomoya then comes to terms somewhat with their betrayal as they leave. ( this scene is rly important as them leaving is metaphorical for them leaving the Tomoya-bowl and the loss of his glasses symbolises Tomoya to turn into a more traditional MC) It seems they skipped these moments for going into volume 8 which Tomoya and Katou date for \"game research\" and they hold hands and start calling each other by first name. I dont know how they will deal with Izumi and Irori yet tho.\")"
  },
  {
   "score": 1,
   "id": "dj1g0mc",
   "pid": "t1_diy3psf",
   "date": "2017-06-17 13:39:31",
   "depth": 4,
   "text": "Utaha is extremely petty. She just wants to leave a mark on Tomoya regarless of whether it hurts him or not. I can't believe I didn't jump to SS Kato sooner."
  },
  {
   "score": 3,
   "id": "diy54u3",
   "pid": "t1_diy3psf",
   "date": "2017-06-15 10:48:59",
   "depth": 4,
   "text": "[LN](/s \"What becomes the dynamic when Utaha and Eriri leave? I know that Tomoya will confess to Katou but what becomes of them and the team and dynamic?\")\n"
  },
  {
   "score": 2,
   "id": "diycyu5",
   "pid": "t1_diy54u3",
   "date": "2017-06-15 13:08:34",
   "depth": 5,
   "text": "Nothing changes. "
  },
  {
   "score": 6,
   "id": "diy8xsn",
   "pid": "t1_diy54u3",
   "date": "2017-06-15 11:56:17",
   "depth": 5,
   "text": "[removed]"
  },
  {
   "score": 13,
   "id": "diyx4pi",
   "pid": "t1_diy8xsn",
   "date": "2017-06-15 20:29:07",
   "depth": 6,
   "text": "The formating is fucked and it shows as a link."
  },
  {
   "score": 8,
   "id": "diy3xqt",
   "pid": "t1_diy3psf",
   "date": "2017-06-15 10:27:55",
   "depth": 4,
   "text": "Dude, please spoiler tag most of these stuff.  I think the anime is just trying to rearrange the order of events (such as inserting some vol 8 stuff into next episode, then back to vol 7), some of what you said will most likely be shown next episode."
  },
  {
   "score": 6,
   "id": "diy23r7",
   "pid": "t1_diy1qvi",
   "date": "2017-06-15 09:55:35",
   "depth": 2,
   "text": "I am confused, \"dating\" is supposed to be Vol 8 material. This episode basically skipped the Vol 7 ending which I think is one of the most important scene in LN. May be the next episode will cover Vol 7 ending and also give us the dating episode we all want. We will see."
  },
  {
   "score": 3,
   "id": "diy2l0n",
   "pid": "t1_diy23r7",
   "date": "2017-06-15 10:03:59",
   "depth": 3,
   "text": "The season will end with vol 7, with the remaining scenes to be shown in the next episode.  There won't be much vol 8 material if any.  [](/s \"Dating\" is such an important scene I doubt they would waste it by rushing through.\")  It would either be saved to a possible S3 or OVA episodes.\n\n\nEdit: now I think of it, Maruto might actually try something - [they could](/s \"move part of vol 8 - the dating part to next episode, and then go back to warp up vol 7. It still doesn't kill the chance of a potential S3, just that vol 8 materials will be significantly altered.\")"
  },
  {
   "score": 2,
   "id": "diy3b3x",
   "pid": "t1_diy2l0n",
   "date": "2017-06-15 10:16:46",
   "depth": 4,
   "text": "ya that's what I meant. I really hope next episode go this way, it would be the perfect way to end season 2."
  },
  {
   "score": 3,
   "id": "diy376e",
   "pid": "t1_diy2l0n",
   "date": "2017-06-15 10:14:52",
   "depth": 4,
   "text": " [Question](/s \"I am so confused since it was a while since I read the novel. Wasnt there supposed to be a train station scene where he gives his glasses away? Does that happen first or does he breakdown in front of Kato first?\")\n\nAt this rate of them skipping stuff episode 13 is probably going to end with Tomoya and Kato expecting their first born or something like that since they could prob skip 7 novels for lols"
  },
  {
   "score": 2,
   "id": "diy3m5z",
   "pid": "t1_diy376e",
   "date": "2017-06-15 10:22:14",
   "depth": 5,
   "text": "[The](/s \"train scene happens AFTER meeting with Katou, so no worries.  There would also be a confrontation between Katou and Eriri, but that will likely be shown as flashback next episode.  It already happened chronologically before Katou cut her hair.\")"
  },
  {
   "score": 5,
   "id": "diy3unu",
   "pid": "t1_diy3m5z",
   "date": "2017-06-15 10:26:25",
   "depth": 6,
   "text": "Despite me loving this series the anime has a tendency to skip important moments and fuck with the chronology of things like Barry Allen was inside their universe and fucking up the timeline."
  },
  {
   "score": 2,
   "id": "diygztx",
   "pid": "t1_diy3unu",
   "date": "2017-06-15 14:23:53",
   "depth": 7,
   "text": "They did add some scenes Light Novel did not have tho (or maybe from \"Girl Side\")"
  },
  {
   "score": 4,
   "id": "diy5j96",
   "pid": "t1_diy3unu",
   "date": "2017-06-15 10:56:02",
   "depth": 7,
   "text": "To me, you've been senpai for centuries\n\n*helicopter noises*"
  },
  {
   "score": 9,
   "id": "diy45af",
   "pid": "t1_diy3unu",
   "date": "2017-06-15 10:31:39",
   "depth": 7,
   "text": "All with the blessing of the writer Fumiaki Maruto, himself being the scriptwriter.  He is intentionally rearranging the story to fit the anime presentation.  While not always successful, I think some of the choices actually improved how it was shown in the novel.  (While I rate him as one of the best galgame scriptwriters and love this story, his first attempt at light novel writing can be awkward at times, exactly like how Utaha is going the other way)"
  },
  {
   "score": 16,
   "id": "diz3pfn",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 23:54:19",
   "depth": 0,
   "text": "Top 10 Anime Betrayals :("
  },
  {
   "score": 16,
   "id": "diz4w1v",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 00:43:47",
   "depth": 0,
   "text": "While their decision to join Akane's team was most definitely the correct one(I mean seriously how can any aspiring creative turn down an opportunity like this) I still can't help but feel disheartened and betrayed. So many conflicted feelings. TnT  "
  },
  {
   "score": 8,
   "id": "diz26qj",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 22:58:30",
   "depth": 0,
   "text": "Right up till the end of the episode, I'm all [](#sadholo)\n\nBut then Katou comes along right at the end and there's gonna be a cute deeto and I'm all [](#hugbear)"
  },
  {
   "score": 8,
   "id": "dizolt7",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 09:45:12",
   "depth": 0,
   "text": "rip kato's hair         -2017"
  },
  {
   "score": 13,
   "id": "diz43sa",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 00:10:11",
   "depth": 0,
   "text": "So the episode before the end is here, and here's what i think:\n\nSo we now know what happened in the month that Utaha and Eriri took the offer. They finally acknowledged each other's creations, so that's awesome! Also, we now know that Aki is really upset, but still wishes them the best nonetheless, so he gets some good points for taking it well, and he has **bestwaifuKatou** to help him out.\n\nSo, now I do have a good theory as to why Eriri wasn't motivated by Aki anymore and now by Akane: if you recall, Aki *did* insult her art before, which was shown as he was talking to her about how he didn't praise her artwork, merely calling it \"good\" insted of \"great\", which made Eriri try harder. After he softened up, she stopped trying as hard, and had to use that moment to keep herself motivated during the Winter Comiket fiasco.\n\nSo...basically, she's a masochist when it comes to her artwork: insults work better than praises, and because Aki can't bring himself to do that to his friend (and in reality, who would, unless you're just an ass), she couldn't do as well as she could. I really do wonder how she would react if she ever found out that she's a total M.\n\nAs for Utaha [Spoilers for the Future] (/s \"Basically, she's no M like Eriri, and even breaks down when Akane insults her in the same way she does Eriri, except the latter can take the critiques while Utaha ends up suffering and having her near unbreakable confidence shattered, so there's some retribution for the ex Utaha supporters that were betrayed by their queen. As for Eriri, Katou, Your Goddess, will handle that for you...\")\n\nStill, I can't wait to see how they'll end this season. Maybe we may get a season 3 greenlight at the end credits! Fingers crossed, people..."
  },
  {
   "score": 2,
   "id": "diz4gw6",
   "pid": "t1_diz43sa",
   "date": "2017-06-16 00:25:29",
   "depth": 1,
   "text": "See, its not Tomoya's fault that he had such mentally and personally fucked up Ms working for him, I mean he had no way of knowing it and I doubt if he's into being an S. Kek"
  },
  {
   "score": 2,
   "id": "diz4p0g",
   "pid": "t1_diz4gw6",
   "date": "2017-06-16 00:35:15",
   "depth": 2,
   "text": "I doubt anybody would know. They keep saying that she needs to be pushed, but that method doesn't last long, and in this context, it's pretty inaccurate. Personally, I find it funny that the reason she's sucking right now is because no one is telling her that she sucks."
  },
  {
   "score": 3,
   "id": "diz56mm",
   "pid": "t1_diz4p0g",
   "date": "2017-06-16 00:56:34",
   "depth": 3,
   "text": "You know what Im starting to  feel that the real reason is:\n\n\n\n\n**\"You know Tomoya, you're just a small fry in this industry, and here's a person, A veteran and a famous one , that is offering us  a job, We're going to have big salaries and gain fame, so No doujin games for now, Bye Bye**\n\n\n\nBut the author smartly showed it this way\n\n\n\n**Tomoya your preventing our creative minds to grow, we are leaving for now to pursue our love with our craft PS We love you**\n\n\n\nI dont know I really find the 'Creative issue' unnatural and forced\n\n\n\n\nI dont know maybe the author is doing this to prevent the two girls to be portrayed negatively as people  and friends. LOL"
  },
  {
   "score": 2,
   "id": "diz5kqj",
   "pid": "t1_diz56mm",
   "date": "2017-06-16 01:14:01",
   "depth": 4,
   "text": "It does feel like the entire story is trying to paint Aki as a poor producer, which he is in a sense, but the choices he's given is \"It's either 100 or bust. No exceptions. Anything else will break up the group.\" Not everyone can handle that kind of pressure all the time, especially a novice. But once you stop and actually think about it all and how creators really are, you start to see the truth to it all and realize that the roles of the sympathetic heroines and the really hated protag in harems need to be reversed here.\n\nExcept Katou. She cool beans, yo."
  },
  {
   "score": 4,
   "id": "diz5ybj",
   "pid": "t1_diz5kqj",
   "date": "2017-06-16 01:31:04",
   "depth": 5,
   "text": ">that the roles of the sympathetic heroines and the really hated protag in harems need to be reversed here. \n\nWell, No matter how a bit retarded Aki has been acting this past and current season.\n\n\n\nPeople can sympathize that in the bottom, He's just a caring friend,  and thats the reason he sucks as a producer which in itself not really bad or a negative trait, Maybe to some artist or writer Aki would be one of the best, given that he provide calm anf relaxing environment for people but thats just a guess."
  },
  {
   "score": 1,
   "id": "dizby0a",
   "pid": "t1_diz5ybj",
   "date": "2017-06-16 05:32:35",
   "depth": 6,
   "text": "Who needs friends when you have riches and fame."
  },
  {
   "score": 6,
   "id": "dizcsmu",
   "pid": "t1_diz5ybj",
   "date": "2017-06-16 05:53:14",
   "depth": 6,
   "text": "Judging by how Tomoya handled Michiru's band and promoted Utaha's novel, he is more of a decent agent type than a project manager type."
  },
  {
   "score": 6,
   "id": "diz603a",
   "pid": "t1_diz5ybj",
   "date": "2017-06-16 01:33:16",
   "depth": 6,
   "text": "Nah I agree. I mention on MAL that in any other setting, Aki would be a decent director."
  },
  {
   "score": 12,
   "id": "diz1888",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 22:26:30",
   "depth": 0,
   "text": "Meanwhile the overworked animators of A-1's team handling Saekano be like \n\n\"Just what character are we animating right now? You need someone to insult you as external pressure to do well as a creator? Eriri makes me wish I wasn't sustaining myself on instant ramen and 5 hours of sleep daily.\"\n\nI didn't like how this episode ended. They should've animated the entire Katou reunion scene instead of just ending it with the \"go on a date part\". With what they're doing, they're going to make me afraid for an entire week that they'll butcher the scene by skipping the main content entirely. \n\nThe Katou reunion scene is supposed to be the light at the end of the tunnel in this arc and also to reinforce Katou's position as best girl [despite](/s 'Tomoya's constant raging boner for Eriri ... if you read the LN volumes later on. He makes me so mad.') "
  },
  {
   "score": 15,
   "id": "diz57kw",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 00:57:43",
   "depth": 0,
   "text": "Well I dont think it'll get a third season, so I'll just look for LN spoilers for what happends in the end after the anime series finishes.\n\nAs for my thoughts:\n\nEriri just said that she's gonna betray her friend for the second time.\n\nLike, she betrayed him once, but still after all the years, he forgave her, then she stabs him in the back again.\n\nShe's the worst kind of human.\n\nOverworking will make you the greatest artist? I don't think so.\n\nThe greatest people did their things because they loved doing it and were driven with passion. Not because they were working on it 24/7"
  },
  {
   "score": 1,
   "id": "diz6p1u",
   "pid": "t1_diz57kw",
   "date": "2017-06-16 02:05:09",
   "depth": 1,
   "text": "greatest people always take big challenge and huge chance in life"
  },
  {
   "score": 6,
   "id": "dizfols",
   "pid": "t1_diz57kw",
   "date": "2017-06-16 06:57:35",
   "depth": 1,
   "text": "Agreed with that, she already knew that she was betraying Tomoya once again, she doesn't need any compassion from the readers and any forgiveness from Tomoya and Megumi. At least for some volumes one of them does this job :D\n\nLike I said in another comment, I wouldn't want Eriri as a friend, she big failed Tomoya two times. "
  },
  {
   "score": 2,
   "id": "dj1gll8",
   "pid": "t1_dizfols",
   "date": "2017-06-17 13:53:28",
   "depth": 2,
   "text": "literally worst girl."
  },
  {
   "score": 21,
   "id": "diy5l3e",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 10:56:55",
   "depth": 0,
   "text": "I came her to rant that this episode is 2h late on HS. FML"
  },
  {
   "score": 19,
   "id": "diyjsra",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 15:19:43",
   "depth": 0,
   "text": "These past 2 episodes had me fucked up, like maybe i'm missing something but it seems like it's just been one big ol' \"fuck you\" from Eriri and Utaha towards Aki, like i feel like the best thing that happened to him was probably Katou at the end of the episode. Like from what i saw they gave him one chance as a producer and he wasn't perfect and didn't push them enough so they just jump ship. I dunno maybe i'm just a little frustrated with Eriri and Utaha, I hate all of this drama."
  },
  {
   "score": 2,
   "id": "dj17jf4",
   "pid": "t1_diyjsra",
   "date": "2017-06-17 10:24:58",
   "depth": 1,
   "text": "Tomoya deserves it. Someone needs to teach him to grow up. "
  },
  {
   "score": 2,
   "id": "dj1bhiy",
   "pid": "t1_dj17jf4",
   "date": "2017-06-17 11:53:07",
   "depth": 2,
   "text": "I would agree with you if this were a continuous issue however no one says shit to him until it's all over with and everyone just leaves to do their own thing. He got like no feedback with what he did wrong until Eriri and Utaha go off with their new project which again IMO was just a big fuck you, you suck at being a producer Tomoya Kbai."
  },
  {
   "score": 3,
   "id": "dj1fx68",
   "pid": "t1_dj1bhiy",
   "date": "2017-06-17 13:37:10",
   "depth": 3,
   "text": "Pretty sure Eriri and Utaha didn't really know either why they weren't improving. Didn't tell Tomoya because they were scared, but whatever feelings man. \n\nTomoya does suck. Eriri needs someone that can tell her to do something and doesn't give her any leeway. That's why the Eriri ship is fundamentally flawed, even though Eriri is my favorite character. Hell, Utaha X Eriri would be 10x better than Tomoya and Eriri. "
  },
  {
   "score": 2,
   "id": "dj1gfgf",
   "pid": "t1_dj1fx68",
   "date": "2017-06-17 13:49:25",
   "depth": 4,
   "text": "Katou X Tomoya 4 life but Eriri is 2nd best IMO"
  },
  {
   "score": 1,
   "id": "dj1nju3",
   "pid": "t1_dj1gfgf",
   "date": "2017-06-17 16:21:37",
   "depth": 5,
   "text": "I agree. I wouldn't want Eriri being with such a sad person either. "
  },
  {
   "score": 4,
   "id": "dizx501",
   "pid": "t1_diyjsra",
   "date": "2017-06-16 12:20:47",
   "depth": 1,
   "text": "There are just not enough reasons to continue helping Tomoya imo especially when thinking about the future. Think about it. A massive game producer comes to you and offers you to work on an incredibly long and popular game series. Who would deny the offer? "
  },
  {
   "score": 6,
   "id": "dizquat",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 10:25:38",
   "depth": 0,
   "text": "And just like that, Best Girl saves the day."
  },
  {
   "score": 4,
   "id": "dj04zg5",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 14:55:24",
   "depth": 0,
   "text": "I am amazed at how much emotion this is dredging up for me. Similar circumstances have occurred in life, at that point we went from friends to 'friends'. If anyone asked, both parties would definitely answer that we were friends, but we were much more closer to acquaintances and over time, went our separate ways.\n\nIt's close to a sense of betrayal, but much more adequately captured by the sentiment of 'I was mistaken to trust you with that level of intimacy. Going forward, I'll be correcting that and won't be relying on you in that same manner.'"
  },
  {
   "score": 2,
   "id": "dj1gupv",
   "pid": "t1_dj04zg5",
   "date": "2017-06-17 13:59:31",
   "depth": 1,
   "text": "Damn dude, that was too real."
  },
  {
   "score": 6,
   "id": "dj0h4xh",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 19:32:40",
   "depth": 0,
   "text": "The best episode ever. Decisions, struggles, fightings.\nHow can people not relate to this is beyond me."
  },
  {
   "score": 12,
   "id": "dizb5t8",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 05:09:13",
   "depth": 0,
   "text": "I really think a lot of people are missing the point of the last two episodes in regards to Eriri (and, to a lesser extent, Utaha).\n\nShe knows she's betraying Tomoya. She literally broke down into tears in this episode because of it. She hates herself for it. But she knows she hit a wall with him on talent and she couldn't get over it where she stood.\n\nShe's not a demon. She didn't say \"Fuck you\" and walk away with a smile on her face. She's torn up as hell about this. And yet I see so many comments like she did just that, even though she didn't."
  },
  {
   "score": 9,
   "id": "dizdokt",
   "pid": "t1_dizb5t8",
   "date": "2017-06-16 06:14:15",
   "depth": 1,
   "text": "Reposting my reply from elsewhere:\n\n I think some fans are not understanding what the author is doing. He is not intentionally making people hate them, instead he is trying to humanize them by allowing these trope heavy side heroines to form independent choices and flawed executions, which are realistic for high school girls. By breaking down their harem member status, it's making their characters far more interesting and multi-faceted. Unfortunately some fans are still selling them short. \n\nThis is coming from a Megumi fan."
  },
  {
   "score": 2,
   "id": "dj08ttg",
   "pid": "t1_dizdokt",
   "date": "2017-06-16 16:19:44",
   "depth": 2,
   "text": "Agreed. I think Utaha already gave up on Aki since she conceded to Kato, and in that sense between working with Aki on Saekano and working with Eriri on a FinalFantasy-level game it was natural that she would leave it to Eriri to make that decision. Eriri is the one truly making the decision to break, and it really destroys her that she is doing it, again, for the second time. It seems that she didn't pluck up the courage to talk to Tomoya afterwards, which interestingly echoes how Tomoya left Kato out in the final days of their game.\n\nI'm looking forward to how Aki develops as a character after this hurdle, if he goes on a warpath at all, and if Saekano's going to be produced. Chances are, Izumi might end up in his circle instead."
  },
  {
   "score": 1,
   "id": "dj10ahf",
   "pid": "t1_dj08ttg",
   "date": "2017-06-17 07:33:16",
   "depth": 3,
   "text": "Izumi in his circle will be awesome "
  },
  {
   "score": 8,
   "id": "dizejxq",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 06:33:52",
   "depth": 0,
   "text": "Damn I wish this season was longer, I cannot fathom them coming to a good conclusion with one episode left. I see people defending Eriri and Utaha, and I guess I can understand it from a professional standpoint, but I will be beyond disappointed if they somehow stay friends with Tomoya. Maybe rivals could work, but there is no way I will rate this show well if they do an asspull and reverse the betrayal in the next episode.\n\nEDIT: So I read the source material summaries past where the anime takes place, and [Major SaeKano LNs 9-12 Spoilers](/s \"I can already tell I am not going to like this. Too much white knighting from the MC to the betrayers... He sacrifices his own work to help them out of their own grave, even though they sacrificed their relations with him to dig their own grave. No idea what LN 13 will be like when it comes out, but I got a feeling it will not end how I want it to. In fact, I bet Eriri and Utaha join back with Tomoya after he saves their asses and they go back to merry days (without the harem hijinks since Kato wins in LN 12). I did however enjoy the fact that Utaha greatly regrets her decisions and builds off of them, not sure how much Eriri really changes aside from learning how to draw when Tomoya is around instead of having emotional artist block or whatever. The fact that Utaha tries to rape(? according to the summary I read) the MC in LN 12 tells me that she clearly did not learn how hard she lost the harem battle, or blindly thought she even stood a chance after how weak she looked during LN 10-12.\") This is just my opinion from what I read, however. In the end, it is only a story and I probably got too worked up over it."
  },
  {
   "score": 1,
   "id": "dj8y43d",
   "pid": "t1_dizejxq",
   "date": "2017-06-22 07:17:03",
   "depth": 1,
   "text": "Hello, could you please tell me where you've read thses summaries or even full chapters? Also are they in english?"
  },
  {
   "score": 3,
   "id": "dj956gz",
   "pid": "t1_dj8y43d",
   "date": "2017-06-22 09:22:42",
   "depth": 2,
   "text": "> Huge spoilers in all of these links for way beyond the current anime. I can't find volumes 1-5 but they might be somewhere. All of that is covered in the anime anyway. \n> \n> Volume 6: http://msnkkan.blogspot.com/2014/04/do-you-remember-love.html?m=1\n> \n> Volume 7: http://msnkkan.blogspot.de/2014/12/last-note-first-trip.html?m=1\n> \n> Volume 8: https://magnavalon.wordpress.com/2015/07/20/saekano-volume-8-a-new-beginning/\n> \n> Volume 9: https://www.reddit.com/r/Saekano/comments/449fw0/spoilers_saenai_heroine_no_sodatekata_volume_9/\n> \n> Volume 10: https://magnavalon.wordpress.com/2016/07/20/saekano-volume-10/\n> \n> Volume 11: https://magnavalon.wordpress.com/2016/11/19/saekano-volume-11-blessing/\n> \n> Volume 12: https://magnavalon.wordpress.com/2017/03/17/saekano-volume-12/\n> \n> I'm pretty sure those are the exact ones i read, all from google. magnavalon seems to be a good site for them in general. \n\nCourtesy of /u/Slytherin4Lyfe"
  },
  {
   "score": 1,
   "id": "dj95bf2",
   "pid": "t1_dj956gz",
   "date": "2017-06-22 09:24:58",
   "depth": 3,
   "text": "Thank you"
  },
  {
   "score": 1,
   "id": "dizofmy",
   "pid": "t1_dizejxq",
   "date": "2017-06-16 09:42:06",
   "depth": 1,
   "text": "Thanks, in the text on \"Major Saekano LNs 9-12 spoilers\" you said all I think. Exceptionally the Utaha's part, she has to see that she can't be that friendly anymore, be it because she left him or because he likes Kato. Didn't like the way that Tomoya said that he didn't want Eriri, though. He should have said that he didn't want someone who has betrayed him, not because some fame that she can get or whatever. Btw, where did you read that Utaha regret her decision? "
  },
  {
   "score": 2,
   "id": "dj0dnyh",
   "pid": "t1_dizofmy",
   "date": "2017-06-16 18:16:34",
   "depth": 2,
   "text": "That was just the feeling I got when I read the summaries of the chapters, I didn't actually read the LNs so I could be wrong. "
  },
  {
   "score": 6,
   "id": "dizrola",
   "pid": "t1_dizejxq",
   "date": "2017-06-16 10:40:39",
   "depth": 1,
   "text": "Yeah I just read the summaries for chapter 12 and it's complete shit. [Spoiler talk](/s \"I don't like that he goes out of his way to help them and goes behind Katou's back when he should have just focused on his own company. I also hate how everyone just reconciles at the end.\")"
  },
  {
   "score": 6,
   "id": "dizezx2",
   "pid": "t1_dizejxq",
   "date": "2017-06-16 06:43:14",
   "depth": 1,
   "text": "[You will defenitely love the next episode](/s \"They will still be friends, Tomoya will forgive them completely, like nothing happened\")"
  },
  {
   "score": 1,
   "id": "dizg36s",
   "pid": "t1_dizezx2",
   "date": "2017-06-16 07:05:51",
   "depth": 2,
   "text": "Yeah just read the summaries, [SaeKano LNs](/s \"Fuck me, I guess I expected way too much from it all. Well, at least end of LN 12 tells me we get to see Kato in maximum victory glory in LN 13 unless they really fuck that up somehow.\")"
  },
  {
   "score": 2,
   "id": "dizgz9j",
   "pid": "t1_dizg36s",
   "date": "2017-06-16 07:23:38",
   "depth": 3,
   "text": "Tomoya best MC this season, from zero to hero. LMAO"
  },
  {
   "score": 4,
   "id": "diyzpq4",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 21:39:22",
   "depth": 0,
   "text": "If you're going to do something like this, tell your friend that you did, ok, he/she would understand. If you don't tell him, don't even bother to ask for forgiveness, you should know the consequences of  your actions. "
  },
  {
   "score": 3,
   "id": "dizy5h9",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 12:39:58",
   "depth": 0,
   "text": "Thank God for Kato. This whole episode was about how the other two girls get over their love for the protagonist, and it was hard to watch."
  },
  {
   "score": 4,
   "id": "dj06mmy",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 15:30:36",
   "depth": 0,
   "text": "Oh wow the animation this episode was top notch. Hair and body movement and such was so fucking fluid. 10/10\n\nHonestly this made me sort of understand their point of view, I'm not that mad they left. I gotta say though I *love* Utaha and Eriri's relationship developement. It's like a bromance between girls. Sismance? ...Nah that sounds dumb."
  },
  {
   "score": 4,
   "id": "dj08z3w",
   "pid": "t1_dj06mmy",
   "date": "2017-06-16 16:23:09",
   "depth": 1,
   "text": "a sort of professional respect intermixed with desire because their works *move* each other in ways even Aki Tomoya can not."
  },
  {
   "score": 5,
   "id": "dj074ta",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 15:41:33",
   "depth": 0,
   "text": "Best Girl on the Offensive. "
  },
  {
   "score": 6,
   "id": "dizf55p",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 06:46:18",
   "depth": 0,
   "text": "While I understand WHY they would want to work for Akane, I still can't forgive HOW they did it. If you recall, in the last episode, Eriri already suspected that Tomoya was working on a 2nd project a MONTH before he showed it to Utaha senpai. There were so many ways for them to have attacked this. Infact, if they went to him right away, I truly belive that Tomoya would've been very very okay with it, had they talked to him about it. Instead, they cowardly waited a month, and for Tomoya to actually finish his proposal. Not cool."
  },
  {
   "score": 5,
   "id": "dizzgn8",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 13:05:23",
   "depth": 0,
   "text": "I'm gonna stick to my guns and say, fuck Utaha and Eriri. I'm in all my rights to dislike their development, but I won't deny it's good for both. \n\nBasically they choose each other, to continue working as a group for themselves. This meant they had to leave the MC and any motivation they had with him. This is not really bad for them as characters, because they decided their own lives were more important as it should be, they grew into their own characters, hurrah for yuri route. As far as I care they can take them out of the story now, which is MUCH better for me, because fuck both.\n\nNo seriously, they made their exit now, whatever happens to them now is not important for the story. Aki already accepted it and moved on, Katou is been the best as always. This is now the story of Aki and Katou, without the bother of 2 unnecessary useless fanservice characters(Not really), and now the problem is continuing the circle."
  },
  {
   "score": 6,
   "id": "dj0tqoa",
   "pid": "t3_6hflpu",
   "date": "2017-06-17 03:38:23",
   "depth": 0,
   "text": "I think we can all agree that both Eriri and Utaha's decisions are not bad. They needed to leave the team in order to improve. However, there seems to be a split on whether their action of not informing Aki of their decision is justified. Some say they don't owe him anything while others say that it's betrayal.\n\nHere's my take. Utaha and Eriri are shitty friends. They left Aki when they decided that they have no more use for him (Utaha basically being rejected and Eriri becoming Aki's number one). Saying that both of them don't owe him any explanation is bullshit since being noticed by Akane was a result of Aki dragging them both into creating a game. And it's not like they didn't benefit from it since they both learned something new because of that project (Utaha learning that too much description isn't good in a visual novel and Eriri achieving a new art style). Now that they want something new (Utaha wanting to f*ck Eriri's art and Eriri realizing she has masochistic tendencies XD), they couldn't even be bothered to say to Aki that they're leaving the team, for a WHOLE MONTH! Heck, if Tomoya didn't chase after Utaha, they probably wouldn't say anything at all. Doesn't Aki deserve that at least? They're still technically friends, right?\n\nConclusion: Utaha and Eriri are opportunistic b*tches, Kato is best girl, Michiru is forgotten XD"
  },
  {
   "score": 2,
   "id": "dj12aih",
   "pid": "t1_dj0tqoa",
   "date": "2017-06-17 08:23:30",
   "depth": 1,
   "text": "Yeah, I agree with that. You can't call they friends with the way they treated the matter. The decisions were not bad, but the way they handled it, man... And it seems for them that the friendship was one way only, considering that they didn't tell him the decision"
  },
  {
   "score": 3,
   "id": "diyb7mn",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 12:37:05",
   "depth": 0,
   "text": "i'm not familiar with the light novels but it feels like it'll be tough to end the series in a couple of episodes. another season is probably a bit much as well. maybe a movie?"
  },
  {
   "score": 3,
   "id": "diyj01r",
   "pid": "t1_diyb7mn",
   "date": "2017-06-15 15:03:17",
   "depth": 1,
   "text": "Well next episode is the last one..."
  },
  {
   "score": 5,
   "id": "diygdgz",
   "pid": "t1_diyb7mn",
   "date": "2017-06-15 14:11:55",
   "depth": 1,
   "text": "we need 6 seasons and 2 movies"
  },
  {
   "score": 3,
   "id": "diyrtf9",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 18:18:51",
   "depth": 0,
   "text": "No one noticed the rokudenashi posters?"
  },
  {
   "score": 3,
   "id": "diz7s8f",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 02:56:38",
   "depth": 0,
   "text": "I thought we were going to get a whole episode without Katou. Then she comes in at the end and gets my hopes up. Can't wait for next weeks now."
  },
  {
   "score": 3,
   "id": "dizqlbi",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 10:21:12",
   "depth": 0,
   "text": "Such a roller coaster of emotions all throughout the episode.\n\nSeason 3 plz \n\n*Has that akashic records poster been in the editor's room the entire season?*"
  },
  {
   "score": 1,
   "id": "dizuzzx",
   "pid": "t1_dizqlbi",
   "date": "2017-06-16 11:40:51",
   "depth": 1,
   "text": "*I haven't noticed the poster, but probably! Season 1 had an OreImo poster and Nendoroids in the exact same spots the whole time.*"
  },
  {
   "score": 3,
   "id": "dj06gku",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 15:27:01",
   "depth": 0,
   "text": "Well I kind of forgive Eriri for at least admitting she's totally fucking wrong for doing Tomoya like that.  However, it's still shitty she needed a total asshole to get her drawing instead of a kind caring friend.\n\nI was just getting used to Megumi with long hair and a ponytail but I did love her short hair at first."
  },
  {
   "score": 1,
   "id": "dj12ds5",
   "pid": "t1_dj06gku",
   "date": "2017-06-17 08:25:44",
   "depth": 1,
   "text": "The sad part is that she admitted it, but didn't do anything to at least make it less painful, like maybe telling him that Akane had scouted them and/or the decision to join Akane "
  },
  {
   "score": 3,
   "id": "dj13ker",
   "pid": "t1_dj12ds5",
   "date": "2017-06-17 08:53:39",
   "depth": 2,
   "text": "Yeah.  I liked how the one that was most considerate of the group and Tomoya personally was the rival guy."
  },
  {
   "score": 6,
   "id": "diyjbbx",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 15:09:40",
   "depth": 0,
   "text": "imean, isnt Utaha supposed to be Eriris babysitter? why in the world would she accept a job that is so beneath her, considering her pride, i just dont get it. Eriris decision to leave is understandable, Utahas is not. At this point, i just hope he moves on, forgets about them and hires some new people while making sweet sweet love to Katou, like any normal functioning human beeing would\n\nTBH the entire episode is a waste, their motivations and backstory for the betrayal was explained last episode, we didnt need an entire episode of this bullshit, especially since its the second last episode and theres so much shit to resolve"
  },
  {
   "score": 5,
   "id": "dizd7fc",
   "pid": "t1_diyjbbx",
   "date": "2017-06-16 06:02:44",
   "depth": 1,
   "text": "Utaha's motivation is pretty clear to me, she wants to work with Eriri."
  },
  {
   "score": 11,
   "id": "diyktqu",
   "pid": "t1_diyjbbx",
   "date": "2017-06-15 15:40:55",
   "depth": 1,
   "text": "My interpretation is that the whole thing about calling Utaha as Eriri's babysitter was Akane's way of getting under Utaha's skin in negotiation, just like when she said Eriri's art was easy to imitate.  If her art was so mediocre and replaceable, why go through the trouble of spying on her undercover in episode 6, and actually taking the time and effort to imitate her style?  Same thing could be said for Utaha, if her writing was really not on par with Eriri's art and up to the caliber of the RPG project (think Final Fantasy), why through the official channel contact Utaha's publisher in the first place?  Note that a commercial contract with Utaha would mean some profit sharing with her publisher as well, so that's a pretty important business collaboration between companies, not some decision to be taken lightly.  Being an accomplished writer herself, would Akane give the main scriptwriter job of the game to a college freshman \"babysitter\"?\n\nThe fact is, she could read Utaha and Eriri like open books being an industry veteran and know exactly how to get on their nerves.  She correctly read Eriri's current complacency and creative ambition, as well as Utaha's pride as a professional writer and mutual respect and rivalry with Eriri."
  },
  {
   "score": 1,
   "id": "dj1h2wz",
   "pid": "t1_diyktqu",
   "date": "2017-06-17 14:05:02",
   "depth": 2,
   "text": "I know Akane is an old wolf who can read her prey pretty well"
  },
  {
   "score": 2,
   "id": "diylxso",
   "pid": "t1_diyktqu",
   "date": "2017-06-15 16:04:29",
   "depth": 2,
   "text": "did she give Utaha the main scriptwriter job though? i thought she was just going to assist the main scriptwriter, while watching Utaha"
  },
  {
   "score": 6,
   "id": "diymm2i",
   "pid": "t1_diylxso",
   "date": "2017-06-15 16:19:15",
   "depth": 3,
   "text": "Utaha will be the main scriptwriter. It was mentioned last episode, even though Akane played the \"only if Eriri signs up\" card to poke at Utaha's ego.  \n\nAkane herself is not directly involved in the creative process but she is the project leader. Due to her strong reputation and track records, she can make the production company greenlite any of her personnel picks.  That's why the offer is so attractive.  \n\nIt's like Steve Jobs (alive and well) approaching a comp sci graduate to be the main developer of his next project.  Even knowing how much a horrible person he could be, realistic speaking how many young graduates can turn down such an opportunity?"
  },
  {
   "score": 3,
   "id": "diz70ae",
   "pid": "t1_diyktqu",
   "date": "2017-06-16 02:19:42",
   "depth": 2,
   "text": "good point bro. Akane never underestimate both Eriri and Utaha, it's just her lie to push them forward"
  },
  {
   "score": 4,
   "id": "diy2rwq",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 10:07:21",
   "depth": 0,
   "text": "[removed]"
  },
  {
   "score": 7,
   "id": "diz6e79",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 01:51:05",
   "depth": 0,
   "text": "It's really depressing to see all the Utaha and Eriri hate after these last two episodes. Everyone who loved these characters now wants them to die horrible deaths and that genuinely makes me sad."
  },
  {
   "score": 3,
   "id": "dizmmqz",
   "pid": "t1_diz6e79",
   "date": "2017-06-16 09:09:35",
   "depth": 1,
   "text": "Meanwhile i am just starting to like them more and more (not that i didn't like them before)"
  },
  {
   "score": 6,
   "id": "diz9y11",
   "pid": "t1_diz6e79",
   "date": "2017-06-16 04:28:02",
   "depth": 1,
   "text": "Betrayal does that "
  },
  {
   "score": 2,
   "id": "dizfi0u",
   "pid": "t1_diz6e79",
   "date": "2017-06-16 06:53:51",
   "depth": 1,
   "text": "Well, if they didn't the betrayal the way they did, I think that they would still be liked. But they didn't even have the courage to tell their loved one (and childhood friend) the action they took and instead waited long enough that created the award situation when he was asking them to work with him. I'm sad that the author decided to make Aki a shitty protagonist that will basically forgive the two of them in like one/two volumes. At least Megumi is there to keep throwing the truth in the face of Eriri. Sadly she took the same action of Tomoya at last :/"
  },
  {
   "score": 11,
   "id": "dizdd11",
   "pid": "t1_diz6e79",
   "date": "2017-06-16 06:06:36",
   "depth": 1,
   "text": "I think some fans are not understanding what the author is doing. He is not intentionally making people hate them, instead he is trying to humanize them by allowing these trope heavy side heroines to form independent choices and flawed executions, which are realistic for high school girls. By breaking down their harem member status, it's making their characters far more interesting and multi-faceted. Unfortunately some fans are still sellong them short. \n\nThis is coming from a Megumi fan."
  },
  {
   "score": 3,
   "id": "dizr9vf",
   "pid": "t1_dizdd11",
   "date": "2017-06-16 10:33:20",
   "depth": 2,
   "text": "I can definitely see that with how the direction and animation played out in this episode. We're supposed to sympathize with these characters. Although their decision to tell Aki at the last second was completely idiotic, we have an understanding of why it was hard for them to reach that decision. Watching both of them breakdown and cry was really emotional for me."
  },
  {
   "score": 4,
   "id": "diy8id2",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 11:48:42",
   "depth": 0,
   "text": "I like it! Call all the survivors of the SS Utaha and Eriri  for a new yuri ship! "
  },
  {
   "score": 1,
   "id": "diz931g",
   "pid": "t1_diy8id2",
   "date": "2017-06-16 03:54:38",
   "depth": 1,
   "text": "[](#heart-thumbs-up)"
  },
  {
   "score": 5,
   "id": "dizbydq",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 05:32:51",
   "depth": 0,
   "text": "I hate how the anime makes it look like as if Utaha and Eriri didn't do anything wrong and put the blame on Tomoya... What they did is horrible not because they wanted to work for a bigger company! It was wrong because they kept it a secret for a whole month instead straight up being honest to him! And then they have the nerve to blame him just because both of them need someone who bullies them to be motivated! My God! This makes me so mad! I won't share any tear for them! At least Katou saved this episode for me."
  },
  {
   "score": 8,
   "id": "diykhan",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 15:33:40",
   "depth": 0,
   "text": "I'm so glad they decided to go with the game company, even if it means leaving Aki.\n\nEriri wants to get better and while it hurts her she realized she just can't get that motivation from Aki, he doesn't push her hard enough or give her enough of a challenge. I hope they're still friends by the end, I would hate for it to completely blow up their relationship."
  },
  {
   "score": 14,
   "id": "diymjg0",
   "pid": "t1_diykhan",
   "date": "2017-06-15 16:17:36",
   "depth": 1,
   "text": "From a relationships perspective, Eriri destroyed any chance of being Aki's \"number one\". But this is anime and aki will probably be super forgiving and everything will resolve itself. I just want aki to rip Eriri apart for betraying him, again. "
  },
  {
   "score": 2,
   "id": "diypzva",
   "pid": "t1_diymjg0",
   "date": "2017-06-15 17:36:15",
   "depth": 2,
   "text": "There's going to be some drama at first yeah, but I really hope Aki can understand why she took the job. It hurts at first but it's the right decision for everyone involved."
  },
  {
   "score": 12,
   "id": "diyrbex",
   "pid": "t1_diypzva",
   "date": "2017-06-15 18:07:04",
   "depth": 3,
   "text": "Accepting the job is fine because its a big opportunity. The problem is that she didn't tell him and left him hanging for a month and only found out from Utaha. "
  },
  {
   "score": -1,
   "id": "diyrs7z",
   "pid": "t1_diyrbex",
   "date": "2017-06-15 18:18:01",
   "depth": 4,
   "text": "She knew that it would create a huge emotional scene and she didn't want to deal with that."
  },
  {
   "score": 16,
   "id": "diys0u5",
   "pid": "t1_diyrs7z",
   "date": "2017-06-15 18:23:49",
   "depth": 5,
   "text": "Which what made her a big bitch in the eyes of  almost everyone on the hate bandwagon\n\nIronically, If she told Aki the day she was offered a job and did not wait for a fuckin month, I doubt if it would be a big emotional mess since Aki is already  thinking if he would get them on board the new project because he thinks they have their own work to do, Im 100% sure if they told Aki the earliest possible he would be less emotional and in fact happy that they are going to work for a big project."
  },
  {
   "score": 1,
   "id": "dizc1d8",
   "pid": "t1_diys0u5",
   "date": "2017-06-16 05:35:01",
   "depth": 6,
   "text": "So what if she didnt tell him. Aki did it too."
  },
  {
   "score": 11,
   "id": "diysqe2",
   "pid": "t1_diys0u5",
   "date": "2017-06-15 18:40:52",
   "depth": 6,
   "text": "Also she knew he was planning to start a new project with the group. Which makes it even worse "
  },
  {
   "score": 5,
   "id": "diz69wl",
   "pid": "t1_diysqe2",
   "date": "2017-06-16 01:45:47",
   "depth": 7,
   "text": "And they had all just promised Megumi that they wouldn't keep things from each other..."
  },
  {
   "score": 8,
   "id": "diza66e",
   "pid": "t1_diys0u5",
   "date": "2017-06-16 04:36:19",
   "depth": 6,
   "text": "I think it's just sucks for Aki to slave away at a new proposal to win his friends over again and hope they will come back, if I were Aki I rather be told the day after they accepted so I can move on to other things. Just knowing they they didn't tell me for a month while I work my ass off would be the frosting to the cake in terms of betrayal."
  },
  {
   "score": 8,
   "id": "diyrfoc",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 18:09:45",
   "depth": 0,
   "text": "Eriri is a cutt throat bitch"
  },
  {
   "score": 2,
   "id": "diy11pi",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 09:37:07",
   "depth": 0,
   "text": "So is there a fan translation for this LN or only in raw, I really want to read it "
  },
  {
   "score": 2,
   "id": "diy3ta9",
   "pid": "t1_diy11pi",
   "date": "2017-06-15 10:25:43",
   "depth": 1,
   "text": "As far as I know it's also available in Chinese, Korean and possibly Indonesian and other Asian languages, not sure if it helps anyways... :S"
  },
  {
   "score": 3,
   "id": "diy6l8x",
   "pid": "t1_diy11pi",
   "date": "2017-06-15 11:14:34",
   "depth": 1,
   "text": "There is an official translation of the manga, not LN, but it is well behind the the anime. "
  },
  {
   "score": 3,
   "id": "diy2bj9",
   "pid": "t1_diy11pi",
   "date": "2017-06-15 09:59:19",
   "depth": 1,
   "text": "Currently there are no fans translations on the series due to being taken down by DMCA months ago. You can find summaries for Vol. 5 - 12 in /r/Saekano"
  },
  {
   "score": 2,
   "id": "diyixod",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 15:01:55",
   "depth": 0,
   "text": "what the fuck just happened?\nEdit: Didn't watch the most current episode, RIP"
  },
  {
   "score": 2,
   "id": "diz6fuq",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 01:53:14",
   "depth": 0,
   "text": "Am I the only one amazed that Eriri started from the hair first in her sketch? I normally have to start by making the head's basic shape and placing the nose."
  },
  {
   "score": 5,
   "id": "diz6g08",
   "pid": "t1_diz6fuq",
   "date": "2017-06-16 01:53:26",
   "depth": 1,
   "text": ">Am I the only one \n\n Probably not"
  },
  {
   "score": 1,
   "id": "diz7fmk",
   "pid": "t1_diz6g08",
   "date": "2017-06-16 02:39:58",
   "depth": 2,
   "text": "username checks out"
  },
  {
   "score": 2,
   "id": "dizol5u",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 09:44:52",
   "depth": 0,
   "text": "Little too melodramatic for my liking."
  },
  {
   "score": 2,
   "id": "dizr39d",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 10:30:05",
   "depth": 0,
   "text": "So is that Kato confronting Eriri scene still going to happen? [Question](/s \"I read somewhere that Kato slaps Eiri, is this true?\")"
  },
  {
   "score": 2,
   "id": "dizsgd7",
   "pid": "t1_dizr39d",
   "date": "2017-06-16 10:54:33",
   "depth": 1,
   "text": "[Saekano](/s \"No slapping, just an emotional confrontation, hopefully shown as flashback next episode. Katou broke up with Eriri and took much longer to forgive her than Tomoya, which is a more natural reaction if you ask me.\")"
  },
  {
   "score": 2,
   "id": "dizv6mn",
   "pid": "t1_dizsgd7",
   "date": "2017-06-16 11:44:18",
   "depth": 2,
   "text": "Yeah, this is the reaction that should have happened with Tomoya too ¬¬"
  },
  {
   "score": 2,
   "id": "dj0zykv",
   "pid": "t3_6hflpu",
   "date": "2017-06-17 07:24:29",
   "depth": 0,
   "text": "it became a Habit for Katou to steal the show in just a few seconds  \n"
  },
  {
   "score": 2,
   "id": "dj134up",
   "pid": "t3_6hflpu",
   "date": "2017-06-17 08:43:34",
   "depth": 0,
   "text": "a few episodes ago i thought i'm gonna be salty AF if any of the girls leave the circle. But somehow i don't feel salty at all in this episode. \n\nalso the BGM when ~~masochist girl~~ Eriri draw is very good, feels really different than the the rest of the show so far.\n\nI expect a whole Katou episode next week"
  },
  {
   "score": 4,
   "id": "dizcmux",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 05:49:27",
   "depth": 0,
   "text": "Good on you Aki. You're hurt, but you get where they're coming from. You're handling this with a healthy amount maturity and understanding.\n\nI wish r/anime would follow your example."
  },
  {
   "score": 2,
   "id": "diy1k3j",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 09:46:04",
   "depth": 0,
   "text": "Hopefully this follows the LN because the infinite amount of salt a certain scene could cause would be fantastic. [LN Spoilers](/s \"Even this should have changed the status quo, it doesn't. Tomoya still helps them with their jobs.\")"
  },
  {
   "score": 2,
   "id": "diz6xwr",
   "pid": "t1_diy1k3j",
   "date": "2017-06-16 02:16:36",
   "depth": 1,
   "text": " [Saekano spoilers](/s \"And I'm not even happy that Utaha has the audacity to kiss Tomoya after backstabbing him and leaving him\") the looks on their faces when they're begging to come back would satisfy me"
  },
  {
   "score": 3,
   "id": "diz6edg",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 01:51:19",
   "depth": 0,
   "text": "Why does everyone keep letting her down and betraying her. Poor Megumi... She not a creator, she will not understand their decision like Tomoya does... and as usual Megumi always there when Tomoya need a support.. fuck you Tomoya.. fuck you."
  },
  {
   "score": 2,
   "id": "dj043fb",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 14:37:04",
   "depth": 0,
   "text": "Man, fvck Utaha and Eriri. Megumi canon waifu."
  },
  {
   "score": 3,
   "id": "dj2xa4s",
   "pid": "t3_6hflpu",
   "date": "2017-06-18 14:46:31",
   "depth": 0,
   "text": "I love the development with Eriri and Utaha. This an unusual and welcome turn of events that shows true character growth. \n\nIf you dislike what they did I don't think you're getting what the author is trying to portray. Everyone is following their own dreams and what started as a harem / do whatever to make Aki happy, has turned into them leaving his grasp. Kato is there for Aki so he can manage. The other girls weren't blossoming under Aki because they were tied down by their love for him.\n\nI think the girls all made the proper choices because they can't keep working for him as a friend/lover that won't get reciprocated. He'll just end up with Kato. It was good for Utaha and Eriri to move on and find something that would benefit THEM and not living for Aki like they were before. It shows they both have grown. \n\nAnd they don't owe Aki anything, as he's just making up projects as he goes and there was never any talk of a new game. It's not like they signed a contract with him to keep working for him. They're just friends that decided to help him on his first game."
  },
  {
   "score": 4,
   "id": "diz81r6",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 03:09:16",
   "depth": 0,
   "text": "Utaha and Eriri definitely did the right thing. Tomoya didn't bring out their full potential. Sometimes people need someone that pushes them over the edge, like Eriri needed - Tomoya can't manage to that as it seems. Wanting to wait until everything works out and friendship.. is fine and all but that won't help them pursue their career like their new offer. \n\n\nTomoya is pretty much dead to me as a character - the girls certainly carry this show by a huge margin. I disagree with most people not liking this attitude that the creators need a push sometimes - imo it's exactly what they need especially in a scenario like Eriri's slump."
  },
  {
   "score": 2,
   "id": "diz9x8n",
   "pid": "t1_diz81r6",
   "date": "2017-06-16 04:27:17",
   "depth": 1,
   "text": "But you can't say how they got the push is right or how they left (by not really telling Aki) is right "
  },
  {
   "score": 2,
   "id": "dizact3",
   "pid": "t1_diz9x8n",
   "date": "2017-06-16 04:42:46",
   "depth": 2,
   "text": "Akane told them the facts, showed Eriri that she still needs to improve -> it leads to her wanting to be better and draw again. How is that wrong? Aki would have told her to not worry about it and waited more months while they all waste their time. Can you call that a good producer?\n\nHow they left? Did they ever agree to do another game right off the bat? Aki never took any of their leads to go beyond typical friendship, so why is it wrong for them to want to follow their career more than a school-friends doujin circle with a lousy producer? Yeah sure they never told him - but did he do better? I highly doubt it."
  },
  {
   "score": 8,
   "id": "dizb9k1",
   "pid": "t1_dizact3",
   "date": "2017-06-16 05:12:30",
   "depth": 3,
   "text": "In terms of being a lousy producer, Aki never promised them he would be the best producer to push them beyond their limits, he's just a high school student with some goals and he met them with the tools he had at his disposal which I think is admirable. It's only natural for someone to keep pushing after some success, so the need to tell the girls that he was planning something isn't necessary, especially when he kept asking when Eriri could draw again, dropping hints that he hopes she'll be able to draw again so he can work on the next proposal. She even knew herself that he wanted to work on something new.\n\nSecond leaving the team to join a veteran and promised of fame and money is too good of an offer to pass no matter what, but honestly, that decision is hollow and one-sided. Aki is stripped of two of his creators and more importantly friendship. Even though he never really followed through with Utaha's vague confession, he didn't say no flat out. With Eriri, it started to look like their relationship was blossoming again, so the potential to move beyond friends and something more was there, we'll just never know. \n\nIn short I don't disagree with you, I completely agree that decision is the best for the girls. I just disapprove of the way they were poached (by being insulted) and the matter they handled of leaving Aki. If the Akane was stern but not an asshole and they told Aki let's say within a week of their decision then trust me, I would have nothing to say and probably defend the girls decisions"
  },
  {
   "score": 5,
   "id": "diygw7o",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 14:21:59",
   "depth": 0,
   "text": "Skipped through the first 18 minutes due to the overwhelmingly unbearable presence of backstabbing bitches.  \nThose traitors should just go DIAF\n\nOnly the last few minutes with Iori and ofc, Kato's appearance in the end, *somewhat* saved this episode."
  },
  {
   "score": 2,
   "id": "diz6akk",
   "pid": "t1_diygw7o",
   "date": "2017-06-16 01:46:37",
   "depth": 1,
   "text": "Nothing will give better satisfaction is the look on their faces when Tomoya made a better game and now they want to come back if they do fuck them and [Saekano Spoiler](/s \"Utaha kisses Tomoya...I don't know how you have the audacity to do that to him\")"
  },
  {
   "score": 6,
   "id": "diz29t8",
   "pid": "t1_diygw7o",
   "date": "2017-06-15 23:01:25",
   "depth": 1,
   "text": "Yeah, I did the same. The fact that the two of them did the action in the most bitchy way seemed to be overlooked and they tried to show us that \"The action was necessary\". Oh, for God's sake, I don't want to sympathize with them. Good reason, wrong method. That the only thing that I need to keep in mind. "
  },
  {
   "score": 2,
   "id": "diy75xs",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 11:24:41",
   "depth": 0,
   "text": "Who else wants to board SS UtahaxEriri after this episode?  We all know the other ship has sailed.\n\nEdit: Getting downvoted for suggesting a yuri ship?\n\n(╯°□°）╯︵ ┻━┻\n"
  },
  {
   "score": 5,
   "id": "diy7xnv",
   "pid": "t1_diy75xs",
   "date": "2017-06-15 11:38:23",
   "depth": 1,
   "text": "Those are sinking ships my friend, that's coming from an Ex Utaha shipper "
  },
  {
   "score": 1,
   "id": "dizfx9k",
   "pid": "t1_diy7xnv",
   "date": "2017-06-16 07:02:29",
   "depth": 2,
   "text": "Did you read his post properly? It's not SS Utaha (x Tomoya) or SS Eriri (x Tomoya), it's SS Utaha x Eriri, a ***yuri*** ship.\n\n*Edit: To the folks downvoting me now as well as /u/dene323 : You still don't get it do you? I'm not even disagreeing with you! But somehow you don't seem to understand that a *yuri ship* **is not in direct competition** with your preferred ships!*"
  },
  {
   "score": 5,
   "id": "diy87wx",
   "pid": "t1_diy7xnv",
   "date": "2017-06-15 11:43:29",
   "depth": 2,
   "text": "We still got the Metronome manga. "
  },
  {
   "score": 2,
   "id": "diy8jvk",
   "pid": "t1_diy87wx",
   "date": "2017-06-15 11:49:29",
   "depth": 3,
   "text": "As if that's a safe route... Even with Katou banned, Mayu hasn't gotten serious yet...\n\nBeing Utaha senpai is suffering."
  },
  {
   "score": -1,
   "id": "diy8uno",
   "pid": "t1_diy8jvk",
   "date": "2017-06-15 11:54:44",
   "depth": 4,
   "text": "I honestly expect Tomoya to end up with the three main girls to please everyone. "
  },
  {
   "score": 3,
   "id": "diy97b2",
   "pid": "t1_diy8uno",
   "date": "2017-06-15 12:00:58",
   "depth": 5,
   "text": "Eriri's personal route manga was cancelled prematurely due to lack of commercial success :P\n\nPoor Eriri...\n\nBtw, I think an actual galgame with multiple routes are more likely.  After all, the author was a galgame writer to begin with.  It would just be back to his familiar territory.  Given the meta nature of the story theme, it would be more interesting."
  },
  {
   "score": 1,
   "id": "dizc317",
   "pid": "t1_diy97b2",
   "date": "2017-06-16 05:36:10",
   "depth": 6,
   "text": "A vita visual novel game like Psycho Pass."
  },
  {
   "score": 8,
   "id": "diya0pa",
   "pid": "t1_diy97b2",
   "date": "2017-06-15 12:15:37",
   "depth": 6,
   "text": "Well it's quite easy to understand why the Eriri manga was cancelled while metronome is still going... I mean she's awful.\n\nFor some reason I think that vol 13 will begin with the wrong answer to what we expect will happen sadly and I can't tell you why I think that... it's just a hunch."
  },
  {
   "score": 3,
   "id": "diyapxk",
   "pid": "t1_diya0pa",
   "date": "2017-06-15 12:28:08",
   "depth": 7,
   "text": "We White Album 2 boys? "
  },
  {
   "score": 3,
   "id": "diyaqvx",
   "pid": "t1_diya0pa",
   "date": "2017-06-15 12:28:37",
   "depth": 7,
   "text": "You mean vol 13 will wrap up \"Saekano - the Introductory Chapter\"? :P"
  },
  {
   "score": 12,
   "id": "diy8dce",
   "pid": "t1_diy7xnv",
   "date": "2017-06-15 11:46:09",
   "depth": 2,
   "text": "We are working on a new and improved, yuri powered ship by salvaging parts from the two wreckage. "
  },
  {
   "score": 3,
   "id": "dizfw48",
   "pid": "t1_diy75xs",
   "date": "2017-06-16 07:01:50",
   "depth": 1,
   "text": "Not sure why you're being downvoted. You were obviously referring to a ***yuri*** ship that does not involve Tomoya (he's with Katou, as it should be)."
  },
  {
   "score": 3,
   "id": "dizov2s",
   "pid": "t1_dizfw48",
   "date": "2017-06-16 09:49:51",
   "depth": 2,
   "text": "(╯°□°）╯︵ ┻━┻\n\nTell me about it\n\nI got quite a bit of downvotes because people misread the ship I was implying... geez people are so upset with the girls... calm down already..."
  },
  {
   "score": 3,
   "id": "diyfezn",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 13:53:46",
   "depth": 0,
   "text": "I can't seem to find a good website to watch the new episode. Can someone help me out?"
  },
  {
   "score": 1,
   "id": "diyfl48",
   "pid": "t1_diyfezn",
   "date": "2017-06-15 13:56:59",
   "depth": 1,
   "text": "s a m e "
  },
  {
   "score": 1,
   "id": "diyfvow",
   "pid": "t1_diyfl48",
   "date": "2017-06-15 14:02:29",
   "depth": 2,
   "text": "We're both struggling, it seems."
  },
  {
   "score": 1,
   "id": "diykzd7",
   "pid": "t1_diyfvow",
   "date": "2017-06-15 15:44:13",
   "depth": 3,
   "text": "we all do"
  },
  {
   "score": 3,
   "id": "diyg7tb",
   "pid": "t1_diyfezn",
   "date": "2017-06-15 14:08:54",
   "depth": 1,
   "text": "[removed]"
  },
  {
   "score": 0,
   "id": "diyj1im",
   "pid": "t1_diyg7tb",
   "date": "2017-06-15 15:04:07",
   "depth": 2,
   "text": "This comment has been removed.\n\n- Links to or other obvious direction toward pirate, illegal, or unofficial anime content are not allowed. This includes links to unofficial translations/scanlations of light novels, visual novels, and manga, unofficial anime streams, torrent sites, unofficially uploaded full OSTs, and images and video containing watermarks from any of the previously mentioned websites. In addition, proxy services are also forbidden.\n\n  Repeated violations of this rule will result in a ban.\n\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 3,
   "id": "diyh3ge",
   "pid": "t1_diyg7tb",
   "date": "2017-06-15 14:25:51",
   "depth": 2,
   "text": "You are a God among men. Arigato."
  },
  {
   "score": 1,
   "id": "diyob9u",
   "pid": "t1_diyh3ge",
   "date": "2017-06-15 16:57:09",
   "depth": 3,
   "text": "[deleted]"
  },
  {
   "score": 0,
   "id": "diyoeg4",
   "pid": "t1_diyob9u",
   "date": "2017-06-15 16:59:08",
   "depth": 4,
   "text": "Sure thing!"
  },
  {
   "score": 1,
   "id": "diyuz3j",
   "pid": "t1_diyoeg4",
   "date": "2017-06-15 19:35:56",
   "depth": 5,
   "text": "can i have the link too? thanks"
  },
  {
   "score": 1,
   "id": "diythcj",
   "pid": "t1_diyoeg4",
   "date": "2017-06-15 18:59:14",
   "depth": 5,
   "text": "Link pls \n"
  },
  {
   "score": 1,
   "id": "diyqz98",
   "pid": "t1_diyoeg4",
   "date": "2017-06-15 17:59:09",
   "depth": 5,
   "text": "Can I have it, too?"
  },
  {
   "score": 1,
   "id": "diz0sgu",
   "pid": "t1_diyoeg4",
   "date": "2017-06-15 22:12:19",
   "depth": 5,
   "text": "Please PM me the link too. :)"
  },
  {
   "score": 1,
   "id": "diyztz1",
   "pid": "t1_diyoeg4",
   "date": "2017-06-15 21:42:50",
   "depth": 5,
   "text": "link please if you don't mind? :D"
  },
  {
   "score": 1,
   "id": "diyx7ar",
   "pid": "t1_diyoeg4",
   "date": "2017-06-15 20:30:57",
   "depth": 5,
   "text": "Link?"
  },
  {
   "score": 5,
   "id": "diyx7cz",
   "pid": "t1_diyx7ar",
   "date": "2017-06-15 20:31:00",
   "depth": 6,
   "text": "\n> Link?\n\n[Here you go!](https://upload.wikimedia.org/wikipedia/en/3/39/Wakerlink.jpg)\n\n---\n\n^(I am a bot. | )[^Creator](https://www.reddit.com/user/alienpirate5)^( | Unique string: 8188578c91119503)"
  },
  {
   "score": 3,
   "id": "diygovd",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 14:18:02",
   "depth": 0,
   "text": "cant find where to watch saekano season 2 episode 10.... ;w; can anyone link? "
  },
  {
   "score": 2,
   "id": "diyim0b",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 14:55:18",
   "depth": 0,
   "text": "Why is there a flat? Does this involve music?"
  },
  {
   "score": 2,
   "id": "diypdt8",
   "pid": "t1_diyim0b",
   "date": "2017-06-15 17:21:45",
   "depth": 1,
   "text": "I guess you could say the last couple episodes have really fallen ♭."
  },
  {
   "score": 21,
   "id": "diyyumt",
   "pid": "t1_diyim0b",
   "date": "2017-06-15 21:14:49",
   "depth": 1,
   "text": "Well, there's Eriri..."
  },
  {
   "score": 2,
   "id": "diz7j67",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 02:44:44",
   "depth": 0,
   "text": "The Great Betrayal Part 2 (and 10 seconds of redemption)\n\nIt is funny how people just abandoned adding [episode entries](https://myanimelist.net/anime/30727/Saenai_Heroine_no_Sodatekata_%E2%99%AD/episode) on MAL since episode 9"
  },
  {
   "score": 4,
   "id": "dizl7v7",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 08:43:40",
   "depth": 0,
   "text": "Drama aside, I think its realistic that Eriri and Utaha would leave Tomoya. I mean comparing Tomoya's small dream to working at a big hit title, Katou is just sticking around since she has no where else to go. As for Tomoya's future, I have no clue where hes going. Definitely pursuing his dream, but it was never clarified how. I also thought Iori and Izumi were going to join Tomoya on his project. (If its happens, I would love to watch a side story about this). Michiru been missing in action for awhile. (Everyone forgot about her LOL. Maybe another side story on her?) Honestly, I would definitely watch a show just to see Eriri and Utaha working at the big hit title, like another Shirobako-type show but with Saekano's characters. So things gonna wrap up soon, but seems like there are some more potential material that's left over."
  },
  {
   "score": 1,
   "id": "dj5h03n",
   "pid": "t1_dizl7v7",
   "date": "2017-06-20 06:55:21",
   "depth": 1,
   "text": "> I think its realistic that Eriri and Utaha would leave Tomoya. \n\nI agree. In the creative world, people are always leaving teams and joining new teams. There's rarely a time when a team stays together for a long time (CLAMP may be an exception). Freelance is the way of the creative world and it's only natural that they all go out on their own at some point."
  },
  {
   "score": 1,
   "id": "dj1yzej",
   "pid": "t1_dizl7v7",
   "date": "2017-06-17 21:30:27",
   "depth": 1,
   "text": "I still think that it's likely that Akane's going to realize that Iori was correct and try to bring in Tomoya and (maybe?) Katou.\n\nReally, we're talking about an AAA game, bringing on one or two more high-school kids part-time to deal with the talent isn't going to substantially impact the budget."
  },
  {
   "score": 2,
   "id": "dizmes5",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 09:05:31",
   "depth": 0,
   "text": "Another incredible episode, the whole scene with Eriri and Utaha was great and they are amazing. One episode left, please, please don't let it end with both girls going back to the doujin circle because of stupid reasons!!!"
  },
  {
   "score": 1,
   "id": "dj092xb",
   "pid": "t1_dizmes5",
   "date": "2017-06-16 16:25:35",
   "depth": 1,
   "text": "I don't think that'll happen. Since this is volume 7, there's still 8? volumes left to be adapted, and the amount of asspull required would destroy any meaning in the tears they shed to make this agonizing decision."
  },
  {
   "score": 2,
   "id": "diygye9",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 14:23:07",
   "depth": 0,
   "text": "I'm actually glad that Utaha and Eriri are free of Tomoya or at least I hope they are. Though it feels so backward for Tomoya and Katou to only now get around to dating.\n\nAlso I'm going to ship Utaha x Eriri, I don't care if it's probably going to sink. It was a really nice scene between them in the art room and I'd really like to see their friendship grow without Tomoya's interface."
  },
  {
   "score": 1,
   "id": "diz39ax",
   "pid": "t1_diygye9",
   "date": "2017-06-15 23:36:57",
   "depth": 1,
   "text": "> I'm actually glad that Utaha and Eriri are free of Tomoya or at least I hope they are. \n\nI hope they are but I feel like they'll weasel him in somehow..."
  },
  {
   "score": 2,
   "id": "dizmopu",
   "pid": "t1_diz39ax",
   "date": "2017-06-16 09:10:35",
   "depth": 2,
   "text": "Please no!!!"
  },
  {
   "score": 1,
   "id": "dizghdp",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 07:13:47",
   "depth": 0,
   "text": "While I am not going to defend Utaha and Eriri for their rationale for \"betraying\" Tomoya, I do find some of the sudden hating on them to be a bit over the top. (Wishing them a sadistic death? Really?)\n\nNeither do I agree with some folk's sudden disappointment at the dramatic direction this show is heading into. Sometimes I wonder if we're even watching the same show."
  },
  {
   "score": 3,
   "id": "dizo6pd",
   "pid": "t1_dizghdp",
   "date": "2017-06-16 09:37:42",
   "depth": 1,
   "text": "I know. I only hope after next episode people can be healed by our best girl, and calm down a bit. The author is intentionally making the characters flawed to make the story more interesting, so while polarizing opinions arw expected, I think a lot the hate for Utaha and Eriri's \"betrayal\" or Tomoya \"deserving it\" are quite irrational."
  },
  {
   "score": 1,
   "id": "diz3ee8",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 23:42:17",
   "depth": 0,
   "text": "So is there going to be a episode 10 or was that the season ending ?"
  },
  {
   "score": 3,
   "id": "diz8xy6",
   "pid": "t1_diz3ee8",
   "date": "2017-06-16 03:48:53",
   "depth": 1,
   "text": "There's one more episode left, the season ending airs next week. "
  },
  {
   "score": 1,
   "id": "dizla8y",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 08:44:53",
   "depth": 0,
   "text": "Idk what to think any more, at least there is one more ep. All this time I thought it had only 10eps.\n\nThat would've made for an interesting ending though"
  },
  {
   "score": 1,
   "id": "dj0joda",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 20:43:20",
   "depth": 0,
   "text": "[cant wait to see](/s \"The part on the date when Tomoya record Kato's confession with his camera\")"
  },
  {
   "score": 1,
   "id": "dj0mh9r",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 22:09:38",
   "depth": 0,
   "text": "Aww, I thought they would actually talk it out first before they decide to hover over to Akane. It remains to be seen, but I'm getting the feeling that they haven't really spoken to each other ever since they left. "
  },
  {
   "score": 1,
   "id": "dj2ohhv",
   "pid": "t3_6hflpu",
   "date": "2017-06-18 11:28:58",
   "depth": 0,
   "text": "So... has anyone actually seen Maruto Fumiako in person? MAL shows him only like this: https://myanimelist.net/people/22237/Fumiaki_Maruto"
  },
  {
   "score": 1,
   "id": "dj4o7l6",
   "pid": "t3_6hflpu",
   "date": "2017-06-19 16:44:02",
   "depth": 0,
   "text": "So dayo, sono tori dayo"
  },
  {
   "score": 1,
   "id": "diyog84",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 17:00:14",
   "depth": 0,
   "text": "Can anyone dm me the link to the episode? I cant find it online "
  },
  {
   "score": 1,
   "id": "diz67lt",
   "pid": "t1_diyog84",
   "date": "2017-06-16 01:42:48",
   "depth": 1,
   "text": "It's right there the amazon one"
  },
  {
   "score": 1,
   "id": "diyog87",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 17:00:14",
   "depth": 0,
   "text": "Can anyone dm me the link to the episode? I cant find it online "
  },
  {
   "score": 1,
   "id": "diz3wka",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 00:02:07",
   "depth": 0,
   "text": "Wow the episode should of just been added onto episode 8.\nNo point in making katou spend 2 minutes in this ova to show who won.\n\nStill weird they made this ova only 2 minutes!"
  },
  {
   "score": 1,
   "id": "dj0y0tu",
   "pid": "t3_6hflpu",
   "date": "2017-06-17 06:29:52",
   "depth": 0,
   "text": "Short haired Katou is back! I'm fine with whatever hair Katou has, but I love short-haired anime girls and was one of the reasons I liked her in the first place."
  },
  {
   "score": 1,
   "id": "diz90z1",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 03:52:19",
   "depth": 0,
   "text": "OMG, those freaking overreactions in this episode made me cringe so fucking hard I'm surprised I was able to finish the episode, honestly was really painful to watch."
  },
  {
   "score": -17,
   "id": "diyaoog",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 12:27:32",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 6,
   "id": "diyh0px",
   "pid": "t1_diyaoog",
   "date": "2017-06-15 14:24:22",
   "depth": 1,
   "text": "At least she's loyal, that's coming from a Utaha shipper "
  },
  {
   "score": 10,
   "id": "diydt52",
   "pid": "t1_diyaoog",
   "date": "2017-06-15 13:23:53",
   "depth": 1,
   "text": "And you still have shit tastes. Nothing changed there then. "
  },
  {
   "score": -15,
   "id": "diyea5i",
   "pid": "t1_diydt52",
   "date": "2017-06-15 13:32:30",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 2,
   "id": "dizfzsj",
   "pid": "t1_diyea5i",
   "date": "2017-06-16 07:03:56",
   "depth": 3,
   "text": ">Not as shit as your's for thinking Kato is worst girl\n\nRight back at you troll"
  },
  {
   "score": -2,
   "id": "dizos74",
   "pid": "t3_6hflpu",
   "date": "2017-06-16 09:48:25",
   "depth": 0,
   "text": "No point arguing guys. Saekano s2 ended at ep 8.\n\nThis is just a what if story.... and this is a WtF story... I am looking at you utaha and erirri!!!!"
  },
  {
   "score": -3,
   "id": "diyt8za",
   "pid": "t3_6hflpu",
   "date": "2017-06-15 18:53:28",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 7,
   "id": "diytjly",
   "pid": "t1_diyt8za",
   "date": "2017-06-15 19:00:49",
   "depth": 1,
   "text": "Because people are not upset about them accepting the job, the hate is on how bitchy of them to wait one month until they told Tomoya."
  }
 ]
}