{
 "score": 706,
 "id": "6bxd4w",
 "num_comments": 278,
 "date": "2017-05-18 09:39:21",
 "comments": [
  {
   "score": 328,
   "id": "dhq8qw7",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 09:56:15",
   "depth": 0,
   "text": "Katou was too real this episode. She had every right to be upset too. \n\nGod I love her"
  },
  {
   "score": -13,
   "id": "dhqmqs3",
   "pid": "t1_dhq8qw7",
   "date": "2017-05-18 14:00:01",
   "depth": 1,
   "text": "Mmm, she could be overreacting a touch.  Having her there wouldn't really have helped much more than not, I think."
  },
  {
   "score": 13,
   "id": "dhqyvg1",
   "pid": "t1_dhqmqs3",
   "date": "2017-05-18 18:15:54",
   "depth": 2,
   "text": "Let me put it this way.\n\nSome girl ask you to be a part of a project, and it was interesting so you come aboard, and when you are actually beginning to feel passionate about this, that girl ditches you and the entire project to take care of your best friend. Fun thing is you have no problem with the friend part, it's that this girl didn't even bash an eyelid to abandon a project you tirelessly worked on for better of a year.\n\nIf anything, she was dramatically underreacting. If I were kato I would beat the living shit out of everyone and delete their contact."
  },
  {
   "score": -10,
   "id": "dhqzbm8",
   "pid": "t1_dhqyvg1",
   "date": "2017-05-18 18:26:11",
   "depth": 3,
   "text": "But… that's not what happened at all.\n\nEdit:  I'd love to hear an explanation as to how what he did constitutes \"abandoning\" or anything close to it.  A missed deadline does not make abandonment, people.  Nor does scaled-back packaging."
  },
  {
   "score": 3,
   "id": "dhrawii",
   "pid": "t1_dhqzbm8",
   "date": "2017-05-18 23:56:54",
   "depth": 4,
   "text": "I'll explain why what he did is abandoning. \n\nWhat they did is not some school project that can get coupla days extension. This is winter comiket, literally the biggest convention in the world of any kind (look it up). You can still make profit after the fact, but selling 100 copies of your game in winter comiket is almost as embarrassing as exhibiting a four-year-old's drawing in the louvre.\n\nThere are lotsa more details in the industry that I cannot simply explain as a reply in a reddit thread, but I can't think of a world where a deadline is NOT important,  I'm sorry."
  },
  {
   "score": -1,
   "id": "dhrbjdm",
   "pid": "t1_dhrawii",
   "date": "2017-05-19 00:24:13",
   "depth": 5,
   "text": "I am familiar with the scale of Comiket, yes.  My point is that they hold one every six months.  Even in the worst case scenario, they just push back release to the next Summer one and call it good.  Being otaku, they are all well aware of the commonness of releases delayed due to production issues, even at a fully professional level, to say nothing of doujin work like this."
  },
  {
   "score": 2,
   "id": "dhrqdkf",
   "pid": "t1_dhrbjdm",
   "date": "2017-05-19 08:17:24",
   "depth": 6,
   "text": "Wow the downvoting is getting out of hand.\n\nYou're missing the point. Abandonment isn't the primary issue, it's a matter of *trust*. Megumi said it herself that Tomoya didn't make a wrong choice in choosing to tend to Eriri over finishing the project (and obviously it's not her place to judge him for making that call). Knowing Megumi, if Tomoya had contacted her to discuss his plans going forward she would have patted him on the back and encouraged him, as well as provide counsel and possible alternative solutions. But he didn't even after telling him directly \"let me know if anything comes up\" and trying to call him on the phone. She figured their friendship was close enough he would keep her in the loop."
  },
  {
   "score": 1,
   "id": "dhss6a7",
   "pid": "t1_dhrqdkf",
   "date": "2017-05-19 21:46:27",
   "depth": 7,
   "text": "I'm addressing the issue as stated in the comment — supposed abandonment of the project.\n\nOf course he could have involved Kato more in any case, and he does deserve some amount of calling out for that.  But to say he deserved to be beaten and ghosted for it is beyond over-the-top."
  },
  {
   "score": 9,
   "id": "dhr742x",
   "pid": "t1_dhqzbm8",
   "date": "2017-05-18 21:40:24",
   "depth": 4,
   "text": "Actually, that really is. Katou may not be the most expressive and blunt girl ever, but if real women we're ever that straightforward men would have a piece of cake maintaining relationships. She's hurt because from her POV Tomoya doesn't consider their friendship to be close enough that he would keep her in the loop for something as monumental as altering the end result of their project. It may not be evident from Megumi's demeanor but she genuinely likes these guys, quirky as they may be, and has had a lot of fun making this game. Katou put in the extra effort to set aside her plans for the weekend in case something happened (and it did) and worried deeply about Eriri's well-being last episode. People who are just working on a project in their spare time do not do these sort of things. Not to mention Megumi has put so much effort into the game, helping the him and the other girls anyway she can. \n\nNow you can argue that her reaction may be a little too much for a misunderstanding and inconsideration on the part of our LN Protag-kun but Megumi's whole characterization is based around \"real\" personalities. I've experienced first hand that women, especially one you're close to, can hold a grudge when they feel betrayed, not just get angry, brush off a slight, and make up like a tsundere haremette."
  },
  {
   "score": 37,
   "id": "dhqoken",
   "pid": "t1_dhqmqs3",
   "date": "2017-05-18 14:34:25",
   "depth": 2,
   "text": "It's not what she is upset about though. The matter is not about her going there or not. She could have stayed in Tokyo and helped with coordinating production in Tomoya's place. She could even accept an executive decision from the director to abandon the deadline for the sake of Eriri's health, as long as she is BRIEFED or CONSULTED like a respected partner. To be completely kept in the dark and literally treated like a background character when for months she was 100% dedicated to the project is what's really getting to her."
  },
  {
   "score": -9,
   "id": "dhqr1di",
   "pid": "t1_dhqoken",
   "date": "2017-05-18 15:23:34",
   "depth": 3,
   "text": "I think that's less down to his thoughts about her (or lack thereof) than it is to his control-freak nature on this project — if every little thing is not done just to his liking, it's shit, therefore he has to be the one driving everything.  Dude needs to learn some delegation"
  },
  {
   "score": 34,
   "id": "dhqiim2",
   "pid": "t1_dhq8qw7",
   "date": "2017-05-18 12:46:57",
   "depth": 1,
   "text": "Katou has overtaken the place for best girl in my heart! Sorry Utaha... "
  },
  {
   "score": 1,
   "id": "dhssv0w",
   "pid": "t1_dhqiim2",
   "date": "2017-05-19 22:08:41",
   "depth": 2,
   "text": "I had them neck and neck for season 1. Gave Utaha the title this season but This episode just reminds me why I also love Kato so much....such a tough choice."
  },
  {
   "score": 3,
   "id": "dhszgm7",
   "pid": "t1_dhssv0w",
   "date": "2017-05-20 03:11:44",
   "depth": 3,
   "text": "Katou won me over in Season 1 but there is a Manga which focuses on Utaha as main heroine (Which is glorious btw) and that but then neck to neck but think season 2 has sold me on katou as overall best girl."
  },
  {
   "score": 1,
   "id": "dhtdl5q",
   "pid": "t1_dhszgm7",
   "date": "2017-05-20 10:27:48",
   "depth": 4,
   "text": "Woooah, there's a Utaha manga? Link or name please.\n\nAnd yea, I've been thinking that Katou is probably best girl but I just prefer Utaha on a more personal level."
  },
  {
   "score": 3,
   "id": "dhtfxbz",
   "pid": "t1_dhtdl5q",
   "date": "2017-05-20 11:23:10",
   "depth": 5,
   "text": "It's called \"Saenai Kanojo (Heroine) no Sodatekata - Koisuru Metronome\" and iirc its a completely original/separate story from the main one, which means no spoilers about the original plot. Enjoy!\n\nEdit: I believe Eri has her own manga as well but iirc it does roughly have the same plot at the main one. "
  },
  {
   "score": 10,
   "id": "dhtdrg5",
   "pid": "t1_dhqiim2",
   "date": "2017-05-20 10:31:55",
   "depth": 2,
   "text": "For me Utaha is still best girl but Katou might be best character. I don't think those two have to go together. Often best character doesn't even have to be someone I like (not say that in this case though, Katou is pretty likable) "
  },
  {
   "score": 6,
   "id": "dhtfyo8",
   "pid": "t1_dhtdrg5",
   "date": "2017-05-20 11:24:04",
   "depth": 3,
   "text": "This is actually a really good reply, I hadn't thought about it like that before!\n\nEdit: Not being sarcastic. "
  },
  {
   "score": 93,
   "id": "dhql888",
   "pid": "t1_dhqiim2",
   "date": "2017-05-18 13:33:19",
   "depth": 2,
   "text": "I'm glad you finally found the light bro"
  },
  {
   "score": 40,
   "id": "dhqrbg7",
   "pid": "t1_dhq8qw7",
   "date": "2017-05-18 15:29:16",
   "depth": 1,
   "text": "> God I hate Tomoya"
  },
  {
   "score": 60,
   "id": "dhqbxyk",
   "pid": "t1_dhq8qw7",
   "date": "2017-05-18 10:53:07",
   "depth": 1,
   "text": "Recall her running commentary on dating sims when she first tried it at Aki's place in S1 - the \"3D\" emotional complexities she demonstrated already foreshadowed the difficulty level of her \"route\"."
  },
  {
   "score": 163,
   "id": "dhqdgra",
   "pid": "t1_dhq8qw7",
   "date": "2017-05-18 11:19:18",
   "depth": 1,
   "text": "She doesn't have an exagerrated attitude. She thinks rationally yet remains unpredictable. That's what makes her the hardest to completely win over. It's part of her own charm.\n\n[](#wow)\n"
  },
  {
   "score": 259,
   "id": "dhq8m19",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 09:53:58",
   "depth": 0,
   "text": "I defeated Izumi. I defeated Michiru. I defeated Utaha.\n\nWait...one name's still missing..."
  },
  {
   "score": 16,
   "id": "dhq8t5k",
   "pid": "t1_dhq8m19",
   "date": "2017-05-18 09:57:21",
   "depth": 1,
   "text": "Some lies are too big to joke about them."
  },
  {
   "score": 7,
   "id": "dhqx253",
   "pid": "t1_dhq8m19",
   "date": "2017-05-18 17:34:39",
   "depth": 1,
   "text": "We need torpedos for the incoming stealth submarine! Oh wait, ss eriri is flat on all sides! Torpedos are no-go!"
  },
  {
   "score": 198,
   "id": "dhq8z99",
   "pid": "t1_dhq8m19",
   "date": "2017-05-18 10:00:20",
   "depth": 1,
   "text": "SS Eriri's radar is only scanning surface vessels..."
  },
  {
   "score": 129,
   "id": "dhq957p",
   "pid": "t1_dhq8z99",
   "date": "2017-05-18 10:03:17",
   "depth": 2,
   "text": "She can't detect the approaching of Megumi-class Fast attack nuclear submarine... "
  },
  {
   "score": 44,
   "id": "dhq9bo5",
   "pid": "t1_dhq957p",
   "date": "2017-05-18 10:06:30",
   "depth": 3,
   "text": "Nah, she's sunk already. She's well aware of that.\nHer defeating others are just for consolation."
  },
  {
   "score": 51,
   "id": "dhq9qmq",
   "pid": "t1_dhq9bo5",
   "date": "2017-05-18 10:13:51",
   "depth": 4,
   "text": "Not necessarily at this point.  Barring Megumi returning for the second half, Eriri is basically leading 3:0 at half time. Champagnes are popped in the locker room.\n\nAlthough we all know how that turned out in Istanbul..."
  },
  {
   "score": 6,
   "id": "dhqjex2",
   "pid": "t1_dhq9qmq",
   "date": "2017-05-18 13:02:20",
   "depth": 5,
   "text": "I see Eriri is pulling a similar strategy to the Atlanta Falcons"
  },
  {
   "score": 3,
   "id": "dhqzviy",
   "pid": "t1_dhqjex2",
   "date": "2017-05-18 18:38:58",
   "depth": 6,
   "text": "Hey, Eriri, do you want to win the Aki Bowl ring? \n\nNah, I'll pass."
  },
  {
   "score": 6,
   "id": "dhr5taf",
   "pid": "t1_dhqjex2",
   "date": "2017-05-18 21:02:05",
   "depth": 6,
   "text": "Golden State 2016"
  },
  {
   "score": 21,
   "id": "dhqb4br",
   "pid": "t1_dhq9qmq",
   "date": "2017-05-18 10:38:29",
   "depth": 5,
   "text": "> Although we all know how that turned out in Istanbul\n\nNever thought we would see Liverpool's Champions league final reference here."
  },
  {
   "score": 6,
   "id": "dhrsv1e",
   "pid": "t1_dhqb4br",
   "date": "2017-05-19 09:03:05",
   "depth": 6,
   "text": "Just goes to show, we are one, we are weebs, and we are otakus. Expect us. Fear us."
  },
  {
   "score": 4,
   "id": "dhrt10w",
   "pid": "t1_dhrsv1e",
   "date": "2017-05-19 09:06:10",
   "depth": 7,
   "text": "And drop points to Middlesbrough."
  },
  {
   "score": 37,
   "id": "dhqda0b",
   "pid": "t1_dhq9qmq",
   "date": "2017-05-18 11:15:58",
   "depth": 5,
   "text": "The Kato train does not care about leads or such trivial matters. It just hits. The impact is gonna be hard yet sudden. It's gonna happen when you least expect it. Clech your waifu pillow, because this won't be pretty.\n\n[](#evilgrin)"
  },
  {
   "score": 196,
   "id": "dhq9ak2",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:05:57",
   "depth": 0,
   "text": "[**YOU FUCKED UP TOMOYA.**](http://i.imgur.com/JcF54SY.png)\n\n[Watching Katou walk away while dragging her luggage](http://i.imgur.com/tqUeFO5.png) was like watching someone's wife getting tired of her husband's shit. Which I think is the perfect way to describe what just happened tbh. Katou gave her all for this project and made it clear to Aki that if anything happens he can always lean on her but our boy felt like he needed to carry everything on his shoulders that he forgot about all of those times Katou offered herself for him and him only.\n\nI feel like patching things up with Katou won't be as easy as with the other girls. Also that Akane looks like she's bad news. "
  },
  {
   "score": 7,
   "id": "dhraed4",
   "pid": "t1_dhq9ak2",
   "date": "2017-05-18 23:35:45",
   "depth": 1,
   "text": "Tomoya does NOT deserve Katou.\n\nI feel like watching a faithful wife who I used to have crush on high school repeatedly get cheated on in some ways while she keeps giving him second chances."
  },
  {
   "score": 13,
   "id": "dhr5sis",
   "pid": "t1_dhq9ak2",
   "date": "2017-05-18 21:01:28",
   "depth": 1,
   "text": "More than him carrying everything on his back, Rival-Kun was right on the money. Aki wanted to spend the time with Eri more than the game, which is why he decided to not tell anyone, specially Kato. \n\nBasically I think it parallels him been a cheating bastard."
  },
  {
   "score": 19,
   "id": "dhqa9tb",
   "pid": "t1_dhq9ak2",
   "date": "2017-05-18 10:23:18",
   "depth": 1,
   "text": "Patching things up with a border-lining 3D girlfriend can be messy..."
  },
  {
   "score": 80,
   "id": "dhqayo0",
   "pid": "t1_dhq9ak2",
   "date": "2017-05-18 10:35:35",
   "depth": 1,
   "text": "My 3D girlfriend and I had this exact same argument a couple days ago. Being an anime only fan I had no idea this was coming and hearing Katou say those words was painful to say the least. "
  },
  {
   "score": 6,
   "id": "dhs5xpv",
   "pid": "t1_dhqayo0",
   "date": "2017-05-19 13:06:20",
   "depth": 2,
   "text": "lol the worst thing to share about yourself in this sub"
  },
  {
   "score": 7,
   "id": "dhqy049",
   "pid": "t1_dhqayo0",
   "date": "2017-05-18 17:55:45",
   "depth": 2,
   "text": "Good luck dude, I hope you're able to patch it up."
  },
  {
   "score": 18,
   "id": "dhqtb1d",
   "pid": "t1_dhqayo0",
   "date": "2017-05-18 16:11:11",
   "depth": 2,
   "text": "[REEEE](https://www.youtube.com/watch?v=DzGbCDNhZFc)"
  },
  {
   "score": 28,
   "id": "dhqtmwc",
   "pid": "t1_dhqayo0",
   "date": "2017-05-18 16:18:25",
   "depth": 2,
   "text": "REEEEEÈEEEEEEEEEEEE\n\nGET OUT NORMIE!"
  },
  {
   "score": 35,
   "id": "dhqgs2k",
   "pid": "t1_dhqayo0",
   "date": "2017-05-18 12:16:53",
   "depth": 2,
   "text": "Must have been upset because you are a normie."
  },
  {
   "score": 13,
   "id": "dhqmxqu",
   "pid": "t1_dhqgs2k",
   "date": "2017-05-18 14:03:35",
   "depth": 3,
   "text": "Must of been because you didn't say \"must *have*\""
  },
  {
   "score": 40,
   "id": "dhqzdsx",
   "pid": "t1_dhqayo0",
   "date": "2017-05-18 18:27:33",
   "depth": 2,
   "text": ">3d girlfriend\n\nAre we talking about oculus or the 3ds?"
  },
  {
   "score": 26,
   "id": "dhr02we",
   "pid": "t1_dhqzdsx",
   "date": "2017-05-18 18:43:41",
   "depth": 3,
   "text": "Probably a figure"
  },
  {
   "score": 105,
   "id": "dhqk0s5",
   "pid": "t1_dhqayo0",
   "date": "2017-05-18 13:12:45",
   "depth": 2,
   "text": ">3D girlfriend\n\nREEEEEEE!"
  },
  {
   "score": 11,
   "id": "dhra32f",
   "pid": "t1_dhqk0s5",
   "date": "2017-05-18 23:23:12",
   "depth": 3,
   "text": "Came here expecting this reply, not disappointed"
  },
  {
   "score": 61,
   "id": "dhqz8sc",
   "pid": "t1_dhqayo0",
   "date": "2017-05-18 18:24:21",
   "depth": 2,
   "text": ">3D girlfriend\n\n[mfw](https://streamable.com/bt978)"
  },
  {
   "score": 224,
   "id": "dhqdoxo",
   "pid": "t1_dhqayo0",
   "date": "2017-05-18 11:23:13",
   "depth": 2,
   "text": ">*3D girlfriend*\n\n[](#badtaste)"
  },
  {
   "score": 157,
   "id": "dhqd18n",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:11:50",
   "depth": 0,
   "text": "- **Katou is scary when she is angry.** She doesn't blow up melodramatically or anything, but she just give you that calm but disappointed and hurt look, just like how a real girl would do. And that's far more damaging than any outbursts and tantrums from Utaha, Eriri and Michiru combined. Tomoya brought this upon himself, when Katou gave everything for him, and he took her for granted.\n\n- The way Katou gave an annoyed sighed when Tomoya still didn't get why she was pissed off really sends shivers down the spine: That's when your girlfrend is about to really rip you apart, whereas before she was merely rattling her tail like a snake warning you to stay away from her. Thumbs up to her VA Yasuno Kiyono for making this real.\n\n- Iori's driver Enaka is none other than Kousaka Akane, the founder and lead illustrator for Iori's group \"rouge en rouge\". (Voiced by Nabatame Hitomi, VA for Kazusa in White Album 2)\n\n- If you all remember, back in season 1, Iori said \"rouge en rouge\" had planned to recruit Eriri into their group. This was most likely Akane's idea.\n\n- Upon seeing Eriri's art first hand, Akane couldn't resist an \"evil grin\" as it reaffirms her interest in Eriri's talent. Like the scout of a major sports team doing anything to get their hands on the star of a budding mid-sized team."
  },
  {
   "score": 2,
   "id": "dhrc0zo",
   "pid": "t1_dhqd18n",
   "date": "2017-05-19 00:46:44",
   "depth": 1,
   "text": "lmao real girl would do. Did you already experience relationships or you a girl or something? "
  },
  {
   "score": 6,
   "id": "dhrc3sa",
   "pid": "t1_dhrc0zo",
   "date": "2017-05-19 00:50:23",
   "depth": 2,
   "text": "Well, even if I don't, that's what I see my mom does whenever my dad's being an asshole."
  },
  {
   "score": 0,
   "id": "dhrcqcr",
   "pid": "t1_dhrc3sa",
   "date": "2017-05-19 01:20:56",
   "depth": 3,
   "text": "You got a nice mom then :) majority of girls can't control there emotions. Girls are more emotional than guys. "
  },
  {
   "score": 1,
   "id": "dhrjzue",
   "pid": "t1_dhrcqcr",
   "date": "2017-05-19 06:05:58",
   "depth": 4,
   "text": "on their period?"
  },
  {
   "score": 2,
   "id": "dhrlo2q",
   "pid": "t1_dhrjzue",
   "date": "2017-05-19 06:43:58",
   "depth": 5,
   "text": "all the time, but especially on their period"
  },
  {
   "score": 8,
   "id": "dhrcxkg",
   "pid": "t1_dhqd18n",
   "date": "2017-05-19 01:30:39",
   "depth": 1,
   "text": "I thought Enaka was sabotaging and I was really confused but thanks your explanation really cleared things up."
  },
  {
   "score": 20,
   "id": "dhqn477",
   "pid": "t1_dhqd18n",
   "date": "2017-05-18 14:06:52",
   "depth": 1,
   "text": "> he took her for granted.\n\nIt's the opposite — he didn't take her at all.\n\n>rogue \n\nRouge?"
  },
  {
   "score": 0,
   "id": "dhqzipt",
   "pid": "t1_dhqn477",
   "date": "2017-05-18 18:30:44",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 4,
   "id": "dhr31jz",
   "pid": "t1_dhqzipt",
   "date": "2017-05-18 19:52:09",
   "depth": 3,
   "text": "Examine those two words closely.  Rogue.  Rouge.  They're different."
  },
  {
   "score": 3,
   "id": "dhr4hxn",
   "pid": "t1_dhr31jz",
   "date": "2017-05-18 20:27:17",
   "depth": 4,
   "text": "Error noted.\n\nThis is what happens when attempting to reply to something while not having without sleep."
  },
  {
   "score": 4,
   "id": "dhqxdfy",
   "pid": "t1_dhqn477",
   "date": "2017-05-18 17:41:42",
   "depth": 2,
   "text": "Thats the rival dojin team. Its french for 'Red in Red'"
  },
  {
   "score": 11,
   "id": "dhsvkx5",
   "pid": "t1_dhqd18n",
   "date": "2017-05-19 23:53:01",
   "depth": 1,
   "text": "Enaka=akanE\n\n*Flips table"
  },
  {
   "score": 32,
   "id": "dhqyzzx",
   "pid": "t1_dhqd18n",
   "date": "2017-05-18 18:18:49",
   "depth": 1,
   "text": "I seriously hated Tomoya this episode. Even though I understand why he did everything that he did, it still goes to show he doesn't give two f's about Katou's feelings. Moterfucker got the best girl of an era in the most undeserving coupling of a generation."
  },
  {
   "score": 35,
   "id": "dhqj9cv",
   "pid": "t1_dhqd18n",
   "date": "2017-05-18 12:59:43",
   "depth": 1,
   "text": ">  just like how a real girl would do.\n\nI didn't experience that until after I got married, Girls tended to be explosive when they were pissed "
  },
  {
   "score": 27,
   "id": "dhr0hsd",
   "pid": "t1_dhqj9cv",
   "date": "2017-05-18 18:53:04",
   "depth": 2,
   "text": "Well, Tomoya and Katou are like a married couple at this point."
  },
  {
   "score": 72,
   "id": "dhqe6js",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:31:45",
   "depth": 0,
   "text": "Whole episode mostly dedicated to Eriri, but Katou just steals my whole attention. I am glad she didn't just walk away with \"it's nothing\" or burst into tears & emotions. Just a cold explanation why she is hurt and it felt so real. \n\nI think many can relate to this situation because it is usually like this in some friendships and relationships. It happens so suddenly when you don't expect it, when you don't think you've done anything wrong. That's why the last scene really gripped my heart, [Katou was scary.](http://i.imgur.com/nBCf0i4.png)"
  },
  {
   "score": 158,
   "id": "dhq8ryq",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 09:56:47",
   "depth": 0,
   "text": "Good to see White Album 3 finally aired."
  },
  {
   "score": 1,
   "id": "dhs096n",
   "pid": "t1_dhq8ryq",
   "date": "2017-05-19 11:19:52",
   "depth": 1,
   "text": "***The amount of White Album 2 vibes I'm getting from this season is too damn high!***\n\nSorry about dragging up that old meme, but this season... man! I'm starting to get traumatic flashbacks to 2013. And yet, there's isn't even a triangle in this show!\n\nIf Michiru pulls out a saxophone in one of the coming episodes, I'm going to have PTSD, big time."
  },
  {
   "score": 3,
   "id": "dhqdihk",
   "pid": "t1_dhq8ryq",
   "date": "2017-05-18 11:20:09",
   "depth": 1,
   "text": "I thought that was Scum's Wish?"
  },
  {
   "score": 5,
   "id": "dhs0lra",
   "pid": "t1_dhqdihk",
   "date": "2017-05-19 11:26:17",
   "depth": 2,
   "text": "I'm not sure if you're making a joke, but in case you're not: WA2 and Kuzu no Honkai are pretty much fundamentally different. The protagonist of WA2 wasn't out to hurt anyone, he was just a good guy who tried to please everyone around him but got caught in a really bad spot. KnH is about a bunch of people looking to either use others as surrogates for their unreachable love or looking to screw over others out of spite, revenge or excitement."
  },
  {
   "score": 10,
   "id": "dhs0t4e",
   "pid": "t1_dhs0lra",
   "date": "2017-05-19 11:30:05",
   "depth": 3,
   "text": "> The protagonist of WA2 wasn't out to hurt anyone, he was just a good guy who tried to please everyone around him but got caught in a really bad spot.\n\nThe really bad spot being [WA2](/s \"inside his friend's vagina while he was blowing off his girlfriend's birthday party\")?\n\nYou could say the same about the School Day's MC, couldn't you?"
  },
  {
   "score": 1,
   "id": "dhsutfx",
   "pid": "t1_dhs0t4e",
   "date": "2017-05-19 23:21:10",
   "depth": 4,
   "text": "No,  I think there's a clear difference between the MC's. In WA2, he's genuinely in pain over trying to choose between the two girls, whereas the MC in School Days is weak and just let's people walk all over him (and even says so himself)."
  },
  {
   "score": 6,
   "id": "dhsxbmt",
   "pid": "t1_dhsutfx",
   "date": "2017-05-20 01:15:27",
   "depth": 5,
   "text": "I don't remember him being in that much pain.  [WA2](/s \"He accepted the first girl that confessed to him, then when he realized he had stronger feelings for the other girl he went and fucked her on his girlfriend's birthday.\")"
  },
  {
   "score": 2,
   "id": "dht157f",
   "pid": "t1_dhsxbmt",
   "date": "2017-05-20 04:38:31",
   "depth": 6,
   "text": "Remember the Christmas episode? He was pretty much in physical pain over his situation."
  },
  {
   "score": 5,
   "id": "dhtft6c",
   "pid": "t1_dht157f",
   "date": "2017-05-20 11:20:23",
   "depth": 7,
   "text": "School Days MC was in physical pain at the end as well."
  },
  {
   "score": 3,
   "id": "dhtitr9",
   "pid": "t1_dhtft6c",
   "date": "2017-05-20 12:33:18",
   "depth": 8,
   "text": "Can't argue with that :)"
  },
  {
   "score": 2,
   "id": "dhs2uy5",
   "pid": "t1_dhs0t4e",
   "date": "2017-05-19 12:08:49",
   "depth": 4,
   "text": "Thankfully Setsuna has no yandere tendency."
  },
  {
   "score": 36,
   "id": "dhqdpoy",
   "pid": "t1_dhqdihk",
   "date": "2017-05-18 11:23:34",
   "depth": 2,
   "text": "If Ethical-kun couldn't resist Utaha's sexual advances in episode 4 (widely criticized by many viewers btw), it would have gone down that route."
  },
  {
   "score": 15,
   "id": "dhqb74r",
   "pid": "t1_dhq8ryq",
   "date": "2017-05-18 10:39:50",
   "depth": 1,
   "text": "It's a Maruto Fumiaki's work after all.  "
  },
  {
   "score": 15,
   "id": "dhq92vr",
   "pid": "t1_dhq8ryq",
   "date": "2017-05-18 10:02:07",
   "depth": 1,
   "text": "Did you notice a special cameo this episode?  It should be a familiar voice :)"
  },
  {
   "score": 8,
   "id": "dhqjog1",
   "pid": "t1_dhq92vr",
   "date": "2017-05-18 13:06:51",
   "depth": 2,
   "text": "Wait, what was it???\n\nEdit: nvm, I found it in the thread."
  },
  {
   "score": 8,
   "id": "dhrhyv0",
   "pid": "t1_dhq8ryq",
   "date": "2017-05-19 05:09:36",
   "depth": 1,
   "text": "Just realized it's written by the same guy.\n\nFuuuuuck"
  },
  {
   "score": 97,
   "id": "dhq9akm",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:05:58",
   "depth": 0,
   "text": "LN readers weren't joking when they said the drama will start after the winter comiket...\n\nit is really an achievement when you are able to deeply disappoint the usually very tolerant and forgiving Katou \n\n"
  },
  {
   "score": 29,
   "id": "dhqbnoe",
   "pid": "t1_dhq9akm",
   "date": "2017-05-18 10:48:01",
   "depth": 1,
   "text": "Well. We LN reader are already prepared for intensive drama that gonna happen next. \n\nSaekano is just a 4/10 White Album 2 drama level"
  },
  {
   "score": 4,
   "id": "dhqx4vr",
   "pid": "t1_dhqbnoe",
   "date": "2017-05-18 17:36:18",
   "depth": 2,
   "text": "\n\nWhat's the connection between Saekano and White Album 2? I keep seeing people here compare the two "
  },
  {
   "score": 2,
   "id": "dhr325g",
   "pid": "t1_dhqx4vr",
   "date": "2017-05-18 19:52:31",
   "depth": 3,
   "text": "Same author (Maruto Fumiaki) and dem Plot Twist..."
  },
  {
   "score": 8,
   "id": "dhqxbgs",
   "pid": "t1_dhqx4vr",
   "date": "2017-05-18 17:40:28",
   "depth": 3,
   "text": "Nothing. Except same author :S"
  },
  {
   "score": 9,
   "id": "dhqdrgv",
   "pid": "t1_dhqbnoe",
   "date": "2017-05-18 11:24:27",
   "depth": 2,
   "text": "So how are you an LN reader? I've tried finding translations of Saenai but I couldn't find them anywhere. And I really want to know what happens next in this show."
  },
  {
   "score": 1,
   "id": "dhr1kjr",
   "pid": "t1_dhqdrgv",
   "date": "2017-05-18 19:18:15",
   "depth": 3,
   "text": "It's available in my country (Thailand) although it's release is pretty slow now Publisher just release Vol.5 on April. So either I read summaries or go full Japanese and buy it from Amazon.co.jp"
  },
  {
   "score": 28,
   "id": "dhqeegu",
   "pid": "t1_dhqdrgv",
   "date": "2017-05-18 11:35:37",
   "depth": 3,
   "text": "You either have to be Japanese or know how to read kanji because there are no translations for the LNS. Just summaries."
  },
  {
   "score": 10,
   "id": "dhqeved",
   "pid": "t1_dhqeegu",
   "date": "2017-05-18 11:43:44",
   "depth": 4,
   "text": "One more reason to start learning Japanese again I guess... Such a shame."
  },
  {
   "score": 1,
   "id": "dhqwqpq",
   "pid": "t1_dhqeved",
   "date": "2017-05-18 17:27:32",
   "depth": 5,
   "text": "Learn Japanese so you can have the best grill app. "
  },
  {
   "score": 16,
   "id": "dhqfv0u",
   "pid": "t1_dhqeved",
   "date": "2017-05-18 12:00:54",
   "depth": 5,
   "text": "Alternative is to learn Chinese, since most Japanese to Chinese novel/anime/game translations gets done quite timely and accurately.  Probably an even harder language to learn for English speakers though..."
  },
  {
   "score": 1,
   "id": "dhr0s9q",
   "pid": "t1_dhqfv0u",
   "date": "2017-05-18 18:59:44",
   "depth": 6,
   "text": "i can read chinese, kind of.\n\ni cannot understand the LNs."
  },
  {
   "score": 6,
   "id": "dhqqaoi",
   "pid": "t1_dhqfv0u",
   "date": "2017-05-18 15:08:29",
   "depth": 6,
   "text": "Gonna have to object on that. Chinese is waaay simpler.\n1) One script (Not bloody 3)\n2) SVO order\n3) 99.9% characters have only one pronunciation \n4) Relatively less of a high-context language than Japanese\n\nTrust me as someone who has a moderate degree of proficiency in both."
  },
  {
   "score": 10,
   "id": "dhqr2q0",
   "pid": "t1_dhqqaoi",
   "date": "2017-05-18 15:24:21",
   "depth": 7,
   "text": "Hmm, learning to listen and speak oral Chinese may arguably be easier than Japanese, due to similar sentence syntax / grammar to English and relatively simple pronunciations, but reading a novel is completely different... the sheer amount character memorization is mind-boggling for non-native beginners.  At least with Japanese text one can try to read it out aloud and make sense of it (2 out of 3 scripts in Japanese are essentially alphabets?  Kanji is like Hanzi but used much less frequently)."
  },
  {
   "score": 3,
   "id": "dhraepx",
   "pid": "t1_dhqr2q0",
   "date": "2017-05-18 23:36:06",
   "depth": 8,
   "text": "Agree, reading novels in Chinese can be a challenge even to a native speaker, due to those ancient words that you won't come across with normally."
  },
  {
   "score": 7,
   "id": "dhqrt8q",
   "pid": "t1_dhqr2q0",
   "date": "2017-05-18 15:39:35",
   "depth": 8,
   "text": "Personally, I've found memorizing Hanzi much easier because compound words and deriving meanings from radicals makes far more sense than Kanji. Having an alphabet is nice and all but possessing ~100 mora is incredibly annoying. Makes Cyrillic look like a piece of cake.\n\nAdmittedly, reading sci-fi/fantasy LNs in Chinese is pretty awful though. So many advanced and technical characters I had to look up that kana can easily navigate around.\n\nPersonally, I think Hangul wins because they took the best of both worlds."
  },
  {
   "score": 3,
   "id": "dhs0zew",
   "pid": "t1_dhqrt8q",
   "date": "2017-05-19 11:33:24",
   "depth": 9,
   "text": "Chinese learner here and I agree, on the Hangul as well :)\n\nSay what you want about memorizing Chinese characters, but the kind of grammar you find in manga translated from Japanese feels fairly straight-forward to me."
  },
  {
   "score": 5,
   "id": "dhqg1r5",
   "pid": "t1_dhqfv0u",
   "date": "2017-05-18 12:04:14",
   "depth": 6,
   "text": "Oh I'm actually interested in learning Japanese though."
  },
  {
   "score": 25,
   "id": "dhqghp0",
   "pid": "t1_dhqfv0u",
   "date": "2017-05-18 12:11:58",
   "depth": 6,
   "text": "Learning to read Chinese is even harder than Japanese."
  },
  {
   "score": 4,
   "id": "dhs17ks",
   "pid": "t1_dhqghp0",
   "date": "2017-05-19 11:37:43",
   "depth": 7,
   "text": "Chinese learner here: both languages have their respective easy parts and hard parts. Chinese pronunciation rules and grammar seem (to me) easier than the Japanese equivalents, while Japanese trades some of the difficulty of learning large amounts of Chinese characters with the relative ease of learning a smaller number of phonetic characters."
  },
  {
   "score": 6,
   "id": "dhrd2hy",
   "pid": "t1_dhqghp0",
   "date": "2017-05-19 01:37:27",
   "depth": 7,
   "text": "On the bright side, Chinese is more widely spoken than Japanese. "
  },
  {
   "score": 48,
   "id": "dhq8sv0",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 09:57:13",
   "depth": 0,
   "text": "So the game they distributed at the winter comiket wasn't the full one? In any case their fully selling out in 30 minutes was pretty amazing, and the mysterious hat lady (who I'm guessing is Rouge en Rouge's famous author?) taking a copy makes me pretty hopeful we're going to get some more Eriri episodes quite soon (the show's title did say this season would be centered around her, after all).\n\n Not sure why the woman who drove Aki and Iori had an evil smile on her face as they were carrying Eriri out, and judging by Iori's expression neither did he. \n\nOnce again Aki is called out for his actions, and this time Katou seems really upset about it. This is the first time we've seen such emotion from her, and it's going to be pretty interesting to see how Aki deals with it, since both Eriri and Utaha have relatively straightforward (to the audience at least) flags, but Katou getting mad? Nope. "
  },
  {
   "score": 11,
   "id": "dhqnacg",
   "pid": "t1_dhq8sv0",
   "date": "2017-05-18 14:10:04",
   "depth": 1,
   "text": "> more Eriri episodes quite soon (the show's title did say this season would be centered around her, after all).\n\nI see what you did there."
  },
  {
   "score": 29,
   "id": "dhqdtk9",
   "pid": "t1_dhq8sv0",
   "date": "2017-05-18 11:25:28",
   "depth": 1,
   "text": "Regarding Akane's \"evil smile\": Last season Iori revealed that rogue en rogue had plans to recruit Eriri, but Aki got his hands to her for this Winter Comiket. \n\nAfter seeing Eriri's work and talent first hand, it has just reaffirmed Akane's determination to snatch Eriri from Blessing Software in time for the next Summer Comiket.\n\nIt's like the Red Sox or Yankees having sights on your star player, but quietly saying nothing while waiting for the current season to finish and observing his talent shine, so that they may snatch him up with a lucrative offer he can't refuse."
  },
  {
   "score": 46,
   "id": "dhqb7zm",
   "pid": "t1_dhq8sv0",
   "date": "2017-05-18 10:40:15",
   "depth": 1,
   "text": "Thought the mysterious hat lady was gonna either steal or destroy one of the falling art after she gave that smile. Glad that didn't happen."
  },
  {
   "score": 23,
   "id": "dhqmnzo",
   "pid": "t1_dhqb7zm",
   "date": "2017-05-18 13:58:35",
   "depth": 2,
   "text": "There is no point of destroy those art if you can steal the artist your self, she sure as fuck want Eriri on her team."
  },
  {
   "score": 79,
   "id": "dhq9v23",
   "pid": "t1_dhq8sv0",
   "date": "2017-05-18 10:16:04",
   "depth": 1,
   "text": "It was the full game, but due to missing the deadline for batch production, they had to burn CDs themselves, thus only making a 100 copies with no packaging materials whatsoever.  They originally aimed for over 1000 copies with professional packaging."
  },
  {
   "score": 6,
   "id": "dhs0pb2",
   "pid": "t1_dhq9v23",
   "date": "2017-05-19 11:28:07",
   "depth": 2,
   "text": "Honest question: is digital distribution somehow banned in Japan? Is it illegal? Considered immoral? Or are bandwidth speeds so low and costs so high that no one would ever think to sell a VN/gal-game online?"
  },
  {
   "score": 7,
   "id": "dhsk05h",
   "pid": "t1_dhs0pb2",
   "date": "2017-05-19 18:20:29",
   "depth": 3,
   "text": "Comket is a two-way street.\n\n\nFans show up in person to support their creator by purchasing physical goods directly (hence all profit goes to creators, instead of middlemen).\n\n\nCreators show up with \"event-only\" items to tease and thank the fans for their support.\n\n\nAlso, most doujin are pretty much violation of copy-righted material.  So if they are sold at events only, the IP owners won't mind as much.  If doujin are sold commercially online 24/7, the IP owners will likely take legal action."
  },
  {
   "score": 15,
   "id": "dhs1scd",
   "pid": "t1_dhs0pb2",
   "date": "2017-05-19 11:48:40",
   "depth": 3,
   "text": "As far as I know people do release doujin games online and in physical stores.  I think blessing soft aiming to release the full game on time during the winter comiket was primarily about generating buzz. For a new doujin circle, even one stacked with talent like theirs, it's difficult to generate the same level of excitement and word-of-mouth rep if solely released on a web platform. The winter comiket is also full of industry heavyweighs, so it's probably easier to find potential sponsors and future collaborators.  In the LN, their initial 100 copies generated significant buzz online for weeks, 1000 copies were sold out the first day it landed on store shelves, leading to 5k additional order."
  },
  {
   "score": 33,
   "id": "dhqttxs",
   "pid": "t1_dhq9v23",
   "date": "2017-05-18 16:22:41",
   "depth": 2,
   "text": "Which will happen eventually. Hell, those original 100 will probably become collector's items especially given the trajectory of Eriri's and Utaha's careers and the buzz over the game."
  },
  {
   "score": 45,
   "id": "dhqjbor",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 13:00:47",
   "depth": 0,
   "text": "\"Saekano - Flat\"\n\naka \"Saekano - Tomoya offends his friends\""
  },
  {
   "score": 41,
   "id": "dhqc7ys",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:58:01",
   "depth": 0,
   "text": "Just from [this](http://imgur.com/boq5alb) scene i never clinched my butt so hard and i just got a chill in my spine that i didn't manage to shake off even in the \"uplifting, understanding\" scenes.\n\n[](#keikaku)\n\nAlso, the voice acting is so good that a slight change in tone delivers an entirely different expression. expressionless girls sure are scary\n\n[](#terror)\n\nEdit: maybe this is what happens when you don't realize why everyone is putting up with your selfish actions until it is too late."
  },
  {
   "score": 3,
   "id": "dhr66ut",
   "pid": "t1_dhqc7ys",
   "date": "2017-05-18 21:12:49",
   "depth": 1,
   "text": "Dandere girls tend to be best girls, but Megumi is just on a whole other level."
  },
  {
   "score": 38,
   "id": "dhqe7sr",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:32:22",
   "depth": 0,
   "text": "Though I'm a Katou shipper with Utaha being a close second, I gotta admit that Eriri was really adorable in this episode. [Those cute little fangs!](http://i.imgur.com/mugFRhQ.jpg) [I guess that's one of her defining features.](http://cdn.awwni.me/qce2.jpg) \n\n[](#flattered)\n\nThis defeat will hopefully teach Tomoya to better manage his team and take their opinion in consideration. Megumi had every right to call him off given how much she sacrificed for him. Tomoya has been acting a little too entitled. He needed this reality check. \n\n[](#katoupout)"
  },
  {
   "score": 114,
   "id": "dhq7vo2",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 09:41:24",
   "depth": 0,
   "text": "[Katou being upset](http://i.imgur.com/iQ1wedn.png) and [Aki being told](http://i.imgur.com/V9oueSa.png) was great! Love how much flak he's actually getting this time around!\n\nAlso very happy their game was a success although it feels mostly because it's by Eriri and Utaha...\n\nCurious to see how that mystery, scary, ominous hat lady plays into all this."
  },
  {
   "score": 0,
   "id": "dhql9dk",
   "pid": "t1_dhq7vo2",
   "date": "2017-05-18 13:33:52",
   "depth": 1,
   "text": "[removed]"
  },
  {
   "score": 5,
   "id": "dhqtk18",
   "pid": "t1_dhql9dk",
   "date": "2017-05-18 16:16:40",
   "depth": 2,
   "text": "> or Slut\n\nWhat the fuck did you just fucking say about best girl, you little bitch? I’ll have you know I graduated top of my class in the Navy Seals, and I’ve been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and I’m the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You’re fucking dead, kiddo."
  },
  {
   "score": -4,
   "id": "dhqy5ks",
   "pid": "t1_dhqtk18",
   "date": "2017-05-18 17:59:13",
   "depth": 3,
   "text": "God damn, this is why some country on this world doesn't give a fuck about America."
  },
  {
   "score": 2,
   "id": "dhqz3hn",
   "pid": "t1_dhqy5ks",
   "date": "2017-05-18 18:20:58",
   "depth": 4,
   "text": "Wtf are you talking about? This is the greatest quality of mankind! Getting upset over practically nothing!"
  },
  {
   "score": 0,
   "id": "dhr2q4s",
   "pid": "t1_dhqz3hn",
   "date": "2017-05-18 19:44:49",
   "depth": 5,
   "text": "... so troll is greatest quality of mankind? or is it hypocrite?\nsince he said he is in navy seals and can use marine corps equipment, as Uncle Sam always like to said to bring freedom to the world, but see how he behave. When a female behave like a slut then she is a slut, if because i call female a slut because she behave like a slut he come to my house to kill me then what the fuck is USA freedom is? Hypocrite?!?"
  },
  {
   "score": 4,
   "id": "dhqwzx9",
   "pid": "t1_dhq7vo2",
   "date": "2017-05-18 17:33:16",
   "depth": 1,
   "text": "Ikr. This season is like an all-you-can-kato buffet. I get to see the complicated character that is kato in different light, and definitely in different lighting as well.\n\nKato best girl. Not just this season but of all time. Fight me everyone."
  },
  {
   "score": 134,
   "id": "dhqb1po",
   "pid": "t1_dhq7vo2",
   "date": "2017-05-18 10:37:09",
   "depth": 1,
   "text": "Katou true best girl doesn't cry like a whinny bitch when upset."
  },
  {
   "score": 80,
   "id": "dhqb8a0",
   "pid": "t1_dhqb1po",
   "date": "2017-05-18 10:40:23",
   "depth": 2,
   "text": "She just like 3D girl wandering into harem anime..."
  },
  {
   "score": 19,
   "id": "dhqblr3",
   "pid": "t1_dhqb8a0",
   "date": "2017-05-18 10:47:02",
   "depth": 3,
   "text": ">saying someone as great as Katou is \"*like*\" a 3D girl\n\n[](#blankblink)\n\n"
  },
  {
   "score": 9,
   "id": "dhqbt1w",
   "pid": "t1_dhqblr3",
   "date": "2017-05-18 10:50:40",
   "depth": 4,
   "text": "I'm sorry for that. Just some part of her. like the reaction that can't be predictable."
  },
  {
   "score": 62,
   "id": "dhqbewt",
   "pid": "t1_dhqb8a0",
   "date": "2017-05-18 10:43:39",
   "depth": 3,
   "text": "And that's why she is best girl of 2017 (take the hint everyone)."
  },
  {
   "score": 7,
   "id": "dhqeypl",
   "pid": "t1_dhqbewt",
   "date": "2017-05-18 11:45:19",
   "depth": 4,
   "text": "Megumin & Darkness (KonoSuba S2), Kanna (Dragon maid), Vigne & Satania (GabDrop), Konatsu(Rakugo) and Historia & Mikasa (SnK S2)  make the competition extremely tough this year. C.C. (Code Geass: LotR) is also gonna be a strong contender.\n\n[](#katoupls)\n"
  },
  {
   "score": -20,
   "id": "dhqm0rj",
   "pid": "t1_dhqeypl",
   "date": "2017-05-18 13:47:03",
   "depth": 5,
   "text": "Stupid & Stupid Slut  \nDragon?!  \nToo good demon & Stupid demon  \n---^---  \nPrincess & Brocon female killer  \nGreen witch  \n  \nKato is too real & rare (that right, girl like her is rare)... that may be her - point... still her personality is great enough to get 1st place as wife candidate for me."
  },
  {
   "score": 1,
   "id": "dhra6wd",
   "pid": "t1_dhqm0rj",
   "date": "2017-05-18 23:27:28",
   "depth": 6,
   "text": "woah calm down mr.edgy you don't have to do this to other girls"
  },
  {
   "score": 1,
   "id": "dhrgi35",
   "pid": "t1_dhra6wd",
   "date": "2017-05-19 04:19:14",
   "depth": 7,
   "text": "Come on, if i didn't do that it'd be not fair to other girls."
  },
  {
   "score": 3,
   "id": "dhr0lwm",
   "pid": "t1_dhqm0rj",
   "date": "2017-05-18 18:55:40",
   "depth": 6,
   "text": "what is wrong with you"
  },
  {
   "score": -1,
   "id": "dhr38a4",
   "pid": "t1_dhr0lwm",
   "date": "2017-05-18 19:56:30",
   "depth": 7,
   "text": "By calls some of them stupid? Did you watch the anime they're in? Other than lol at how stupid they are then what can you do? shutdown your brain so you can enjoy those story? if not you would just stop watching because how stupid the story was."
  },
  {
   "score": 1,
   "id": "dhr3bz1",
   "pid": "t1_dhr38a4",
   "date": "2017-05-18 19:58:54",
   "depth": 8,
   "text": "1st one is comedy\n\n2nd is SOL\n\n3rd is SOL+Comedy"
  },
  {
   "score": 0,
   "id": "dhr3uh7",
   "pid": "t1_dhr3bz1",
   "date": "2017-05-18 20:11:22",
   "depth": 9,
   "text": "facepalm...\nIt's exactly that. It's stupid comedy, it created comedy on the stupid of the characters, so what wrong calls those character stupid?"
  },
  {
   "score": 1,
   "id": "dhr9qd4",
   "pid": "t1_dhqeypl",
   "date": "2017-05-18 23:09:33",
   "depth": 5,
   "text": "Dragon Maid and Gabriel Dropout won't be in contention due to \"recency bias\". Don't think Megumin will win due to lack of her screen time."
  },
  {
   "score": 3,
   "id": "dhr5o05",
   "pid": "t1_dhqeypl",
   "date": "2017-05-18 20:57:56",
   "depth": 5,
   "text": "Don't forget Senjougahara's comeback in the summer ;). "
  },
  {
   "score": 7,
   "id": "dhr0n6x",
   "pid": "t1_dhqeypl",
   "date": "2017-05-18 18:56:28",
   "depth": 5,
   "text": "If you're talking about the best girl contest 2017, I don't think characters from the last 3-4 seasons are allowed to compete."
  },
  {
   "score": 9,
   "id": "dhraqb0",
   "pid": "t1_dhqbewt",
   "date": "2017-05-18 23:49:39",
   "depth": 4,
   "text": "Vote Kato Megumi, make /r/anime great again!!!"
  },
  {
   "score": 21,
   "id": "dhqe16s",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:29:09",
   "depth": 0,
   "text": "This episode in a nutshell for me, Happy Eriri = Happy Laifu. \n\nI'm not surprised that Kato was mad, when I first started the episode the first thing I thought is \"Where is Kato\" and it really weirded me out a that she wasn't there despite saying she would make time for it. I'm really interested to see how things pick up from here on out now that the 1st Winter Event is over.  "
  },
  {
   "score": 2,
   "id": "dhrrutb",
   "pid": "t1_dhqe16s",
   "date": "2017-05-19 08:44:36",
   "depth": 1,
   "text": "she even called and tomoya was like \"fuck that\""
  },
  {
   "score": 21,
   "id": "dhr0h0e",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 18:52:35",
   "depth": 0,
   "text": "Megumi's \"outburst\" was fucking terrifying mostly due to the fact that her tone and speech pattern was the same as normal.  When someone is all dramatic and yelling when they're made is somewhat easy to take because you expected them to be that way.  With Megumi's calm and soothing tone saying such angry words hit way harder than if she yelled it.  The tone makes it sound like there's no way Tomoya could ever redeem himself because she sounded done with his shit.  Megumi is obviously not but still.  You get that feeling.\n\nThis added dimension to her makes her even more best girl."
  },
  {
   "score": 6,
   "id": "dhr98s4",
   "pid": "t1_dhr0h0e",
   "date": "2017-05-18 22:51:04",
   "depth": 1,
   "text": "They picked the perfect voice actress to bring her alive."
  },
  {
   "score": 16,
   "id": "dhq9efv",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:07:52",
   "depth": 0,
   "text": "That's what you get when you ignore the character in this anime's title.    \nI really understood Megumi's feeling since I was treated the same way before."
  },
  {
   "score": 17,
   "id": "dhqakk5",
   "pid": "t1_dhq9efv",
   "date": "2017-05-18 10:28:37",
   "depth": 1,
   "text": "It was also interesting to observe viewers' reaction to last week episode, when most were bashing Tomoya for being dense and not attending to Eriri sooner, very few people were commenting on how Megumi would react.  People were literally falling into the same trap as Tomoya by habitually relegating Megumi as a background character. "
  },
  {
   "score": 16,
   "id": "dhqbq2y",
   "pid": "t1_dhqakk5",
   "date": "2017-05-18 10:49:12",
   "depth": 2,
   "text": "Well I think most people were right to bash Tomoya for not acting sooner but they didn't expect him to ignore the blatant \"I'll help you if you need me\" comments from Katou."
  },
  {
   "score": 2,
   "id": "dhqs16s",
   "pid": "t1_dhqbq2y",
   "date": "2017-05-18 15:44:09",
   "depth": 3,
   "text": "Yeah I took for granted that there is no way she wouldn't come unless he told her not to."
  },
  {
   "score": 25,
   "id": "dhqf0k5",
   "pid": "t1_dhq9efv",
   "date": "2017-05-18 11:46:13",
   "depth": 1,
   "text": "Man it was hard to watch. From the start of the episode I was wondering why he didn't ask Katou to tag along to Nasu Kogen, and then he just kept digging his grave the whole time.\n\nShe's totally in the right on this one, and I was also impressed with how you could sort of tell she was mad at Komiket without it being exaggerated or extremely obvious"
  },
  {
   "score": 34,
   "id": "dhq7yip",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 09:42:45",
   "depth": 0,
   "text": "I thought it was going to take a while before they hit Winter Comiket. Turned out faster than I thought. The ignored call from Katou was a bad sign and now Katou is obviously mad at Tomoya, it's pretty obvious she's developed feelings as well. The rest is just harem stuff I suppose, I thought the whole series would be centered around this game creation, but I was wrong."
  },
  {
   "score": 9,
   "id": "dhqngps",
   "pid": "t1_dhq7yip",
   "date": "2017-05-18 14:13:25",
   "depth": 1,
   "text": "> Katou is obviously mad at Tomoya, it's pretty obvious she's developed feelings as well.\n\nAm I misremembering, or isn't her like for him the whole basis of her being involved with the group?"
  },
  {
   "score": 1,
   "id": "dhqr2lq",
   "pid": "t1_dhqngps",
   "date": "2017-05-18 15:24:17",
   "depth": 2,
   "text": "I interpreted in a way that she was a person who had little to any presence, so when she was first being noticed, she'd be interested and curious. With Tomoya being pushy as well, she just joined in and followed. I may be wrong as I usually am, but I didn't think she was in interested in Tomoya on the get go."
  },
  {
   "score": 6,
   "id": "dhr3cid",
   "pid": "t1_dhqngps",
   "date": "2017-05-18 19:59:15",
   "depth": 2,
   "text": "She's take the game development seriously. She's curious about the new world that she recently discovered. But the MC is dense. \n\n[Spoiler](/s \"She didn't have any romantic interest toward MC in the first arc (This is where Anime Adapted) but in the second arc (LN: Vol 8-12) She start to showed that she like him (Vol.11: Her reaction just confirm that she's really like him)\")"
  },
  {
   "score": 1,
   "id": "dhy0ur2",
   "pid": "t1_dhr3cid",
   "date": "2017-05-23 12:51:57",
   "depth": 3,
   "text": "Response to spoiler...[Love may be too strong a word at this point](/spoiler)"
  },
  {
   "score": 48,
   "id": "dhq83ft",
   "pid": "t1_dhq7yip",
   "date": "2017-05-18 09:45:04",
   "depth": 1,
   "text": "It's center around Megumi. Other girls just for filling the plot..."
  },
  {
   "score": 13,
   "id": "dhqdvs9",
   "pid": "t1_dhq83ft",
   "date": "2017-05-18 11:26:32",
   "depth": 2,
   "text": ">Other girls just for filling the plot...\n\nWell, it's not just the plot that's gonna be filled\n\n[](#dubs)"
  },
  {
   "score": 3,
   "id": "dhr0v9k",
   "pid": "t1_dhqdvs9",
   "date": "2017-05-18 19:01:40",
   "depth": 3,
   "text": "is that as lewd as i think it is"
  },
  {
   "score": 3,
   "id": "dhr63j3",
   "pid": "t1_dhr0v9k",
   "date": "2017-05-18 21:10:07",
   "depth": 4,
   "text": "Yeah hand holding is lewd stuff."
  },
  {
   "score": 9,
   "id": "dhrtf5a",
   "pid": "t1_dhq83ft",
   "date": "2017-05-19 09:13:22",
   "depth": 2,
   "text": "It really is though, and it comes to light more and more with each episode. The other girls are so heavily based on tropes just to highlight Katou but they hold their own when needed to even further show just how far ahead Katou is in terms of character.\n\nHell, this mini-arc almost feels like it was made for Aki to ignore Katou's call. I didn't even pay much attention to it at first because it sorta felt right for an Anime.\n\nBut Katou remembered it. She didn't write this off at all. That phone call could've not happened and Katou could've ignore this or she would've been asleep at the time and Aki could've made the excuse to not disturb her, but reality stuck.\n\nThe writing in this show has a lot more to it than a harem. I'm scared to get off of this wild ride."
  },
  {
   "score": 48,
   "id": "dhq8d39",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 09:49:37",
   "depth": 0,
   "text": "This felt very rushed.\n\nI liked how Eriri was leaning in on Tomoya, that was very cute. They are childhood friends after all (therefore she is doomed anyways lol)\n\nWell, that's the first time i've seen Katou visibly upset like that. Seeing how he never accepted her helping hand in this season, i get her. "
  },
  {
   "score": 38,
   "id": "dhq90cc",
   "pid": "t1_dhq8d39",
   "date": "2017-05-18 10:00:52",
   "depth": 1,
   "text": "I had the same impression. They basically handwaved everything related to the final product and the success of their game. I suppose they focused on the characters themselves. After all the game was successful mostly thanks to Eriri and Utaha, and their work was already animated.\n\nAs for Katou, you could feel that she was mad in every scene were she was present..."
  },
  {
   "score": 10,
   "id": "dhq9fgi",
   "pid": "t1_dhq90cc",
   "date": "2017-05-18 10:08:23",
   "depth": 2,
   "text": "They only sold 100 copies with minimal packaging due to missing the deadline, when they originally aimed for over 1000, can't say that was completely successful for a year worth of effort.  Quality / reputation-wise it was pretty much guaranteed though."
  },
  {
   "score": 29,
   "id": "dhqo1hi",
   "pid": "t1_dhq90cc",
   "date": "2017-05-18 14:24:24",
   "depth": 2,
   "text": "Megumi's voice actress does a really great job with a very difficult role. The others get to go full anime tropes at the drop of a hat, but she has to always be subtle and nuanced.\n\nAlmost every time she speaks it's like a bolt of reality slicing through the show. I love it."
  },
  {
   "score": 70,
   "id": "dhqch8a",
   "pid": "t1_dhq8d39",
   "date": "2017-05-18 11:02:26",
   "depth": 1,
   "text": "Katou was literally the only one that gave Aki zero problems too. Throughout the show, she's been the anchor that keeps everyone rooted and supported everyone. Even Utaha went to her for help.\n\nShe could've just sat there and did nothing but modeled for Eriri and let things go by, but she put in way more effort than she needed to and still got put down."
  },
  {
   "score": 10,
   "id": "dhr0qve",
   "pid": "t1_dhqch8a",
   "date": "2017-05-18 18:58:52",
   "depth": 2,
   "text": "yeah. the game definitely wouldn't have gone as smoothly as it has if not for Kato anchoring everyone and supporting Aki so much. I thought she was just giving him the cold shoulder for rejecting her call like any other character, but she just once again comes through as the unrivaled best girl."
  },
  {
   "score": 45,
   "id": "dhqaj8i",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:27:58",
   "depth": 0,
   "text": "Loving the faces Michiru and Utaha make [when Eriri is acting cute with Aki.](https://i.imgur.com/8pwFWVf.jpg)"
  },
  {
   "score": 38,
   "id": "dhqk7pw",
   "pid": "t1_dhqaj8i",
   "date": "2017-05-18 13:16:00",
   "depth": 1,
   "text": "Utaha is ready to body that fool"
  },
  {
   "score": 24,
   "id": "dhr0xhw",
   "pid": "t1_dhqk7pw",
   "date": "2017-05-18 19:03:08",
   "depth": 2,
   "text": "\"fuckin runt missed her deadline and brags about her work then tries to steal the man\""
  },
  {
   "score": 12,
   "id": "dhqo6zi",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 14:27:17",
   "depth": 0,
   "text": "Eriri will always be number 1 to me. <3\n\n[](#salute)"
  },
  {
   "score": 36,
   "id": "dhqb6dm",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:39:28",
   "depth": 0,
   "text": "[Katou showing disdain towards Aki?](#terror)\n\n[He dun fucked up](#emiliaohdear)\n\nWe spent a season and a half on the Winter Comiket story and I'm curious where the story will go from here. The whole team was basically together for the purpose of Winter Comiket so do they work together for the Summer Comiket now? Then again Utaha is graduating soon...\n\nI'm really interested to see what happens next since the first major arc seems to be done with or nearly over and we still have another 6 episodes left. \n\n"
  },
  {
   "score": -10,
   "id": "dhqgxmh",
   "pid": "t1_dhqb6dm",
   "date": "2017-05-18 12:19:32",
   "depth": 1,
   "text": "Worse than \"I love emilia\"?"
  },
  {
   "score": 3,
   "id": "dhsv97n",
   "pid": "t1_dhqgxmh",
   "date": "2017-05-19 23:38:53",
   "depth": 2,
   "text": "This is still a sensitive subject in the minds of r/anime it would seem."
  },
  {
   "score": 39,
   "id": "dhqbguh",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:44:37",
   "depth": 0,
   "text": "Ive been waiting for this [scene animated for 2 years](https://imgur.com/a/i9Y7r) and it was worth it. To be honest, Tomoya deserve it.\n\nThe woman in the hat Kousaka Akane smile when she saw Eriri illustration and taking away Iori's copy of Cherry Blessing, she pretty much sets her sights to Tomoya's circle."
  },
  {
   "score": 44,
   "id": "dhqdc4z",
   "pid": "t1_dhqbguh",
   "date": "2017-05-18 11:16:59",
   "depth": 1,
   "text": ">\"The first time she betrayed me\"\n\nHopefully this is not what the direct translation means. Because if it does, Tomoya is just a douchebag. Hopefully it is more like the anime"
  },
  {
   "score": 37,
   "id": "dhqffro",
   "pid": "t1_dhqdc4z",
   "date": "2017-05-18 11:53:31",
   "depth": 2,
   "text": "The Japanese word used, 反逆, is actually closer to \"rebel,\" which is even worse because it implies that Tomoya views Megumi as a subordinate. "
  },
  {
   "score": 5,
   "id": "dhqrhy6",
   "pid": "t1_dhqffro",
   "date": "2017-05-18 15:33:03",
   "depth": 3,
   "text": "The Japanese language is pretty nuanced so maybe it's neither of those meanings, not that I would know I have no clue on how to read moon runes."
  },
  {
   "score": 9,
   "id": "dhrbdlv",
   "pid": "t1_dhqffro",
   "date": "2017-05-19 00:17:21",
   "depth": 3,
   "text": "Taking a very liberal intepretation, maybe it means \"turning her back on me\", or \"showed me her back\" in terms of walking away."
  },
  {
   "score": 29,
   "id": "dhqwqt9",
   "pid": "t1_dhqffro",
   "date": "2017-05-18 17:27:36",
   "depth": 3,
   "text": "I'd probably translate 反対 as \"oppose\" in this context; however I don't have anything else to add to the discussion."
  },
  {
   "score": 9,
   "id": "dhqggnx",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 12:11:28",
   "depth": 0,
   "text": "Well that went better than I expec... oh...\n\nWhile it was nice to see Aki caring about Eriri, even when it became clear that he was forgetting someone important. On the whole I've noticed Aki is very single minded and charge forward on whatever he's passionate about. Unfortunately that tends to hurt those knocked aside or left in the dust once the passion fades.\n\nKatou has every right to be upset, but that calm anger was so much more scary than some over dramatic shouting match. I'm interested to see how Aki is going to patch this up.\n\nThough I hope they release Eriri's artwork at some point, it really did look beautiful. Tried looking on the show's [website](http://www.saenai.tv/) and [Twitter](https://twitter.com/saenai_heroine) but they weren't there. There was a Katou body pillow [NSFW link](https://pbs.twimg.com/media/DAEMuHTUAAA35fp.jpg:large) which somehow seems a little more classier than a normal anime pillow, at least by body pillow standards anyway."
  },
  {
   "score": 8,
   "id": "dhqcxdi",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:10:01",
   "depth": 0,
   "text": "Oh my god the tension of that scene is so high. I was basically holding my breath when Katou spoke. Still mostly emotionless, but damn that tension"
  },
  {
   "score": 6,
   "id": "dhqkb2m",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 13:17:38",
   "depth": 0,
   "text": "I really need to change my expectations to that show, that's no light self-aware comedy harem anymore."
  },
  {
   "score": 7,
   "id": "dhqq230",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 15:03:41",
   "depth": 0,
   "text": "This shit right here is why I love this show. Amidst an amalgamation of stereotyped love interests we have an extremely realistic character that acts just like a real, sane, human being.\n\nKatou is the best"
  },
  {
   "score": 17,
   "id": "dhq95jv",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:03:27",
   "depth": 0,
   "text": "Fans of White Album 2, go check out the ending credits and look for a cameo VA :)"
  },
  {
   "score": 14,
   "id": "dhqb7y7",
   "pid": "t1_dhq95jv",
   "date": "2017-05-18 10:40:14",
   "depth": 1,
   "text": "Touma right? Did she voiced akane this episode?"
  },
  {
   "score": 8,
   "id": "dhqbj5r",
   "pid": "t1_dhqb7y7",
   "date": "2017-05-18 10:45:45",
   "depth": 2,
   "text": "Yep."
  },
  {
   "score": 29,
   "id": "dhqdhmu",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:19:44",
   "depth": 0,
   "text": "Kato's ability to steal the show is what puts her on another level compared to the other girls.\n\nShe's best and its not even close, Eririfags and Utahafags quit being on denial por favor."
  },
  {
   "score": 12,
   "id": "dhqr8fi",
   "pid": "t1_dhqdhmu",
   "date": "2017-05-18 15:27:35",
   "depth": 1,
   "text": "[No.](#utahapraises)"
  },
  {
   "score": 12,
   "id": "dhq819e",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 09:44:02",
   "depth": 0,
   "text": "That ending... Like I was expected. Maruto Strike again.\n\nCongratulation Tomoya-kun. [You've piss her off](http://i.imgur.com/wWRj2zd.png)"
  },
  {
   "score": 6,
   "id": "dhqnkeg",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 14:15:21",
   "depth": 0,
   "text": "Man Tomoya is really annoying sometimes. He needs a reality check. "
  },
  {
   "score": 13,
   "id": "dhq9dds",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:07:21",
   "depth": 0,
   "text": "Welp, Aki messed up... as usual.\n\nEriri episode was great, Eriri is always amazing and i loved everything about it, i am very worried about why that Akane girl was smiling like that in Eriri's place, though..."
  },
  {
   "score": 11,
   "id": "dhqjw9m",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 13:10:38",
   "depth": 0,
   "text": "Fuck. dude.\nRun away not even answer your girl friend call.\n \nKato should dump him."
  },
  {
   "score": 8,
   "id": "dhqgap9",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 12:08:36",
   "depth": 0,
   "text": "Here's this week's [collaboration illustration](https://twitter.com/saenai_heroine/status/865244366243151872) by [Mibu Natsuki](https://www.pixiv.net/member.php?id=3917786)(Pixiv nsfw).\n\n[2x upscale.](http://i.imgur.com/3RPXo4o.png)"
  },
  {
   "score": 8,
   "id": "dhqe1fr",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:29:16",
   "depth": 0,
   "text": "oh my godddddd. we were all Tomoya at the end"
  },
  {
   "score": 9,
   "id": "dhqf6of",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:49:08",
   "depth": 0,
   "text": "I was hoping Kato was going to say some shit about him ignoring her, but the cold explanation and her walking away alone hurt. Past few episodes she stated many times she will help if she can and to just call her. Her position is probably the worst in the group.  While everyone else got dragged in  as well, Utaha and Eriri are both professionals and if anything game is good for promotion. Michiru still has her band and tthe game is good for promoting her music/her band. Also all three are doing things in their field so it's more practice and experience. Now Kato experience doesn't really help her future at all. In fact she probably is the most dedicated in the group and the fact that Tomoya left her in the dark wad practically a slap to the face. Basically telling the person who volunteered most of their free time for something they were working hard on and saying their not an equal or important enough to contact. Tomoya's selfishness doesn't help either.  Apologize for horrendous errors typing on this phone is a bitch. "
  },
  {
   "score": 9,
   "id": "dhqfo9h",
   "pid": "t1_dhqf6of",
   "date": "2017-05-18 11:57:36",
   "depth": 1,
   "text": "Dont forget she barely understood this stuff to begin with so she was willing to learn about tomoya's word and how to create a game just for him to completely ignore her"
  },
  {
   "score": 3,
   "id": "dhq9s4v",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:14:36",
   "depth": 0,
   "text": "Wait, so the disc they were selling at the Winter Comiket (and sold out in 30 minutes) was just a demo or did I get it wrong?"
  },
  {
   "score": 9,
   "id": "dhqa38q",
   "pid": "t1_dhq9s4v",
   "date": "2017-05-18 10:20:07",
   "depth": 1,
   "text": "It was a full version, but with minimal packaging. The demo (that Iori mentioned) was presumably released on the net prior to the Comiket."
  },
  {
   "score": 9,
   "id": "dhqaofo",
   "pid": "t1_dhq9s4v",
   "date": "2017-05-18 10:30:32",
   "depth": 1,
   "text": "100 self-made copies with no packaging instead of the original aim of 1000 professionally made discs."
  },
  {
   "score": 3,
   "id": "dhqcgq0",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:02:13",
   "depth": 0,
   "text": "And there we have it. That's why, ladies and gents, you need to talk to each other about things.\n\n---\nI can't believe I thought that Katou wouldn't win when I started watching this show. If she doesn't, then nobody does."
  },
  {
   "score": 3,
   "id": "dhqeon3",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:40:29",
   "depth": 0,
   "text": "I knew why she was upset as soon as I saw her face being hidden in the booth. She was left out. She feels like she hasn't gained Tomoya's complete trust after all this time. Godammit, Tomoya.... You just can't get anything right."
  },
  {
   "score": 3,
   "id": "dhqiatg",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 12:43:12",
   "depth": 0,
   "text": "That Katou scene was the biggest passive aggressive fuck you I've seen in a while."
  },
  {
   "score": 3,
   "id": "dhqu2ag",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 16:27:50",
   "depth": 0,
   "text": "Everyone has pretty much touched upon everything with Megumi and Eriri so I just want to say I'm happy Aki has pointed out and accepted that for all the issues between them Iori still sees him and Eriri as friends. This is the second time he has gone out of his way to help them asking for nothing in return. Sure, they both may have different end goals in their creation efforts in the industry, but deep down they both still share that love of story telling and fandom."
  },
  {
   "score": 3,
   "id": "dhqlc2u",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 13:35:07",
   "depth": 0,
   "text": "Does anyone know who the artist for the in-anime art (Eriri's art) is? That art is fire."
  },
  {
   "score": 17,
   "id": "dhqmdvh",
   "pid": "t1_dhqlc2u",
   "date": "2017-05-18 13:53:31",
   "depth": 1,
   "text": "Kurehito Misaki, the LN illustrator of Saekano. The anime character designs are pretty, but his work is just at a different level."
  },
  {
   "score": 4,
   "id": "dhr1zyd",
   "pid": "t1_dhqmdvh",
   "date": "2017-05-18 19:28:13",
   "depth": 2,
   "text": ">his work is just at a different level.\n\nThere's the regular biannual Comiket every August and December, and then there's Comiket Special, held once every 5 years in March. \n\nI still remember it, in March 2015: Comiket Special 6. That was when Misaki released a special edition SaeKano doujin as \"Kashiwagi Eri\" using the circle name \"Egoistic Lily\" instead of Misaki's usual circle \"Cradle\". \n\nThe queue was ridiculously long, all the way to the next hall. I could not hope to even get near the hall where the booth is located, let alone getting to the front.\n\nAll copies were sold out within half an hour. To this day, occasional copies of that doujin could be spotted in second-hand stores in Nakano Broadway (AKA the second Akihabara), but priced at over 15,000 yen, nearly 30 times its original price."
  },
  {
   "score": 1,
   "id": "dlo0oaw",
   "pid": "t1_dhr1zyd",
   "date": "2017-08-15 12:16:57",
   "depth": 3,
   "text": "would you happen to know what the doujin's title is?\n\nis it 'Memories Of Lily 00' by any chance - because looking through the contents it's really not worth half as much ..."
  },
  {
   "score": 1,
   "id": "dlo1cbz",
   "pid": "t1_dlo0oaw",
   "date": "2017-08-15 12:27:43",
   "depth": 4,
   "text": "Jesus, replying to a post I made 2 months ago that even I myself have forgotten that I even wrote it?\n\nI bestow you the title of Thread Necromancer (TM).\n\nAnyway, yes, it is as you say, Memories of Lily."
  },
  {
   "score": 1,
   "id": "dlo1f0p",
   "pid": "t1_dlo1cbz",
   "date": "2017-08-15 12:28:55",
   "depth": 5,
   "text": "haha i'm only just watching saekano s2 now (i'm a binge watcher) so i'm reading the episode discussions as i go along."
  },
  {
   "score": 4,
   "id": "dhqmf0c",
   "pid": "t1_dhqmdvh",
   "date": "2017-05-18 13:54:04",
   "depth": 2,
   "text": "He's a god"
  },
  {
   "score": 4,
   "id": "dhqlmxz",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 13:40:19",
   "depth": 0,
   "text": "Well, Tomoya just fucked up. He upset best girl."
  },
  {
   "score": 11,
   "id": "dhqftyl",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 12:00:23",
   "depth": 0,
   "text": "Way too fucking rushed jesus christ.\n\nThey decided to take their time adapting Volume 5 and parts of GS 1 which was good... only to rush the shit out of Volume 6 and probably Volume 7 when THESE TWO VOLUMES ARE THE MOST IMPORTANT VOLUMES IN THE ENTIRE FUCKING SERIES AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH.\n\nHoly fucking shit what a fucking train wreck garbage adaption this is becoming. Reminds me the fucking Oregairu Zoku adaptation (except this is much worse).\n\nLiterally re-reading the LN in my hands right now to get the details of what the anime adaptation decided to let go (despite most of these things being very fucking important).\n\nAlso got rid of very important dialogue and some scenes of Iori giving real bro advice and care for Aki which makes him the #1 bro of the series.\n\nHere are the important scenes/dialogue straight up cut out from the adaptation....:\n\n> Iori bringing medicine and changes of clothes picked out by one of his secetary coworkers in his doujin circle.\n\n> Iori telling Aki that if Aki doesn't tell his group about him going to visit Eriri who fell sick alone without telling anyone in 3 days after the fact some of his members may leave the group which Aki takes as a joke/little insult from Iori when Iori was actually giving him sound advice because Aki treats his members like his little minions with almost no full disclosure/trust when it comes to big issues like this.\n\n> Iori tells Aki that he should have sent someone else to take care of Eriri in his group while he works on the game because Aki is the fucking director with a deadline coming up and Aki flat out says that he can't trust anyone to do it himself because Utaha and Eriri hate each other (when in reality, these two have the utmost respect for each other) Eriri dislikes Michiru and he can't ask Kato to do it because he feels he uses her around too much. This was supposed to show that Aki has no real trust in his group and he almost cost his group the entire game project just because he couldn't trust others to help out when it counted the most.\n\n> Got rid of Aki and Eriri spending days together and having little cute interactions together like a couple... Aki cooking and feeding Eriri some soup to help her get through her illness and Eriri cooking breakfast for Aki and feeding him when he gets sick due to him not eating for an entire day because he was too occupied with treating Eriri's illness..\n\n> Got rid of the fact that THEY SPENT CHRISTMAS TOGETHER AND EVEN GOT RID OF THE MERRY CHRISTMAS GREETING RIGHT BEFORE THE CUT TO COMIKET AHHHHHH.\n\n> Totally got rid of Eriri telling Izumi about how she has changed now from before and has the courage to be able to surpass Izumi's growth, which was a sign of her growth both as a creator and a direct effect of her making up with Aki \n\n> Aki telling Iori that he can put 100% faith in the new Eriri while Eriri and Izumi have their own little conversation, which shows that Aki has improved in his trust issues when it comes to leaving his creators to do what they can without constant supervision and hindering the overall work progress.\n\n> Got rid of the ending parts where Kato tries to act indifferently to the trust issues that Aki had during the Eriri incident and tried to brush it off when Aki asks her what is wrong. She eventually cracks and tells everything to Aki like she did in this episode's ending.\n\nThis volume was supposed to show that Aki is willing to put everything in the line (even his dream project) for Eriri and later on Utaha (in vol 10+) because those two girls are the two people he respects the most by far.\n\nAnd since this happened, Kato is obviously pissed because of two reasons:\n\n1. Aki didn't trust her or the group enough and almost cost them an entire project they worked on their own free time and money (hint hint Utaha) for HIS SAKE...\n\n2. Aki didn't think about everyone else that put in so much effort into the project and decided to ditch all of that just for one person (in this case Eriri, and despite Kato and Eriri being best friends, which the anime does not display well... is still a huge no no to Kato).\n\n\n\nSo sad how Volume 6 was the Eririfag volume and also the second most important volume in the series (only after Volume 7), only to be rushed to fucking hell and beyond.\n\nAs a LN reader that has been following the series for years and spent quite the bucks on the series, it is sad to see the anime adaptation get so rushed, especially at the most important parts of the series...\n\nThough I'm an Utahafag, if they were gonna rush it, they should have given Volume 5 and GS 1 2-3 episodes and adapted Volume 6 with 3-4 episodes...\n\nI can only hope that Volume 7, the MOST IMPORTANT FUCKING ARC, doesn't get rushed to hell like this... "
  },
  {
   "score": 0,
   "id": "dhrwtfs",
   "pid": "t1_dhqftyl",
   "date": "2017-05-19 10:16:06",
   "depth": 1,
   "text": "Anime only viewer here. It's not just the adaptation that was rushed. This episode has a lot of technical issues too like static crowds, poor in-betweening, poor layouts and poor foley (sound effects).\n\n[Example 1:](http://imgur.com/a/Bhhw6) I believe the fire in the fireplace is a video and not actually animated. The second problem is that the light doesn't flicker like a real fire does.\n\n[Example 2:](http://imgur.com/a/D9R1J) the last transition of her head movement is jittery because of improper/rushed in-betweens.\n\nThen the crowd at Comiket is sparse and mostly static. The scenes jump between different locations at the venue with no big establishing shot that can help us track their movement, which made me very disoriented."
  },
  {
   "score": 1,
   "id": "di4lwkz",
   "pid": "t1_dhqftyl",
   "date": "2017-05-27 15:46:44",
   "depth": 1,
   "text": "I knew that this episode felt rushed. I didn't really like the episode until the last scene. Thanks for pointing out what the anime skipped out on. Would you mind clearing up something for me? I'm still kinda confused about the conflict for this arc. \n\nInitially it seems that Eriri has hit a mental block because of their game's female protag's similarities to Katou? She can't imagine seeing the game's MC being with Katou-lite so she has trouble drawing the artwork. Aki tries to let Eriri fix her block herself but then Utaha lectures him for not trusting her? I know you say that he doesn't trust his teammates but that doesn't seem to be the issue here. \n\nIsn't the problem that he's too complacent in dealing with Eriri's block instead of directly addressing it? And how exactly did Eriri manage to get past her mental block, just pushing herself?"
  },
  {
   "score": 2,
   "id": "di4lzsv",
   "pid": "t1_di4lwkz",
   "date": "2017-05-27 15:49:07",
   "depth": 2,
   "text": "The problem here is that Tomoya isn't actively pushing Eriri to work on her illustrations and just letting her do as she pleases. Eriri secretly wants Tomoya to push her to her limits but Tomoya doesn't want to put too much pressure on his group members anymore.\n\nAs for how she will manage to get past it, the anime will probably cover it."
  },
  {
   "score": 1,
   "id": "di4m3a5",
   "pid": "t1_di4lzsv",
   "date": "2017-05-27 15:51:39",
   "depth": 3,
   "text": "Damn that was a quick response. Thanks!"
  },
  {
   "score": 1,
   "id": "di4n9xz",
   "pid": "t1_di4m3a5",
   "date": "2017-05-27 16:23:00",
   "depth": 4,
   "text": "np"
  },
  {
   "score": 1,
   "id": "dhqo05n",
   "pid": "t1_dhqftyl",
   "date": "2017-05-18 14:23:42",
   "depth": 1,
   "text": "hey, did you read the LN in english or japanese ?"
  },
  {
   "score": 1,
   "id": "dhqrm9f",
   "pid": "t1_dhqo05n",
   "date": "2017-05-18 15:35:33",
   "depth": 2,
   "text": "I think the LN doesn't have an English translation."
  },
  {
   "score": 3,
   "id": "dhqpcwt",
   "pid": "t1_dhqo05n",
   "date": "2017-05-18 14:49:52",
   "depth": 2,
   "text": "Read it in KR/JP.\n\nThere's no english translation minus the volume 5 translation from nanodesu."
  },
  {
   "score": 1,
   "id": "dhqqb8k",
   "pid": "t1_dhqpcwt",
   "date": "2017-05-18 15:08:47",
   "depth": 3,
   "text": "if you don't mind me asking\n\nare you from japan or did you learn it ?\n\nif you learnt japanese, do you have any advice on how to learn japanese ? \n\n"
  },
  {
   "score": 2,
   "id": "dhqrf8s",
   "pid": "t1_dhqqb8k",
   "date": "2017-05-18 15:31:29",
   "depth": 4,
   "text": "Korean but learned Japanese for 2 years+ now.\n\nI guess just be diligent and make sure you have to the basics down right (such as the grammar and vocabulary).\n\nKanji is also a pain so memorize it daily if you can.\n\nUsing a textbook/workbook will help tremendously. I never studied it through online means so I can't give any advice on those.\n\nWhen it comes to learning a language, I think persistence is key. \n\nGood luck!"
  },
  {
   "score": 0,
   "id": "dhrjy9c",
   "pid": "t1_dhqrf8s",
   "date": "2017-05-19 06:04:50",
   "depth": 5,
   "text": "personally seems like too much work for light novel"
  },
  {
   "score": 5,
   "id": "dhrbp4m",
   "pid": "t1_dhqftyl",
   "date": "2017-05-19 00:31:22",
   "depth": 1,
   "text": "I could definitely feel the missing scenes here. There were enough red flags to figure out where things were heading, but weren't given enough time to be satisfied with the ending. Really wish I could read the LN. This is probably one of my favorite anime/stories in quite a while."
  },
  {
   "score": 2,
   "id": "dhqexmv",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:44:48",
   "depth": 0,
   "text": "Akane with that smirk. Katou has every right to be mad at him. Really wanna see what's gonna happen next. Looks like volume 7 starts next week"
  },
  {
   "score": 2,
   "id": "dhqjfzj",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 13:02:50",
   "depth": 0,
   "text": "Suddenly Eriri is best girl for me."
  },
  {
   "score": 2,
   "id": "dhqto0r",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 16:19:07",
   "depth": 0,
   "text": "Oh shit. Katou told Aki. \n\nThats the best thing that I wasnt expecting. \n\n"
  },
  {
   "score": 2,
   "id": "dhqtxrl",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 16:25:00",
   "depth": 0,
   "text": "I think I may officially have jumped ship from Utaha-senpai to Katou. Utaha is fun to look at and is voiced by my favorite seiyuu. Which are all things I can explicitly enjoy. But Katou is simply best girl for this anime. "
  },
  {
   "score": 2,
   "id": "dhr3p6d",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 20:07:47",
   "depth": 0,
   "text": "Man, all of the girls are really good, and I still prefer Utaha (for myself anyway), but Katou is very well written and interesting. Excited to see what happens next. Hopefully Aki will just understand her feelings and apologize rather than try to \"fix\" it. "
  },
  {
   "score": 2,
   "id": "dhr678b",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 21:13:07",
   "depth": 0,
   "text": "MC redeems himself slightly by deciding to take care of Eriri instead of still pushing for the ridiculous deadline.  \n\nIori says some stuff that everybody else is probably thinking like \"wtf did you do to make all these people work so hard/why are they even doing this for you\".\n\nBut in the end everything goes well with their limited run sale and the other teammates just kind of gloss over the fact that one of them collapsed and that the ridiculous scope of the project is due to dumb last minute shit the MC wanted to add at the last minute.\n\nSo...it cancels each other out?\n\nThen there's the bit with Katou.  I agree with her and can see why she would be mad, but it's crazy that this is the only thing she's mad about.  Dumbass MC has a list of sins a mile long."
  },
  {
   "score": 2,
   "id": "dhrfhf5",
   "pid": "t3_6bxd4w",
   "date": "2017-05-19 03:37:13",
   "depth": 0,
   "text": "the faces in this [poster](https://files.yande.re/image/1f4db544c7698b1f89d50df65ee7fead/yande.re%20393496%20aki_tomoya%20hashima_izumi%20hyoudou_michiru%20kasumigaoka_utaha%20katou_megumi%20megane%20saenai_heroine_no_sodatekata%20sawamura_spencer_eriri%20seifuku%20thighhighs.jpg) finally make sense"
  },
  {
   "score": 1,
   "id": "dhs3vm8",
   "pid": "t1_dhrfhf5",
   "date": "2017-05-19 12:27:59",
   "depth": 1,
   "text": "The art style of the op as well."
  },
  {
   "score": 2,
   "id": "dhrrixa",
   "pid": "t3_6bxd4w",
   "date": "2017-05-19 08:38:35",
   "depth": 0,
   "text": "Haha Katou is too 'real' at this point. When the quiet ones snap they're so cold and scary. The passionate fights are so much easier to deal with.\n\nI think Katou having no professional invested interest in the game itself was always a problem to begin with, it makes it easy for her to simply walk away. Its a powerful position considering it makes her almost immune to becoming Tomoya's tool. \n\nThis new situation is awesome it opens room for Katou and Tomoya's Development. It assume its going to end up with her having more control over him."
  },
  {
   "score": 2,
   "id": "dhsv5l9",
   "pid": "t3_6bxd4w",
   "date": "2017-05-19 23:34:48",
   "depth": 0,
   "text": "Amazing that even in Eriri's episode, Kato stole the show."
  },
  {
   "score": 3,
   "id": "dhqcvrw",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:09:15",
   "depth": 0,
   "text": "So who's this Akane? Is she gonna be the antagonist for this series? Spoil me away (remember to tag it tho).\n\nAlso, is there any way we can get a hand on Eriri's drawings? Looks very nice, would love to get them as wallpapers."
  },
  {
   "score": 5,
   "id": "dhqjpv7",
   "pid": "t1_dhqcvrw",
   "date": "2017-05-18 13:07:33",
   "depth": 1,
   "text": "Regardless, spoilerless explanation:\n\nAkane Kousaka is the leader of rouge en rouge. Basically their Tomoya, except she's much more successful and mysterious. We found out in S1 that she was interested in taking Eriri from Tomoya, bbut she refused and stuck with Blessing Software."
  },
  {
   "score": 3,
   "id": "dhqh898",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 12:24:39",
   "depth": 0,
   "text": "Katou probally feels left out and useless, understandable that shes angry tbh"
  },
  {
   "score": 1,
   "id": "dhqtted",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 16:22:21",
   "depth": 0,
   "text": "i really don't like this surge of dramatic tension, the appeal of the first season were fun character interactions, and a somewhat sense of awereness, and i think this season has been deviating from that, and it's suffering because of it, i'll give it one more episode or two, then if it doesn't change, i'll probably drop it"
  },
  {
   "score": 7,
   "id": "dhqvcia",
   "pid": "t1_dhqtted",
   "date": "2017-05-18 16:56:15",
   "depth": 1,
   "text": "The truth is it's hard to please everyone.  \n\nI think from the start Saekano viewers were divided into 3 camps - those coming for something \"tasteful\" / \"profound\" quickly dismissed this show based on episode 0 for \"pretending\" to be self-aware and smart while lowering itself to the same harem tropes - these people dropped it quickly or continued watching simply to make fun of it (you can look up most anime bloggers' initial reactions from season 1 and 2 and witness this attitude quite clearly); those coming for a simple rom-com / harem / ecchi show were glad to find a high quality show that is self-aware, with witty dialogues and very likable characters; and then there are the LN readers and White Album 2 fans who knew exactly what to expect from Fumiaki Maruto, a master of character building and emotional manipulation, and saw through all the harem antics as smoke and mirrors.  This group has been waiting patiently for two years for the delicious drama to kick into high gears.  Surely the sudden surge of dramatic tension would alienate some fans from the second camp, but I personally think the show is finally revealing its full potential as a touching romantic drama with realistic and complex characters.\n\nBy the way, despite his track record with White Album 2, Maruto actually can do happy endings based on his earlier works."
  },
  {
   "score": 1,
   "id": "dhqwtds",
   "pid": "t1_dhqvcia",
   "date": "2017-05-18 17:29:12",
   "depth": 2,
   "text": "> but I personally think the show is finally revealing its full potential as a touching romantic drama with realistic and complex characters.\n\ni could argue endlessly about the errors of this part, but for a second lets assume you are right, this anime from this point onwards turns into an anime version of a shakespeare play, why do this halfway into season 2?, considering this is likely not even going to get a season 3 (considering this is anime lets be real), why make this huge turn?, i can't say this is a good decision\n\n> and then there are the LN readers and White Album 2 fans who knew exactly what to expect from Fumiaki Maruto, a master of character building and emotional manipulation, and saw through all the harem antics as smoke and mirrors. This group has been waiting patiently for two years for the delicious drama to kick into high gears\n\nso if you say people in camp number one left, and people from the second get somewhat alienated you are basically saying that only ln readers and white album fans can *get* saekano, really?"
  },
  {
   "score": 3,
   "id": "dhqx627",
   "pid": "t1_dhqwtds",
   "date": "2017-05-18 17:37:02",
   "depth": 3,
   "text": "Problem is, by the time Season 1 started airing in winter 2015, what you are seeing now is already published as LN... What could they do? Not adapting beyond Season 1 despite the commercial success or throw away the source material?"
  },
  {
   "score": -1,
   "id": "dhqxjnq",
   "pid": "t1_dhqx627",
   "date": "2017-05-18 17:45:34",
   "depth": 4,
   "text": "i'm not really blaming A1, i'm blaming who ever wrote this, do japanese people like this?, how would you feel, if halfway into a storm of swords the book sudenly turned into a romance solely dedicated to the hound and a bar whore?"
  },
  {
   "score": 4,
   "id": "dhr1qim",
   "pid": "t1_dhqxjnq",
   "date": "2017-05-18 19:22:04",
   "depth": 5,
   "text": "Harem romcoms have always turned serious towards the end. Haganai, Yahari, OreImo, etc., as the story winds down and romantic plotlines are tied up, things get more serious. "
  },
  {
   "score": -1,
   "id": "dhr2c4y",
   "pid": "t1_dhr1qim",
   "date": "2017-05-18 19:35:59",
   "depth": 6,
   "text": "neither of those examples has a tone shift like this one, you know that right?"
  },
  {
   "score": 4,
   "id": "dhr4icx",
   "pid": "t1_dhr2c4y",
   "date": "2017-05-18 20:27:35",
   "depth": 7,
   "text": "I distinctly remember the comedy being practically gone in Yahari S2. Haganai at the very least got serious in the last few episodes with \"eh nandatte\". I honestly don't remember much about OreImo but that had a fist fight. "
  },
  {
   "score": -1,
   "id": "dhr4qaq",
   "pid": "t1_dhr4icx",
   "date": "2017-05-18 20:33:00",
   "depth": 8,
   "text": "yeah, but the stuff they fight about in those shows is in the first episodes, hachiman has discussions about his ideals in like episode 2, and oreimo had the sister being a bitch to the mc, signifing what was gonna happen, and honestly the thing in haganai was so far into the show, almost at the end of it, that completely forgot it existed, the same can't be said about saekano"
  },
  {
   "score": 6,
   "id": "dhr4m60",
   "pid": "t1_dhr2c4y",
   "date": "2017-05-18 20:30:08",
   "depth": 7,
   "text": "Not sure what you're on about. \n\nOf course they have similar tone shifts."
  },
  {
   "score": 4,
   "id": "dhqym2v",
   "pid": "t1_dhqxjnq",
   "date": "2017-05-18 18:09:47",
   "depth": 5,
   "text": "The LN sale just broke 2.5 million copies, and Season 1 BD sold close 10k copies, so I would say Japanese fans actually don't mind it that much... I would expect S2 BD figures to be a bit lower though, which is not that surprising.\n\nAs for the author, if you are familiar with his previous work like most Japanese fans, probably wouldn't be this surprised. It's like GRRM saying he will now write a lighthearted rom-com, you would have braced for something more spicy wouldn't you?"
  },
  {
   "score": 0,
   "id": "dhqz2cq",
   "pid": "t1_dhqym2v",
   "date": "2017-05-18 18:20:16",
   "depth": 6,
   "text": "if that rom-com represents saekano, then i would drop it halfway into book 1, because the rom-com was waiting too long to spice things up, and i got bored, assuming i'm a grrm fan in this metaphor, and if i weren't then see above"
  },
  {
   "score": 9,
   "id": "dhr4zwc",
   "pid": "t1_dhqwtds",
   "date": "2017-05-18 20:39:48",
   "depth": 3,
   "text": "I could similarly argue endlessly the errors of your argument. What makes you so damn sure that this show is not gonna get a season 3? SaeKano is a \"tier-1\" title alongside the likes of SAO (which will be getting a season 3 soon BTW), so not sure what's with your \"let's be real\" assumption here as though you know the industry inside out.\n\n>so if you say people in camp number one left, and people from the second get somewhat alienated you are basically saying that only ln readers and white album fans can get saekano, really?\n\nTalk about putting words in people's mouths.\n\nA few flaws in this argument:\n\n1. Not everyone in camp 1 left. And if they were previously making fun of it due to the misassumption that it is shallow, surely they would now be impressed or at least reassess their previously dismissive stance?\n\n2. People in the second get somewhat alienated? Really? I count myself as one of these, and I believe many anime-only folks here belong to this group as well and so far this change in tone has been well-received. The only one who's feeling alienated around here is you, I'm afraid. Stop trying to speak for the rest of us.\n\n3. /u/dene323 said the LN and WA readers gets SaeKano, but how on earth did you interpret that as ONLY they can get it is beyond me."
  },
  {
   "score": 1,
   "id": "dhqa7mh",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:22:15",
   "depth": 0,
   "text": "Aki-kun dun goofed."
  },
  {
   "score": 1,
   "id": "dhqaawi",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:23:50",
   "depth": 0,
   "text": "Between Megumi last season, and the two Megumis this season, I can't choose between them!"
  },
  {
   "score": 1,
   "id": "dhqak6q",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:28:27",
   "depth": 0,
   "text": "When I was watching the comiket scene this episode and hearing that uptune music that is usually used for ending a story arc, I could feel the uneasiness on what's going to happen after it. It's one of my highlights this episode.\n\nOh yeah, ALWAYS ANSWER YOUR PHONE GUYS."
  },
  {
   "score": 1,
   "id": "dhqeuap",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:43:13",
   "depth": 0,
   "text": "So can anyone pm me a way to read the light novel, cause I can't wait another week to know what happens."
  },
  {
   "score": 1,
   "id": "dhqgv9x",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 12:18:24",
   "depth": 0,
   "text": "so from now on it's just katou arc? "
  },
  {
   "score": 1,
   "id": "dhqpn8f",
   "pid": "t1_dhqgv9x",
   "date": "2017-05-18 14:55:27",
   "depth": 1,
   "text": "My body is ready. Bring on best girl."
  },
  {
   "score": 19,
   "id": "dhqikp8",
   "pid": "t1_dhqgv9x",
   "date": "2017-05-18 12:47:56",
   "depth": 1,
   "text": "We are now in episode 20 of Katou's arc."
  },
  {
   "score": 1,
   "id": "dhqh9tr",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 12:25:25",
   "depth": 0,
   "text": "AKI-KUN YOU DUN GOOFED"
  },
  {
   "score": 1,
   "id": "dhrgfb4",
   "pid": "t3_6bxd4w",
   "date": "2017-05-19 04:16:11",
   "depth": 0,
   "text": "It's all fun and games, until you pissed off the calmest girl."
  },
  {
   "score": 1,
   "id": "dhrhpyv",
   "pid": "t3_6bxd4w",
   "date": "2017-05-19 05:01:42",
   "depth": 0,
   "text": "Oh damn, you made best girl mad.  Aki, kill yourself."
  },
  {
   "score": 1,
   "id": "dhrojay",
   "pid": "t3_6bxd4w",
   "date": "2017-05-19 07:42:17",
   "depth": 0,
   "text": "Oh shit i wasn't expecting that the comiket would be in the middle of the season. So I guess they'll adapt the LN until vol 8 in this season?"
  },
  {
   "score": 1,
   "id": "dhspfen",
   "pid": "t3_6bxd4w",
   "date": "2017-05-19 20:27:15",
   "depth": 0,
   "text": "Can someone spoil for me why Utaha and Eriri leave blessings software?"
  },
  {
   "score": 1,
   "id": "dhrk776",
   "pid": "t3_6bxd4w",
   "date": "2017-05-19 06:10:59",
   "depth": 0,
   "text": "Megumi got pissed over him not talking, which is a pretty legitimate response if blown wildly out of proportion, but it intrigues me the Tomoya keeps going out of its way to say how hard she worked when as far as I can she she didn't really do anything:\n\n- Utaha wrote the script.\n- Eriri did the art.\n- Michiru (and her band) did the music.\n- Tomoya did the programming and held the team together.\n- Megumi... was there too? Modelled for Eriri? Occasionally made comments in meetings? I don't understand and haven't since S1 what her role is beyond fodder for Tomoyas fantasies.\n\nAs an aside, this season has made me lean much more towards Eriri, seeing her attitude towards the project; rolling with the punches and putting out what she could to get things done."
  },
  {
   "score": 1,
   "id": "dhqc10d",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:54:35",
   "depth": 0,
   "text": "Every time Katou told Aki to rely on her I knew this was coming. Can't really blame him, though, such is human nature. But, man, calm words of disappointment hit the hardest..."
  },
  {
   "score": 3,
   "id": "dhsnast",
   "pid": "t1_dhqc10d",
   "date": "2017-05-19 19:34:17",
   "depth": 1,
   "text": "I can, he was told multiple times by both Utaha and Katou to go to Nasu Kogen and Katou told him multiple times that she'd go with him. Instead he waits until the very last minute to go, blows Katou off and ignores her call. Dude had it coming and I'm so glad Katou did not let him get away with it."
  },
  {
   "score": 1,
   "id": "dhqey9m",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:45:06",
   "depth": 0,
   "text": "Now I wished this would be a Visual Novel. My god, every girl is officially best girl. There's no way this would end with satisfy ending unless you make a VN of this."
  },
  {
   "score": 1,
   "id": "dhrtw93",
   "pid": "t1_dhqey9m",
   "date": "2017-05-19 09:22:08",
   "depth": 1,
   "text": "Little did you know that your wish was already granted years ago.\n\nhttp://www.amiami.com/top/detail/detail?gcode=GAME-0013579\n\nThough you'll have to find another store."
  },
  {
   "score": 1,
   "id": "dhr6nrf",
   "pid": "t1_dhqey9m",
   "date": "2017-05-18 21:26:51",
   "depth": 1,
   "text": "Not a VN but the manga has both a Utaha route and an Eriri route. Utaha's is ongoing, Eriri's is finished. They both have fan translations.  "
  },
  {
   "score": 0,
   "id": "dhu3u4z",
   "pid": "t3_6bxd4w",
   "date": "2017-05-20 21:42:59",
   "depth": 0,
   "text": "umm... can someone ELI5 about katou's scene? i just cant understand it"
  },
  {
   "score": 0,
   "id": "dhu3u8o",
   "pid": "t3_6bxd4w",
   "date": "2017-05-20 21:43:05",
   "depth": 0,
   "text": "umm... can someone ELI5 about katou's scene? i just cant understand it"
  },
  {
   "score": -9,
   "id": "dhqb963",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 10:40:49",
   "depth": 0,
   "text": "Wtf katou has emotions?"
  },
  {
   "score": 0,
   "id": "dhr93ch",
   "pid": "t1_dhqb963",
   "date": "2017-05-18 22:45:34",
   "depth": 1,
   "text": "Please, sir, rise to the top as a lifejacket in water. This is hilarious."
  },
  {
   "score": -1,
   "id": "dhqexr4",
   "pid": "t3_6bxd4w",
   "date": "2017-05-18 11:44:52",
   "depth": 0,
   "text": "As a Eriri fan I hope Kazusa's VA from White Album teaches Eriri how to cuck Kato >:)"
  },
  {
   "score": 1,
   "id": "dhqkwil",
   "pid": "t1_dhqexr4",
   "date": "2017-05-18 13:27:45",
   "depth": 1,
   "text": "Lol that's not gonma happen because [spoiler](/s \"Tomoya later falls in love with Kato and confessed his feelings for her in Vol. 12. Katou is his number one now\")"
  },
  {
   "score": 3,
   "id": "dhqge79",
   "pid": "t1_dhqexr4",
   "date": "2017-05-18 12:10:16",
   "depth": 1,
   "text": "If we are going with the WA2 analogy, Kato is the upgraded Setsuna - retaining the high emotional intelligence without the manipulation and martyr complex; while Utaha and Eriri splits Kazusa's appearance and personality.  It's not a fair fight to be honest...\n\nI sometimes think Seakano is Maruto's secret revenge for Setsuna..."
  }
 ]
}