{
 "score": 296,
 "id": "6glst8",
 "num_comments": 79,
 "date": "2017-06-11 08:01:01",
 "comments": [
  {
   "score": 61,
   "id": "dir973d",
   "pid": "t3_6glst8",
   "date": "2017-06-11 08:24:18",
   "depth": 0,
   "text": "I wonder if white hair guy is finally gonna show up again and that is how they are gonna get out of Wonderland...\n\nAlso Wonderland seemed pretty cool, reminded me of Flip Flappers, wish we could have spent more time there."
  },
  {
   "score": 8,
   "id": "dirl06w",
   "pid": "t1_dir973d",
   "date": "2017-06-11 12:55:13",
   "depth": 1,
   "text": "That is actually a really good theory. I forgot about the white haired dude, but I did think he would return to maybe try and kidnap Sana one last time. But recuse her? That would be a really interesting development."
  },
  {
   "score": 34,
   "id": "dirarqu",
   "pid": "t3_6glst8",
   "date": "2017-06-11 09:02:03",
   "depth": 0,
   "text": "When the house fell down that rabbit was like:\" Well, screw you all, I'm outta here\"."
  },
  {
   "score": 37,
   "id": "dirchfa",
   "pid": "t3_6glst8",
   "date": "2017-06-11 09:42:37",
   "depth": 0,
   "text": "Multiple Dreams of Alice showing up seems scary, This episode was really intense and fun to watch."
  },
  {
   "score": 10,
   "id": "dirkrby",
   "pid": "t1_dirchfa",
   "date": "2017-06-11 12:49:54",
   "depth": 1,
   "text": "Yeah, I wonder what is going to happen because how do they play off Ferris wheels suddenly appearing in Tokyo and hundreds of random people suddenly getting magical powers?"
  },
  {
   "score": 5,
   "id": "dirl9ad",
   "pid": "t1_dirkrby",
   "date": "2017-06-11 13:00:40",
   "depth": 2,
   "text": "I don't want to imagine what would happen lol, what would happen if Dreams of Alice applied to IRL and lots of people started getting it?"
  },
  {
   "score": 19,
   "id": "dirmxat",
   "pid": "t1_dirl9ad",
   "date": "2017-06-11 13:37:05",
   "depth": 3,
   "text": "Dunno, but if I was one of the people who didn't get one I'd be pissed.  \n[](#nicoisdone)"
  },
  {
   "score": 1,
   "id": "dirmzbg",
   "pid": "t1_dirmxat",
   "date": "2017-06-11 13:38:21",
   "depth": 4,
   "text": "What would you do with your Dreams of Alice power?"
  },
  {
   "score": 2,
   "id": "dirnkjd",
   "pid": "t1_dirmzbg",
   "date": "2017-06-11 13:51:14",
   "depth": 5,
   "text": "Depends on the power, but probably just whatever it seems practical to use it for at the moment.  \n[](#nicoisdone)"
  },
  {
   "score": 1,
   "id": "dirqlcv",
   "pid": "t1_dirnkjd",
   "date": "2017-06-11 15:00:13",
   "depth": 6,
   "text": "I'd solve world-wide problems."
  },
  {
   "score": 16,
   "id": "dirzg6e",
   "pid": "t1_dirqlcv",
   "date": "2017-06-11 18:18:01",
   "depth": 7,
   "text": "I'm going to take this potato chip and eat it."
  },
  {
   "score": 1,
   "id": "disnjjs",
   "pid": "t1_dirzg6e",
   "date": "2017-06-12 07:02:45",
   "depth": 8,
   "text": "Yep!"
  },
  {
   "score": 36,
   "id": "dirldzt",
   "pid": "t3_6glst8",
   "date": "2017-06-11 13:03:32",
   "depth": 0,
   "text": "I actually like that Sana's behaviour and speech is consistently that of a child, especially one with an extremely abnormal upbringing.\n\nAll those people getting powers should make things interesting, though I was expecting one of the normal cast to suddenly get some."
  },
  {
   "score": 4,
   "id": "disaafr",
   "pid": "t1_dirldzt",
   "date": "2017-06-11 22:53:34",
   "depth": 1,
   "text": "I like Sana's behavior too. Often in anime, a child will act childish at first and become mature for 2 or 3 episode later. Seeing Sana really make her looks like a fresh child character"
  },
  {
   "score": 21,
   "id": "dirw79j",
   "pid": "t1_dirldzt",
   "date": "2017-06-11 17:05:35",
   "depth": 1,
   "text": "She's one of the best written actual child characters I've seen "
  },
  {
   "score": 24,
   "id": "dir8z9q",
   "pid": "t3_6glst8",
   "date": "2017-06-11 08:18:50",
   "depth": 0,
   "text": "Urusai! Urusai! Urusai! Urusai! Urusai! Urusai!\n\nAnyone reminded of [this red head](http://imgur.com/yJWl13N) when Sana screams urusai so many times? (JC Staff seems to like to do this a lot...)\n\nAnyway, I was expecting that ending, since both girls cancel each other's powers out. Hence, Sana's dream world will collapse and both will be in trouble when both use their powers simultaneously. What I didn't expect is the implications of Sana's power breakdown, and how the both of them ended up in a crevice. \n\nLooking forward to the next episode!\n\nEdit: Sana's name"
  },
  {
   "score": 42,
   "id": "dirbr5l",
   "pid": "t3_6glst8",
   "date": "2017-06-11 09:25:21",
   "depth": 0,
   "text": "It is frustrating to watch, but it is an accurate depiction of how a young kid who are just experiencing new things to not know how to word them or how to deal with them. This causes a lot of issues to arise from the simplest of all things. I still can't understand why Hatori's power cancels out with Sana's power if Sana is the power itself given a physical state. Two episodes left and there are plenty of questions left to answer."
  },
  {
   "score": 2,
   "id": "diswoez",
   "pid": "t1_dirbr5l",
   "date": "2017-06-12 09:57:44",
   "depth": 1,
   "text": "Can't tell anything about Hatori's power, but as for Sana and her being power itself. It was explained earlier that Sana at first wasn't even human, person, or living being. Just pure phenomena reacting to thoughts of person. So Sana as a person more of a product of power than power itself. That's why despite being origin of phenomena Sana needs to eat to perform miracles. That's also probably why Hatori's and Sana's powers can cancel each other, despite background of Sana."
  },
  {
   "score": 16,
   "id": "dis7tjv",
   "pid": "t1_dirbr5l",
   "date": "2017-06-11 21:35:31",
   "depth": 1,
   "text": "My guess is that Sana's and Hatori's powers are actually very similar. They are the only 2 powers that have ever truly \"created\" something that previously did not exist. All other powers we've seen are the manifestations of a desire for a single thing that has already existed.\n\nInstead, Sana and Hatori actually create/have mastery over one half of existence/reality. Hatori can create the \"soul\" -- artificial personalities, memories, emotions that inhabit the \"material\". Sana can create the \"material\", \"matter' or the \"body\" -- anything physical she can dream of, she can bring into existence. But she cannot control the mind, the memories, the \"soul\" like Hatori can.\n\nReading into the esoteric imagery from the classic Alice & Wonderland story, Sana and Hatori's powers together seem to make up the \"dual\" nature of life and existence. The Body and the Soul, the Spiritual and the Material. One who has complete mastery of one cannot have mastery over the other -- they are equally god over one half of the human experience. Even inside Sana's physical \"Wonderland\" she's never been able to control the thoughts or emotions of those who enter it. Only their physical experience."
  },
  {
   "score": 1,
   "id": "dixty2v",
   "pid": "t1_dis7tjv",
   "date": "2017-06-15 07:29:28",
   "depth": 2,
   "text": "Interesting theory, but I don't agree. Hatori's power is still \"one\" power (or card), even if it is a powerful one and I don't even see, where she should have really created something and even this \"mastery\" isn't perfect. We already heard, the effects were of in time, if she's not close by. \n\nSana, on the other hand, has the power to use \"any\" card, that she can imagine, so far.\n\nSo, why hasn't Sana used it to control people? Hard to tell, but well, I think the reason lies in her personality, that's just a thing, that's totally impossible to imagine for her. Human or not, she's still a little girl. \nThat (knowing / Imagination to control people) changed in the last episodes possibly, but now it's a cruel thing for her, something, she would never do to anyone, then whatever Sana is, she's actually very kindhearted."
  },
  {
   "score": 5,
   "id": "dis81cm",
   "pid": "t1_dis7tjv",
   "date": "2017-06-11 21:41:54",
   "depth": 2,
   "text": "Oh wow, that is actually incredible. I've only read Alice in Wonderland when I was a kid and I honestly don't remember much from it. They are very adamant about the tie ups so this just could be it. That was a nice read and insight, thank you for that."
  },
  {
   "score": 15,
   "id": "dirfe4v",
   "pid": "t1_dirbr5l",
   "date": "2017-06-11 10:49:26",
   "depth": 1,
   "text": "A few episodes ago Sana's card went into some kind of error mode, maybe because of this it breaks when in contact with another power, and it's just coincidence that Hatori's was the first she came into direct contact with"
  },
  {
   "score": 8,
   "id": "dirltan",
   "pid": "t1_dirfe4v",
   "date": "2017-06-11 13:13:05",
   "depth": 2,
   "text": "Yeah, I think it's wrong to imagine Hatori's power as a power as strong as Sana's and they cancel each other out, it's more like a rock thrown into gears, a small power that by mere coincidence makes the stronger one break upon contact."
  },
  {
   "score": 2,
   "id": "dirmw7l",
   "pid": "t1_dirltan",
   "date": "2017-06-11 13:36:25",
   "depth": 3,
   "text": "Could be that no power is really stronger than any other powers, differing only in what the power is. Could simply be that their powers are in some way opposites and act upon each other with destructive interference.  \n[](#nicoisdone)"
  },
  {
   "score": 56,
   "id": "dir9tvy",
   "pid": "t3_6glst8",
   "date": "2017-06-11 08:39:49",
   "depth": 0,
   "text": "I didn't expect that much plot from this arc! The multiple Dreams of Alice showing up?? No way they touch on all the by season's end.\n\nAlso is anyone else tired of the \"_frazzled_\" line?"
  },
  {
   "score": 2,
   "id": "dirk6dv",
   "pid": "t1_dir9tvy",
   "date": "2017-06-11 12:37:29",
   "depth": 1,
   "text": "I am getting tired of the \"frazzled\" line too. It is the same bit every time:\nSana says, \"ahh I feel frazzled\"\nSome other character always asks, \"what does frazzled mean\"\nand she always replies with... \"frazzled means frazzled!\""
  },
  {
   "score": 6,
   "id": "diray3n",
   "pid": "t1_dir9tvy",
   "date": "2017-06-11 09:06:15",
   "depth": 1,
   "text": "> Also is anyone else tired of the \"frazzled\" line?\n\n+1\n\nIt was cute at first, but she uses it too much in this episode to the point of being annoying."
  },
  {
   "score": 27,
   "id": "dirlat1",
   "pid": "t1_diray3n",
   "date": "2017-06-11 13:01:36",
   "depth": 2,
   "text": "But that is how kids behave.\n\nKids are often annoying, especially when they deal with issues they cannot handle on their own.  I am glad this show does a genuine portrayal of young children, as opposed to the distorted adult versions that other animes like to do."
  },
  {
   "score": 17,
   "id": "dira800",
   "pid": "t1_dir9tvy",
   "date": "2017-06-11 08:49:19",
   "depth": 1,
   "text": "I guess it very appropriately explains Sana's emotions. Sana has no idea what those emotions are, but know that they are emotions of irritation, hence the \"mosha mosha\" line. \n\nI agree that it is kinda irritating and tiring though, but it perfectly shows how much Sana is progressing as a person, and how she is slowly beginning to understand herself. "
  },
  {
   "score": 2,
   "id": "diraad6",
   "pid": "t1_dira800",
   "date": "2017-06-11 08:50:48",
   "depth": 2,
   "text": "Yeah I like what it shows and represents but I'm just really tired of hearing _mosha mosha_..."
  },
  {
   "score": 88,
   "id": "dirah12",
   "pid": "t1_dir9tvy",
   "date": "2017-06-11 08:55:08",
   "depth": 1,
   "text": "It's annoying to hear, but also a very accurate representation of how a 9 year old kid would act when she has no idea what these emotions mean but is forced to deal with them."
  },
  {
   "score": 8,
   "id": "dirpsxe",
   "pid": "t1_dirah12",
   "date": "2017-06-11 14:41:59",
   "depth": 2,
   "text": "But it's also a bad translation, since \"frazzled\" is a real word, while to everyone in the show \"mushi-mushi\" seems like gibberish."
  },
  {
   "score": 6,
   "id": "dis60ab",
   "pid": "t1_dirpsxe",
   "date": "2017-06-11 20:44:45",
   "depth": 3,
   "text": "Yeah, it should be like \"I'm feeling Harbericked!\""
  },
  {
   "score": 14,
   "id": "dis7ow8",
   "pid": "t1_dirpsxe",
   "date": "2017-06-11 21:31:28",
   "depth": 3,
   "text": "She's saying, [mosha-mosha](http://jisho.org/search/moshamosha), which is 100% a real mimetic word, meaning ragged, disheveled, and kinda torn up and a mess."
  },
  {
   "score": 1,
   "id": "dis7tpc",
   "pid": "t1_dis7ow8",
   "date": "2017-06-11 21:35:39",
   "depth": 4,
   "text": "Hmm, well it doesn't seem like a term usually used to describe your state of mind, while \"frazzled\" certainly is.  Frazzled also means \"worn-out; fatigued\" which doesn't quite go with mosha-mosha anyway."
  },
  {
   "score": 21,
   "id": "dirahzy",
   "pid": "t1_dirah12",
   "date": "2017-06-11 08:55:45",
   "depth": 2,
   "text": "Especially one who is still new to emotions and dealing with people!"
  },
  {
   "score": 33,
   "id": "dirj0ox",
   "pid": "t1_dirah12",
   "date": "2017-06-11 12:11:44",
   "depth": 2,
   "text": "In this thread, a lot of people who, as adults, haven't spent a lot of time around children.\n\nSadly, a lot of 'grown ups' tend to latch onto annoying and repetitive things themselves while never noticing the similarity - like cigarettes (...and memes ...and zombies)."
  },
  {
   "score": 8,
   "id": "divo5oa",
   "pid": "t1_dirj0ox",
   "date": "2017-06-13 22:07:29",
   "depth": 3,
   "text": "> annoying and repetitive things\n\n>Memes\n\nDon't you dare shit talk my memes. My memes are dank as f."
  },
  {
   "score": 14,
   "id": "dirax6i",
   "pid": "t3_6glst8",
   "date": "2017-06-11 09:05:38",
   "depth": 0,
   "text": "The transition to plot was handled really well here. I still love Sana and this doesn't feel like the show decided to change its focus so much as a natural extension of the themes getting Sana in to trouble. I was worried it might feel forced trying to insert some drama to get an ending together but this episode really delivered.\n\nI desperately hope the show sells well, it can't wrap all this up, the source is still ongoing and I would love so much to see a season two unless they completely throw the ending."
  },
  {
   "score": 11,
   "id": "diratto",
   "pid": "t3_6glst8",
   "date": "2017-06-11 09:03:25",
   "depth": 0,
   "text": "I really like the development of both Sana and Ha-chan. Hopefully they will learn from one another and Ha-chan will come to terms with her powers."
  },
  {
   "score": 11,
   "id": "dird0z7",
   "pid": "t3_6glst8",
   "date": "2017-06-11 09:55:13",
   "depth": 0,
   "text": "I figured frazzled means confused"
  },
  {
   "score": 5,
   "id": "dirsovs",
   "pid": "t1_dird0z7",
   "date": "2017-06-11 15:47:03",
   "depth": 1,
   "text": "I'm mentally translating it as \"irritated\""
  },
  {
   "score": 17,
   "id": "dirw581",
   "pid": "t1_dirsovs",
   "date": "2017-06-11 17:04:22",
   "depth": 2,
   "text": "it doesnt mean irritated, it means 'I don't understand what I'm feeling, and I can't express it as I'm having emotions I've never had before'"
  },
  {
   "score": 25,
   "id": "dirtw0u",
   "pid": "t1_dird0z7",
   "date": "2017-06-11 16:12:37",
   "depth": 1,
   "text": "nah it just means frazzled"
  },
  {
   "score": 3,
   "id": "diumdnt",
   "pid": "t1_dirtw0u",
   "date": "2017-06-13 09:41:51",
   "depth": 2,
   "text": "Agreed, there isn't really a single real word to express what Sana feels when she says  she's frazzled. It's confusion, but also being powerless, not getting what's going on, being frustrated, unable to word her feelings to seek help,  and not knowing what to do even though you should be capable of doing it.\n\nAdults would just say \"confused and uncomfortable\" and expect everyone to get the general feeling."
  },
  {
   "score": 1,
   "id": "divt28z",
   "pid": "t1_diumdnt",
   "date": "2017-06-14 01:10:07",
   "depth": 3,
   "text": "it's probably just empathy, the tropiest emotion when it comes to nonbiological humanlike beings in sci fi.\n\nshe used to be a selfish queen, but now, after being taught common sense and whatnot, she's maturing into Alice."
  },
  {
   "score": 12,
   "id": "dirpav6",
   "pid": "t3_6glst8",
   "date": "2017-06-11 14:30:40",
   "depth": 0,
   "text": "Sana trying to adult?\n\n[lol](#laughter)\n\nAnd despite the dangers, Zouroku straight up adulting and likely gonna open up a can of scolding on Sana. Really curious how Sana will deal with her \"frazzleness\" with Ha-chan.\n\nOh boy this show has been quite the ride so far. Most of us expected this show to be a SoL. Then after the first episode we thought it's gonna be some kind of escape story but the show solves it rather quickly. And now we're in another arc with the ending coming up soon.\n\nI'm really interested to seeing what people would think of this show and how to describe it after it airs. \n\n\n"
  },
  {
   "score": 2,
   "id": "dirsswg",
   "pid": "t1_dirpav6",
   "date": "2017-06-11 15:49:22",
   "depth": 1,
   "text": "I'll just call it a \"good Yuuki Yuuna wannabe\""
  },
  {
   "score": 5,
   "id": "disjs3e",
   "pid": "t3_6glst8",
   "date": "2017-06-12 05:28:09",
   "depth": 0,
   "text": "So because everybody has already discussed the episode (living in Europe I always come late to this threads...) I'm surprised nobody talked about the music. I think this show has a decent choice of soundtrack, but everytime they choose a song with lyrics I absolutely love it. The opening, the ending and this time the song when Ha-chan enters Wonderland I found absolutely breathtaking.\n\nIt also helps that I love songs that have that \"musicbox\" feeling. If someone likes that as well, I suggest listening to [Wermland](https://www.youtube.com/watch?v=f8NxWm8eYd4&list=PL2B4A7C790C7C5764), by  Detektivbyrån. It's instrumental, but wonderful nonetheless."
  },
  {
   "score": 6,
   "id": "dirtap1",
   "pid": "t3_6glst8",
   "date": "2017-06-11 15:59:54",
   "depth": 0,
   "text": "I really liked this episode, Sana's personallity and acting is just like any other kid's, that's really amusing and, I guess, fairly realistic (thumbs up to J.C.Staff.).\n\n[Two in the](http://imgur.com/NRSWFUZ) [same](http://imgur.com/MLKjddF) [week](https://i.imgur.com/P6FXcq2.jpg), both of them are like \"Coudn't care less about this\".\n\nAlso we've got some (what I deem as) nice [wallapers](http://imgur.com/a/axm8T)."
  },
  {
   "score": 4,
   "id": "dire83m",
   "pid": "t3_6glst8",
   "date": "2017-06-11 10:22:55",
   "depth": 0,
   "text": "I don't think its emotions, I think her human brain is just having hard time coping with the insurmountable power. Its gota go somewhere. Probably in these errors. If you notice she has way more energy and she talks faster and gets lost on different things, switching around. \n\nThat godly entity has no where to go but through Sana.\n\nTry to understand that she is basically running like an Infinity core cpu inside a potato."
  },
  {
   "score": 3,
   "id": "dirkq3i",
   "pid": "t3_6glst8",
   "date": "2017-06-11 12:49:08",
   "depth": 0,
   "text": "Jodorowsky? Like The Holy Mountain Jodorowsky? I'm pretty sure that Wonderland didn't have anything to do with naked people throwing rocks at Jesus before Jesus goes to Mexico to watch Germans in gas masks waltz in a pre party for the great Mayan vs Conquistador frog lizard war that takes place before he meets the alchemist..."
  },
  {
   "score": 1,
   "id": "dirmoul",
   "pid": "t1_dirkq3i",
   "date": "2017-06-11 13:31:54",
   "depth": 1,
   "text": "I'm sorry what? Please explain."
  },
  {
   "score": 2,
   "id": "dirmry1",
   "pid": "t1_dirmoul",
   "date": "2017-06-11 13:33:47",
   "depth": 2,
   "text": "[the ~~perfect~~ film](https://en.wikipedia.org/wiki/The_Holy_Mountain_(1973_film)"
  },
  {
   "score": 8,
   "id": "dirvz50",
   "pid": "t1_dirkq3i",
   "date": "2017-06-11 17:00:28",
   "depth": 1,
   "text": "I think it was a Dune reference, since the ships in Dune travel by folding space, not unlike the way that wonderland is basically folded space.  Jodorowsky was supposed to be the director of the movie adaptation, but his version was never made, and there was a documentary a few years back about it.\n\nSame director though."
  },
  {
   "score": 2,
   "id": "dirs347",
   "pid": "t3_6glst8",
   "date": "2017-06-11 15:33:30",
   "depth": 0,
   "text": "this show is amazing, it's basically its own niche, but it's amazing. Sana's childish behavior is amazingly portrayed and fun to watch."
  },
  {
   "score": 2,
   "id": "disds7y",
   "pid": "t3_6glst8",
   "date": "2017-06-12 01:16:19",
   "depth": 0,
   "text": "This episode was incredible; I really can't express how much I adore the Wonderland setting in anime.  This episode's depiction was spot on.  It really felt like a whimsical, mysterious world where anything is possible.  What's more, it has that edge of darkness in the background that really perks my interest.  \n\n&nbsp;\n\nI would love to see an anime that takes place exclusively in a Wonderland setting.  *Pandora Hearts* and *Flip Flappers* come close, but I think this series is honestly the best I've seen of it so far."
  },
  {
   "score": 1,
   "id": "dircmom",
   "pid": "t3_6glst8",
   "date": "2017-06-11 09:46:02",
   "depth": 0,
   "text": "So no one has explained to Sana-chan how emotions work? Seriously, if only she talked to Zoroku and Sanae about it she would be able to explain this \"frazzled\" feeling she's always having. \n\nI guess I kinda like how she's discovering these things herself, which is really a part of growing up. Also I think this will also be a good time for Sana to learn what Good and Evil is and how it's not always black and white. I just wonder how they'll get out of this mess."
  },
  {
   "score": 1,
   "id": "dirfwtv",
   "pid": "t3_6glst8",
   "date": "2017-06-11 11:01:14",
   "depth": 0,
   "text": "I'm still confused, so Wonderland is the place Sana created with her power that she trapped Ha-chan in?  And its causing other Dreams of Alice to show up?\nThings are getting intense now the finale is coming up, hope things are wrapped up in a satisfying way!"
  },
  {
   "score": 1,
   "id": "dirk7lm",
   "pid": "t3_6glst8",
   "date": "2017-06-11 12:38:12",
   "depth": 0,
   "text": "I always felt sorry for that one unlucky girl whose Looking Glass produced that Ferris Wheel, not only cause of being responsible such a huge catastrophe but imagine the energy loss and shock for a person unaccustomed to using that ability!"
  },
  {
   "score": 1,
   "id": "dirlfu9",
   "pid": "t3_6glst8",
   "date": "2017-06-11 13:04:40",
   "depth": 0,
   "text": "So it seemed like the wonderland that Sana created to hold the two girls were pretty much a \"time out\" area thought up by Sana so that they would sit there and have to think about what they did wrong, kinda makes sense from a kids perspective "
  },
  {
   "score": 1,
   "id": "dirw47l",
   "pid": "t1_dirlfu9",
   "date": "2017-06-11 17:03:46",
   "depth": 1,
   "text": "Kind of.  Since she had already created it, it was more like her romper room, and the research facility was built on top of it.  It just never went away.  And apparently toilets are the ideal location to link it to."
  },
  {
   "score": 1,
   "id": "dirnooj",
   "pid": "t3_6glst8",
   "date": "2017-06-11 13:53:48",
   "depth": 0,
   "text": "This keeps getting better with each and every episode."
  },
  {
   "score": 1,
   "id": "dirpqo2",
   "pid": "t3_6glst8",
   "date": "2017-06-11 14:40:32",
   "depth": 0,
   "text": "Well that escalated quickly.  Wonder how much carnage there will be with dozens or hundreds of thousands brand new dreams of Alice.  Probably not much since this show seems to avoid people getting seriously harmed.\n\nI'm also wondering about the large difference between the magical Wonderland and those little sections that look like they were drawn in crayons.  "
  },
  {
   "score": 1,
   "id": "disary9",
   "pid": "t3_6glst8",
   "date": "2017-06-11 23:11:23",
   "depth": 0,
   "text": "I like how this author wrote kids realistically. Least the manga's been licensed so I may actually keep up with this after the anime."
  },
  {
   "score": 1,
   "id": "diwm7z0",
   "pid": "t1_disary9",
   "date": "2017-06-14 12:26:04",
   "depth": 1,
   "text": "It has?  Who grabbed it?"
  },
  {
   "score": 1,
   "id": "diwn3sb",
   "pid": "t1_diwm7z0",
   "date": "2017-06-14 12:41:46",
   "depth": 2,
   "text": "I can't recall off the top of my head. It's on the MAL page for the manga."
  },
  {
   "score": 1,
   "id": "dise40j",
   "pid": "t3_6glst8",
   "date": "2017-06-12 01:31:52",
   "depth": 0,
   "text": "Woah, this was actually a pretty great episode. Clearly-defined emotional conflict, creative visuals, and adorable to boot. "
  },
  {
   "score": 1,
   "id": "dixtfl9",
   "pid": "t3_6glst8",
   "date": "2017-06-15 07:19:28",
   "depth": 0,
   "text": "It looked a bit, like their dream of Alice cancelt each other out at first. But, seeing now that wonderland is growing and multiple Dreams of Alice are activating, I think, it's not what's happen here. The power is strong as ever, but I think, Sana has temporarily lost the control over it. (on an notice: I don't know the manga)."
  },
  {
   "score": -8,
   "id": "diraw30",
   "pid": "t3_6glst8",
   "date": "2017-06-11 09:04:56",
   "depth": 0,
   "text": "I'm totally hating this episode.\n\nFirst, Sana's attitude is beyond redeemable. You would expect she would have better manners after all this time she's been living under Zouroku's roof and under Sanae's guard. She just acts as an annoying brat not even listening to what Ayu & Hatori have to say, even though both apologized.\n\nSecond, Ichijou and the rest of the research team talk so casually about Wonderland when there hasn't been any explanation previously to this other world or phenomenom.\n\nThird, there no explanation either why sana is able to transport people to this wonderland plane. And apparently all the troubles caused because of the energy consumed to create whatever Sana has on her mind is already gone."
  },
  {
   "score": 5,
   "id": "diy34co",
   "pid": "t1_diraw30",
   "date": "2017-06-15 10:13:28",
   "depth": 1,
   "text": "Beyond redeemable? She's a 9 year old kid who, despite having lived with Sanae and Zoroku for a while now (not very long tho), has had minimal contact with other people and still hasn't grown accustomed to basic human interactions. You can't expect a 9 year old who has pretty much been cooped in a laboratory her whole life to act like a grown up and be mature, that's just absurd and unreasonable. She doesn't even understand her own emotions for crying out loud so all she can do is describe them as \"I feel frazzled\".\n\nNow, on to the part where I **really** disagree with you. You say Sana is beyond redeemable, yet defend Hatori and act like she's done no wrong in the same paragraph. Maybe because you sympathize with her more than Sana?\n Hatori is **much** worse than Sana. I wouldn't say I think Hatori is beyond redeemable like you did with Sana (her situation is regrettable), but I certainly find it hard to sympathize with her. Hatori ran around and abused her powers to do bad things due to what essentially boils down to mommy and daddy issues, and it caused an adverse effect on everyone besides Sana. Everyone just froze up for Sana and she was all alone, scared and had no idea what was going on. When Sana first encountered the two amongst all the \"zombie\" people Hatori treated Sana with **hostility** upon seeing she was unaffected by her powers, and Hatori even pushed Sana down despite Hatori being the one at fault. \n\nYou say Sana hasn't listened to what Ayu and Hatori have to say, but she DID listen to what Ayu had to say in **this very episode**. Were you even paying attention? Also, when Hatori is in front of Sana while she's in the box she says \"I have nothing to say to you\" and then tries to victimize herself by saying \"You don't know anything\". So, as of right now, Hatori hasn't even TRIED to explain herself to Sana. Hatori even admitted last episode (or the episode before that, can't remember) that the whole situation must have been VERY scary for Sana and she admitted this episode that the things she's done is bad, and yet she STILL treats Sana with dismissal and hostility. Oh and Ayu apologized, but Hatori HAS NOT apologized. She said \"And I will apologize\". There's a difference between apologizing and saying you're **going to** apologize. With all this taken into consideration, Sana's animosity towards Hatori isn't just understandable...it's **justified**.\n\nYou just seem very biased against Sana without taking Hatori's attitude towards Sana or her own actions into account. \n\nStill, it's an opinion thing. You're entitled to your opinion, even though I wholly and completely disagree with it and cannot for the life of me understand how anyone can think the way you do."
  },
  {
   "score": 7,
   "id": "dirjqaq",
   "pid": "t1_diraw30",
   "date": "2017-06-11 12:27:43",
   "depth": 1,
   "text": "I understand if you are annoyed by Sana's attitude but I think calling her attitude beyond redeemable is a bit strong. She hasn't been living with Zouroku and Sanae for that long, she's only 9 years old and even then I would say her mental age is less than that because of all that time she spent in the research facility. "
  },
  {
   "score": -1,
   "id": "dirm7l4",
   "pid": "t1_dirjqaq",
   "date": "2017-06-11 13:21:37",
   "depth": 2,
   "text": "We don't know exactly how long has she been living with Zouroku, but it does feel like it's been weeks, probably even a couple of months or more. So that's some fair time for her to grow up and learn from the harsh Zouroku grampa how to behave.\n\nShe even made a promise with Zouroku that she wouldn't use her powers unless it's completely necesesary or as a last resort. Wich she doesn't, she's using them to get revenge at Ayu & Hatori wich they already apologized, but she's just butthurt and a simple apology doesn't cut it for her."
  },
  {
   "score": 4,
   "id": "dirp3l2",
   "pid": "t1_dirm7l4",
   "date": "2017-06-11 14:26:02",
   "depth": 3,
   "text": "> We don't know exactly how long has she been living with Zouroku, but it does feel like it's been weeks, probably even a couple of months or more. So that's some fair time for her to grow up and learn from the harsh Zouroku grampa how to behave.\n\nEven if it's a couple of months is that really long enough for someone to learn all of those important skills? Think about it. It takes most people 18 years or more to be able to grow up and mature and this isn't even a year.\n\n> She even made a promise with Zouroku that she wouldn't use her powers unless it's completely necesesary or as a last resort. Wich she doesn't, she's using them to get revenge at Ayu & Hatori wich they already apologized, but she's just butthurt and a simple apology doesn't cut it for her.\n\nYeah, and she messed up. People do that! But that doesn't mean people are beyond redeemablity, it just means that they messed up. People learn from mistakes and grow. That's what people do. Especially kids."
  },
  {
   "score": 1,
   "id": "diudca9",
   "pid": "t1_dirp3l2",
   "date": "2017-06-13 06:58:12",
   "depth": 4,
   "text": "> It takes most people 18 years or more to be able to grow up and mature and this isn't even a year.\n\nWe're not talking about maturity and independance here. We're talking about a kid growing up and stop acting like an unsupervised brat, and that goes from ages 9 to around 12 (hence the overused phrase you act like a 12 year old because that's the time when most kids with correct supervision stop acting so childish). Specially with a very harsh supervision from Zouroku we would expect some noticeable progress from what Sana was in the early episodes, but it seems we're going backwards on that regard.\n\n>Yeah, and she messed up. People do that!\n\nAnd Sana isn't even real, she's just a flawed character that it isn't even suposed to represent a real child. Those are just poor aguments trying to cover an unconsistant and poorly written work of fiction."
  },
  {
   "score": 12,
   "id": "dirhlnj",
   "pid": "t1_diraw30",
   "date": "2017-06-11 11:39:15",
   "depth": 1,
   "text": "IIRC, in the first arc of the series, they explained that Sana is actually the embodiment of Wonderland.  She is basically a god, which is why so many researchers and Minnie C were after her in the first arc: to learn how to develop and utilize this power.\n\nThe energy consumption is only an issue if the user is malnourished.  The research facility intentionally underfed her so that in the eventuality that she does escape, she wouldn't go too far.  Since Sana is living under a fairly stable household, that shouldn't ever be an issue now.\n\nAnd, c'mon, she's like nine years old, if that.  Cut her some slack for just being a kid."
  },
  {
   "score": -2,
   "id": "dirlz86",
   "pid": "t1_dirhlnj",
   "date": "2017-06-11 13:16:44",
   "depth": 2,
   "text": ">they explained that Sana is actually the embodiment of Wonderland.\n\nThey barely scratched the topic of wonderland. They did talk about Sana being an entity capable of materializing almost anything within her mind. But that doesn't connect one thing such as wonderland to her powers, you're just making the connection out of Lewis Carroll's Alice in Wonderland book, not because the show actually showed it and made sure it was something important to future episodes.\n\n>The energy consumption is only an issue if the user is malnourished.\n\nAnd also if the user abuses of her powers her energy lvls are reduced drastically. And by the amount of Sana's creations like the turtle, the portal, the rabbit, the big wooden door, the birdcage, one would think those would take their toll, but they haven't wich doesn't make sense from what they have told in the past.\n\n>And, c'mon, she's like nine years old, if that. Cut her some slack for just being a kid.\n\nI don't have to cut anyone slack, if you have your own opinion, fine. But I detest people who shove down their way of thinking into someone else's throat.\n"
  },
  {
   "score": 6,
   "id": "dirweo4",
   "pid": "t1_dirlz86",
   "date": "2017-06-11 17:10:04",
   "depth": 3,
   "text": "> And by the amount of Sana's creations like the turtle, the portal, the rabbit, the big wooden door, the birdcage, one would think those would take their toll, but they haven't wich doesn't make sense from what they have told in the past.\n\nShe was reusing a lot of things that she had already created, and it was already established that when she's well fed like a normal child, she has a lot more energy.  When they first found her child form, she basically created wonderland from the description in the book.  Once that level of power was understood, they started restricting her diet to control her powers better.\n\nAlso, I'm going to go out on a limb and guess that you either don't have kids or know anyone with kids."
  },
  {
   "score": 1,
   "id": "diud27y",
   "pid": "t1_dirweo4",
   "date": "2017-06-13 06:52:22",
   "depth": 4,
   "text": "> She was reusing a lot of things that she had already created\n\nThat's a load of BS from you. The show never stated that reusing materials or creations equals to a full refund or even a partial refund of the energy used.\n\n>and it was already established that when she's well fed like a normal child, she has a lot more energy.\n\nThank you captain obvious, what would we do without you? \n\nIn scale basis, how do you explain back in episode 2 when Sana eats a couple of hot cakes (around probably more than half of what a regular kid her age could stuff her stomach with) she feels completely depleted after creating a huge hot cake around 3/4 of real mass of what the turtle. I'm not even bringing up the fact that without any explanation a whole Ferris wheel materlized in the middle of Tokyo. There's a lot of inconsistencies without limitations on how much stuff can sana create.\n\n>Also, I'm going to go out on a limb and guess that you either don't have kids or know anyone with kids.\n\nAnd you fail big time. I don't have kids of my own, but I have plenty of nephews that vary from ages 8 to 18 that even I have helped supervise when their parents had to leave them on my care. Even the younger ones don't act like uneducated brats. They do pout or feel they don't want to obey sometimes, but they don't yell \"I'm so frazzled\" repeatedly with their loud voice."
  }
 ]
}