{
 "score": 609,
 "id": "6h8ff2",
 "num_comments": 180,
 "date": "2017-06-14 09:00:50",
 "comments": [
  {
   "score": 278,
   "id": "diwcbet",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:35:22",
   "depth": 0,
   "text": "Sandal-san continues to be a bro of unprecedented calibur."
  },
  {
   "score": 23,
   "id": "diz8nug",
   "pid": "t1_diwcbet",
   "date": "2017-06-16 03:37:02",
   "depth": 1,
   "text": "While everyone keeps mentioning he's one-eighth, no one's yet speculated on who among the current Manoyama locals Sandal might be distantly related to.\n\nThat would seem to potentially matter to a lot of things in the story."
  },
  {
   "score": 65,
   "id": "dix67t0",
   "pid": "t1_diwcbet",
   "date": "2017-06-14 19:08:43",
   "depth": 1,
   "text": "I read the \"unprecedented calibre\" in Sandal's voice."
  },
  {
   "score": 175,
   "id": "diwd0l0",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:46:57",
   "depth": 0,
   "text": "Sandal is a really interesting character that I'm glad is used for much more than a one-off comedic relief. I always wondered why they credit him in the opening credits as the original creator for the show (Alexandre S.D. Celibidache is his real name as per episode 5), and now I'm thinking that maybe from a very loose meta narrative, it's meant to be as if this is his retelling of the lovely area of Manoyama (to get people to visit, perhaps). \n\nAlso thought it a bit of a jump to have Riri sing in front of people so quickly, but it was very nice and emotional. I hope Chitose loosens up a bit because of this, her character seems to swing from being lukewarm to downright mean. "
  },
  {
   "score": 81,
   "id": "diwuo5y",
   "pid": "t1_diwd0l0",
   "date": "2017-06-14 14:59:19",
   "depth": 1,
   "text": "> Also thought it a bit of a jump to have Riri sing in front of people so quickly, but it was very nice and emotional.\n\nThat was my first thought too. But then I remembered Riri volunteered to step in for the missing actress a few episodes back.  \n \nSinging in front of a dozen people is probably a step down from acting in front of a camera, crew and professional actors.\n\nShe's painfully aware of her social anxiety and knows she has to venture outside her comfort zone to improve. I really admire and envy her strength and fearlessness to push through."
  },
  {
   "score": 30,
   "id": "dixbj4y",
   "pid": "t1_diwuo5y",
   "date": "2017-06-14 21:18:12",
   "depth": 2,
   "text": "So many things in this show hit home. I can relate to Riri the most probably"
  },
  {
   "score": 16,
   "id": "dixiz9s",
   "pid": "t1_dixbj4y",
   "date": "2017-06-15 01:49:03",
   "depth": 3,
   "text": "Mhm, same for me.   \nRiri's arc was handled with so much understanding and tact, I'm genuinely amazed. "
  },
  {
   "score": 106,
   "id": "diwj050",
   "pid": "t1_diwd0l0",
   "date": "2017-06-14 11:29:15",
   "depth": 1,
   "text": "As Sandal is the one who presents the next episode's previews, I've always seen him as the narrator of this story. Hence, he's like the studio's incarnation in the show (which would explain his name in the credits) and the very symbol of us being observers."
  },
  {
   "score": 17,
   "id": "diwl4nz",
   "pid": "t1_diwj050",
   "date": "2017-06-14 12:06:33",
   "depth": 2,
   "text": "I like this explanation"
  },
  {
   "score": 148,
   "id": "diwegf8",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:11:08",
   "depth": 0,
   "text": ">One eighth\n\n>Guild\n\n[that voice](#hnng)\n\nThat over with, this was another brilliant episode. I'm going to link back to my comment last week since a lot of what I said there holds true here too: https://www.reddit.com/r/anime/comments/6fucmh/spoilers_sakura_quest_episode_10_discussion/dil5wa0/\n\nWhen that guy just starts talking over Riri the moment she shows up, tells her she's 'ruining the mood' and says she's not 'normal'. Ohhh boy I know that feeling. You're shy to speak up at all, and when you try and someone else just starts speaking over you it's crushing; it feels like you don't have a voice. If it happens once or twice it's not so bad. But when it's been happening regularly, for years, it really starts to cut deep. Death by a thousand papercuts.\n\nThat whole story with the dragon is beautiful! But wow that ending to it was unexpectedly dark. Not only did the dragon die alone, but it was demonised and the truth forgotten. Until Sandal-san and Riri bring it back!\n\n>How can you smile like that? I can't do that. I can't be like you... Nobody accepts me. Nobody understands.\n\n[](#comfortfood)\n\nOf course she feels like this. Not just the anxiety, shyness and introversion, not just the constant negative reinforcement from people around her, but the feeling of abandonment by her parents too. Ditched by them in a town neither of them wanted to stay in, stuck with her overbearing grandmother, with no control over her life. Not a healthy situation. Frankly she needs therapy; but then imo everyone needs therapy at least every once in a while.\n\nYoshino's being great this episode. She's made some hiccups in the past, but she gets the MVP award this episode. Positive reinforcement is exactly what someone like Riri needs. 'You are valid, your differences are not weaknesses, you are not wrong, I respect you and care about you.'. I'm also glad they didn't go overboard on the crying; no tear-jerking soundtrack, no generic melodrama, no wailing or shouting. Like everything in this show it was kept quiet, realistic and understated. And it's the first step in her becoming more comfortable in herself, exactly as I expected last week. Sometimes we all need a shoulder to cry on.\n\nAlso Sandal-san you beautiful bastard. Seriously his timing has been god-tier several times, but this is the first time it hasn't been to set up a joke. He's not a one-note character, he's not a generic goofy wierdo comedy relief cutout, he's a character too. And a good guy, at that.\n\nAnd that song. She's got a lovely voice and should share it!\n\nIt's spooky, Riri's situation these past two episodes has been unsettling close to my own, and music was a way I learnt to deal with my anxiety too. \n\nI'm not sure if it's that when performing I was in control, or that since I knew exactly what was going to happen and when I felt more grounded. Maybe it's that by controlling my breathing to sing and play instruments, I kept my breathing slow and calm rather than starting to hyperventilate. I spent ages on music when I was growing up, learned four instruments, sang in every music group I could find. A lot of seemingly confident people I knew struggled with nerves and stage fright, but in spite of my own anxiety I didn't. I played lead parts in musicals even though I was basically mute in a classroom. I performed to some 900+ people for school events without batting an eye, as part of small groups as well as solo. And I sang in the Royal Albert Hall three times, and that seats 5700 people (and it was full, holy crap, that time I did feel very nervous lol, until I started to sing, and then I was fine). Strange that I can do that and feel great, yet still get nervous when there's more than ten people in a room. \n\nIt was like singing helped me to find my voice, back when it felt like I didn't have one at all.\n\nAnd I know it's small, but that moment at the end where Riri mumbles a half-joke about Manoyama being a town for elopers, and Yoshino hears and responds positively; that would actually be pretty big to her, hence Riri's surprised reaction. Counter to the \"no-one wants to hear what you have to say\" that's been reinforced so much, including earlier in this episode, she's proving that Ririko does indeed have a voice, and she is being heard, and listened to as well.\n\nIt wasn't exactly unpredictable based on last week, [but still...](https://www.youtube.com/watch?v=HsqmU3v0hVA)"
  },
  {
   "score": 6,
   "id": "dixgv58",
   "pid": "t1_diwegf8",
   "date": "2017-06-15 00:16:39",
   "depth": 1,
   "text": "I know how that feels and it hurts me watching Ririko being pulled over and talked over like that. How many times have a shy introvert finally step up and speak up, only to be interrupted and talked over as if the person's words have absolutely no value. All the time used to muster up the courage to do so is instantly crushed and repeatedly as well.\n\n\nI also used to perform music, but I'm not as confident as you are. I enjoy performing and playing, but crowds always get to me so I'm always nervous on stage, but it doesn't keep me away from trying to perform."
  },
  {
   "score": 17,
   "id": "dix47yb",
   "pid": "t1_diwegf8",
   "date": "2017-06-14 18:23:29",
   "depth": 1,
   "text": "> stuck with her overbearing grandmother, with no control over her life\n\nI don't think shes overbearing at all, she clearly lets Riri do what she wants, if she chooses to. She just understands that she is an introvert and tells her its ok to not force herself. If Riri wanted to stay out longer, i doubt the grandma would reject it."
  },
  {
   "score": 18,
   "id": "dj010a5",
   "pid": "t1_dix47yb",
   "date": "2017-06-16 13:35:26",
   "depth": 2,
   "text": "I don't think the grandmother understands Riri as well as she thinks she does. When she says stuff like \"Besides, you don't like being around people\", the way she says it feels more like an order. She thinks she is acting in Riri's best interest, but in reality, it's blocking Riri from getting closer to people, which she clearly does want to do. "
  },
  {
   "score": 44,
   "id": "diwp1tj",
   "pid": "t1_diwegf8",
   "date": "2017-06-14 13:16:38",
   "depth": 1,
   "text": "Riri was the character I could mostly relate to, in terms of introversion, shyness, and anxiety. I cringed when the policeman talked over her and said, \"Normal girls don't like that kind of stuff.\" Comments like that are very damaging for someone trying to speak up and participate in conversations. And I agree that if it happens enough times over a long period would force a person to rescind from any form of interaction.\n\nBut it's great to have someone like Yoshino who will help you through your rut. We need validation of ourselves from people who truly understand us. Riri is self-conscious of how weird she seems, but Yoshino assures her that it's nothing to be ashamed of; it's what makes her unique. I cried at Yoshino and Riri's one-on-one because it's similar to the few moments I had with people that helped me through my rut. So sweet! \n\nRiri's singing made me cry lol. There's something about having the stage to yourself that gives you empowerment, especially when you're used to being in the background. I could imagine Riri feeling less nervous and more courageous to sing the song because she's given the platform to speak and everyone is listening to what she has to say. It's a wonderful feeling (as someone who has social anxiety but found voice through theatre and dance)."
  },
  {
   "score": 48,
   "id": "diwisgw",
   "pid": "t1_diwegf8",
   "date": "2017-06-14 11:25:28",
   "depth": 1,
   "text": "> When that shopkeeper just starts talking over Riri the moment she shows up, tells her she's 'ruining the mood' and says she's not 'normal'.\n\nThat's not the shopkeeper, that's the policeman that's constantly hitting on that one girl"
  },
  {
   "score": 18,
   "id": "diwjcag",
   "pid": "t1_diwisgw",
   "date": "2017-06-14 11:35:14",
   "depth": 2,
   "text": "My mistake, damn red shirts!"
  },
  {
   "score": 42,
   "id": "dix4ik4",
   "pid": "t1_diwisgw",
   "date": "2017-06-14 18:30:11",
   "depth": 2,
   "text": "Execution is the only way."
  },
  {
   "score": 24,
   "id": "dixndw6",
   "pid": "t1_dix4ik4",
   "date": "2017-06-15 04:51:34",
   "depth": 3,
   "text": "All right now, Lovepon."
  },
  {
   "score": 12,
   "id": "dizyfxt",
   "pid": "t1_dixndw6",
   "date": "2017-06-16 12:45:30",
   "depth": 4,
   "text": "EXECUTE! EXECUTE! EXECUTE!\n"
  },
  {
   "score": 122,
   "id": "diwcmcn",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:40:21",
   "depth": 0,
   "text": "[Well someone got it almost right last thread!](http://i.imgur.com/3L7IMJp.png)\n\n([Link](https://www.reddit.com/r/anime/comments/6fucmh/spoilers_sakura_quest_episode_10_discussion/dimflzj/?context=10000))\n\nAlso, don't know why but the \"One Eighth!\" was really funny!\n\nHappy for Riri too :)"
  },
  {
   "score": 61,
   "id": "diwg2df",
   "pid": "t1_diwcmcn",
   "date": "2017-06-14 10:38:33",
   "depth": 1,
   "text": "the \"One eighth\" thing was hilarious, the English caught me off guard"
  },
  {
   "score": 19,
   "id": "dixbl8c",
   "pid": "t1_diwg2df",
   "date": "2017-06-14 21:19:46",
   "depth": 2,
   "text": "I was cracking up. It almost sounds like a different person. I love how its randomly sprinkled in whenever he talks/narrates "
  },
  {
   "score": 96,
   "id": "diwjffb",
   "pid": "t1_diwcmcn",
   "date": "2017-06-14 11:36:47",
   "depth": 1,
   "text": "[Made a clip out of the \"One eighth!\"](https://streamable.com/n6xf9)\n\n[](#feelsgoodman)"
  },
  {
   "score": 15,
   "id": "diwjvhc",
   "pid": "t1_diwjffb",
   "date": "2017-06-14 11:44:33",
   "depth": 2,
   "text": "Not the hero we deserve but the hero we need."
  },
  {
   "score": 76,
   "id": "diwt1uy",
   "pid": "t1_diwjffb",
   "date": "2017-06-14 14:29:05",
   "depth": 2,
   "text": "I'm totally not into guys, but whenever he starts speaking english, I wonder a little bit."
  },
  {
   "score": 46,
   "id": "diww621",
   "pid": "t1_diwt1uy",
   "date": "2017-06-14 15:29:24",
   "depth": 3,
   "text": "At this rate I wonder if it's possible to be straight in 3D but bi in 2D"
  },
  {
   "score": 12,
   "id": "dixhy7u",
   "pid": "t1_diww621",
   "date": "2017-06-15 01:02:37",
   "depth": 4,
   "text": "Yuri on Ice pretty much convinced me of that."
  },
  {
   "score": 35,
   "id": "dix1xxr",
   "pid": "t1_diww621",
   "date": "2017-06-14 17:31:35",
   "depth": 4,
   "text": "2D>3D applies to men as well, so it's definitely possible."
  },
  {
   "score": 99,
   "id": "diwei9u",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:11:59",
   "depth": 0,
   "text": "My interpretation of [Sandal's artwork.](http://i.imgur.com/H7hye5w.jpg)  \nRiriko is obviously the dragon girl.  \nYoshino is the unicorn because she is cute and fluffy like a rainbow (also pink hair).  \nShiori is the normal \"brown\" girl.  \nSanae is the phoenix because she reborn in Manoyama.  \nMaki is the winged horse who thinks herself a normal horse but in reality she could fly wherever she wants."
  },
  {
   "score": 1,
   "id": "diwnwda",
   "pid": "t1_diwei9u",
   "date": "2017-06-14 12:55:44",
   "depth": 1,
   "text": "All of them fly/have wings except for the unicorn, could that have something to do with anything?"
  },
  {
   "score": 11,
   "id": "diwoj1s",
   "pid": "t1_diwnwda",
   "date": "2017-06-14 13:07:17",
   "depth": 2,
   "text": "It has a badass horn so the attack power is off the roof and common knowledge that unicorns can dash which is cooler than flying.  \nNah, probably Sandal just ran out of space :)"
  },
  {
   "score": 7,
   "id": "diwjgb1",
   "pid": "t1_diwei9u",
   "date": "2017-06-14 11:37:13",
   "depth": 1,
   "text": "I think Maki is phoenix (her career is dead until that event revitalize it again) and Sanae is pegasus (don't realize that she's special)."
  },
  {
   "score": 2,
   "id": "diwqif3",
   "pid": "t1_diwjgb1",
   "date": "2017-06-14 13:42:55",
   "depth": 2,
   "text": "Yes, especially since Sanae was worried about being an ordinary, indistinct cog in the corporate world. "
  },
  {
   "score": 11,
   "id": "diwgfog",
   "pid": "t1_diwei9u",
   "date": "2017-06-14 10:44:51",
   "depth": 1,
   "text": "> Shiori is the normal \"brown\" girl.\n\nSeems like an eagle to me, and an eagle is a symbol of pride. Shiori is proud she was born in Manoyama. "
  },
  {
   "score": 30,
   "id": "diwgx21",
   "pid": "t1_diwgfog",
   "date": "2017-06-14 10:53:05",
   "depth": 2,
   "text": "To be honest that's a gryphon which creatures are known for guarding treasure and priceless possessions. Such as the traditions of Manoyama.  \nIt was only the third introduction and I was not heated enough to give a deeper meaning to it :)"
  },
  {
   "score": 6,
   "id": "diwu0i0",
   "pid": "t1_diwgx21",
   "date": "2017-06-14 14:46:58",
   "depth": 3,
   "text": "She also protected the \"treasure\" of the old folks who passed away and their house got burned down  for the movie. \n\nWell kinda.  Their names were put in the credits."
  },
  {
   "score": 70,
   "id": "diwsaij",
   "pid": "t1_diwei9u",
   "date": "2017-06-14 14:15:02",
   "depth": 1,
   "text": "* **Ririko** -> Dragon is obvious\n\nMaki and Sanae are opposites while also being a pair (since they are constantly bickering yet supporting each other and you rarely see one without the other) so they should be the two mythical horses so:\n\n* **Sanae** -> Unicorn because they are seen as the more \"intellectual\" and regal beast. Sanae is more thinker.\n\n* **Maki** -> Pegesus because they are the more \"physical\" and down to earth beast. Maki is a doer.\n\n* **Shiori** -> Griffin because they are a sign of loyalty and bravery. Shiori is loyal to her home town and while hidden away, she is really brave.\n\n* **Yoshino** -> A bright phoenix that is commonly associated with the sun and optimism.  "
  },
  {
   "score": 1,
   "id": "dj6k28a",
   "pid": "t1_diwsaij",
   "date": "2017-06-20 18:54:05",
   "depth": 2,
   "text": "The phoenix can be all of them except for Shiori since in a way they're all trying to find themselves and are being \"reborn\" in Manayoma"
  },
  {
   "score": 177,
   "id": "diwd88h",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:50:27",
   "depth": 0,
   "text": "[What an asshole!](http://i.imgur.com/gUaj6d1.jpg)"
  },
  {
   "score": -44,
   "id": "diwr3c5",
   "pid": "t1_diwd88h",
   "date": "2017-06-14 13:53:17",
   "depth": 1,
   "text": "But Riri surely was getting annoying."
  },
  {
   "score": -31,
   "id": "dix4h75",
   "pid": "t1_diwr3c5",
   "date": "2017-06-14 18:29:18",
   "depth": 2,
   "text": "As much as the Riri waifu fans hate this, it is true. Riri type in real life is really annoying. People would be less offended if her design wasn't cute."
  },
  {
   "score": 16,
   "id": "dj04v70",
   "pid": "t1_dix4h75",
   "date": "2017-06-16 14:52:59",
   "depth": 3,
   "text": "Neither of you understand how introverts work, do you?"
  },
  {
   "score": 51,
   "id": "dixiwf0",
   "pid": "t1_dix4h75",
   "date": "2017-06-15 01:45:21",
   "depth": 3,
   "text": "Let's shun anyone with their weird hobby before they say anything."
  },
  {
   "score": 35,
   "id": "dixxr5t",
   "pid": "t1_dixiwf0",
   "date": "2017-06-15 08:39:25",
   "depth": 4,
   "text": "Which is an ironic stance to take given this subreddit and the show this thread is devoted to."
  },
  {
   "score": 11,
   "id": "diywb06",
   "pid": "t1_diwd88h",
   "date": "2017-06-15 20:08:09",
   "depth": 1,
   "text": "[How can you say such things so her?](http://imgur.com/a/eLEGs)"
  },
  {
   "score": 14,
   "id": "diyruym",
   "pid": "t1_diwd88h",
   "date": "2017-06-15 18:19:52",
   "depth": 1,
   "text": "He's a normie."
  },
  {
   "score": 15,
   "id": "diyo20d",
   "pid": "t1_diwd88h",
   "date": "2017-06-15 16:51:25",
   "depth": 1,
   "text": "And I was rooting for him last episode!"
  },
  {
   "score": 41,
   "id": "dix9w79",
   "pid": "t1_diwd88h",
   "date": "2017-06-14 20:35:17",
   "depth": 1,
   "text": "I can't remember the last time I came to dislike a character in that short a timespan"
  },
  {
   "score": 9,
   "id": "dj5874k",
   "pid": "t1_dix9w79",
   "date": "2017-06-20 02:00:47",
   "depth": 2,
   "text": "THAT episode of Masamune-kun. Literally showed up on screen for a moment and I hated him."
  },
  {
   "score": 134,
   "id": "diwf3hp",
   "pid": "t1_diwd88h",
   "date": "2017-06-14 10:22:08",
   "depth": 1,
   "text": "Glad he didn't get the girl"
  },
  {
   "score": 51,
   "id": "diwntpf",
   "pid": "t1_diwf3hp",
   "date": "2017-06-14 12:54:24",
   "depth": 2,
   "text": "After that I sincerely hoped he'd fail. Justice prevailed!"
  },
  {
   "score": 30,
   "id": "dix48wv",
   "pid": "t1_diwntpf",
   "date": "2017-06-14 18:24:07",
   "depth": 3,
   "text": "It's too bad, I actually hoped he'd get the girl from the previous episode but after what he said, I'm glad he got his just desserts."
  },
  {
   "score": 87,
   "id": "diwfb5o",
   "pid": "t1_diwf3hp",
   "date": "2017-06-14 10:25:47",
   "depth": 2,
   "text": "Karma"
  },
  {
   "score": 75,
   "id": "diwdmt4",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:57:11",
   "depth": 0,
   "text": "That was a wrap-up for Ririko's mini arc. Now every major character has got one - Yoshino (1-3 ep), Sanae (4-5), Maki (6-7), Shiori (8-9) and Ririko (10-11). All of them were pretty formulaic and simple, but were handled in a nice, careful manner with humour and decent attention to details and characterization. Just as the show itself - it doesn't blows me away, but it's a by all means a pleasant watch. \n\nCurious what path the second cour takes. Will it continue to develop characters in the same arc-ish style? Or maybe there will be a single (or two) major arc which is going to comprise everything? I guess we'll see, though I expect a little bit of a step up for the second half, especially in terms of emotional investment. \n\nThe episode itself was straightforward just as analogy between dragon's story and Ririko. Good thing she didn't change much but still reflected a bit on her desicions and people around her. Also Chitose's overprotective and grumpy nature is explained, which is also nice. It's simple, but does this show need more than that? Will see what second cour has to offer. "
  },
  {
   "score": 39,
   "id": "diwhx2u",
   "pid": "t1_diwdmt4",
   "date": "2017-06-14 11:10:17",
   "depth": 1,
   "text": "I'm guessing the second cour's gonna starts to really tackle how to bring people back to Manoyama with more of a focus on Yoshino. I'm curious to see if Yoshino develops as a character at all, given that she's been fairly static since the first few episodes. "
  },
  {
   "score": 10,
   "id": "dix4qsg",
   "pid": "t1_diwhx2u",
   "date": "2017-06-14 18:35:22",
   "depth": 2,
   "text": "Oh shit I forgot this was a 2-cour. Thanks for reminding me."
  },
  {
   "score": 19,
   "id": "dix9cp9",
   "pid": "t1_diwhx2u",
   "date": "2017-06-14 20:21:54",
   "depth": 2,
   "text": "holy fuck this is 2 cour ? holy shit, this is just crazy, this is one of the hidden gem of the season, the relaxing feeling the show bring is really top notch, "
  },
  {
   "score": 67,
   "id": "diwejn2",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:12:38",
   "depth": 0,
   "text": "Freaking [Sandal](http://imgur.com/jkUC9nF.jpg) keeps stealing the show.\n\n[**ONE EIGHT**](#anko)\n\n*He's the [Hero Manoyama](http://imgur.com/WZ0O2CH.jpg) deserves* ~~but not the~~ *and the one it needs right now*. That [painting](http://imgur.com/05aJyId.jpg) at the end representing the 5 girls was a pretty nice touch to wrap things up.\n\nOh boy, these guys from the dating event have been the best special guest so far. So weird to see them get all confused about using [silverware](http://imgur.com/6XkHyf4.jpg) since we western gaijins use them all the time. The guy [cleaning](http://imgur.com/GPCMCwm.jpg) his hand in the glass pretty much took the cake in the sillyness contest\n\nGlad we're over with Riri's arc. Her story of struggles [accepting](http://imgur.com/3cuWzsa.jpg) her peers around her hits very close to home. \n\nI swear it, this show has the [best timed](http://imgur.com/Bzfu7JW.jpg) and well displayed [hugs](http://imgur.com/6V4KAGO.jpg) I've seen in a very long time (I would have loved it more if the rest of the girls were there to express the same sentiment towards our beloved Kudere, but using Yoshino as the delegate was also a good choice) It totally kills me when characters from other series are suffering and all their close friends and peers can do is just stand aside them because that's their culture.\n\nThe [songs](http://imgur.com/05aJyId.jpg) in the show are setting it appart from other P.A.Works previous shows. Hope we can get more of these, specially in the final episodes. Speaking of... guess we're not getting a cour finale this time.\n\n#EPISODE 11 OUTFIT COUNT\n___________________________________________________________\n\nNO NEW OUTFITS THIS TIME\n\n___________________________________________________________\n#[WARDROBE SUMMARY](https://www.reddit.com/r/anime/comments/66b42x/spoilers_sakura_quest_episode_3_discussion/dgh1qya/)\n_________________________________________________\n**TOTAL OUTFIT COUNT SO FAR**\n\n**Yoshino** outfits: **14**\n\nYoshino variations: **7**\n\n**Shiori** outfits: **12**\n\nShiori variations: **2**\n\n**Sanae** outfits: **12**\n\nSanae variations: **1**\n\n**Maki** outfits: **12**\n\nMaki variations: **2**\n\n**Riri** outfits: **10**\n\nRiri variations: **1**\n\n\n______________________________________________\n\n\n\n\n\n\n"
  },
  {
   "score": 10,
   "id": "diwt9vg",
   "pid": "t1_diwejn2",
   "date": "2017-06-14 14:33:12",
   "depth": 1,
   "text": "Actually, if you're really familiar with french cuisine and restaurant etiquette, what he's doing isn't strange or silly in the least. Very frequently, you're given a [finger bowl](https://en.wikipedia.org/wiki/Finger_bowl) of water at the beginning of the meal, and it's used for exactly what he's doing.\n\n"
  },
  {
   "score": 26,
   "id": "diwu971",
   "pid": "t1_diwt9vg",
   "date": "2017-06-14 14:51:34",
   "depth": 2,
   "text": "I'm aware about the bowl used to clean your fingertips. But that's not a bowl, that's a common glass of water, hence the joke."
  },
  {
   "score": 9,
   "id": "dizyvoe",
   "pid": "t1_diwejn2",
   "date": "2017-06-16 12:53:59",
   "depth": 1,
   "text": "I thought the silverware joke was about them being \"country bumpkins\" and not knowing how to use eating utensils. "
  },
  {
   "score": 2,
   "id": "dj00226",
   "pid": "t1_dizyvoe",
   "date": "2017-06-16 13:17:04",
   "depth": 2,
   "text": "Ah, that's a very nice insight I never thought of."
  },
  {
   "score": 50,
   "id": "diwdxh6",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:02:11",
   "depth": 0,
   "text": "Didn't think an obscure Japanese folk song would survive 4 generations in Scandinavia.\n\nIs anyone here one-eighth mixed-blood and been taught a song in that ethnic group's language? "
  },
  {
   "score": 1,
   "id": "dlucsvd",
   "pid": "t1_diwdxh6",
   "date": "2017-08-19 07:26:38",
   "depth": 1,
   "text": "He's a bard, why would he *not* know an obscure song?"
  },
  {
   "score": 34,
   "id": "dixb66d",
   "pid": "t1_diwdxh6",
   "date": "2017-06-14 21:08:22",
   "depth": 1,
   "text": "It must be an arts focused family. Sandal is a well known artist, visiting the homeplace of his great grandparent. They probably appreciated the culture as artists, and that's why Sandal happens to have a cultural and personal connection to Manoyama despite being an outsider"
  },
  {
   "score": 7,
   "id": "dixnahc",
   "pid": "t1_dixb66d",
   "date": "2017-06-15 04:48:27",
   "depth": 2,
   "text": "Yet the culture was lost within a span of one generation in Manoyama..."
  },
  {
   "score": 2,
   "id": "diy58ek",
   "pid": "t1_dixnahc",
   "date": "2017-06-15 10:50:45",
   "depth": 3,
   "text": "Unfortunately, it happens more often than you might think."
  },
  {
   "score": 22,
   "id": "diy587q",
   "pid": "t1_dixnahc",
   "date": "2017-06-15 10:50:40",
   "depth": 3,
   "text": "Unfortunately, it happens more often than you might think."
  },
  {
   "score": 49,
   "id": "diwitsk",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:26:08",
   "depth": 0,
   "text": "[This moment hit me right in my guts] (http://imgur.com/a/fNGlN). The act of a random jerk shutting you up when you're truly opening yourself (and isn't easy for you) because you seem boring to his eyes or you might ruin his day is something I don't desire to happen to anyone introvert and shy. It really makes you think you are trash and inferior to your peers, unworthy to live in community. It hurt so much seeing Riri there. Gladly Yoshino understood and showed interest as a way of making her feel better (besides of caring about her).\n\nWe've getting more and more Sandal-san moments, and he knows how to save the day (although it seems he limits himself being at the right place at the right moment)! Will he maybe get his own arc in a near future? Since he's an observer and the narrator it's unlikely, but it would be a nice surprise!\n\nAnd, relating to this week's name:\n\n**Ep 11: The Forgotten Requiem**: *requiem* means *rest* in Latin, and it's how musical pieces dedicated to the deceased are named, mainly as a mourning or as a wish for them to have a calm journey to afterlife. So, this week's name refers to the song Riri found out and sung to the visitors as a cultural experience. It is very appropriate IMO, because it complements and continues last episode's topic and plot, and also refers to Riri, as the song \"soothes\" her issues and keeps on with the simile of her being the dragon girl."
  },
  {
   "score": 38,
   "id": "diwl61i",
   "pid": "t1_diwitsk",
   "date": "2017-06-14 12:07:12",
   "depth": 1,
   "text": "> The act of a random jerk shutting you up when you're truly opening yourself (and isn't easy for you) because you seem boring to his eyes or you might ruin his day is something I don't desire to happen to anyone introvert and shy.\n\nI wish Yoshino was next to her and not in the bus. She definitely would have said something. Glad she sensed something was wrong and went to support Riri."
  },
  {
   "score": 5,
   "id": "diyobf8",
   "pid": "t1_diwl61i",
   "date": "2017-06-15 16:57:14",
   "depth": 2,
   "text": "Where was Shiori? She probably would have yelled the hell out of him."
  },
  {
   "score": 10,
   "id": "diyzxcd",
   "pid": "t1_diyobf8",
   "date": "2017-06-15 21:45:32",
   "depth": 3,
   "text": "Nah, she'd have smiled at him as she politely demanded that he apologise. All the while letting off a killer's aura that would cow any man."
  },
  {
   "score": 15,
   "id": "diwvbkp",
   "pid": "t1_diwl61i",
   "date": "2017-06-14 15:11:59",
   "depth": 2,
   "text": "Yes. She was a real queen there."
  },
  {
   "score": 15,
   "id": "diwowyx",
   "pid": "t1_diwl61i",
   "date": "2017-06-14 13:14:13",
   "depth": 2,
   "text": "And the hug was executed well. + Sandal's Forgotten Mayonama song :)"
  },
  {
   "score": 3,
   "id": "diyo8h5",
   "pid": "t1_diwowyx",
   "date": "2017-06-15 16:55:24",
   "depth": 3,
   "text": "I need that song. Both OP and ED albums are out and its not in that. So most likely the OST. Can't wait!"
  },
  {
   "score": 29,
   "id": "diwf0q5",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:20:46",
   "depth": 0,
   "text": "Best Supporting Act - Sandal-san. His Japanese ancestry ended up saving the day for the Dating Tour and help regain Riri's confidence in herself.\n\nAnyone fancy shipping him and Riri?"
  },
  {
   "score": 3,
   "id": "dix9f5u",
   "pid": "t1_diwf0q5",
   "date": "2017-06-14 20:23:34",
   "depth": 1,
   "text": "do you think her grandmom will allow it tho ? especially since what happened to riri's parents"
  },
  {
   "score": 8,
   "id": "dix9jdb",
   "pid": "t1_dix9f5u",
   "date": "2017-06-14 20:26:25",
   "depth": 2,
   "text": "Sandal-san's more or less become a native of Manoyama and treated as such, so it's highly unlikely that he'll leave town."
  },
  {
   "score": 4,
   "id": "dixumaa",
   "pid": "t1_dix9jdb",
   "date": "2017-06-15 07:42:29",
   "depth": 3,
   "text": "I think it's the other way around. I perceive his character as a roaming artist looking out for inspiration for his paintings and his music. Manoyama might be the place where he has spendt a lot of time lately, but I'm thinking he could pack up overnight and leave town for a different kind of setting without even telling a soul where he's going."
  },
  {
   "score": 5,
   "id": "diyra10",
   "pid": "t1_dixumaa",
   "date": "2017-06-15 18:06:12",
   "depth": 4,
   "text": "While I don't agree with that assessment, but even so, I don't think it'll be that of a problem as compared to Riri's parents. Sandal knows Manoyama like the back of his hand, unlike Riri's dad, who wants to leave at the first opportunity."
  },
  {
   "score": 1,
   "id": "diysbo0",
   "pid": "t1_diyra10",
   "date": "2017-06-15 18:31:08",
   "depth": 5,
   "text": "Knowing a small town like the back of your own hand pretty much helps my argument. I lived most of my life in a medium sized city. I moved to a smaller town during my college years and figured the small town pretty soon. \n\nLater on I moved back to my medium sized city and really never had anything to go back to that small sized town, even though I met most of my best friends in there wich I keep in contact thru msg app.\n\nAn artist of pretty much any kind, will always be ambitious to find new things that will inspire him/her to meet new people from different cultures and different places, different types of food, different hobbies or activites.\n\nOnce you feel fullfilled, you're ready to settle down, wich doesn't seem that way with Sandal-san who still looks pretty young and ambitious."
  },
  {
   "score": 3,
   "id": "diysea4",
   "pid": "t1_diysbo0",
   "date": "2017-06-15 18:32:52",
   "depth": 6,
   "text": ">wich doesn't seem that way with Sandal-san who still looks pretty young and ambitious.\n\nYou would have been right, however, are we even watching the same show? Sandal-san looks VERY fulfilled and content here."
  },
  {
   "score": 1,
   "id": "diysy3h",
   "pid": "t1_diysea4",
   "date": "2017-06-15 18:45:59",
   "depth": 7,
   "text": "In the first episode he appeared playing a mandolin. A few episodes ago he was playing a violin. This last episode he was playing a flute. Who knows how many other instruments he wants to master. \n\nThat's a very ambitious guy in my book."
  },
  {
   "score": 5,
   "id": "dix22ae",
   "pid": "t1_diwf0q5",
   "date": "2017-06-14 17:34:18",
   "depth": 1,
   "text": "How old is he supposed to be? I can't tell really. "
  },
  {
   "score": 15,
   "id": "dixnii7",
   "pid": "t1_dix22ae",
   "date": "2017-06-15 04:55:48",
   "depth": 2,
   "text": "I would assume mid twenties."
  },
  {
   "score": 5,
   "id": "dixunrg",
   "pid": "t1_dixnii7",
   "date": "2017-06-15 07:43:16",
   "depth": 3,
   "text": "My money is on his late 20s or probably early 30s"
  },
  {
   "score": 15,
   "id": "dixnib1",
   "pid": "t1_diwf0q5",
   "date": "2017-06-15 04:55:35",
   "depth": 1,
   "text": "> Anyone fancy shipping him and Riri?\n\nI want to ship Yoshino and all the girls, so no."
  },
  {
   "score": 33,
   "id": "diwpv3f",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 13:31:11",
   "depth": 0,
   "text": " [Ririko's Song](https://files.catbox.moe/534apk.webm)"
  },
  {
   "score": 5,
   "id": "dixd5ng",
   "pid": "t1_diwpv3f",
   "date": "2017-06-14 22:05:29",
   "depth": 1,
   "text": "When the song started I thought my music was playing in another tab because the beginning sounds so much like the song \"lit\" from the koe no katachi OST"
  },
  {
   "score": 32,
   "id": "diwsqul",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 14:23:25",
   "depth": 0,
   "text": "[God dammit, Ririko! What did the Scandinavian man just say?](http://imgur.com/a/BiOmE)"
  },
  {
   "score": 26,
   "id": "diwh3pr",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:56:11",
   "depth": 0,
   "text": "[when Ririko began to sing](http://media.salon.com/2016/05/image-20160523-10994-12rwe2d.jpg) \n\nseriously thou, that was a beautiful song                                  \n"
  },
  {
   "score": 49,
   "id": "diwbyqg",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:29:34",
   "depth": 0,
   "text": "[That was unexpected!](http://i.imgur.com/RLc25lo.png)\n\nI've always thought that Sandal was just some foreigner artist that got lost while travelling around Japan and just got stuck in Manoyama. His backstory actually makes more sense and fits very well with the theme of the show.\n\nAlso [I was hoping something happens between these two.](http://i.imgur.com/jnHiKb6.png) Given their own backstories I think Riri and Sandal could work well as a couple although with the nature of this show I doubt anything will happen."
  },
  {
   "score": 4,
   "id": "dixesm4",
   "pid": "t1_diwbyqg",
   "date": "2017-06-14 22:59:12",
   "depth": 1,
   "text": "> Given their own backstories I think Riri and Sandal could work well as a couple although with the nature of this show I doubt anything will happen.\n\nI never knew I wanted this... "
  },
  {
   "score": 31,
   "id": "diwc86j",
   "pid": "t1_diwbyqg",
   "date": "2017-06-14 09:33:53",
   "depth": 1,
   "text": "He's the best character in the show, hands down.\n\nIt's like he's always one step further than other people on the show."
  },
  {
   "score": 1,
   "id": "dixnca7",
   "pid": "t1_diwc86j",
   "date": "2017-06-15 04:50:03",
   "depth": 2,
   "text": "Some would say he's ten steps ahead."
  },
  {
   "score": 12,
   "id": "dixluft",
   "pid": "t1_diwc86j",
   "date": "2017-06-15 03:56:18",
   "depth": 2,
   "text": "I mean, [he](http://sakura-quest.wikia.com/wiki/Mr._Sandal) is listed as the original creator [in the opening credits](http://i.imgur.com/kot8euJ.jpg), so he's probably got the whole story in front of him already."
  },
  {
   "score": 0,
   "id": "diynqvi",
   "pid": "t1_dixluft",
   "date": "2017-06-15 16:44:33",
   "depth": 3,
   "text": "That's just a fan site. I wouldn't put too much trust into it. It is probably just a pseudonym for the production committee, similar to Magical Quartet for Madoka."
  },
  {
   "score": 14,
   "id": "diypkri",
   "pid": "t1_diynqvi",
   "date": "2017-06-15 17:26:20",
   "depth": 4,
   "text": "It's definitely a cute joke and likely not some deep lore thing, but if you go back to episode 5(~13:00), that *is* his name. "
  },
  {
   "score": 1,
   "id": "diz0ojt",
   "pid": "t1_diypkri",
   "date": "2017-06-15 22:08:58",
   "depth": 5,
   "text": "Ah, you're right."
  },
  {
   "score": 8,
   "id": "dixn1vu",
   "pid": "t1_dixluft",
   "date": "2017-06-15 04:40:28",
   "depth": 3,
   "text": "Yeah, he is one-above-all in this series."
  },
  {
   "score": 39,
   "id": "dix03qj",
   "pid": "t1_diwc86j",
   "date": "2017-06-14 16:51:22",
   "depth": 2,
   "text": ">It's like he's always one step further than other people on the show.\n\nMaybe he reads the manga.\n\n[](#chinosmirk)\n\n"
  },
  {
   "score": 19,
   "id": "diwe8es",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:07:26",
   "depth": 0,
   "text": "Sandal is the greatest character. He stands out so well from the already diverse cast and has talent written all over his face. He just helped out Riri so effortlessly by little words about his own life story in Manoyama. \n\nAlso Riri singing the song accompanied by Sandal's guitar playing was pretty beautiful. \n\nI'd say, that's the best episode so far in terms of emotional impact...by far. And i hope it continues with this direction, more emotion please."
  },
  {
   "score": 20,
   "id": "diwegqi",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:11:16",
   "depth": 0,
   "text": "So one hundred years ago a Scandinavian man visited a rural Japanese town, fell in love with a woman, took her back home, and taught their children, grandchildren, and great grandchildren how to sing in Japanese. Damn, that's dedication. Makes me feel bad for not knowing the language of my first generation immigrant parents"
  },
  {
   "score": 20,
   "id": "diwnxfp",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 12:56:17",
   "depth": 0,
   "text": "This episode had a really beautiful message. It's ok to be different. \n\nIt's so satisfying watching these girls grow throughout the series. God bless this show being 25 episodes\n\n[ ](#wow \"This episode made me so happy I can't even describe it\")"
  },
  {
   "score": 19,
   "id": "diwqu54",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 13:48:45",
   "depth": 0,
   "text": "why is the MAL ratting steadily dropping, I think its a fun show to watch and relax. :("
  },
  {
   "score": 4,
   "id": "dix4rv2",
   "pid": "t1_diwqu54",
   "date": "2017-06-14 18:36:03",
   "depth": 1,
   "text": "Fairly common https://www.reddit.com/r/anime/comments/3z6cr7/mal_score_progressions_for_fall_2015/"
  },
  {
   "score": 8,
   "id": "diwwwul",
   "pid": "t1_diwqu54",
   "date": "2017-06-14 15:44:43",
   "depth": 1,
   "text": "I don't know but it shouldn't matter too much because once the show's finished it should rebound one we drop the scores of all those that didn't make it 1/5 of the way in."
  },
  {
   "score": 13,
   "id": "dix1ivu",
   "pid": "t1_diwwwul",
   "date": "2017-06-14 17:22:10",
   "depth": 2,
   "text": "never understood people that rate a show before the end. I know it's ok to drop a show, but I don't think you can pass a complete judgment on something without seeing most of it."
  },
  {
   "score": 3,
   "id": "dix9ha8",
   "pid": "t1_dix1ivu",
   "date": "2017-06-14 20:24:59",
   "depth": 3,
   "text": "I guess majority of people will even rate show on MAL after just eps 1, they just want to leave their mark, LOL"
  },
  {
   "score": 5,
   "id": "dix2ksf",
   "pid": "t1_dix1ivu",
   "date": "2017-06-14 17:45:43",
   "depth": 3,
   "text": "I think she people are just into their system enough that they keep their score up to date as they go along."
  },
  {
   "score": 1,
   "id": "dizo96g",
   "pid": "t1_dix2ksf",
   "date": "2017-06-16 09:38:54",
   "depth": 4,
   "text": "Yeah, I usually start rating a show after the first three episodes."
  },
  {
   "score": 23,
   "id": "diww9me",
   "pid": "t1_diwqu54",
   "date": "2017-06-14 15:31:24",
   "depth": 1,
   "text": "People usually don't rate a show midway unless they are dropping it, which would indicate they feel negatively about it. "
  },
  {
   "score": 19,
   "id": "diwqsof",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 13:48:01",
   "depth": 0,
   "text": "I usually call the guys who randomly use English words 'best guy' ironically, but Sandal-san has truly earned that title. He's the greatest."
  },
  {
   "score": 33,
   "id": "diwcoxs",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:41:33",
   "depth": 0,
   "text": "[We have to protect this smile!](http://i.imgur.com/3aqg0Gd.png)\n\nI have never heard a sexier [\"One-eight\"](http://i.imgur.com/2DHZ6CQ.png) \n\nRiriko x Sandal-san anyone?\n\nPretty nice episode, loved the song."
  },
  {
   "score": 10,
   "id": "dixe2h2",
   "pid": "t1_diwcoxs",
   "date": "2017-06-14 22:34:14",
   "depth": 1,
   "text": "Since you are like the 4th or 5th person I gotta ask do you know why everyone keep writing it as \"One-eight\" instead of \"One-eighth\"? Is it just a common typo or some regional thing I've never heard of?"
  },
  {
   "score": 3,
   "id": "dixenk7",
   "pid": "t1_dixe2h2",
   "date": "2017-06-14 22:54:24",
   "depth": 2,
   "text": "Didn't even notice x)\n\nI am gonna guess it is just a common typo since i certainly meant to write \"One-eighth\""
  },
  {
   "score": 2,
   "id": "dixeqri",
   "pid": "t1_dixenk7",
   "date": "2017-06-14 22:57:24",
   "depth": 3,
   "text": "Haha alright thanks that's what I assumed was probably the case, just thought I'd ask."
  },
  {
   "score": 13,
   "id": "diwm7xm",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 12:26:03",
   "depth": 0,
   "text": "[2spooky4me](http://i.imgur.com/W02qcL8.png)"
  },
  {
   "score": 12,
   "id": "diwk2kb",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:48:01",
   "depth": 0,
   "text": "Ok I'm gonna need a guitar tab of thhe Manoyama Song. Beautiful. "
  },
  {
   "score": 4,
   "id": "diwpn8p",
   "pid": "t1_diwk2kb",
   "date": "2017-06-14 13:27:19",
   "depth": 1,
   "text": "Im gonna Second this"
  },
  {
   "score": 2,
   "id": "dixscst",
   "pid": "t1_diwpn8p",
   "date": "2017-06-15 06:57:35",
   "depth": 2,
   "text": "Third"
  },
  {
   "score": 14,
   "id": "dixs7xl",
   "pid": "t1_diwk2kb",
   "date": "2017-06-15 06:54:52",
   "depth": 1,
   "text": "I made one \nhttps://tabs.ultimate-guitar.com/m/misc_cartoons/sakura_quest_-_dragon_song_tab.htm"
  },
  {
   "score": 2,
   "id": "dj2uck1",
   "pid": "t1_dixs7xl",
   "date": "2017-06-18 13:39:49",
   "depth": 2,
   "text": "Thanks a bunch!"
  },
  {
   "score": 4,
   "id": "dixvhal",
   "pid": "t1_dixs7xl",
   "date": "2017-06-15 07:58:34",
   "depth": 2,
   "text": "You are the fucking truth. "
  },
  {
   "score": 10,
   "id": "diwijsy",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:21:13",
   "depth": 0,
   "text": "So does Sandal-san just like lurk in random locations with his flute or a song ready for when someone pass by?"
  },
  {
   "score": 8,
   "id": "diwnvsi",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 12:55:26",
   "depth": 0,
   "text": "[Oh no](http://i.imgur.com/L0qXflS.png)"
  },
  {
   "score": 10,
   "id": "diwpepq",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 13:23:07",
   "depth": 0,
   "text": "This episode was so beautiful. \n\nThe comparison between the dragon story and Ririko's life is very well done and relatable, a lot of us loners could see ourselves as dragons of our own story. \n\nThe show has always been very light-hearted and I didn't expect to cry a little, but my heart couldn't help it at [this scene](http://i.imgur.com/ipnqwSx.png). Even a bit back, seeing her [get upset](http://i.imgur.com/3SJCF1K.png) after pretty much indirectly told \"stfu no one cares\" made me want to punch the guy and hug Ririko.\n\nVery excited to get some back-story on Sandal-san too! I thought he may be that one weird character who talks nonsense the entire series remaining mysterious, but apparently not! As weird as he still may be, he's a truly interesting character and I love how he pretty much sang the song for Ririko [telling her not to cry.](http://i.imgur.com/BFTqDZ5.png)\n\nAnd in the end, the scene with Ririko singing was by far my favorite of the entire series up until now. I feel it kind of reflects how it is easier to come in front of a crowd or hang around people when it involves something you are passionate about. "
  },
  {
   "score": 7,
   "id": "dix2eki",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 17:41:56",
   "depth": 0,
   "text": "Sandal actually does have some purpose and isn't just some goofy guy in the background. I'm glad that he's an actual character and that Ririko got some development. However, it is a shame how little the town cares about their traditions, while paying some lip service that they do. Ririko didn't have to go far to find that alternate dragon story; it was in a library in town. I'm guessing the old people in town are around the same age as Sandal's grandmother, so in the space of one generation, they all forgot the town's song and the true dragon story."
  },
  {
   "score": 6,
   "id": "dixn6ou",
   "pid": "t1_dix2eki",
   "date": "2017-06-15 04:44:56",
   "depth": 1,
   "text": "Yep sometimes its the older generation that ignores tradition yet pretending they do care.\n"
  },
  {
   "score": 6,
   "id": "diwhpt7",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:06:44",
   "depth": 0,
   "text": "Beautiful episode"
  },
  {
   "score": 9,
   "id": "diwci2s",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:38:23",
   "depth": 0,
   "text": "Ririko episode get hyped. Don't worry Ririko, I understand you. \n\nWas pretty nice. Too bad about the cop though. Freaking Sig Curtis just showed up and stole his girl."
  },
  {
   "score": 12,
   "id": "diwuz7c",
   "pid": "t1_diwci2s",
   "date": "2017-06-14 15:05:16",
   "depth": 1,
   "text": "I don't feel bad for the cop, he was being pretty insensitive to Ririko."
  },
  {
   "score": 5,
   "id": "dixabpt",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 20:46:16",
   "depth": 0,
   "text": "That red shirt police guy was a huge asshole to Riri for \"ruining the mood\".  The real thing ruining the mood is his over-bearing clingy attitude.  Like the girl looked pretty uncomfortable and didn't want to cause a fuss by telling him to back off.\n\nAlso, I love me some more of Sandal.  Him saying \"one-either\" and \"guilt\" made me feel uncomfortable and I'm not sure whether I liked it or not.  While not a purely focused episode, I'm glad that he did play a larger role here.  Always appreciate when side characters get some good development."
  },
  {
   "score": 5,
   "id": "dixs9eb",
   "pid": "t3_6h8ff2",
   "date": "2017-06-15 06:55:40",
   "depth": 0,
   "text": "ririko song tab\n\nhttps://tabs.ultimate-guitar.com/m/misc_cartoons/sakura_quest_-_dragon_song_tab.htm"
  },
  {
   "score": 3,
   "id": "diwmjhb",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 12:31:40",
   "depth": 0,
   "text": "I started watching this show a bit late, I finally got the time to catch up. I really love it so far. The op and ed are fantastic, the characters are all great, and watching this show just makes me happy. It's definitely my favorite this season.\n\nThis episode was great as well. I love that we got to see more of both Riri and Sandal. I really liked the story about the dragon and the alternative interpretation of it. That scene where Riri sings and the fireflies arrive is so beautiful, I must admit I shed a few tears there."
  },
  {
   "score": 3,
   "id": "dixi7t6",
   "pid": "t3_6h8ff2",
   "date": "2017-06-15 01:14:18",
   "depth": 0,
   "text": "Wow, that all wrapped up really nicely. Ririko's arc, the tale of the dragon, and the matchmaking tour all managed to have the same message about accepting outsiders, and a damn good one at that. "
  },
  {
   "score": 4,
   "id": "dix7q8x",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 19:43:11",
   "depth": 0,
   "text": "Why the girls don't find any attraction to Sandal-san yet I don't know."
  },
  {
   "score": 2,
   "id": "diwhup5",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:09:06",
   "depth": 0,
   "text": "I love Kanami Sekugichi"
  },
  {
   "score": 2,
   "id": "diwj51a",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:31:41",
   "depth": 0,
   "text": "I think Sandal is God or something. The guys a fucking bad ass always being around solving people's problems out of nowhere. "
  },
  {
   "score": 1,
   "id": "diz1khx",
   "pid": "t1_diwj51a",
   "date": "2017-06-15 22:37:44",
   "depth": 1,
   "text": "Sandal ex Machina"
  },
  {
   "score": 2,
   "id": "diwk4le",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:48:59",
   "depth": 0,
   "text": "Was enjoying the Yoshino and Riri moment and then I hear Sandals singing. Damn it Sandals San stop stealing every scene you are in. Also love Riri singing with Sandals playing. Hope we get a version without them talking or someone cleans it up. Also the end we see Sandals a man of many talents painting. Who do you guys think represent which creature?\n\nRiri is obviously the dragon. Which leaves a Phoenix, Unicorn, Pegasus, and a Griffin. I think Yoshino is the Phoenix because it rises from the ashes and they are all trying to resurrect the town, but she is the main force behind this. Shiori is probably the unicorn simply because its associated with friendship and happiness and Shiori seems to be the friendliest of the bunch. Pegasus was known for wisdom and Sanae oftens provides that. Maki is the Griffin due to process of elimination.\n\n"
  },
  {
   "score": 2,
   "id": "diwm0rt",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 12:22:27",
   "depth": 0,
   "text": "The old hag actually smilied properly for once, Wow, just Wow."
  },
  {
   "score": 2,
   "id": "diwstyk",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 14:25:01",
   "depth": 0,
   "text": "I thought the big guy was going turn out to be Riri's dad, but we still got a nice story arc for her with a sweet hug. That song was really nice and Sandal is a top guy, though I curious to see where his story will go now."
  },
  {
   "score": 2,
   "id": "diwxrot",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 16:02:07",
   "depth": 0,
   "text": "one eight"
  },
  {
   "score": 2,
   "id": "dix712m",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 19:27:20",
   "depth": 0,
   "text": "A really nice episode for Ririko and to show some character development for her. The end song for this arc was beautiful as well. "
  },
  {
   "score": 2,
   "id": "dixhcw7",
   "pid": "t3_6h8ff2",
   "date": "2017-06-15 00:37:08",
   "depth": 0,
   "text": "Sandal-san x Ririko, the OTP. They're completely fit for each other."
  },
  {
   "score": 2,
   "id": "dizpojg",
   "pid": "t3_6h8ff2",
   "date": "2017-06-16 10:04:33",
   "depth": 0,
   "text": "For me, this was the best episode and yet best character development in the series. And the song Riri sang at the end, it was so beautiful!"
  },
  {
   "score": 3,
   "id": "dixhiph",
   "pid": "t3_6h8ff2",
   "date": "2017-06-15 00:44:02",
   "depth": 0,
   "text": "ITT a lot of people who have problems dealing with people that are rude. You guys are getting way too bent out of shape by the red shirt guy. He wasn't THAT bad (though he was bad). He was just being insensitive."
  },
  {
   "score": 5,
   "id": "dixo9k7",
   "pid": "t1_dixhiph",
   "date": "2017-06-15 05:18:59",
   "depth": 1,
   "text": "He deserved a good ball kicking"
  },
  {
   "score": 2,
   "id": "dix8ut9",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 20:09:49",
   "depth": 0,
   "text": "\"One-eighth.\"\n\n\"Guild.\"\n\nRiri's arc has hit way too close to home. Literally have a guy I know telling me lately that I need to open up more and that life's gonna suck for me if I don't be more sociable and do more things. I'm just a quiet introvert dammit!"
  },
  {
   "score": 1,
   "id": "diwdood",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:58:02",
   "depth": 0,
   "text": "Best EP so far. Make up for all the cringe and sadness of the last ep."
  },
  {
   "score": 1,
   "id": "diweapo",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:08:31",
   "depth": 0,
   "text": "I wonder which of the creatures the other girls are in Sandal's painting."
  },
  {
   "score": 9,
   "id": "diwuedr",
   "pid": "t1_diweapo",
   "date": "2017-06-14 14:54:13",
   "depth": 1,
   "text": "[Someone](https://www.reddit.com/r/anime/comments/6h8ff2/spoilers_sakura_quest_episode_11_discussion/diwei9u/) posted a rough of it, which I half agree with, and [someone else](https://www.reddit.com/r/anime/comments/6h8ff2/spoilers_sakura_quest_episode_11_discussion/diwjgb1/) posted a correction for two of the girls, which I agree with also. \n\nHere's my take on it as well:\n\nDragon: Ririko - Kind of obvious, since she was the titular Manoyama Dragon this episode\n\nPhoenix:  Maki - Her career, as well as her personal life was on a bit of a downward slide, until she figuratively rose up from the ashes of the house fire a few episodes back.\n\nGryphon: Shiori - Much like the gryphon, Shiori is focused on defending her treasures; that is, the traditions and values of Manoyama\n\nPegasus: Sanae - Pegasus has long been a symbol of wisdom and inspiration, and apart from Shiori, Sanae has provided this in spades.\n\nUnicorn: Yoshino - Unicorns are known for standing firm and fighting when needed, and that's Yoshino to a 'T' through the series. While she initially wanted to run from her duties in Manoyama, when confronted with the reality of her contract, she stood her ground and has given her all."
  },
  {
   "score": 1,
   "id": "diwxwd9",
   "pid": "t1_diwuedr",
   "date": "2017-06-14 16:04:48",
   "depth": 2,
   "text": "Thank you. I like your interpretation. "
  },
  {
   "score": 1,
   "id": "diwednk",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 10:09:51",
   "depth": 0,
   "text": "As someone who has put the show on hold (almost dropping it) at episode 4. How has the show been so far?"
  },
  {
   "score": 1,
   "id": "dix9lbw",
   "pid": "t1_diwednk",
   "date": "2017-06-14 20:27:46",
   "depth": 1,
   "text": "how can you dropped in eps 4 when it's about best girl arc ? \njoke aside, this show surprised me of how down to earth and realistic the approach to revive the town, this show is also so creative each eps about how to approach each character growth while at the same time give us surprise of Manoyama town side that actually there are really cool for small town to have, so if you are into relaxing show with creative and relaxing tone, you should keep watching"
  },
  {
   "score": 2,
   "id": "dixhlka",
   "pid": "t1_diwednk",
   "date": "2017-06-15 00:47:25",
   "depth": 1,
   "text": "I love it. It's been great. This episode is the best so far I think."
  },
  {
   "score": 9,
   "id": "diwelxl",
   "pid": "t1_diwednk",
   "date": "2017-06-14 10:13:43",
   "depth": 1,
   "text": "It's improved imo.\n\nIt's quiet comedy, small-scale drama, and relatable characterisation. Definitely not for everyone, but if you're looking for a soothing show to put on every now and again I think it's worth looking into."
  },
  {
   "score": 1,
   "id": "diwi7nx",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:15:20",
   "depth": 0,
   "text": "Wow what a nice way to end the episode. I'm really glad Riri got fleshed out as a character. I don't think her anxieties will ever go away, nor should we expect it to, but hopefully she'll become more comfortable with her eccentricities, and more importantly hopefully the other towns people will too. \n\nSpeaking of which, even though we got some of the backstory for Riri's grandmother, she still really rubs me the wrong way. She's been continuously rude to Yoshino, especially this episode when Yoshino just wanted to check up on her friend. And by this point Yoshino's shown that she's dedicated to the town and is not likely to run away anytime soon, and while not all her ideas are good she and her group has managed to bring some life back into the town. \n\nSeeing that one guy wash his hand in the drinking water hit a little too close to home. "
  },
  {
   "score": 1,
   "id": "diwibdf",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:17:08",
   "depth": 0,
   "text": "I actually surprised they chose to end with the ending instead of Ririko's song. It was actually pretty good!  "
  },
  {
   "score": 1,
   "id": "diz0gjq",
   "pid": "t1_diwibdf",
   "date": "2017-06-15 22:01:58",
   "depth": 1,
   "text": "Well, it's a requiem, so it's pretty somber and sad. Considering everything ended more or less well, it's not a proper thematic fit."
  },
  {
   "score": 1,
   "id": "diwyjfh",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 16:17:56",
   "depth": 0,
   "text": "I have same feeling like Ririko used this episode, because I always have different interesting than people around me. That being said, I'm begin to confuse to choose who's best girl in this anime : between Shiori or Yoshino."
  },
  {
   "score": 1,
   "id": "diwzdpz",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 16:35:39",
   "depth": 0,
   "text": "Oh wow, that transition from the dragon girl story to the flashes of Ririko growing up was fantastic!"
  },
  {
   "score": 1,
   "id": "dix9js3",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 20:26:42",
   "depth": 0,
   "text": "Does anyone else ship Sandal and Riri after this or am I being a dragon and the only one?\n\nLovely episode."
  },
  {
   "score": 1,
   "id": "dixgq2d",
   "pid": "t3_6h8ff2",
   "date": "2017-06-15 00:10:48",
   "depth": 0,
   "text": "The instant Ririko was researching the dragons I found out the resemblance, and mostly also because I am an introvert as well. Ririko doesn't dislike human, but is just easily overwhelmed by interactions. This begins an idea of self doubt, wondering why is she the weird one out. She doesn't want extra attention, but because of so, she gathers odd looking eyes, and she also wants to try to interact with people normally like Yoshino does. However, every type of people have their own troubles. Yoshino is often hesitant with multiple opinions from different angles and can't make a decision, but Ririko stays true to herself. One part being Yoshino definitely wanted to stay in Tokyo, but was easily pulled into this whole campaign when she was given the chance to leave early in the series. Ririko really did her best to stand in front of the crowd. As an introvert, I always shake uncontrollably in front of crowds, or even just on stage with only a small group of people, even with multiple practices as I used to perform music. I want to give Ririko a big hug and tell her she's just fine the way she is, and I'm weird just as she is.\n\n\nOne thing I'm concerned is the dragon's song sounds so modern when it was supposed to be past on for an extremely long time, but whatever."
  },
  {
   "score": 1,
   "id": "dixhgj9",
   "pid": "t3_6h8ff2",
   "date": "2017-06-15 00:41:28",
   "depth": 0,
   "text": "I liked this episode"
  },
  {
   "score": 1,
   "id": "diy5nre",
   "pid": "t3_6h8ff2",
   "date": "2017-06-15 10:58:12",
   "depth": 0,
   "text": "Omg. Was that a hint of sandal-san x ririko???"
  },
  {
   "score": 1,
   "id": "diz1d27",
   "pid": "t3_6h8ff2",
   "date": "2017-06-15 22:30:50",
   "depth": 0,
   "text": "I wonder if each arc has a different director.  They feel stylistically very different.  The film crew arc had the subplot about Shiori as well as the main one about Maki.  Meanwhile Shiori's arc's big crisis was resolved really easily, but also had that bit where the cast is hanging out in the Castle, wearing elaborate chef costumes for no reason, plus the costume gag at the beginning."
  },
  {
   "score": 1,
   "id": "dj3i8n8",
   "pid": "t3_6h8ff2",
   "date": "2017-06-18 23:53:40",
   "depth": 0,
   "text": "Such a beautiful beautiful episode. I thought some of the other episodes hit the feels but this one tops them all.\n\nRiri is my favorite girl and this just shows how adorable she is. And the way they ended it was perfect. That beautiful song and then the adorable drawing. I love this show."
  },
  {
   "score": 1,
   "id": "dix0qt8",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 17:05:15",
   "depth": 0,
   "text": "The whole eloping thing at the end? Seems like a really really bad idea to disobey your parents."
  },
  {
   "score": 8,
   "id": "dix4dn9",
   "pid": "t1_dix0qt8",
   "date": "2017-06-14 18:27:05",
   "depth": 1,
   "text": "Depends on how old you are and who your parents are. Two 18 year olds fresh out of highschool? Probably a bad idea. Two late 20s with weirdly old fashioned parents, eh, do what you want."
  },
  {
   "score": 1,
   "id": "diwdsb7",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 09:59:42",
   "depth": 0,
   "text": "Cool we got animal legends in that last painting like the dragon, the unicorn, the phoenix, Pegasus, and **a griffin**...~~*a bald eagle of some sort*?~~\n\n[~~What is that?~~](#morethanonewaifu)\n\nIt's nice to see the grouchy grandma look to warm up a bit after seeing Riri look a lot better now."
  },
  {
   "score": 2,
   "id": "diwgjtg",
   "pid": "t1_diwdsb7",
   "date": "2017-06-14 10:46:50",
   "depth": 1,
   "text": ">  bald eagle of some sort?\n\n[A Griffin.](https://en.wikipedia.org/wiki/Griffin) Griffins are awesome.^(Yes, I played a lot of HoMM 3.)\n\nHard to tell who's who, though. \n"
  },
  {
   "score": 5,
   "id": "diwg471",
   "pid": "t1_diwdsb7",
   "date": "2017-06-14 10:39:24",
   "depth": 1,
   "text": "[It's not a bald eagle](https://en.wikipedia.org/wiki/Griffin)"
  },
  {
   "score": 2,
   "id": "diwg6wp",
   "pid": "t1_diwg471",
   "date": "2017-06-14 10:40:41",
   "depth": 2,
   "text": "Ah thanks. I knew something was off."
  },
  {
   "score": 1,
   "id": "diwjutr",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 11:44:14",
   "depth": 0,
   "text": "Ririko parent situation seems a bit extreme to me. They got divorced when she was still a baby/little kid and for some reason her father got the custody of her. Then he left for overseas job and mother cut contact with her. I dunno... this behaviour of her parents is so selfish and I don´t think it would go like this in real life. Honestly, it breaks immersion for me. Despite that I still enjoyed the episode as whole and there is still chance for some more development in future episodes. "
  },
  {
   "score": 3,
   "id": "dixhnaq",
   "pid": "t1_diwjutr",
   "date": "2017-06-15 00:49:25",
   "depth": 1,
   "text": "I've seen plenty of \"problem kids\" online and in real life that have significantly more messed up childhoods. Honestly this isn't surprising at all. It's the stupid unfortunate reality of people who hook up not to start a family and spend the rest of their lives together but just to be sex friends. It's all too common."
  },
  {
   "score": 3,
   "id": "dix8re0",
   "pid": "t1_diwjutr",
   "date": "2017-06-14 20:07:28",
   "depth": 1,
   "text": "> this behaviour of her parents is so selfish and I don´t think it would go like this in real life.\n\nEh I'd say it probably happens often enough to be a problem."
  },
  {
   "score": 1,
   "id": "diwlcit",
   "pid": "t3_6h8ff2",
   "date": "2017-06-14 12:10:21",
   "depth": 0,
   "text": "I cant put my fingre on it but I havent really enjoyed these two episodes all that much. The shows still good and I'm excited for whats next but these two just did not hold my attention at all."
  },
  {
   "score": 2,
   "id": "diz1hpt",
   "pid": "t1_diwlcit",
   "date": "2017-06-15 22:35:04",
   "depth": 1,
   "text": "I think it's because every other episode has had the framing device of trying to pull of an event despite setbacks.  The singles retreat wound up going really well, so that tension was missing.  I thought we'd see more of it."
  }
 ]
}