{
 "score": 653,
 "id": "6fucmh",
 "num_comments": 171,
 "date": "2017-06-07 09:00:40",
 "comments": [
  {
   "score": 356,
   "id": "dil5wa0",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:39:19",
   "depth": 0,
   "text": "This is why I love this show.\n\nNo big loud melodrama, it's quiet, subtle and relatable.\n\nThis episode is a really accurate portrayal of what it's like growing up as a shy introvert with social anxiety. Almost uncomfortably so.\n\nYou can't help feeling like there must be something wrong with you. Groups exhaust you, people all around you seem to have energy and confidence without trying and expect you to be the same, but it doesn't work like that. People are different, some people are shy and extroverts (i.e. they're shy, but 'get their energy back' by being around other people), some people are shy and introverts (i.e. they get their energy back on their own). And if you're a shy introvert with social anxiety, it's so easy to feel cut off from other people.\n\nIt was only after becoming an adult that I realised that was ok. \n\nNot everyone is an extrovert, not everyone 'gives off energy' to other people. Some of us are quieter, and need time and space in order to feel comfortable. And even though we might sometimes need time to ourselves, or be away from a group, that doesn't mean we don't like people. It doesn't mean we don't want to spend time with others.\n\nBut sometimes when we try, and it tires us out, and we have to leave early or we feel unable to participate, it ends up making us feel more lonely than if we hadn’t been there at all. And that's why Riri leaves rather than watching them dance; seeing that will only make her feel more isolated and that there's something wrong because she doesn't want to do the dance. Sometimes we need time alone, but that doesn't mean we want to be lonely. That's why I stopped going to big parties and stuff. It was too loud, there were too many people, it made me feel uncomfortable, and even if I was having fun I got exhausted and had to leave so I could calm down and just breathe. It was horrid, I didn't enjoy it at all. But I was a first year uni student and everyone was doing exactly that and seemed to be enjoying it, so it must have been something wrong with me, right? Well, no.\n\nI don't like big parties, I prefer to spend time with friends more personally. No strangers around, no big noise, no crowds, just us having dinner, or watching a movie, or chatting, or cuddling, or working, or doing anything. I don't want big birthday parties, or Christmas parties, I want something small and quiet where I can spend time with those handful of people who I love as family.\n\nI enjoy that so much more than big parties, and whereas the big crowds make me feel isolated and lonely, those closer-knit groups make me feel at home and comfortable, and confident. I don't feel even remotely alone, because I'm not.\n\nAnd I may be projecting here, but to my eyes, Ririko's the same.\n\nThe classrooms and large groups made her feel isolated, the expectations and demands of others (smile, dance, be happy, be an extrovert) made her feel alienated, and her discomfort with those things has made her feel that there's something wrong with her. Ad then Shiori says that she's changing and she's happier, but she doesn't feel like anything has changed, she doesn't feel any happier; she's more comfortable in that smaller group, but still not speaking much, still unsure, and hasn't realised that's ok. She feels, like I felt, that because she's different from those around her, there must be something wrong with her. \n\nHer home situation isn't helping any. She's an adult now but she doesn't have independence, she's not being allowed to spend time with the others and make up her own mind. I was also the same, and it was after I became more independent that I started figuring out what I needed. Tbh she needs to move out and gain more control over her own life, thinking about it, moving in to the log cabin might be just what she needs. Whether she does or not, she will have to become more assertive and independent in her home life. Calling it now!\n\nAnd I reckon that over the course of this show (beginning from the next episode) she's going to realise that she isn't 'wrong'. That there isn't something wrong with her, she's just *her*. And what she needs to feel safe and happy isn't necessarily the same as what everyone else needs. There's nothing sad about it, finding out what you need to feel happy is a good thing.\n\nWhat they're doing with Ririko here is a very mature and calm representation of how that feels. It’s silent and it affects every aspect of your life. And I know how it feels.\n\nAnd I have never seen a show handle a theme like this in such a simple, understated, and accurate way. It's totally realistic.\n\nCuriously I also remember not being bothered much by rain too, it felt soothing somehow. \n\nThere’s nothing wrong with shy people, everyone’s just different, and it can take a lot of time (and meeting the right people) to learn that and to feel happier. "
  },
  {
   "score": 2,
   "id": "djg2c9o",
   "pid": "t1_dil5wa0",
   "date": "2017-06-26 19:04:00",
   "depth": 1,
   "text": "Wow! That was amazingly well written! Yeah seriously, this show is so great. It feels so authentic if that makes sense. Each of the characters has really interesting personalities and everything! I agree with all you said too. I really connected with Riri these past few episodes."
  },
  {
   "score": 2,
   "id": "dj2pytl",
   "pid": "t1_dil5wa0",
   "date": "2017-06-18 12:02:20",
   "depth": 1,
   "text": "This perfectly explains the experience and feelings that introverts go through. I've always been shy as a kid but I've learned at a young age how to essentially force myself to be more outgoing in certain situations, not just out of fear of being seen as the odd man out but out of personal responsibility, too. Just this week, I've had to moderate several panels for a conference as a favor to the organizers, who have helped me out over the years. Earlier this year, I also did a storytelling session in front of a theater audience for work and spoke at a large gathering in front of hundreds of guests honoring my grandmother. Folks commended me on those occasions for being a \"natural\" at public speaking but what I don't tell people is that it takes a tremendous amount of effort because I still get quite nervous and experience anxiety when talking in front of people. But it's something I understand that I need to learn to deal with whether it be for my job or family. It's just that some introverts deal with it better than others and I think it's important not to force or judge folks who may not be as comfortable with it. For the most part, I've seen people be quite understanding, provided they realize what's going on."
  },
  {
   "score": 3,
   "id": "din1p3x",
   "pid": "t1_dil5wa0",
   "date": "2017-06-08 11:57:38",
   "depth": 1,
   "text": "Pretty much.  I've learned to adapt since I  can't always be like that but the introverted feel will always be there"
  },
  {
   "score": 3,
   "id": "dimb9et",
   "pid": "t1_dil5wa0",
   "date": "2017-06-08 02:17:05",
   "depth": 1,
   "text": "Watched the ep before going to work. Sitting in the break room with the others with the tv on, half way through reading your comment I had to get up and go for a walk outside. I didn't get the connection between going for a walk in the rain till I finished it. It's pouring out and I forgot my coat. "
  },
  {
   "score": 4,
   "id": "dilgmpk",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 13:44:09",
   "depth": 1,
   "text": "wow that got so real "
  },
  {
   "score": 10,
   "id": "dil9eii",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 11:39:26",
   "depth": 1,
   "text": "I wish I could give you gold, but all I can afford is [reddit silver](http://i.imgur.com/1ZuMORo.jpg)"
  },
  {
   "score": 9,
   "id": "dilcj1h",
   "pid": "t1_dil9eii",
   "date": "2017-06-07 12:33:02",
   "depth": 2,
   "text": "Hell, I don't want the bastards at reddit to get money :P That silver is gold to me!"
  },
  {
   "score": 6,
   "id": "dil7kpu",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 11:08:15",
   "depth": 1,
   "text": "Well said. "
  },
  {
   "score": 8,
   "id": "dim76dn",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 23:25:14",
   "depth": 1,
   "text": "INTROVERTS TAKE MANHATTAN\n\n- Three days on the town, marveling at all that energy \n- Three days in bed, recovering from the experience\n\nAt least, that's been my take."
  },
  {
   "score": 6,
   "id": "dilwxt1",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 19:17:29",
   "depth": 1,
   "text": "Thank you for this post, sincerely."
  },
  {
   "score": 8,
   "id": "dilzql7",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 20:15:36",
   "depth": 1,
   "text": "What I find neat is that how Japan treated shy introverts.. I'm not totally certain they treat them better but based on what I know about Japan I assume they let them be. Which I admire..\n\nIn America I acted exactly like Riri when I was in elementary school. I often sat down in a corner by myself away from people.. What I got was scolded by the teachers with \"can't play well with others\" being told to my parents and bullied by the other kids. Luckily my parents didn't bother me about what the teacher's said, I think they got mad at the teacher's actually..\n\nAlso luckily I was a big kid who had above average athleticism, so physical bullying didn't work on me. But they grew smarter and resorted to using the teachers to get me in trouble.. When several kids make the same claim against 1 kid, the teacher believes the several kids.. \n\nThis is a big reason I wish I was raised in Japan, and if I have kids I'd prefer them to be raised in Japan.. Though I'm white so I'd be worried about them being bullied for not being Japanese."
  },
  {
   "score": 4,
   "id": "dio7rag",
   "pid": "t1_dilzql7",
   "date": "2017-06-09 06:05:21",
   "depth": 2,
   "text": "OMG"
  },
  {
   "score": 8,
   "id": "dilpmla",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 16:42:27",
   "depth": 1,
   "text": "Yes, Ririko is very relatable in the terms of being a shy introvert. At some point in time the person will self doubting, wondering if they're just weird and cut off from society. At one point they'd try to have fun with others as everyone else looked so cheerful. It just doesn't work out for everyone. At some point in my life I learned to deal with people and strangers without coming off as a jerk and learned to hold conversations better, but I'm still mostly uncomfortable when dealing with situations like this. In a sense, it is a skill I picked up to avoid further attention by carefully navigating through it. Some people are weird, but as long as it isn't hurting anyone else, it is fine to be weird. Well, I tell that to others, but I also have problems actually staying true to that myself."
  },
  {
   "score": 13,
   "id": "dilhbko",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 13:56:21",
   "depth": 1,
   "text": "> It was only after becoming an adult that I realised that was ok. \n\nThat's how I feel lately. I vastly enjoy time alone playing video games or surfing the internet over hanging out with people. I do quite a few chores daily that can leave me feeling tired and so I want to be left alone.\n\nUnfortunately for me this guy I know thinks that's quite wrong and it's, \"Something I need to work on.\" \n\nHe's a guy who's quite loud, energetic and passionate about the things he likes. He's a nice guy and I do enjoy hanging out with him sometimes. After a few hours of hanging out though I need a few days away from him as I just get so tired."
  },
  {
   "score": 10,
   "id": "din7sdw",
   "pid": "t1_dilhbko",
   "date": "2017-06-08 13:44:52",
   "depth": 2,
   "text": "Man I hate people like that who can't take a hint."
  },
  {
   "score": 6,
   "id": "dintij6",
   "pid": "t1_din7sdw",
   "date": "2017-06-08 21:14:09",
   "depth": 3,
   "text": "To be fair, sometimes people can be bad at giving hints.\n\nTo use myself as an example, even if someones bothering me I'm so conflict averse (like even in the tiniest of ways when it comes to strangers) that I'll just act like everything is fine and pray something happens that gets me out of the situation."
  },
  {
   "score": 14,
   "id": "dildypl",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 12:57:34",
   "depth": 1,
   "text": "Thanks for really nailing what it's like being an introvert. I know that people on Reddit really like to toss that term around like it's equivalent to being shy, but that's not necessarily the case. As you said it's about being able to \"recharge\" by spending time alone, but you still enjoy hanging out with a small group of friends."
  },
  {
   "score": 18,
   "id": "dilnmzt",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 15:59:56",
   "depth": 1,
   "text": "Add gender stereotypes on top of it (women should smile, men should be aggressive, etc.), and we have the perfect recipe of how to make such a person miserable before realizing well into the adulthood that it is all okay and nothing to be ashamed of."
  },
  {
   "score": 20,
   "id": "dil6mvt",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 10:52:00",
   "depth": 1,
   "text": "Absolutely nailed it."
  },
  {
   "score": 30,
   "id": "dilf8xv",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 13:19:38",
   "depth": 1,
   "text": "I think Ririko's complication with her grandmother isn't that she isn't being allowed freedom (given how Shiori talks about their relationship I get the sense that she could actually have a lot more if she wanted it) so much as her grandmother is not only protective of her/skeptical of the whole tourism project but also accommodates her introversion without pushing when Ririko withdraws from her friends and is looking uncomfortable.  "
  },
  {
   "score": 32,
   "id": "dilzkko",
   "pid": "t1_dilf8xv",
   "date": "2017-06-07 20:12:01",
   "depth": 2,
   "text": "This is my only critique for the post. Ririko's grandmother is stern and huffy about a lot of things, but she really cares for Ririko. IMO, she wants Ririko to go out and hang out with friends, but at the same time, understands her and reassures her that it's ok to come back early if she wants to. That being said, progress might be too slow, and the grandmother might be holding her back by being too accommodating. "
  },
  {
   "score": 57,
   "id": "dilb2aj",
   "pid": "t1_dil5wa0",
   "date": "2017-06-07 12:08:06",
   "depth": 1,
   "text": "Well put.\n\nI feel like part of Riri wants to join the others and dance, but she's convinced herself that she's not meant to be up there with the others - whether it's from a fear of failing and embarrassing herself or even just to avoid the question, \"what's an introvert like her doing?\" In the end, she just leaves and ends up feeling even more lonely because she can't join in when she sees her friends having fun. \n\nThis even shows in the little things, like her absence from conversations with the rest of the group and not partaking in the little quips and inside jokes like the others. You end up feeling like no one else notices you, and honestly, it can weigh pretty heavily on your mind when going out with friends."
  },
  {
   "score": 2,
   "id": "dio7fzy",
   "pid": "t1_dilb2aj",
   "date": "2017-06-09 05:57:03",
   "depth": 2,
   "text": "True"
  },
  {
   "score": 111,
   "id": "dil1iq6",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 09:23:08",
   "depth": 0,
   "text": "I don't know why this show has so little attention. I started it yesterday and I'm enjoying it so far. Solid 7-8 from me. I haven't watched shirobako or Hanasaku Iroha yet though. "
  },
  {
   "score": 1,
   "id": "dimgi8k",
   "pid": "t1_dil1iq6",
   "date": "2017-06-08 05:31:08",
   "depth": 1,
   "text": "I like this show, but it falls about 2 points under Hanasaku Iroha for me. If you enjoy this type of thing I heartily recommend checking out the other two."
  },
  {
   "score": 2,
   "id": "din4rtg",
   "pid": "t1_dil1iq6",
   "date": "2017-06-08 12:51:18",
   "depth": 1,
   "text": "I think they're 3 different shows factoring slice of life. Shirobako focus on the transition of getting a job and the challenge in keeping it. Hanasaku is discovering yourself changing your life style but with a romance on top of it (which I think it was dispensable for what a liked in the show). And Sakura Quest, although have a start with the same principle has Hanasaku Iroha, the main theme of the show is how to revitalize a little country without losing it's tradition while being interesting to tourists.\n\nOn my count, Shirobako does it's job superbly well, a must watch if you like this genre. Seconded by Sakura Quest (thank god they're avoiding romance in this, it just isn't right for the purpose of the show) and last but not least, Hanasaku Iroha makes a very good job on developing the MC and the people around her, but the romance drama kind change things and I was looking for a different direction on that part, but that just me. Good shows, slightly different in their core direction, with powerful characters interecting with each other."
  },
  {
   "score": 6,
   "id": "dil30oa",
   "pid": "t1_dil1iq6",
   "date": "2017-06-07 09:49:15",
   "depth": 1,
   "text": "Probably getting a 9 from me at this rate."
  },
  {
   "score": 3,
   "id": "dilai1f",
   "pid": "t1_dil1iq6",
   "date": "2017-06-07 11:58:26",
   "depth": 1,
   "text": "The best parts of SQ by far are those where main cast actually focuse on doing their job to \"Make Kabura Kingdom Great Again\", but when personal drama is on the foreground - it just feel (for me) like writers really struggle with it."
  },
  {
   "score": 3,
   "id": "dil1mea",
   "pid": "t1_dil1iq6",
   "date": "2017-06-07 09:24:54",
   "depth": 1,
   "text": "> I haven't watched shirobako or Hanasaku Iroha yet though.\n\nIf you're on the fence about checking them out, I say go for it. They're both great."
  },
  {
   "score": 1,
   "id": "dil233t",
   "pid": "t1_dil1mea",
   "date": "2017-06-07 09:33:01",
   "depth": 2,
   "text": "I'm not on the fence. Both on my PTW. I already have a list of stuff I'm currently watching.... Little Witch Academia, AoT, yu yu hakusho, sakura quest and fate zero. Then Ultimate blade works,  my hero academia, After I finished off fate zero/aot. "
  },
  {
   "score": 5,
   "id": "dilipo4",
   "pid": "t1_dil233t",
   "date": "2017-06-07 14:22:16",
   "depth": 3,
   "text": "One thing I'd say about Shirobako is watching it might help give the other shows on your list a different appreciation, what went in to creating them and what elements are put together to create each scene, and just the general feel of the working habits of the animation industry. It has a very positive outlook but the key elements are there. \n\nEspecially with something like My Hero Academia and UBW which both have excellent animation cut from completely different cloths, it can be interesting to approach them with the knowledge gained by Shirobako. Also its a really fun and heartwarming show. "
  },
  {
   "score": 5,
   "id": "dil253y",
   "pid": "t1_dil1iq6",
   "date": "2017-06-07 09:33:57",
   "depth": 1,
   "text": "I haven't seen Shirobako yet but Hanasaku Iroha was fantastic."
  },
  {
   "score": 10,
   "id": "dil298g",
   "pid": "t1_dil253y",
   "date": "2017-06-07 09:35:57",
   "depth": 2,
   "text": "Shirobako is apparently the best. I've seen many people rate it highly who normally don't like Sol or moe anime. It's a lot of people's fav show. "
  },
  {
   "score": 1,
   "id": "dip5b7n",
   "pid": "t1_dil298g",
   "date": "2017-06-09 17:16:55",
   "depth": 3,
   "text": "I'm a fan of slice of life, but no matter how much I tried I just couldn't get into Shirobako. Slogged my way through four or five episodes before I finally gave up. Haven't had any trouble with Sakura Quest so far, but Shirobako just never clicked for me."
  },
  {
   "score": 1,
   "id": "dix1rug",
   "pid": "t1_dip5b7n",
   "date": "2017-06-14 17:27:46",
   "depth": 4,
   "text": "I addressed a similar post [here](https://www.reddit.com/r/anime/comments/6fucmh/spoilers_sakura_quest_episode_10_discussion/dix1n9t/), maybe it might help you too."
  },
  {
   "score": 1,
   "id": "dinwvpr",
   "pid": "t1_dil298g",
   "date": "2017-06-08 22:54:37",
   "depth": 3,
   "text": "It's one third workplace comedy, one third documentary for the anime industry, one third magical realism/imagine spots."
  },
  {
   "score": 11,
   "id": "dilks0u",
   "pid": "t1_dil298g",
   "date": "2017-06-07 15:01:38",
   "depth": 3,
   "text": "Yep, its one of those rare pearls that transcends genres.\n\nKinda like K-on! turns people into moe addicts."
  },
  {
   "score": 1,
   "id": "dilky69",
   "pid": "t1_dilks0u",
   "date": "2017-06-07 15:05:04",
   "depth": 4,
   "text": "I haven't watched k-on. I usually never start with the top series weirdly. I still have yet to watch fmabh. I was planning on doing yu yu, hxh and then fmabh. I even have the blu rays, but I haven't watched them."
  },
  {
   "score": 9,
   "id": "dilwcvv",
   "pid": "t1_dil1iq6",
   "date": "2017-06-07 19:05:58",
   "depth": 1,
   "text": "I like Shirobako a lot more (10/10), but I still think Sakura Quest is pretty good. Shirobako is a lot more fast paced and exciting imo."
  },
  {
   "score": 1,
   "id": "dimxg99",
   "pid": "t1_dilwcvv",
   "date": "2017-06-08 10:45:07",
   "depth": 2,
   "text": "Not OP but I've watched a couple of episodes of Shirobako and got kind of bored. I think they were just about to introduce one of the HS friends again (the seiyuu) but I haven't picked it back up. Worth going back?"
  },
  {
   "score": 2,
   "id": "dix1n9t",
   "pid": "t1_dimxg99",
   "date": "2017-06-14 17:24:55",
   "depth": 3,
   "text": "This is a bit late so I don't know how useful it is but Shirobako needs the first few episodes to solidify (in a way). You get thrown into many characters and you know not one of them so end up not being invested in them but that changes and you get to learn more about them, what they are working on, and who they are. \n\nI don't know if I would say the show changes but your time with those characters changes you a bit (their job in the show is still overall the same but you get to know more of the details of it and how/why something affects something else). You end up less as an outsider looking in and more like one of the team. "
  },
  {
   "score": 1,
   "id": "dix3wuo",
   "pid": "t1_dix1n9t",
   "date": "2017-06-14 18:16:22",
   "depth": 4,
   "text": "I've recently started watching more episodes. I think I'm currently on 7 or 8. It's growing on me but it still seems slow. I just got to the first major crisis where Episode 8's animation director said he'd quit. Great resolution to it. "
  },
  {
   "score": 1,
   "id": "dix7d68",
   "pid": "t1_dix3wuo",
   "date": "2017-06-14 19:34:55",
   "depth": 5,
   "text": "> It's growing on me but it still seems slow.\n\nThe panic happens towards the end of the season (of the show they are making) but the characters also draw you in with their their own struggles (which is more effective when you know more about them). The panic/hectic elements overlap with their schedule (it's hard to have major time based conflicts/problems at the start of a production). \n\nFor a slice of life show about how anime is made you end up quite emotional invested in that crew at the end of it (and not just the five friends). \n\nI can't remember if Ema's cubicle neighbour (Shigeru Sugie) is already introduced by this point but he and the whole animation department slowly get a nice spotlight upgrade and the show focuses a bit less on the production management of things and starts to include more details about the rest of the production (art, audio, research, writing, …). I feel that's when the show grows into itself and shows its soul. "
  },
  {
   "score": 1,
   "id": "dix7tbw",
   "pid": "t1_dix7d68",
   "date": "2017-06-14 19:45:06",
   "depth": 6,
   "text": "Awesome! I'll grind it out! I have so many other things I'm watching too. Went back to Chihayafuru, plus new House of Cards, Master of None and I slacked on the new series of Sherlock. \n\nThanks for the awesome motivation to keep watching! "
  },
  {
   "score": 2,
   "id": "diyvs38",
   "pid": "t1_dix3wuo",
   "date": "2017-06-15 19:55:18",
   "depth": 5,
   "text": "I also found Shirobako took a while to hit its stride.  It wasn't bad, and it looked great, but I wasn't really excited for it for a lot of the first cour.  I remember really loving the second cour though"
  },
  {
   "score": 6,
   "id": "din0k02",
   "pid": "t1_dimxg99",
   "date": "2017-06-08 11:38:09",
   "depth": 3,
   "text": "You stopped right before they introduced best girl?! I think you should give it another chance."
  },
  {
   "score": 13,
   "id": "dil1q30",
   "pid": "t1_dil1iq6",
   "date": "2017-06-07 09:26:44",
   "depth": 1,
   "text": "This is my favorite new show of the season, so glad its 2 cour"
  },
  {
   "score": 23,
   "id": "dil4ws3",
   "pid": "t1_dil1iq6",
   "date": "2017-06-07 10:22:24",
   "depth": 1,
   "text": "Everyone has their own preferences. There are definitely people out there who find these type of SOL shows to be super boring. Some people also came in expecting Shirobako: Rural edition (I'm a guilty party member). SQ does a lot of things well (i.e. giving equal time to all the girls), but the reason I don't like it as much (still find it an ejoyable show) as Shirobako is that it feels too sitcom-y to me. When it shows the girls struggling and getting dumpstered by real life is when I think the show is at its best. Shiori has shown fantastic growth in her arc, which I really enjoyed, but I'm still not a fan of everything being so easily resolved. I'm not against nor do I hate optimistic shows, it just feels a bit silly when SQ does it. This is just my personal preference and opinion. I have it at a strong 7, weak 8 as well. "
  },
  {
   "score": 5,
   "id": "dilyrie",
   "pid": "t1_dil4ws3",
   "date": "2017-06-07 19:54:41",
   "depth": 2,
   "text": "I think for me its the opposite. Shirobako can get too intense at times and I disliked Hanasaku Iroha because it just has too much drama, but SQ has been perfect so far in that it has plot, it has comedy, and it has character development, and the characters draw you in without having drama.  But I guess my preference tends towards SOLs so thats probably why... "
  },
  {
   "score": 3,
   "id": "dimp94y",
   "pid": "t1_dilyrie",
   "date": "2017-06-08 08:29:24",
   "depth": 3,
   "text": "Based on what you said, it totally makes sense why you enjoy SQ the most and I can totally understand that. SQ is much more light hearted while still having drama aspects which will be much more appealing to many people. I personally really enjoy harsh truths of reality. Though that could just be because I'm a dude in his early 30's and life is hard man haha. I like drama, but natural drama (if that makes sense) none of that forced crap. An example of forced drama is in currently airing show Re:Creators. Surprisingly enough I actually enjoyed the show quite a bit, until Megane showed up. Naturally flowing drama of just life being life is wonderful and great. But drama being forced through purposeful misunderstandings, etc. Bleck. She singlehandedly almost made me want to drop the show haha. Praise Jeebus for Meteroa. \n\nAnyways my point is we have different tastes and I completely understand why someone would prefer SQ! Hope you have a lovely day!"
  },
  {
   "score": 2,
   "id": "dinw9ln",
   "pid": "t1_dimp94y",
   "date": "2017-06-08 22:34:11",
   "depth": 4,
   "text": "That's quite fair, natural drama is great, and its a common feature of all of my favourite anime. Although I do wish I was also able to enjoy the harsh truths of reality, but instead I choose to try and escape it by watching CGDCT in a rural town. ¯\\_(ツ)_/¯     \n     \nHave an awesome day to you too, and a nice break from the salt-filled pages of the Best Girl contest.    \n    \n(And agree 100% about Re:Creators. I have never appreciated 2/3rds of an episode of Exposition-chan talking as much as I did after watching 2/3rds of an episode of Megane talking.)"
  },
  {
   "score": 54,
   "id": "dil2plt",
   "pid": "t1_dil1iq6",
   "date": "2017-06-07 09:43:52",
   "depth": 1,
   "text": "I had to drop it for a while because it has been to relevant to my real life and my job hunt. Now that I am having some luck, I will pick this show back up."
  },
  {
   "score": 47,
   "id": "dil6xh3",
   "pid": "t1_dil2plt",
   "date": "2017-06-07 10:57:02",
   "depth": 2,
   "text": "The show is much more light hearted and optimistic all around compared to the likes of Shirobako. They do have their struggles but everything so far has been resolved rather quickly. \n\nGlad to see you're starting to have some luck. As someone who graduated college right after the financial collapse in 08-09 I know the pain and struggles. Don't believe in yourself. Believe in me who believes in you. "
  },
  {
   "score": 4,
   "id": "dimm2sr",
   "pid": "t1_dil6xh3",
   "date": "2017-06-08 07:31:38",
   "depth": 3,
   "text": "I was thinking that Sakura Quest is a pessimistic/grounded approach on this kind of genre. It always make me feel that they wont really succeed on what theyre doing but theyre learning about how to handle mediocrity and lose in the process. What I think as a light hearted and optimistic one is Barakamon. (tho I dont know if they were really the same genre)\n\n\nIve been meaning to watch Shirobako, but basing on your observation, Ill probably be constantly sad/ anxious on that anime. will watch it definitely. lol"
  },
  {
   "score": 3,
   "id": "dimovnc",
   "pid": "t1_dimm2sr",
   "date": "2017-06-08 08:22:51",
   "depth": 4,
   "text": "Haha. I apologize if I scared you away from Shirobako. I really do hope you give it a shot. It is truly fantastic.\n\nI'm sure you and I have very different upbringings and experiences in life so I'm sure that plays a huge factor in what we see as pessimistic and grounded. For example in terms of sadness of a show I (and probably unfairly) compare everything to season 4 of The Wire, which is still one of the most soul crushing things I have ever experienced. \n\nI definitely find most of SQ as comedy and light hearted. BUT at the same time it does have the harsh truths and realities of life sprinkled in. Therefore I can see why this show would be more appealing to some people. Yes they have problems and obstacles, but it all seems to be worked out smoothly and quickly. Which unfortunately doesn't happen in real life, most of the time. One thing I will agree with you on is your statement on handling mediocrity. I can see how for several of the girls learning to accept that their big dreams just aren't happening is a nice dose of reality. But again I'm not here to say your thoughts and opinions are wrong. Just that I see things differently. Funnily enough, I actually like Barakamon much more than SQ (up to this point) despite it being more light hearted and optimistic. But like I said above we have different experiences and tastes, hell I could be completely overselling Shirobako. You may think it's actually much happier or a much worse show, and that is fine. Still hope you give it a shot. Truly rewarding show. Anyways hope you have a wonderful day!"
  },
  {
   "score": 1,
   "id": "din8j7q",
   "pid": "t1_dimovnc",
   "date": "2017-06-08 13:58:26",
   "depth": 5,
   "text": "thanks for the thorough reply! yeah, dont worry, Im still watching it. \n\n> season 4 of The Wire\n\ncoool! im currently watching the wire and finished season 3 but it was too much for me and took a break watching it. lol. now im pretty excited continuing it. as far as traumatizing experience, Welcome to NHK is probably on the top of mine. \n\nyeah barakamon actually made me cry, I like it. Though I think its not as grounded. Still, its fun to watch. Hope you have a wonderful day too!"
  },
  {
   "score": 1,
   "id": "dinkhms",
   "pid": "t1_din8j7q",
   "date": "2017-06-08 17:59:21",
   "depth": 6,
   "text": ">im currently watching the wire and finished season 3 \n\nYou sir have now made a life long friend. The Wire is one of my favorite shows of all time. I totally understand it being too much and needing a break. I had to take breaks several times while watching it. Welcome to NHK is definitely a rough one as well. "
  },
  {
   "score": 4,
   "id": "dinwtn7",
   "pid": "t1_dimm2sr",
   "date": "2017-06-08 22:52:36",
   "depth": 4,
   "text": "Sakura Quest is definitely more dramatic/pessimistic than Shiro Bako.  Shiro Bako is way wackier overall, with a focus on the ensemble cast and documentary instead of individual drama or character growth."
  },
  {
   "score": 6,
   "id": "dimnubp",
   "pid": "t1_dimm2sr",
   "date": "2017-06-08 08:04:07",
   "depth": 4,
   "text": "Shirobako is quite optimistic, hell people criticize it for being too optimistic. \n\nIt was a great watch for me. Humour keeps things light and I wasn't sad or anxious at all watching it, maybe aside from 1 or 2 scenes. "
  },
  {
   "score": 2,
   "id": "dimo79i",
   "pid": "t1_dimnubp",
   "date": "2017-06-08 08:10:46",
   "depth": 5,
   "text": "ooooh. thanks! looking forward to watching it!"
  },
  {
   "score": 11,
   "id": "dil93xu",
   "pid": "t1_dil6xh3",
   "date": "2017-06-07 11:34:22",
   "depth": 3,
   "text": "[](#helmetbro)\n\nThanks. I think my odds are really good for the job I interviewed for. With the references I have at the company already, I just need to not mess up. Apparently I'll have to watch Shirobako later too."
  },
  {
   "score": 5,
   "id": "dinp6xe",
   "pid": "t1_dil93xu",
   "date": "2017-06-08 19:34:08",
   "depth": 4,
   "text": "We'll be rooting for you! Good luck and prosper :)"
  },
  {
   "score": 66,
   "id": "dil2bfw",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 09:37:01",
   "depth": 0,
   "text": "I swear this is the only show where I refuse to skip the OP every single week. It's just such a fun little song to listen to."
  },
  {
   "score": 5,
   "id": "dil34px",
   "pid": "t1_dil2bfw",
   "date": "2017-06-07 09:51:14",
   "depth": 1,
   "text": "Full version came out this week!"
  },
  {
   "score": 12,
   "id": "dil6zys",
   "pid": "t1_dil2bfw",
   "date": "2017-06-07 10:58:09",
   "depth": 1,
   "text": "I don't enjoy listening it so much as watching it. I found that the full version doesn't appeal to me so much, but watching Yoshino run full speed through the day while interacting with the others is what really makes the OP enjoyable for me.\n\nFull version ED is beautiful, though."
  },
  {
   "score": 2,
   "id": "dinusi2",
   "pid": "t1_dil6zys",
   "date": "2017-06-08 21:49:07",
   "depth": 2,
   "text": "I haven't gotten around to hearing the full version yet. I really like the song but last time I checked the full wasn't available. It's tied for my favorite OP of the season with the OP from ID-0"
  },
  {
   "score": 60,
   "id": "dil797b",
   "pid": "t1_dil2bfw",
   "date": "2017-06-07 11:02:40",
   "depth": 1,
   "text": "The ED too!"
  },
  {
   "score": 3,
   "id": "dilf59o",
   "pid": "t1_dil797b",
   "date": "2017-06-07 13:17:51",
   "depth": 2,
   "text": "I'm beginning to wonder if Anime OP/ED themes are sped up or slowed down to fit 1 minute 30 seconds. In my opinion, the ED song sounds that much better when sped up to 1.2x speed."
  },
  {
   "score": 2,
   "id": "dio059u",
   "pid": "t1_dilf59o",
   "date": "2017-06-09 01:06:30",
   "depth": 3,
   "text": "I quite like the slowness of the verses and then the faster chorus."
  },
  {
   "score": 64,
   "id": "dil88td",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 11:19:36",
   "depth": 0,
   "text": "And here I thought I could take a break from the Wardrobe, but P.A. Works just keep being the guys walking the extra mile when it comes to details.\n\n[](#taigasigh)\n\nIt always amazes me how big and roomy the animators make japanese cars look alike. I'm 6 foot and 2 inches tall and those [Nissan March](http://imgur.com/Aar2V12.jpg) are so unfomfortable to ride; even my smaller friends have a hard time within those, and lets not even talk when there are 5 of us within that small car.\n\n[*I'm afraid that as a queen I must watch over you all over till the end*](http://imgur.com/XyuJMev.jpg). And here I thought all the other girls and residents of Manoyama were the ones taking care of you dear Yoshino.\n\nWhen the whole bachelor meet up started I was like [\"are there eligeable bachelors in Manoyama?\"](http://imgur.com/bTZeRNp.jpg) and then [Taka-san](http://imgur.com/RfbijyY.jpg) just popped up. I felt sorry for the city girls, too bad he's already married. hah hah, Maki's [*tsukomi*](http://imgur.com/JuoMBWP.jpg) was right on point. This is one of the best assets of the show, the facial expressions from the whole cast, even supports and background characters.\n\nI don't know if I should catalogue [Erika](http://imgur.com/HlDfAIO.jpg) this time as savage or just downright rude with the ladies, but I get it, she must protect her man.\n\nI laughed so hard that almost fell off from my chair when [Sandal](http://imgur.com/8cMPRjB.jpg) popped out playing *\"here comes the bride\"* on a violin. I was like FUCK YOU Sandal (in a nice way, he's fantastic). Even the other [bachelors](http://imgur.com/fqM7Hq4.jpg) think he's a threat. Hah, those guys must watch more anime if they think Sandal [can't get away](http://imgur.com/3VdPVyc.jpg) with all of the bishies on his own.\n\nI have a bit of mixed feelings about this Riri arc. Although I loved the humor about the adults trying to score a girl from the city, I feel like there was so little Riri in the story to see in this episode. Sure, we get to see younger Riri & younger Shiori, but I feel like I'm not getting the whole pie I ordered. At least this is only part one, lets hope there's more Riri to enjoy next episode.\n\n#EPISODE 10 OUTFIT COUNT\n___________________________________________________________\n\n**Number of Yoshino's outfits: 1**\n\n[Yellow Yukata](http://imgur.com/cLmHWnZ.jpg)\n\n___________________________________________________________\n\n**Number of Shiori's outfits: 1**\n\n[Yellow Yukata](http://imgur.com/q4EV0IH.jpg)\n\n___________________________________________________________\n\n**Number of Maki's outfits: 1**\n\n[Blue Yukata](http://imgur.com/pH1b3Us.jpg)\n\n___________________________________________________________\n\n**Number of Sanae's variations: 1**\n\n[Blue Yukata](http://imgur.com/xKwf929.jpg)\n\n___________________________________________________________\n#[WARDROBE SUMMARY](https://www.reddit.com/r/anime/comments/66b42x/spoilers_sakura_quest_episode_3_discussion/dgh1qya/)\n_________________________________________________\n**TOTAL OUTFIT COUNT SO FAR**\n\n**Yoshino** outfits: 13+1=**14**\n\nYoshino variations: **7**\n\n**Shiori** outfits: 11+1=**12**\n\nShiori variations: **2**\n\n**Sanae** outfits: 11+1=**12**\n\nSanae variations: **1**\n\n**Maki** outfits: 11+1=**12**\n\nMaki variations: **2**\n\n**Riri** outfits: **10**\n\nRiri variations: **1**\n\n\n______________________________________________\n\n\n\n\n"
  },
  {
   "score": 9,
   "id": "dil9d4s",
   "pid": "t1_dil88td",
   "date": "2017-06-07 11:38:48",
   "depth": 1,
   "text": "> =11+112\n\nMath doesn't work that way."
  },
  {
   "score": 4,
   "id": "dil8hvl",
   "pid": "t1_dil88td",
   "date": "2017-06-07 11:23:50",
   "depth": 1,
   "text": "Btw, your \"Taka-san\" link is broken.\n\nGood luck with the wardrobe stats! We're all counting on you! :)\n\n^^^^^No ^^^^^pressure."
  },
  {
   "score": 18,
   "id": "dileufd",
   "pid": "t1_dil88td",
   "date": "2017-06-07 13:12:44",
   "depth": 1,
   "text": "Just want to point out, the average height for Japanese girls is between 150cm-160cm. Putting it into perspective, your height would be like 190cm, with the difference possibly being enough to fill the space between Shiori's head and the ceiling."
  },
  {
   "score": 52,
   "id": "dil9vr9",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 11:47:37",
   "depth": 0,
   "text": "So we have confrimation that the bus driver is married. Now we just need proof that the person he's married *to* is Angelica, and we'll be all set."
  },
  {
   "score": 4,
   "id": "dilgyj8",
   "pid": "t1_dil9vr9",
   "date": "2017-06-07 13:49:58",
   "depth": 1,
   "text": "That would be perfect."
  },
  {
   "score": 31,
   "id": "dilobvd",
   "pid": "t1_dil9vr9",
   "date": "2017-06-07 16:14:30",
   "depth": 1,
   "text": "A few episodes ago if you listen he was calling her Mama, which married couples with kids do. That and saying if she were in the movie they were filming it would be a different kind of movie (probably earned him many points that night). Honestly, given 90% of his scenes are with her it seems pretty open and shut by this point."
  },
  {
   "score": 17,
   "id": "dilyehb",
   "pid": "t1_dilobvd",
   "date": "2017-06-07 19:47:14",
   "depth": 2,
   "text": "Yeah, we discussed that last time but since then people have pointed out some minor problems with it\n\n1) There's a thing in Japan where a female bar/club owner would be called Mama-san by customers. Though Anjelica's is more like a  diner and no one else has called her that \n\n2) Erika and her brother has Suzuki as their listed last name. Bus Driver-san has only been called Takamizawa (which is unlikely to be his first name)\n\nThough that could just be that they are her kids from a previous marriage"
  },
  {
   "score": 52,
   "id": "dil2dns",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 09:38:04",
   "depth": 0,
   "text": "[This image would've been a lot better if Ruri agreed to do the dance](http://i.imgur.com/JTEtSoG.png)\n\nSo this time our girls taking on a Matchmaking Party. So our bachelors are a non-profit worker, a Kabura/rice farmer, a competitive eater, a high schooler... It's not a good sign [when the high schooler has a better shot](http://i.imgur.com/mvaxjyd.png) than the other candidates. Oh there's the Police Officer too, [who's pretty smooth too I guess.](http://i.imgur.com/2Auvik3.png)\n\nToo bad Sandal isn't in for the running. Would've easier to convince those girls to stay if he was. Also I think this is the most lines we've had from Sandal in one episode.\n\n\nDammit, with that [\"Live Action\" Version](https://m.youtube.com/watch?v=ssmzhbSZlRQ) of the ED all I can see now is the Chupakabra instead of the girls in ED.\n\n"
  },
  {
   "score": 2,
   "id": "dio7y15",
   "pid": "t1_dil2dns",
   "date": "2017-06-09 06:10:10",
   "depth": 1,
   "text": "They did it in Grimgar "
  },
  {
   "score": 2,
   "id": "dim5jqk",
   "pid": "t1_dil2dns",
   "date": "2017-06-07 22:31:30",
   "depth": 1,
   "text": "> Dammit, with that \"Live Action\" Version of the ED all I can see now is the Chupakabra instead of the girls in ED.\n\nuuhhhh"
  },
  {
   "score": 7,
   "id": "dil340x",
   "pid": "t1_dil2dns",
   "date": "2017-06-07 09:50:52",
   "depth": 1,
   "text": "> This image would've been a lot better if Ruri agreed to do the dance\n\nYeah was hoping they'd get a nice group shot :(\n\n> Oh there's the Police Officer too, who's pretty smooth too I guess.\n\nI ship it.\n\n"
  },
  {
   "score": 9,
   "id": "dil97c4",
   "pid": "t1_dil2dns",
   "date": "2017-06-07 11:36:02",
   "depth": 1,
   "text": "I imagine the police officer is gonna end up with one of them by the end of it"
  },
  {
   "score": 15,
   "id": "dilbp6p",
   "pid": "t1_dil2dns",
   "date": "2017-06-07 12:18:53",
   "depth": 1,
   "text": "I clicked that Live Action ED on YouTube expecting to see cute 3D girls singing...\n\n\nCan't say I'm disappointed with what I received though"
  },
  {
   "score": 4,
   "id": "dinux5a",
   "pid": "t1_dilbp6p",
   "date": "2017-06-08 21:52:54",
   "depth": 2,
   "text": "I have no idea where that live version ED came from, but its 1am and I'm laughing out loud to myself because of the shot of 5 chupakabra's walking in place"
  },
  {
   "score": 30,
   "id": "dil36xz",
   "pid": "t1_dil2dns",
   "date": "2017-06-07 09:52:20",
   "depth": 1,
   "text": "With those violins skills and silky smooth voice (complete with perfect English pronunciation) none of the other bachelors would have stood a chance against him"
  },
  {
   "score": 46,
   "id": "dil56m5",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:27:07",
   "depth": 0,
   "text": "Despite not being a pure comedy, this anime constantly makes me chuckle. Interactions between characters are hilarious and feel somewhat natural - chemistry is definitely there, and that \"rural romance\" tour was pretty funny - especially how the men tried to hit on women. \n\nAnyway, looks like Ririko's arc is now. She always seemed like a reserved and timid person (even though blunt at times) who was mostly interested in her own hobbies. That being said, no one can live outside of society, and Shiori still considers her as a friend. Ririko seems to struggle with returning these feelings and feeling out of place within the group. I don't really want her to change that much - as Chitose said, she's fine as she is - but have nothing against her getting a little bit more comfortable around her friends. "
  },
  {
   "score": 5,
   "id": "dil6hnh",
   "pid": "t1_dil56m5",
   "date": "2017-06-07 10:49:33",
   "depth": 1,
   "text": "It'll probably be a rough transition for her. Looks like she's largely isolated herself her entire life because of her differing interests. While the group has easily accepted her despite that, it's probably still gonna take time for her to be comfortable enough to be herself without potential fear of rejection. "
  },
  {
   "score": 24,
   "id": "dil6p9e",
   "pid": "t1_dil56m5",
   "date": "2017-06-07 10:53:07",
   "depth": 1,
   "text": "> That being said, no one can live outside of society\n\n..Says he on /r/anime. She can live in her favourite subreddit. \n\n[](#emptyinside)\n\n/s\n\nI agree though, I don't want her to change much either. I think the show wants to show that sometimes we have issues dealing with feelings or desires we are not used to. In this case, I feel like Riri's conflicted because although she hated learning the dance as a kid because it was about tradition and forced her to smile, she _still_ wants to learn it with her newly made friends. She's battling her past self and its convictions. "
  },
  {
   "score": 77,
   "id": "dil2y3m",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 09:48:00",
   "depth": 0,
   "text": "Riri arc! Love how they're sharing the spotlight.\n\nI gotta say I was skeptic about this matchmaking thing but these ladies [are](http://i.imgur.com/lnXpnX5.png) [fun](http://i.imgur.com/T1amiq9.png) and we're getting more romance so I won't complain! [Even some jealousy](http://i.imgur.com/EHAToJZ.png) lol\n\n[My favourite shot though](http://i.imgur.com/gu4AJCw.png)\n"
  },
  {
   "score": -3,
   "id": "dil68q8",
   "pid": "t1_dil2y3m",
   "date": "2017-06-07 10:45:15",
   "depth": 1,
   "text": "> Even some jealousy\n\nI think that's more condescension than jealousy. That kid has quite an attitude.."
  },
  {
   "score": 27,
   "id": "dil8n44",
   "pid": "t1_dil68q8",
   "date": "2017-06-07 11:26:18",
   "depth": 2,
   "text": ">condescension\n\nNo, she clearly likes that guy herself, so she's 'marking her territory' and warning the 'old' ladies by insulting them."
  },
  {
   "score": 3,
   "id": "dilb3xt",
   "pid": "t1_dil8n44",
   "date": "2017-06-07 12:08:53",
   "depth": 3,
   "text": "Ah, you're right, I completely forgot Erika has a thing for Kosuke."
  },
  {
   "score": 15,
   "id": "dildh6y",
   "pid": "t1_dil2y3m",
   "date": "2017-06-07 12:49:16",
   "depth": 1,
   "text": ">My favourite shot though\n\nSkeptical Maki is best Maki."
  },
  {
   "score": 28,
   "id": "dil95to",
   "pid": "t1_dil2y3m",
   "date": "2017-06-07 11:35:16",
   "depth": 1,
   "text": "> [Even some jealousy](http://i.imgur.com/EHAToJZ.png) lol\n\n\"Keep your eyes off my man you old hags or they won't even find all your body parts\""
  },
  {
   "score": 41,
   "id": "dil9d68",
   "pid": "t1_dil2y3m",
   "date": "2017-06-07 11:38:49",
   "depth": 1,
   "text": ">My favourite shot though\n\nThat face is priceless. I genuinely laughed out loud when he played the wedding song."
  },
  {
   "score": 29,
   "id": "dil75dv",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 11:00:45",
   "depth": 0,
   "text": "ahahahahha \"ooold....haaaag....\""
  },
  {
   "score": 31,
   "id": "dilc7a9",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 12:27:26",
   "depth": 0,
   "text": "Sandals came out of nowhere and starting playing that wedding song on his violin. Pretty much the unsung hero in this series.\n\nAlso poor Riri. I was sure someone was going to come up to her with an umbrella or something."
  },
  {
   "score": 6,
   "id": "dilotg5",
   "pid": "t1_dilc7a9",
   "date": "2017-06-07 16:25:05",
   "depth": 1,
   "text": "[I said five months ago that he was best boy, and he hasn't proved me wrong yet.](https://www.reddit.com/r/anime/comments/5iapgw/sakura_quest_preview/db6ofx6/)"
  },
  {
   "score": 28,
   "id": "dil658y",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:43:38",
   "depth": 0,
   "text": "That was a completely different vibe for the ending compared to everything else we've seen in this show so far!\n\nWho the hell is [this ominous looking guy](http://i.imgur.com/aWrIqNP.png)?"
  },
  {
   "score": 3,
   "id": "dinjaob",
   "pid": "t1_dil658y",
   "date": "2017-06-08 17:34:48",
   "depth": 1,
   "text": "Looks like [The Muskrat](https://media.giphy.com/media/kYoOddy60X22k/giphy.gif) from Moomins is doing a long waited return."
  },
  {
   "score": 3,
   "id": "dintptz",
   "pid": "t1_dil658y",
   "date": "2017-06-08 21:19:10",
   "depth": 1,
   "text": "He reminds me of Takeo from Ore Monogatari so I really can't think of him as being ominous despite the show clearly trying to paint him in that light."
  },
  {
   "score": 15,
   "id": "dil7abe",
   "pid": "t1_dil658y",
   "date": "2017-06-07 11:03:12",
   "depth": 1,
   "text": "Potential love interest?"
  },
  {
   "score": 8,
   "id": "din104j",
   "pid": "t1_dil658y",
   "date": "2017-06-08 11:45:46",
   "depth": 1,
   "text": "I think Sig got lost https://myanimelist.net/character/10972/Sig_Curtis"
  },
  {
   "score": 49,
   "id": "dila9go",
   "pid": "t1_dil658y",
   "date": "2017-06-07 11:54:18",
   "depth": 1,
   "text": "They've released the sealed dragon, and from now on the genre is going to shift to a save the world plot. ;)\n\n^^^^^I ^^^^^take ^^^^^no ^^^^^responsibility ^^^^^if ^^^^^this ^^^^^actually ^^^^^happens."
  },
  {
   "score": 10,
   "id": "dim4f12",
   "pid": "t1_dila9go",
   "date": "2017-06-07 21:59:08",
   "depth": 2,
   "text": "He's the real Chupakabura."
  },
  {
   "score": 10,
   "id": "dilbb1p",
   "pid": "t1_dila9go",
   "date": "2017-06-07 12:12:15",
   "depth": 2,
   "text": "I would totally take responsibility if that happened."
  },
  {
   "score": 11,
   "id": "dilgzpl",
   "pid": "t1_dilbb1p",
   "date": "2017-06-07 13:50:32",
   "depth": 3,
   "text": "I almost *want* it to happen."
  },
  {
   "score": 8,
   "id": "dim55w3",
   "pid": "t1_dilgzpl",
   "date": "2017-06-07 22:20:11",
   "depth": 4,
   "text": "How about it shifts to a Mayoiga plot while we're at it?"
  },
  {
   "score": 26,
   "id": "dilafmk",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 11:57:17",
   "depth": 0,
   "text": "Sandal-san is stealing the show every time he shows up. Too bad none of us Scandinavians really look like that."
  },
  {
   "score": 29,
   "id": "dilbgsz",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 12:14:57",
   "depth": 0,
   "text": "\n> I'm searching for a place where lovers share romantic moments. A memory from a distant, distant past. I want to find proof that the two of them were alive.\n\nToo deep for me"
  },
  {
   "score": 3,
   "id": "dilgktg",
   "pid": "t1_dilbgsz",
   "date": "2017-06-07 13:43:12",
   "depth": 1,
   "text": "Setup for a fantasy-oriented second cour, maybe."
  },
  {
   "score": 2,
   "id": "dimfp88",
   "pid": "t1_dilgktg",
   "date": "2017-06-08 05:09:09",
   "depth": 2,
   "text": "isekai"
  },
  {
   "score": 9,
   "id": "dimpas6",
   "pid": "t1_dilgktg",
   "date": "2017-06-08 08:30:13",
   "depth": 2,
   "text": "There'll be a side-quel spinoff, kinda like DanMachi: Sword Oratoria, where we find that Sandal-san is off doing heroic save the world stuff in between randomly popping up and spouting off Deep Thoughts^^TM"
  },
  {
   "score": 7,
   "id": "dirw2i9",
   "pid": "t1_dimpas6",
   "date": "2017-06-11 17:02:42",
   "depth": 3,
   "text": "I would pay for that."
  },
  {
   "score": 24,
   "id": "dil31in",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 09:49:40",
   "depth": 0,
   "text": "oh man my heart is breaking for poor Riri. I wonder what's troubling her... \n\n:("
  },
  {
   "score": 38,
   "id": "dil6dvg",
   "pid": "t1_dil31in",
   "date": "2017-06-07 10:47:45",
   "depth": 1,
   "text": "The type of girl you want to embrace and spend hours talking about UFOs. "
  },
  {
   "score": 22,
   "id": "dil8wxz",
   "pid": "t1_dil6dvg",
   "date": "2017-06-07 11:31:03",
   "depth": 2,
   "text": "It's UMAs"
  },
  {
   "score": 9,
   "id": "dilz63z",
   "pid": "t1_dil8wxz",
   "date": "2017-06-07 20:03:31",
   "depth": 3,
   "text": "I think she'd probably talk about both."
  },
  {
   "score": 19,
   "id": "dim2nw3",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 21:14:43",
   "depth": 0,
   "text": "[This](http://i.imgur.com/RlCITjH.jpg) might be the most relatable thing I've seen in anime."
  },
  {
   "score": 18,
   "id": "dil73f5",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:59:48",
   "depth": 0,
   "text": "[Nice to see some fuel for the SS YoShiori.](http://i.imgur.com/poAnnGE.png) I really love watching these characters interact. I got completely caught up to the show over the course of the last two days, and I'm honestly wondering if I'll be able to handle waiting week to week for a whole cour. [This scene was done really well, tough to watch.](http://i.imgur.com/q0V3qcz.png) (my screencaps are pretty low-res, whoops)"
  },
  {
   "score": 15,
   "id": "dilgtoc",
   "pid": "t1_dil73f5",
   "date": "2017-06-07 13:47:33",
   "depth": 1,
   "text": "Nice choice of screenshots, so here are [higher](https://i.imgur.com/KcGueQ9.jpg) [res](https://i.imgur.com/fS46WdE.jpg) ones."
  },
  {
   "score": 16,
   "id": "dil6hdw",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:49:25",
   "depth": 0,
   "text": "My nature is very similar to Riri's. There are things what I don't hate but I do not want to be part of them either. Mostly normal, daily stuff. Being alone is far more easier and convenient than trying to convince others that the problem lies within me and not them."
  },
  {
   "score": 1,
   "id": "dilgrfq",
   "pid": "t1_dil6hdw",
   "date": "2017-06-07 13:46:27",
   "depth": 1,
   "text": "I fully relate with this. I don't hate people, I'd just rather be left alone ya know?"
  },
  {
   "score": 12,
   "id": "dilmmvw",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 15:39:04",
   "depth": 0,
   "text": "A note on the title ドラゴンの逆鱗 (doragon no gekirin).  The subs translate it as \"Dragon's Sore Spot\", but it could also be translated as \"Dragon's Wrath\".\n\n逆鱗 is literally an \"inverted scale\".  Legend had it that of the scales on a dragon's throat, one would be inverted, forming a small chink in his armor.  If you touched that scale, you'd get fucked up, quite fatally.  Hence the metaphor 逆鱗に触れる (gekirin ni fureru) (literally \"touch the inverted scale\") meaning to incur someone's wrath.  Archetypically the emperor's wrath, but, in daily life, perhaps your boss's.\n\n[In conclusion](http://imgur.com/a/rmgGn)."
  },
  {
   "score": 1,
   "id": "dim9rjr",
   "pid": "t1_dilmmvw",
   "date": "2017-06-08 01:08:25",
   "depth": 1,
   "text": "Also, because of Saber's connection to dragons, she too has a gekirin. [F/HA](/s \"Messing with her ahoge turns her into Saber Alter\")"
  },
  {
   "score": 13,
   "id": "dim6fjt",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 22:59:39",
   "depth": 0,
   "text": "People are talking about being glad to see Sandal but why the fuck are we not talking about that mysterious shit he said at the barbecue? \n\n\"A memory from long, long ago...\"\n\n\"I'm looking for proof that the two of them lived?\"\n\nSounds like someone wandered in from another anime!"
  },
  {
   "score": 3,
   "id": "dim7vc6",
   "pid": "t1_dim6fjt",
   "date": "2017-06-07 23:50:23",
   "depth": 1,
   "text": "Maybe he's being meta and foreshadowing Riri and Lake Thing?"
  },
  {
   "score": 9,
   "id": "dimflzj",
   "pid": "t1_dim6fjt",
   "date": "2017-06-08 05:06:31",
   "depth": 1,
   "text": "His grandparents maybe?"
  },
  {
   "score": 24,
   "id": "dil5qsi",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:36:41",
   "depth": 0,
   "text": "[Ravioli](http://i.imgur.com/uXXuDmo.png) [Ravioli](http://i.imgur.com/2WmU0Hc.png)\n\n[PA delivering,](http://i.imgur.com/eOrUh2j.png) i really appreciate [this scene](http://i.imgur.com/6mIpwCZ.png)"
  },
  {
   "score": 22,
   "id": "dil72n3",
   "pid": "t1_dil5qsi",
   "date": "2017-06-07 10:59:25",
   "depth": 1,
   "text": "> Ravioli Ravioli\n\nBut they're adults now, so it's not a problem. :P"
  },
  {
   "score": 19,
   "id": "dil7f4e",
   "pid": "t1_dil72n3",
   "date": "2017-06-07 11:05:30",
   "depth": 2,
   "text": ">Ravioli Ravioli\n\n[loli loli loli](http://i.imgur.com/3j8QJ9M.gifv)"
  },
  {
   "score": 2,
   "id": "dim5lx8",
   "pid": "t1_dil7f4e",
   "date": "2017-06-07 22:33:20",
   "depth": 3,
   "text": "/r/anime always finds a way"
  },
  {
   "score": 19,
   "id": "dilc37t",
   "pid": "t1_dil7f4e",
   "date": "2017-06-07 12:25:32",
   "depth": 3,
   "text": "<(\\^\\_\\^\\<\\)   <(\\^\\_\\^\\)>  (>\\^_\\^)>"
  },
  {
   "score": 27,
   "id": "dilgib0",
   "pid": "t1_dilc37t",
   "date": "2017-06-07 13:41:57",
   "depth": 4,
   "text": "<(\\^\\_\\^\\<\\)   <(\\-\\_\\-\\)>  (>\\^_\\^)>"
  },
  {
   "score": 10,
   "id": "dil6fb6",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:48:25",
   "depth": 0,
   "text": "Okyaku no *Resident*\n\n[**dat gringo Sandal**](#feelsgoodman)"
  },
  {
   "score": 21,
   "id": "dilbbza",
   "pid": "t1_dil6fb6",
   "date": "2017-06-07 12:12:41",
   "depth": 1,
   "text": "I think you mean *REQUIEM*"
  },
  {
   "score": 2,
   "id": "dimfrvz",
   "pid": "t1_dilbbza",
   "date": "2017-06-08 05:11:20",
   "depth": 2,
   "text": "**GOLDEN EXPERIENCE**"
  },
  {
   "score": 19,
   "id": "dilgnwh",
   "pid": "t1_dilbbza",
   "date": "2017-06-07 13:44:44",
   "depth": 2,
   "text": "*nihongo* TOUR *nihongo* DRAGON *nihongo nihongo*"
  },
  {
   "score": 13,
   "id": "dilj2jy",
   "pid": "t1_dilgnwh",
   "date": "2017-06-07 14:28:55",
   "depth": 3,
   "text": "I want to join Sandal-san's harem."
  },
  {
   "score": 9,
   "id": "dilqikr",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 17:01:40",
   "depth": 0,
   "text": "I wonder if Riri doesn't like the dance because it's meant to drive a away the dragon. But being a fan of the unexplained she'd love a dragon to show up and be her maid. Though I wonder [what those DVDs](http://i.imgur.com/9ve7F0F.png) were on her shelf?\n\nI hope she dances by the end of the arc though, the other women looked so cute in yukatas. \n\nFor those curious about [Anomalocaris.](https://en.wikipedia.org/wiki/Anomalocaris?wprov=sfla1) "
  },
  {
   "score": 4,
   "id": "dim7qst",
   "pid": "t1_dilqikr",
   "date": "2017-06-07 23:45:38",
   "depth": 1,
   "text": "> Anomalocaris\n\nIf it were the anglerfish dance, Riri'd be all over it."
  },
  {
   "score": 4,
   "id": "dioh3ia",
   "pid": "t1_dilqikr",
   "date": "2017-06-09 09:12:06",
   "depth": 1,
   "text": "The one on the left that says 縮小戦士リデュース (*Shukushou Senshi Reduce*, \"Reduction Soldier Reduce\") is a reference to [魔法騎士レイアース](https://myanimelist.net/anime/435/Magic_Knight_Rayearth) (*Mahou Kishi Rayearth*, \"Magic Knight Rayearth\"), and the one on the right that says 七福神ゴッドエビス (*Shichifukujin God Ebisu*, \"[Seven Lucky Gods](https://en.wikipedia.org/wiki/Seven_Lucky_Gods) - God (Abyss?)) is a reference to [宇宙大帝ゴッドシグマ](https://myanimelist.net/anime/4183/Uchuu_Taitei_God_Sigma)\n (*Uchuu Taitei God Sigma* \"Space Emperor God Sigma\")."
  },
  {
   "score": 18,
   "id": "dil8vgy",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 11:30:19",
   "depth": 0,
   "text": "I spent 50 % of the time of this episode empathizing with Riri, and the other 50 % cringing at the matchmaking event."
  },
  {
   "score": 5,
   "id": "dio83mj",
   "pid": "t1_dil8vgy",
   "date": "2017-06-09 06:14:00",
   "depth": 1,
   "text": "same tbh. I had to pause!"
  },
  {
   "score": 9,
   "id": "dilr5w8",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 17:15:52",
   "depth": 0,
   "text": "Sandal spoke a lot today... that was so nice\n\nalso why are all these girls so relatable, damn"
  },
  {
   "score": 8,
   "id": "dimz0x0",
   "pid": "t3_6fucmh",
   "date": "2017-06-08 11:11:51",
   "depth": 0,
   "text": "The Manoyama dance was good, but still not the [best PA works dance.](https://www.youtube.com/watch?v=yvlVueWyu18)"
  },
  {
   "score": 2,
   "id": "dina38d",
   "pid": "t1_dimz0x0",
   "date": "2017-06-08 14:26:52",
   "depth": 1,
   "text": "This made me want to rewatch Shirobako again :)"
  },
  {
   "score": 6,
   "id": "dil65b5",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:43:39",
   "depth": 0,
   "text": "Confirmed: Riri has the blood of dragons. She's basically looking for a relative in the Loch Ness monster.\n\nThis show knows how to marry comedy and character drama so well, and in a really unique manner.\n\nEdit: P.S.: I think I've found the equivalent of Miyamori's beer jig from Shirobako's OP: Sanae cleaning the door frame right toward the end of this OP.\n\n[](#scrumptiouslymoe)"
  },
  {
   "score": 7,
   "id": "dilmpki",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 15:40:35",
   "depth": 0,
   "text": "**Ep 10: The Dragon's Soft Spot**: This week's meaning has  been explained pretty superficially by Kadota. You know, it does on one hand make reference to the tale of the Water Dragon that disliked cheer, but on the other hand it serves to explain Ririko's actual situation. Her behaviour until now has always followed the same pattern: She endures a difficult personal and family situation and in spite of that she's been capable of doing lots of things and proved she is a valuable member of the squad. But she never changes her serious and obtuse expression and soft, timid voice, as a signal of her internal disarray. This week's topic has apparently made her unstable pillars tremble: the sole mention of dancing made her uncomfortable and needy of putting everything away for saving herself. Thus, her \"soft spot\" that made her show her weakness is the same that brings on the rage of the dragon. Her capable self has been crushed by something that is supposed to be cheerful.\n\nAnd so Ririko arc has arrived! Let's see how it develops. I don't like to see her sad... Feels so familiar. A big part of the charm of this lovely show is how relatable everything is, and this time it hit me right on the guts. Low self-esteem, uncertainty, insecurities, complexes. I'd love to hug [her] (http://i.imgur.com/eRffAIh.png) and tell her how I dealt with all of these at the wee small hours of my late teens if it could help.\n\nBesides, we got an extra big ration of Sandal-san today. [You can never have enough of him!] (http://i.imgur.com/s29lYEe.png)\n"
  },
  {
   "score": 6,
   "id": "dil6po5",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:53:19",
   "depth": 0,
   "text": "Riri finally getting the spot light she so rightly deserves. Time for everyone to start acknowledging her as Best Girl.\n\nAlso, Erika is a straight up gangsta."
  },
  {
   "score": 5,
   "id": "dil9bfq",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 11:37:59",
   "depth": 0,
   "text": "A rather slow introduction to Riri's arc, but a fun episode nonetheless. It dawned on me how fantastically this show handles its supporting cast. They're all very full of personality and charm. The bus driver is smooth as hell, and I love how the old man tries to shove the chupakabra costume in every situation. Nice episode, and I'd love to see what that ending was about."
  },
  {
   "score": 3,
   "id": "dim5ggt",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 22:28:48",
   "depth": 0,
   "text": "Mayoiga vibes from that last scenes"
  },
  {
   "score": 3,
   "id": "dila66j",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 11:52:42",
   "depth": 0,
   "text": "So far we're progressing at 2 episodes per girl (except Yoshino, who's the main character) since episode 4, so Riri's arc will conclude next week.\n\nRiri's grandma dotes on her maybe a bit too much, which may have contributed somewhat to her introversion. I know because that's how my folks have raised me, so now I'm the quietest guy in the office and proud of it. :) OK, not as bad as Riri, but my point stands.\n\nThe matchmaking event would probably be less cringey if the Tourism Board would insist at least five ladies came instead of just three, which is too awkwardly small a number to start any meaningful conversation with the various guys at the Single Men's Association.\n\nThat last scene with a weird bearded guy emerging out of the water (?) followed by Riri taking shelter from the rain in a bus stop just seems like an unusual place to end the episode.\n\n^^^~~I've_seen_enough_hentai_to_see_where_this_is_going......~~"
  },
  {
   "score": 1,
   "id": "dimfq8r",
   "pid": "t1_dila66j",
   "date": "2017-06-08 05:09:59",
   "depth": 1,
   "text": "reminds me of hermit, Futaba Sakura."
  },
  {
   "score": 2,
   "id": "dilowht",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 16:26:54",
   "depth": 0,
   "text": "Ririko may be awkward a lot, but I love her. Best girl for sure.\n\nThat cliffhanger tho."
  },
  {
   "score": 2,
   "id": "dil2m3c",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 09:42:08",
   "depth": 0,
   "text": "FYI: As of 12:40PM Eastern time, the episode did not show up in CR unless you checked the released calendar.\n\nIt doesn't show up in Roku either."
  },
  {
   "score": 2,
   "id": "dilapk5",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 12:02:03",
   "depth": 0,
   "text": "[At first glance this was something different](http://i.imgur.com/gR7A5y0.jpg)"
  },
  {
   "score": 2,
   "id": "dilh2ry",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 13:52:01",
   "depth": 0,
   "text": "I'm triggered by the small details. [This isnt' a good way to hold you mouse.](https://i.imgur.com/j4Nq0hY.jpg) But it's fixed [in the next shot.](https://i.imgur.com/sPyOq7C.jpg)"
  },
  {
   "score": 17,
   "id": "dilhm9y",
   "pid": "t1_dilh2ry",
   "date": "2017-06-07 14:01:51",
   "depth": 1,
   "text": "It doesn't look like she's *using* it there, though. She just rested her hand on it and moved it randomly back and forth, so she may not have been holding it the way she would if she were going to use it."
  },
  {
   "score": -1,
   "id": "dilimck",
   "pid": "t1_dilhm9y",
   "date": "2017-06-07 14:20:34",
   "depth": 2,
   "text": "She's definitely not using it (unlike someone I know, she doesn't go on Reddit to refill her spirit energy when she's down, apparently), but even so. Simply putting my hand on the mouse like this feels awkward."
  },
  {
   "score": 1,
   "id": "dilduij",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 12:55:32",
   "depth": 0,
   "text": "Absolutely loved all the focus on Riri this time around, but I also liked the little moments with Sandal in this episode too - I really hope he gets his own arc at some point!"
  },
  {
   "score": 1,
   "id": "dildwg0",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 12:56:28",
   "depth": 0,
   "text": "Can't say I was a big fan of this episode but I'm not sure why.\n\nI only noticed this episode, but is riri's front not way too short in the middle relative to the rest of it?"
  },
  {
   "score": 1,
   "id": "dildyp5",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 12:57:33",
   "depth": 0,
   "text": "This is my mellow out show. "
  },
  {
   "score": 1,
   "id": "dimgcp0",
   "pid": "t3_6fucmh",
   "date": "2017-06-08 05:27:10",
   "depth": 0,
   "text": "Man this show is awesome, and really hits me in the feels. It's just so relatable, my hometown is around the size of Manoyama as well and SQ just captures the small town vibes so well. Every single character seems to have a unique personality and a purpose (how good was Erika's snarky line though?) and I just feel so much more invested in the characters than in Shirobako.  "
  },
  {
   "score": 1,
   "id": "dio7gyz",
   "pid": "t3_6fucmh",
   "date": "2017-06-09 05:57:44",
   "depth": 0,
   "text": "I'm scared for Riri. Something is foreshadowed"
  },
  {
   "score": 1,
   "id": "discqum",
   "pid": "t3_6fucmh",
   "date": "2017-06-12 00:29:44",
   "depth": 0,
   "text": "Ahh I've been waiting for the Riri focus episode (my favorite girl out of all the amazing girls) and it delivered! It feels a lot more dramatic than the past episodes but I can't wait to see how Riri grows from this.\n\nI must also say I just love the atmosphere of this show, the setting, the match making, the light humor, every thing is beautiful. I'm so glad there's more episodes to come."
  },
  {
   "score": -5,
   "id": "dil5kq1",
   "pid": "t3_6fucmh",
   "date": "2017-06-07 10:33:46",
   "depth": 0,
   "text": "Riri needs to come out more without the help of the group, me thinks. Make an effort, i don't think she ever made an effort, probably due to her uniqueness and unique hobbies. \n\n\n"
  },
  {
   "score": 2,
   "id": "dirwa99",
   "pid": "t1_dil5kq1",
   "date": "2017-06-11 17:07:23",
   "depth": 1,
   "text": "You don't know many introverts do you?"
  },
  {
   "score": 15,
   "id": "dil622e",
   "pid": "t1_dil5kq1",
   "date": "2017-06-07 10:42:07",
   "depth": 1,
   "text": "It probably isn't so easy for her. She isn't used to having a large group of friends and is probably struggling to fit in. It probably doesn't help that Yoshino can move into town and easily make friends with everyone"
  },
  {
   "score": 7,
   "id": "dilokrb",
   "pid": "t1_dil622e",
   "date": "2017-06-07 16:19:51",
   "depth": 2,
   "text": "Exactly. She doesn't realize they like her as she is and she doesn't need to change to fit in."
  }
 ]
}