{
 "score": 254,
 "id": "6j2lkx",
 "num_comments": 72,
 "date": "2017-06-23 10:15:13",
 "comments": [
  {
   "score": 65,
   "id": "djb0ecn",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 10:36:49",
   "depth": 0,
   "text": "There is no way they can answer all questions in the one remaining episode. Atleast not in a satisfying way."
  },
  {
   "score": 2,
   "id": "djbm6mz",
   "pid": "t1_djb0ecn",
   "date": "2017-06-23 17:49:30",
   "depth": 1,
   "text": "It's not 13 like OG DanMachi?"
  },
  {
   "score": 114,
   "id": "djb1f0t",
   "pid": "t1_djb0ecn",
   "date": "2017-06-23 10:54:40",
   "depth": 1,
   "text": "To answer the questions they will announce Bell's second season.\n\n[](#kurisudisappointed \"never :(\")"
  },
  {
   "score": 1,
   "id": "djbmsna",
   "pid": "t1_djb1f0t",
   "date": "2017-06-23 18:03:15",
   "depth": 2,
   "text": "To be honest with you the chances are low and it's very hard to make an animation out of it since book 6 to book 8 is more like a transition arc (packed full of action still,but book 8 is like a collection of short story and I dOubt they will end here) and from book 9 to book 11 is an important arc that can't be separated. So either they give it a half year season or they will make a seriously bad show. Or they take their time and focus on only book 6 and 7, and I think that would be pretty good"
  },
  {
   "score": 1,
   "id": "djcn1m1",
   "pid": "t1_djbmsna",
   "date": "2017-06-24 12:05:39",
   "depth": 3,
   "text": "Maybe they could do a good adaptation of the books 6 and 7, then a lot of ovas across a year or so for book 8?\n\nAnd then adapt the rest."
  },
  {
   "score": 1,
   "id": "djdcsrl",
   "pid": "t1_djcn1m1",
   "date": "2017-06-24 23:57:48",
   "depth": 4,
   "text": "hope so, but the main purposes of anime adaptations for light novels are boosting the sales of the light novel. If they don't think they could benefit from that, they will properly not do that. Of cause, there are series like Konosuba with a low budget and comes with great sales of BD and great advertisement of the light novel. however, most of them wouldn't be continuing the anime, like index. Especially the sales of the light novel of Danmachi is doing so well (over 120k for vol 12), while less for the the sales of BD "
  },
  {
   "score": 7,
   "id": "djb93re",
   "pid": "t1_djb1f0t",
   "date": "2017-06-23 13:13:26",
   "depth": 2,
   "text": "Which also has its share of answers to provide for the first season."
  },
  {
   "score": 15,
   "id": "djbcmgg",
   "pid": "t1_djb1f0t",
   "date": "2017-06-23 14:22:02",
   "depth": 2,
   "text": "If they would announce Bell's second season that would easily catapult this anime to \"totally worth it\" for me."
  },
  {
   "score": 11,
   "id": "djbdyqp",
   "pid": "t1_djb1f0t",
   "date": "2017-06-23 14:49:35",
   "depth": 2,
   "text": "Ryuu spinoff?"
  },
  {
   "score": 56,
   "id": "djb53jc",
   "pid": "t1_djb1f0t",
   "date": "2017-06-23 12:00:14",
   "depth": 2,
   "text": "I fucking hope so. I love DanMachi."
  },
  {
   "score": 6,
   "id": "djc2qfw",
   "pid": "t1_djb53jc",
   "date": "2017-06-24 02:04:48",
   "depth": 3,
   "text": "I also loved DanMachi. Too bad this isn't it, but a fairly unrelated spinoff with some characters who aren't as interesting."
  },
  {
   "score": 2,
   "id": "djc5t17",
   "pid": "t1_djc2qfw",
   "date": "2017-06-24 04:33:57",
   "depth": 4,
   "text": "I do prefer the real series but this is better then nothing. And not in the way that Berserk 2017 is better then nothign because that show is bullshit."
  },
  {
   "score": 5,
   "id": "djcmyt0",
   "pid": "t1_djc2qfw",
   "date": "2017-06-24 12:03:49",
   "depth": 4,
   "text": "Like with Index and Railgun, I find the moments where the main characters of both interact the most interesting.\n\nUnlike Index and Railgun, I can't really invest myself in the characters from this side of the adaptation.\n\nWe have almost no internal thoughts of Ais, and although there is a little character development from Lefiya, she is everywhere and rather annoying. The other characters which are much cooler get little moments and far between.\n\nI haven't read the manga or the LNs, but from what I've heard around here, it's a matter of the adaptation being weird rather than coming like that from the source.\n\nOn the other hand, something I gather from this is first some context for things we see in the main series, and second a fleshing out of the world. It's clearly that Bell is an outlier in the world of Danmachi, as not only he has and OP ability, but is the only person in his familia, and his closer friends are also outliers in their familias themselves. Ais and the rest are \"normal\" in comparison."
  },
  {
   "score": 35,
   "id": "djb2o1w",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 11:16:51",
   "depth": 0,
   "text": "Well, I'm glad they went back and at least acknowledged that Bell's fight seriously inspired all those who saw it, though I still wish they'd covered the '[bonus special reason](https://www.reddit.com/r/anime/comments/6hnqyz/spoilers_dungeon_ni_deai_wo_motomeru_no_wa/dizsw4b/)' that only Riveria and Ais knew about, and that we'd at least get some inner dialog from Ais on the topic. Oh well, it's better than nothing.\n\nI think both the original and oratoria anime series are generally avoiding the details of the statuses and just keeping things simple with ranks only unless it's absolutely unavoidable or whatever.\n\nI seriously recommend the light novels. The world of DanMachi is a lot of fun I think. It has proper intrigue, damn good fights, and plenty of well defined individual characters, each with their own circumstances and perspectives - even the gods really do feel like who they're based on, generally self-centered higher beings doing whatever they please."
  },
  {
   "score": 1,
   "id": "djbj4tz",
   "pid": "t1_djb2o1w",
   "date": "2017-06-23 16:41:26",
   "depth": 1,
   "text": "What volumes of the light novels should I pick up to continue Bell's and Ais' stories? Or should I read Bell's light novels before continuing to Sword Oratoria?"
  },
  {
   "score": 7,
   "id": "djbmvlp",
   "pid": "t1_djbj4tz",
   "date": "2017-06-23 18:05:04",
   "depth": 2,
   "text": "Only volumes 1-3 of Oratoria are in english yet. Don't know what the anime covers but probably ~4 volumes. \n\nVolumes 1-8 of DanMachi are translated. Anime is based on volumes 1-5 but went through them at a whirlwind pace. I think most will recommend starting from the beginning... "
  },
  {
   "score": 2,
   "id": "djboxca",
   "pid": "t1_djbmvlp",
   "date": "2017-06-23 18:52:27",
   "depth": 3,
   "text": "I thought the anime did a really good job adapting the LN. I think a reader can easily pick up from Volume 6 if they want. "
  },
  {
   "score": 8,
   "id": "djbp9lp",
   "pid": "t1_djboxca",
   "date": "2017-06-23 18:59:57",
   "depth": 4,
   "text": "As they did here, they left out almost all of the internal monologue making Bell seem like a really shallow character, cut out a ton of world building, and pretty much skipped all of volume 4. "
  },
  {
   "score": 8,
   "id": "djboinj",
   "pid": "t1_djbj4tz",
   "date": "2017-06-23 18:43:07",
   "depth": 2,
   "text": "I would honestly recommend you start over all of the fresh as the books do go into more detail than the original anime. If you don't to start from the beginning, at least read volume 5 of Bell's story which covers the end of the original anime as a refresher. \n\nAs far as Sword Oratoria goes, the books are significantly behind the anime although the third came out 3 days ago and I haven't had a chance to read it yet. The books are better than the anime soley for the reason as they actually give Ais some depth to her character, and less Lefiya. The anime doesn't seem to give her any depth because it would be awkward for Ais to discuss her thoughts to the viewer and it really detracts from her motivations. I haven't read the manga but I've heard it is also very good, much better than the anime.\n\nAs far as reading order, it seems to me that the timelines sorta match up book for book, but you wouldn't really benefit from reading them switching back and forth. You will read where Ais/Bell meet up but you likely already know all of that from watching the anime. The events are fairly exclusive between books. I would recommend you just read Bell's 1-8 first."
  },
  {
   "score": 32,
   "id": "djbcm17",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 14:21:47",
   "depth": 0,
   "text": "Magic seems really overpowered in this world."
  },
  {
   "score": 21,
   "id": "djbfc41",
   "pid": "t1_djbcm17",
   "date": "2017-06-23 15:18:27",
   "depth": 1,
   "text": "Well the weakness I guess is the chanting time and running out of magic?"
  },
  {
   "score": 26,
   "id": "djbjnzz",
   "pid": "t1_djbcm17",
   "date": "2017-06-23 16:53:06",
   "depth": 1,
   "text": "Tbf i think Riveria is a special case because she's level 6 and might be the strongest mage in the world i don't actually remember if they said that or not. Lefiya is special because of her ability that lets her use other peoples magic. As someone else has said Magic users need incantation time and are mana gated."
  },
  {
   "score": 3,
   "id": "djc5f4b",
   "pid": "t1_djbjnzz",
   "date": "2017-06-24 04:16:18",
   "depth": 2,
   "text": "So the only mages we know are both overpowered? That seems broken to me."
  },
  {
   "score": 2,
   "id": "djcnxf4",
   "pid": "t1_djc5f4b",
   "date": "2017-06-24 12:26:46",
   "depth": 3,
   "text": "Remember Bell's mind down after he spammed firebolt in the dungeon? Yeah, that's something you don't fuck with. Bell could have easily died to monsters, kidnapped, robbed or murdered if Aiz and Riveria didn't show up when they did."
  },
  {
   "score": 1,
   "id": "djjht1y",
   "pid": "t1_djcnxf4",
   "date": "2017-06-28 19:48:09",
   "depth": 4,
   "text": "bells fireball was pretty OP compared to where he was at the time IIRC. \n\nWhen everything magic related is 'yea well thats a special case' that means magic is op"
  },
  {
   "score": 4,
   "id": "djd4fkx",
   "pid": "t1_djcnxf4",
   "date": "2017-06-24 19:31:33",
   "depth": 4,
   "text": "Bell isn't a mage, but with beginner magic he still managed to wipe out a lot of enemies. Definitely overpowered."
  },
  {
   "score": 2,
   "id": "dkiahhs",
   "pid": "t1_djd4fkx",
   "date": "2017-07-20 20:56:01",
   "depth": 5,
   "text": "I'm pretty sure casting fire magic inside of someone would cause serious damage, and let's not forget a Minotaur is only a floor 17 monster. That crap won't fly so well if he fought something in the 20s or above. Also, it's from a grimoire so it's gonna be bad ass magic "
  },
  {
   "score": 8,
   "id": "djbz3pj",
   "pid": "t1_djbjnzz",
   "date": "2017-06-23 23:26:12",
   "depth": 2,
   "text": "I remember they said Riveria is the strongest mage in Orario. "
  },
  {
   "score": 2,
   "id": "djc5hmf",
   "pid": "t1_djbz3pj",
   "date": "2017-06-24 04:19:30",
   "depth": 3,
   "text": "Isn't Orario basically the world? There is surely only the 1 dungeon."
  },
  {
   "score": 8,
   "id": "djc5ouw",
   "pid": "t1_djc5hmf",
   "date": "2017-06-24 04:28:51",
   "depth": 4,
   "text": "From what I know, Orario is only a city in the mainland continent so the world is actually much larger. Though I guess it's the same case as in Chihayafuru: if you become the best in Karuta in Japan then you're pretty much the best in the world."
  },
  {
   "score": 61,
   "id": "djb28w2",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 11:09:19",
   "depth": 0,
   "text": "So next week will be the last episode of DanMachi Gaiden: Spell Oratoria."
  },
  {
   "score": 26,
   "id": "djbhbu9",
   "pid": "t1_djb28w2",
   "date": "2017-06-23 16:01:36",
   "depth": 1,
   "text": "I can't wait for DanMachi S2 to see all the things hestia does while bell is doing his thing off camera"
  },
  {
   "score": 17,
   "id": "djb1xqb",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 11:03:48",
   "depth": 0,
   "text": "danmachi delivering perfect OST again! that scene at the beginning explaining Bell was on an adventure, excellent OST..\n\nhttps://www.youtube.com/watch?v=pWlfyXi0KYs gonna leave this here "
  },
  {
   "score": 21,
   "id": "djb3n19",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 11:34:16",
   "depth": 0,
   "text": "Alright this episode was pretty rad. We even finally got to see Gareth kick ass. Old man vaporized a dragon in one fucking hit. Where was he during that last boss battle in DanMachi? I seriously can't remember if he was present during that fight."
  },
  {
   "score": 2,
   "id": "djbzei2",
   "pid": "t1_djb3n19",
   "date": "2017-06-23 23:37:31",
   "depth": 1,
   "text": "> Old man vaporized a dragon in one fucking hit\n\nbete and the sisters did the same, the problem in this show they dont care about other characters having attacks/personality. they jump make them jump and punch/kick lol. "
  },
  {
   "score": 6,
   "id": "djbmxaz",
   "pid": "t1_djb3n19",
   "date": "2017-06-23 18:06:10",
   "depth": 1,
   "text": "Most of Loki familia was not at that battle. They left just before it happened. "
  },
  {
   "score": 5,
   "id": "djbjc5d",
   "pid": "t1_djb3n19",
   "date": "2017-06-23 16:45:53",
   "depth": 1,
   "text": "He commands the second group of adventurers so he wasn't there."
  },
  {
   "score": 9,
   "id": "djbqutz",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 19:35:13",
   "depth": 0,
   "text": "Lefiya, and her inner monologue, have pretty much been the reason I'm not a fan of this season. \n\nThis episode didn't have much of that, though, with the exception of the whole \"I gotta catch up to everyone else\" garbage. So, an enjoyable episode. I was a big fan of Bell's impact on the group."
  },
  {
   "score": 18,
   "id": "djb1bxt",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 10:53:11",
   "depth": 0,
   "text": "The anime is now ahead of the manga translations. It seems that they won't be able to solve all the plot lines this season. Since a second season is not likely, there is a possibility that that cut some of the S2 bait in the final episode or they might even go with a modified ending to fit the needs of the show. After all, they did cut many characters from the LN/manga.\n\n[](#csikon)\n\nLefiya was not that bad in this episode but for someone that can copy any spells, it would have been more exciting to see the full range of her abilities and a wider variety of spells. It's a shame that we didn't get to fully understand the inner workings of Ais's thought process in the end. She'll remain that stoic, enigmatic knight for a while. We'll have to be content with the glimpses we've had of her breaking her shell I guess. \n\nHopefully we still have the magnificent manga adaptation. We'll have to wait a bit though.\n\n[](#bestiathumbsup)"
  },
  {
   "score": 2,
   "id": "djb9lux",
   "pid": "t1_djb1bxt",
   "date": "2017-06-23 13:22:59",
   "depth": 1,
   "text": "Is there a read order for both of the manga?"
  },
  {
   "score": 1,
   "id": "djfpd1k",
   "pid": "t1_djb9lux",
   "date": "2017-06-26 14:28:03",
   "depth": 2,
   "text": "The LN's are the originals actually, not the manga."
  },
  {
   "score": 2,
   "id": "djbjw1x",
   "pid": "t1_djb9lux",
   "date": "2017-06-23 16:58:00",
   "depth": 2,
   "text": "Order doesn't really matter they run parallel to each other with very few events actually intersecting."
  },
  {
   "score": 5,
   "id": "djbbgp4",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 13:58:40",
   "depth": 0,
   "text": "old dwarves are always badass \n\ni hope theres a season 2 teaser for bell or a story for ryuu"
  },
  {
   "score": 5,
   "id": "djbezd8",
   "pid": "t1_djbbgp4",
   "date": "2017-06-23 15:10:47",
   "depth": 1,
   "text": "Ryuu's spin-off takes place after Bell's anime ended so that one is a no go. Let's hope Bell gets his second season and have his familia grow and move up in the world."
  },
  {
   "score": 1,
   "id": "djbi98d",
   "pid": "t1_djbezd8",
   "date": "2017-06-23 16:22:09",
   "depth": 2,
   "text": "ohhh\n"
  },
  {
   "score": 5,
   "id": "djc7u03",
   "pid": "t3_6j2lkx",
   "date": "2017-06-24 05:53:38",
   "depth": 0,
   "text": "Finally get to the world-building and intrigue I love the series for\n\nIt ends in one episode\n\n[](#ptsd \"JUST\")"
  },
  {
   "score": 11,
   "id": "djb6n7y",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 12:28:00",
   "depth": 0,
   "text": "Well they actually did it...an episode and a half to get to lvl 59.\n\nI have no clue how this show will end. Is it gonna end with them killing that spirit thing? Or will it end with Aiz vs beast woman? "
  },
  {
   "score": 3,
   "id": "djbe8dr",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 14:55:09",
   "depth": 0,
   "text": "I did like the sound of the spirit/plant thing in the end, pretty terrifying."
  },
  {
   "score": 4,
   "id": "djb5y8y",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 12:15:35",
   "depth": 0,
   "text": "LN / Manga spoilers that were not included in the anime [Sword Oratoria Manga Spoilers](/s \"I dont like that they cut the death of the 2 Pallum Boys that were inspired by Finn, it gave the manga / ln a little bit more depth since you knew some characters could die.\")"
  },
  {
   "score": 5,
   "id": "djbmdtq",
   "pid": "t1_djb5y8y",
   "date": "2017-06-23 17:54:00",
   "depth": 1,
   "text": "I believe those pallums were only in the manga. Many of the characters that died in the manga in that arc are manga exclusive.  The anime is based on the light novels, not the manga."
  },
  {
   "score": 4,
   "id": "djb9fsf",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 13:19:47",
   "depth": 0,
   "text": "Its raining dwarves!"
  },
  {
   "score": 1,
   "id": "djb133q",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 10:48:54",
   "depth": 0,
   "text": "Hard to believe that it ends next week. Liked the ep, especially second half! Excited how this will turn out now! Otherwise I really hope for more in the future."
  },
  {
   "score": 1,
   "id": "djbviu7",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 21:30:01",
   "depth": 0,
   "text": "She calls this thing \"Spirit,\" wasn't that the actual Aria's nickname? Ais' mother? They mentioned that a few episodes ago, didn't they? Is Ais gonna have to kill her own mother?"
  },
  {
   "score": 6,
   "id": "djc2btt",
   "pid": "t1_djbviu7",
   "date": "2017-06-24 01:45:13",
   "depth": 1,
   "text": "They did mention this ~~a few episodes ago~~less than 20 seconds into last week's episode, but you misunderstood. Spirit wasn't Aria's nickname. It was her species."
  },
  {
   "score": 1,
   "id": "djc3apr",
   "pid": "t3_6j2lkx",
   "date": "2017-06-24 02:32:22",
   "depth": 0,
   "text": "It's good to see the show letting the other characters have their badass moments. Now, all that's left is the plot. I'm betting on massive infodumps to at least give a sense of having solved the big mystery."
  },
  {
   "score": 1,
   "id": "djc5rvk",
   "pid": "t3_6j2lkx",
   "date": "2017-06-24 04:32:32",
   "depth": 0,
   "text": "But if they're immune to dragonfire, why be scared by the dragon's projectiles?"
  },
  {
   "score": 0,
   "id": "djazbn3",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 10:18:16",
   "depth": 0,
   "text": "Ah Lefiya kicking ass once again!\n\n[](#faito \"coming a long way\")\n\nDo wish she changed up her spell choice her and there though..."
  },
  {
   "score": 1,
   "id": "djb1je6",
   "pid": "t1_djazbn3",
   "date": "2017-06-23 10:56:49",
   "depth": 1,
   "text": "They won't, it'll most likely end on a cliffhanger."
  },
  {
   "score": 1,
   "id": "djb2e7s",
   "pid": "t1_djb1je6",
   "date": "2017-06-23 11:11:58",
   "depth": 2,
   "text": "Think you replied to the wrong person."
  },
  {
   "score": 1,
   "id": "djb2lvo",
   "pid": "t1_djb2e7s",
   "date": "2017-06-23 11:15:46",
   "depth": 3,
   "text": "yeah"
  },
  {
   "score": 10,
   "id": "djb9eu9",
   "pid": "t1_djazbn3",
   "date": "2017-06-23 13:19:16",
   "depth": 1,
   "text": "One trick pony build, for a character who's alias is \"Thousand Elf\". Tsk tsk, so sad."
  },
  {
   "score": 1,
   "id": "djbf1pz",
   "pid": "t1_djb9eu9",
   "date": "2017-06-23 15:12:11",
   "depth": 2,
   "text": "> One trick pony build\n\nPffft she totally has 2 :p"
  },
  {
   "score": 10,
   "id": "djb34j9",
   "pid": "t1_djazbn3",
   "date": "2017-06-23 11:25:03",
   "depth": 1,
   "text": "Also i noticed why the others like Bete and the 2 sisters, why they dont really have 'attacks'  ? i mean they are considered to be really strong, yet all they do is jump and kick. "
  },
  {
   "score": 1,
   "id": "djbmh38",
   "pid": "t1_djb34j9",
   "date": "2017-06-23 17:56:04",
   "depth": 2,
   "text": "Magic is rare in that universe.  All elves have magic and it is extremely rare for any other race to have magic unless they obtain a grimoire.  Other than that, strength comes from their combat skills.  Many skills only boost stats rather than actually do something."
  },
  {
   "score": 8,
   "id": "djb4ekr",
   "pid": "t1_djb34j9",
   "date": "2017-06-23 11:47:56",
   "depth": 2,
   "text": "They do possess quite a number of skills but they are not shown in the anime [link to danmachi wiki, beware spoilers](http://danmachi.wikia.com/wiki/Skills)"
  },
  {
   "score": 1,
   "id": "djb751q",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 12:36:55",
   "depth": 0,
   "text": "[Ais is so desperate to get stronger that she KS Riveria, lol.](http://i.imgur.com/yZPsZls.jpg) It looks like the series is gonna end just before the Goliath Rex fight... or do they even get to meet? I think it's gonna end where they are on their way back up."
  },
  {
   "score": -4,
   "id": "djbhc14",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 16:01:43",
   "depth": 0,
   "text": "The writing in this show is so awful...\n\n\"Remember, this new species is attracted to magic, so be careful Lefiya.\" How the fuck would you even know that if it's a new species?\n\nWas really excited when Lefiya fell in the hole though, although for some reason they jumped in and saved her. That was pretty lame."
  },
  {
   "score": 1,
   "id": "djbr5gx",
   "pid": "t1_djbhc14",
   "date": "2017-06-23 19:41:59",
   "depth": 1,
   "text": "I forgot all about the attraction to magic thing, so that threw me off too. \n\n> for some reason they jumped in and saved her.\n\nI was REALLY hoping she would disappear for the rest of the episode at the very least. It's difficult to give a shit about her as a character."
  },
  {
   "score": 8,
   "id": "djc2w4y",
   "pid": "t1_djbhc14",
   "date": "2017-06-24 02:12:27",
   "depth": 1,
   "text": ">How the fuck would you even know that if it's a new species?\n\nThe very beginning of episode 1, maybe? When they discovered the new species for the first time and they constantly attacked Lefiya every time she started chanting, perhaps?\n\n[](#konosubawot2)"
  },
  {
   "score": 13,
   "id": "djbinpr",
   "pid": "t1_djbhc14",
   "date": "2017-06-23 16:31:04",
   "depth": 1,
   "text": "It's the same bugs from the earlier level when they invaded the town, they just haven't identified it yet, they only know it's characteristics from their first run through"
  },
  {
   "score": 25,
   "id": "djbhkcp",
   "pid": "t1_djbhc14",
   "date": "2017-06-23 16:06:52",
   "depth": 1,
   "text": "It's the same \"new\" species they have encountered all season. It was attracted to magic in episode 4 or something during Monsterphilia."
  },
  {
   "score": -4,
   "id": "djbefbe",
   "pid": "t3_6j2lkx",
   "date": "2017-06-23 14:59:06",
   "depth": 0,
   "text": "Ah, this got boring again. At least there's just one more episode of me having to skip trough to the Bell and Hestia parts. \n\n"
  }
 ]
}