{
 "score": 261,
 "id": "6gdd23",
 "num_comments": 136,
 "date": "2017-06-09 21:07:54",
 "comments": [
  {
   "score": 147,
   "id": "dipi6iw",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 22:38:39",
   "depth": 0,
   "text": "[untranslated LN spoiler ](/s \"the reason why Bell is being knocked out over and over again by aiz is that she wanted to do the lap pillow thing and pet Bell, who is being regarded as a pet rabbit. However, Bell resisted so much when he woke up, and said that he wouldn't have allowed that if he was conscious. Therefore Aiz figured that she would just need to make him unconscious  \")"
  },
  {
   "score": 17,
   "id": "dipk4yi",
   "pid": "t1_dipi6iw",
   "date": "2017-06-09 23:57:30",
   "depth": 1,
   "text": "This is how you get brain damage."
  },
  {
   "score": 5,
   "id": "dipk6ko",
   "pid": "t1_dipk4yi",
   "date": "2017-06-09 23:59:31",
   "depth": 2,
   "text": "With that sort of thinking I'm pretty sure she already has it.\n\nOh wait, you meant for Bell."
  },
  {
   "score": 26,
   "id": "diplmbk",
   "pid": "t1_dipk6ko",
   "date": "2017-06-10 01:07:42",
   "depth": 3,
   "text": "Interesting enough [untranslated light novel spoiler again ] (/s \" Aiz actually thought Bell's brain was damaged when Bell woke up in the tent and started yelling and screaming after being rescued on level 18. What she didn't realize it's that Bell was screaming because she kept petting him. \")"
  },
  {
   "score": 4,
   "id": "diq5ahk",
   "pid": "t1_diplmbk",
   "date": "2017-06-10 11:41:38",
   "depth": 4,
   "text": "Again. WHY WAS THIS LEFT OUT?"
  },
  {
   "score": 6,
   "id": "diq77yd",
   "pid": "t1_diq5ahk",
   "date": "2017-06-10 12:26:40",
   "depth": 5,
   "text": "because they havent reached that part of the story probably"
  },
  {
   "score": 1,
   "id": "diqy32p",
   "pid": "t1_diq77yd",
   "date": "2017-06-11 01:13:06",
   "depth": 6,
   "text": "Do you think the anime will reach it?"
  },
  {
   "score": 1,
   "id": "dir0dg5",
   "pid": "t1_diqy32p",
   "date": "2017-06-11 03:12:07",
   "depth": 7,
   "text": "Maybe, may not be. Ideally speaking, volume 4 is a really important/good volume of the lightnovel and they should spend the rest of the episodes on it. However, they might try to rush through volume 4 and end at volume 5, which includes that scene, in order to catch up with the progress of the anime of main series."
  },
  {
   "score": 45,
   "id": "dipjfhk",
   "pid": "t1_dipi6iw",
   "date": "2017-06-09 23:27:05",
   "depth": 1,
   "text": "loool, holy shit. [related spoilers](/s \"\"I want to touch him, but he won't let me...whatevs, I'll beat the shit out of him until he can't do anything about it.\"\")"
  },
  {
   "score": 19,
   "id": "dipk8qx",
   "pid": "t1_dipjfhk",
   "date": "2017-06-10 00:02:09",
   "depth": 2,
   "text": "Remember kids, don't stick your dick in crazy!"
  },
  {
   "score": 3,
   "id": "dipm103",
   "pid": "t1_dipk8qx",
   "date": "2017-06-10 01:28:32",
   "depth": 3,
   "text": "more like don't let crazy know you exist"
  },
  {
   "score": 9,
   "id": "dipm5pw",
   "pid": "t1_dipk8qx",
   "date": "2017-06-10 01:35:34",
   "depth": 3,
   "text": "Except for Bell he wants the crazy."
  },
  {
   "score": 94,
   "id": "dipiivl",
   "pid": "t1_dipi6iw",
   "date": "2017-06-09 22:51:31",
   "depth": 1,
   "text": "WHY WAS THIS LEFT OUT?"
  },
  {
   "score": 0,
   "id": "dirxjh5",
   "pid": "t1_dipiivl",
   "date": "2017-06-11 17:35:37",
   "depth": 2,
   "text": "I actually thought this was a great subtle way to give us a peek of Aiz's character. At the very least, the dynamic between Aiz and Bell. There are things that you can imply simply through the way pieces are introduced. Of course, explicitly stating something will always be the more obvious choice for viewers, but not necessarily contain most impact.\n\nBefore we saw this scene, we knew that Aiz was brutally beating Bell up. The heel kick combined with the overdone attacks showed her relentless side. You can argue whether she can dampen her power or whatnot, but arguing that will leave to more discussion about her intentions. If she really can't control her power, then she must be really merciless to agree to the training. If she can control her power but still decided to go full-throttle, well, you can see how her action speaks of her intentions.\n\nBut that's a totally different subject to began with. Moving on, a few seconds later, they showed a scene of Bell on her lap. Now, without context, many people would think that Bell was taking an early nap through the soothing breeze on Aiz's lap. However, after watching the previous seconds that led up to this scene, we can infer that it was Aiz who moved Bell onto her lap. All those brutal hits would knock him out, right? If so, then how can an unconscious person be in the right mind to move their head onto a person's lap?\n\nRather than trying to tackle a hard question, if we look the other way, then the scene makes more sense. What if Aiz was the one who moved Bell onto her lap? If so, then for what reason? Well, how many other reasons could possibly exist for a girl to want a guy's head on their lap?\n\nWhat I'm trying to say is: the scene in question may not have explicitly stated the narrative of the original novel, but it sure did give us an implication that was similar to it."
  },
  {
   "score": 1,
   "id": "dj5dwwg",
   "pid": "t1_dirxjh5",
   "date": "2017-06-20 05:41:39",
   "depth": 3,
   "text": "Aiz can control her strength, but it's difficult for her to and so sometimes her focus slips and she accidentally knocks Bell unconscious. It's a little later that he protests so she starts knocking him out on purpose."
  },
  {
   "score": 3,
   "id": "dippxwj",
   "pid": "t1_dipiivl",
   "date": "2017-06-10 04:49:56",
   "depth": 2,
   "text": "Because the anime adaption has been pure shit since the first episode?"
  },
  {
   "score": 10,
   "id": "dipisno",
   "pid": "t1_dipiivl",
   "date": "2017-06-09 23:01:39",
   "depth": 2,
   "text": "To be fair , I think manga skipped this as well .\n\nEdit: no, it not. Manga included that, someone posted it just down below."
  },
  {
   "score": -5,
   "id": "dipkmqz",
   "pid": "t1_dipisno",
   "date": "2017-06-10 00:19:49",
   "depth": 3,
   "text": "The anime is not based on the manga though. "
  },
  {
   "score": 13,
   "id": "dipqsns",
   "pid": "t1_dipkmqz",
   "date": "2017-06-10 05:25:24",
   "depth": 4,
   "text": "The manga is pretty damn close to the LN, which is something you can't say about the anime."
  },
  {
   "score": 86,
   "id": "dipliue",
   "pid": "t1_dipisno",
   "date": "2017-06-10 01:02:42",
   "depth": 3,
   "text": "[No, the manga definitely included it.](http://imgur.com/a/0d7md)"
  },
  {
   "score": 1,
   "id": "dipz235",
   "pid": "t1_dipliue",
   "date": "2017-06-10 09:19:06",
   "depth": 4,
   "text": "I thought that was covered to the same extent in the main series of the anime."
  },
  {
   "score": 1,
   "id": "dntprgx",
   "pid": "t1_dipz235",
   "date": "2017-10-02 17:06:13",
   "depth": 5,
   "text": "No, not really, she kept giving lap pillows but never explained why she kept doing it or the fact that she would purposely knock him out in order to do it "
  },
  {
   "score": 1,
   "id": "diplmrb",
   "pid": "t1_dipliue",
   "date": "2017-06-10 01:08:19",
   "depth": 4,
   "text": "Oh,my fault"
  },
  {
   "score": 4,
   "id": "dipvhep",
   "pid": "t1_dipliue",
   "date": "2017-06-10 07:51:40",
   "depth": 4,
   "text": "\"I want you to give me one\" - sounds like a beginning of a doujin."
  },
  {
   "score": 13,
   "id": "dipmhqy",
   "pid": "t1_dipliue",
   "date": "2017-06-10 01:53:28",
   "depth": 4,
   "text": "holysheeeet time to read the manga"
  },
  {
   "score": 36,
   "id": "dipnjx9",
   "pid": "t1_dipliue",
   "date": "2017-06-10 02:49:34",
   "depth": 4,
   "text": "Holy crap the manga has so much better execution. What the hell. "
  },
  {
   "score": 7,
   "id": "diqpcwr",
   "pid": "t1_dipnjx9",
   "date": "2017-06-10 20:02:14",
   "depth": 5,
   "text": "Yeah the manga is really good, the action scenes especially are way better than the anime."
  },
  {
   "score": 121,
   "id": "dipimae",
   "pid": "t1_dipiivl",
   "date": "2017-06-09 22:55:11",
   "depth": 2,
   "text": "Because we **needed** to see jealous Lefiya being angry and pouting."
  },
  {
   "score": 40,
   "id": "dipvuqm",
   "pid": "t1_dipimae",
   "date": "2017-06-10 08:01:21",
   "depth": 3,
   "text": "The past few episodes were tolerable but yet again Lefiya ruined an episode. Fuck your yuri obsession get out of my Dungeon romance. I hate it even more since the LN readers have told us shes being forced on us and isn't in the LN like she is in the show.  \n  \nAnother case of 'you have a fucking script why do you insist on making it worse'. "
  },
  {
   "score": 8,
   "id": "diqu1yb",
   "pid": "t1_dipvuqm",
   "date": "2017-06-10 22:22:44",
   "depth": 4,
   "text": "No, Lefiya has as much focus in the source, or at least the manga (which is vastly superior to the anime) as much she does in the anime.  The two major differences are 1) She doesn't have the daydreams, and 2) Ais has more focus and more importantly constant and long monologues.  I mean, the fight against the floor boss alone was waaaaaay longer and way more focused on Ais.\n\nOr in simpler terms, it's not that the anime has more Lefiya than it is supposed, it has less Ais than it is supposed to."
  },
  {
   "score": 1,
   "id": "dis0a65",
   "pid": "t1_diqu1yb",
   "date": "2017-06-11 18:35:46",
   "depth": 5,
   "text": "Ohhhh ok thanks for clearing that up. I guess I misunderstood what people were saying then. "
  },
  {
   "score": 30,
   "id": "diq3b2k",
   "pid": "t1_dipvuqm",
   "date": "2017-06-10 10:55:45",
   "depth": 4,
   "text": "Lefiya is the only character I have seen that managed to make yuri a turn off. That's a new to be honest, because yuri is supposedly never a turn off. "
  },
  {
   "score": 20,
   "id": "diq8g2u",
   "pid": "t1_diq3b2k",
   "date": "2017-06-10 12:55:27",
   "depth": 5,
   "text": "Honestly, I'm fine if she wants to go yuri with Filvis, but the obsession with Aiz is creepy and unwanted."
  },
  {
   "score": 108,
   "id": "dipk6jm",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 23:59:29",
   "depth": 0,
   "text": "[Nothing beats the original squeal of his.](https://streamable.com/rpnze)\n\nAnd I like how from this PoV, it shows that Ains was never doing this because she is such a lovely caring person; she had ulterior motives from the start.  \nNot sinister or anything, but she is doing this more for herself.  \nAdds a good layer to her as a character.\n\nI'm liking this series.  \nMakes me sad knowing that there are just 3 more episodes. :("
  },
  {
   "score": 53,
   "id": "dipkql5",
   "pid": "t1_dipk6jm",
   "date": "2017-06-10 00:24:50",
   "depth": 1,
   "text": "that squeal is top tier , Bell's VA is insanely good"
  },
  {
   "score": 3,
   "id": "dipt28k",
   "pid": "t1_dipkql5",
   "date": "2017-06-10 06:43:34",
   "depth": 2,
   "text": "I need to look up this scene in the dub. I hope they did it justice."
  },
  {
   "score": 12,
   "id": "dipsonz",
   "pid": "t1_dipkql5",
   "date": "2017-06-10 06:31:47",
   "depth": 2,
   "text": "Saekano's MC, Tomoya, also has a similarly amazing squeal!"
  },
  {
   "score": 3,
   "id": "dipvl8e",
   "pid": "t1_dipsonz",
   "date": "2017-06-10 07:54:29",
   "depth": 3,
   "text": "Izumi from Eromanga-sensei also probably has similarly good one."
  },
  {
   "score": 61,
   "id": "dipfj54",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 21:14:32",
   "depth": 0,
   "text": "What a fucking eternity that took to air"
  },
  {
   "score": 20,
   "id": "dipfoej",
   "pid": "t1_dipfj54",
   "date": "2017-06-09 21:18:30",
   "depth": 1,
   "text": "I dont think Amazon even tells you if there is a delay like Crunchyroll does. They have a lot of things to improve.  "
  },
  {
   "score": 38,
   "id": "dipgx1b",
   "pid": "t1_dipfoej",
   "date": "2017-06-09 21:55:21",
   "depth": 2,
   "text": "Only the highest quality for a double paywall"
  },
  {
   "score": 17,
   "id": "dipjoo1",
   "pid": "t1_dipgx1b",
   "date": "2017-06-09 23:37:37",
   "depth": 3,
   "text": "Not to mention the super lazy ass subs on the Amazon player. It's effing weird to me that fans working for nothing but recognition put out higher quality subs in stupid fast time than what are presumably paid employees."
  },
  {
   "score": 7,
   "id": "diprcrt",
   "pid": "t1_dipjoo1",
   "date": "2017-06-10 05:46:41",
   "depth": 4,
   "text": "I'm worried Amazon will hurt the streaming anime industry. They have such deep pockets they can simply out bid every other service except maybe netflix and lock so many shows behind their double paywall. While also not having the experience or care to put in a lot of effort on the anime itself as far as subs and such. They basically in a position they can try to corner the market without worrying abut it being profitable anytime soon."
  },
  {
   "score": 37,
   "id": "dipgrbp",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 21:50:21",
   "depth": 0,
   "text": "Why are [elf casters](http://i.imgur.com/LUBaw1R.png) so [obsessed](http://i.imgur.com/YBuSFIK.jpg) with blondie swordswomen ??"
  },
  {
   "score": 4,
   "id": "dipkwdl",
   "pid": "t1_dipgrbp",
   "date": "2017-06-10 00:32:38",
   "depth": 1,
   "text": "S/M go well together. Saber and Magi that is."
  },
  {
   "score": 26,
   "id": "dipkqbj",
   "pid": "t1_dipgrbp",
   "date": "2017-06-10 00:24:28",
   "depth": 1,
   "text": "I can understand Caster's obsession with Saber but not Lefiya's with Aiz."
  },
  {
   "score": 30,
   "id": "diphh0f",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 22:13:24",
   "depth": 0,
   "text": "I was hoping they would focus a bit more on Aiz's training with Bell. I really enjoyed her thought process in the manga's interpretation of the training. "
  },
  {
   "score": 12,
   "id": "diq3puc",
   "pid": "t1_diphh0f",
   "date": "2017-06-10 11:04:57",
   "depth": 1,
   "text": "When I watched Danmachi, I always thought Aiz had an interest in Bell. Then I watch Oratoria and think Aiz actually doesn't care about Bell and just how to get stronger. And now top comment in this thread has me kind of in the middle?\n\nBasically, yeah, I wish they would have focused more on that. I didn't really need to watch Lefiya stutter for 10 minutes that could have been used on telling me more about the relationship between Aiz and Bell from Aiz's point of view."
  },
  {
   "score": 1,
   "id": "dntpzps",
   "pid": "t1_diq3puc",
   "date": "2017-10-02 17:11:06",
   "depth": 2,
   "text": "It's kinda explained by ppl around Aiz that she has feelings for Bell but Aiz is confused about them and doesn't understand "
  },
  {
   "score": 13,
   "id": "diqfxis",
   "pid": "t1_diq3puc",
   "date": "2017-06-10 15:52:11",
   "depth": 2,
   "text": "As for now, she's interested in Bell mostly for two things. Primarily his insane growth rate and potential, and secondly about how he reminds her of her own childhood self and how she kind of envies his purity of spirit. She finds him calming to be around, and it was made abundantly clear in the LN/manga, but as with EVERY good scene they have cut or mangled it in the anime.. **every one**...."
  },
  {
   "score": 2,
   "id": "diqfz9y",
   "pid": "t1_diqfxis",
   "date": "2017-06-10 15:53:24",
   "depth": 3,
   "text": "It's in the manga? Well the one time I watch the anime instead of read the manga and I miss out. I'll have to read that next, then!"
  },
  {
   "score": 31,
   "id": "dipmu3b",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 02:11:33",
   "depth": 0,
   "text": "[Kars survived!](http://i.imgur.com/Ojfd3I5.png)"
  },
  {
   "score": 2,
   "id": "dipsuad",
   "pid": "t1_dipmu3b",
   "date": "2017-06-10 06:36:46",
   "depth": 1,
   "text": "*Awaken my masters!*"
  },
  {
   "score": 7,
   "id": "diq12rf",
   "pid": "t1_dipmu3b",
   "date": "2017-06-10 10:05:36",
   "depth": 1,
   "text": "In this setting he is just fulfilling his role as Aztec God of Fitness."
  },
  {
   "score": 81,
   "id": "dipjrpy",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 23:41:19",
   "depth": 0,
   "text": "I'm really trying to enjoy this show, but it's difficult. I just don't care about Lefiya, or her inner thoughts. \n\nI also never thought I wouldn't be game for some yuri, but this shit is getting old. Hestia appearance was fucking great, though."
  },
  {
   "score": 15,
   "id": "dipmpsq",
   "pid": "t1_dipjrpy",
   "date": "2017-06-10 02:05:23",
   "depth": 1,
   "text": "Yes! I was wondering if I was the only one thinking this. I find her story very boring as well and wished the show focused more on Ais instead. "
  },
  {
   "score": 16,
   "id": "dipsqfx",
   "pid": "t1_dipjrpy",
   "date": "2017-06-10 06:33:22",
   "depth": 1,
   "text": "I found the solution: ship lefiya with the other elf! Since the show is supposedly about Ais, then they would have no excuse to show Lefiya instead, when she is already another relationship! "
  },
  {
   "score": 3,
   "id": "diqucgv",
   "pid": "t1_dipsqfx",
   "date": "2017-06-10 22:33:25",
   "depth": 2,
   "text": "The series, going all the way to the source, is about the Loki Familia.  Ais and Lefiya are the protagonist and deuteragonist (which means that yes, Lefiya gets just as much focus in the source), but it's still more of an ensemble series than Danmachi."
  },
  {
   "score": 13,
   "id": "dipu349",
   "pid": "t1_dipsqfx",
   "date": "2017-06-10 07:13:49",
   "depth": 2,
   "text": "I'm pretty sure this is the Lefiya Show by this point."
  },
  {
   "score": 114,
   "id": "diphyrl",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 22:30:50",
   "depth": 0,
   "text": "[it was a joke, it was supposed to be a joke](https://www.reddit.com/r/anime/comments/6evgnm/spoilers_dungeon_ni_deai_wo_motomeru_no_wa/didraue/?utm_content=permalink&utm_medium=front&utm_source=reddit&utm_name=anime)\n\nI've held my tounge this long, but this show is horse shit. we were given a synopsis that this show would be about aiz, and not about this creepy stalkery blackmailer elf, the missed opportunity to build up a decent character into a great one was fucked away for what amounts to a habitually abusive charactr that displays tendencies of a dependence disorder. "
  },
  {
   "score": 1,
   "id": "dipxjtu",
   "pid": "t1_diphyrl",
   "date": "2017-06-10 08:43:34",
   "depth": 1,
   "text": "Guess I'm glad the LN's are next up on my reading list. I like the anime but, she really is obnoxious."
  },
  {
   "score": 3,
   "id": "dipvnwd",
   "pid": "t1_diphyrl",
   "date": "2017-06-10 07:56:26",
   "depth": 1,
   "text": "Idk, i actually started to like her, she was kinda cute this episode."
  },
  {
   "score": 3,
   "id": "dips2i6",
   "pid": "t1_diphyrl",
   "date": "2017-06-10 06:11:41",
   "depth": 1,
   "text": ">the missed opportunity to build up a decent character into a great one\n\nIf you want to see that happen I can only recommend the manga and/or the LN. It's sad that the anime didn't deliver what was promised."
  },
  {
   "score": 15,
   "id": "dipqjgl",
   "pid": "t1_diphyrl",
   "date": "2017-06-10 05:15:11",
   "depth": 1,
   "text": "ye there is WAYYYYY to much focus on her and is turning what could have been a decent show into a dramafest shitshow"
  },
  {
   "score": 10,
   "id": "dipw53v",
   "pid": "t1_dipqjgl",
   "date": "2017-06-10 08:08:47",
   "depth": 2,
   "text": "Not even dramafest... Lefiya isn't even really a character, every episode is: Be Scared > Blush > AISSSA-SAAN > Say nothing > Waste our time > AISAA-SAN > Repeat."
  },
  {
   "score": 3,
   "id": "diu4ajh",
   "pid": "t1_dipw53v",
   "date": "2017-06-13 01:59:44",
   "depth": 3,
   "text": "I've started skipping the parts that focus on Lefiya, and hoping in vain that she gets turned into a wet smear for drama points to make Ais mad."
  },
  {
   "score": 53,
   "id": "dipgc8e",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 21:37:29",
   "depth": 0,
   "text": "I didn’t know this was the side story of lefiya. "
  },
  {
   "score": 6,
   "id": "diquhvw",
   "pid": "t1_dipgc8e",
   "date": "2017-06-10 22:39:00",
   "depth": 1,
   "text": "Sword Orotario is about the Familia, with Ais as protagonist and Lefiya as deuteragonist.  It's this way in the source too.  The main difference is that the directors or writers in their infinite \"wisdom\" have butchered most of Ais' scenes and added daydreams to Lefiya's scenes.  Otherwise pretty much everything with Lefiya is true to source.  With Ais though they've cut out like 95 - 99% of her inner monologues and drastically shortened her fights."
  },
  {
   "score": 4,
   "id": "diquy68",
   "pid": "t1_diquhvw",
   "date": "2017-06-10 22:56:02",
   "depth": 2,
   "text": "So instead of it being about their familia. It became a lefiya wet dream side story?"
  },
  {
   "score": 27,
   "id": "dipi10p",
   "pid": "t1_dipgc8e",
   "date": "2017-06-09 22:33:09",
   "depth": 1,
   "text": "apparently leifa's a trap and the \"sword\" in the title is in reference to the steel swinging between the legs"
  },
  {
   "score": 5,
   "id": "dipxwjz",
   "pid": "t1_dipi10p",
   "date": "2017-06-10 08:51:56",
   "depth": 2,
   "text": "No one can beat Felix"
  },
  {
   "score": 54,
   "id": "diph5yo",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 22:03:15",
   "depth": 0,
   "text": "How can such a brilliantly written novel series get reduced to... *this*\n\nAt least the Lefiya x Filvis ship is giving me some recourse. "
  },
  {
   "score": 13,
   "id": "dipl83i",
   "pid": "t1_diph5yo",
   "date": "2017-06-10 00:48:07",
   "depth": 1,
   "text": "As an anime only watcher, this isn't all too bad. Pretty decent even, I'm definitely going to check the novels if they're better"
  },
  {
   "score": 0,
   "id": "dipvu1c",
   "pid": "t1_dipl83i",
   "date": "2017-06-10 08:00:51",
   "depth": 2,
   "text": "Key word being decent."
  },
  {
   "score": 1,
   "id": "dipsrb5",
   "pid": "t1_dipl83i",
   "date": "2017-06-10 06:34:09",
   "depth": 2,
   "text": "Read the manga. It's even better than the novel. "
  },
  {
   "score": 1,
   "id": "dp4jfqs",
   "pid": "t1_dipl83i",
   "date": "2017-10-30 19:39:17",
   "depth": 2,
   "text": "I really hope you've started checking out the LN or manga since this, volume 4 when Aiz trains Bell comes out tomorrow.\n\nThe novels and manga are way better -_-"
  },
  {
   "score": 3,
   "id": "dipqmri",
   "pid": "t1_dipl83i",
   "date": "2017-06-10 05:18:58",
   "depth": 2,
   "text": "You have really low standards.  I haven't looked into any of the manga or LNs for this spinoff, but just watching the anime was painful."
  },
  {
   "score": 16,
   "id": "dipt9qy",
   "pid": "t1_dipqmri",
   "date": "2017-06-10 06:50:07",
   "depth": 3,
   "text": "he who lives off of dirt shall outlive those who hunger for gold"
  },
  {
   "score": -9,
   "id": "diptn27",
   "pid": "t1_dipt9qy",
   "date": "2017-06-10 07:01:05",
   "depth": 4,
   "text": "I would rather enjoy my meals than try and force myself to swallow shit.  But hey, enjoy your shit sandwich."
  },
  {
   "score": 11,
   "id": "dipvtdp",
   "pid": "t1_diptn27",
   "date": "2017-06-10 08:00:23",
   "depth": 5,
   "text": "Aren't you doing exactly that \"forcing yourself to swallow shit\" by forcing yourself to watch show you dont like? Its episode 9, hello? \n\nFrom your perspective *You're eating shit sandwitch*.  Other people are eating average or decent sandwitches. I guess that would make one mad."
  },
  {
   "score": -7,
   "id": "dipwxpi",
   "pid": "t1_dipvtdp",
   "date": "2017-06-10 08:28:32",
   "depth": 6,
   "text": "> Aren't you doing exactly that \"forcing yourself to swallow shit\" by forcing yourself to watch show you dont like? Its episode 9, hello?\n\nOnly watched the first episode.  I pop into these episode discussions to see if it got any better.  It clearly hasn't."
  },
  {
   "score": 16,
   "id": "diq2b4v",
   "pid": "t1_dipwxpi",
   "date": "2017-06-10 10:33:54",
   "depth": 7,
   "text": "So you judge that it is shit based on discussion in threads? So you are shitting on anime you dont even watch? And then tell people they have low standards (their taste is shit basically)?  \n\nSeriously, why do you think that you seeing one episode makes you better judge of the show than one who has seen 9?  \n\nSeriously, i usually never say this, but since you are not watching the show your opinion is fucking worthless and youre just shitposting, not to mention being pretentious about it.  \n\nAnd it's pretty obnoxious. "
  },
  {
   "score": -1,
   "id": "diq884n",
   "pid": "t1_diq2b4v",
   "date": "2017-06-10 12:50:05",
   "depth": 8,
   "text": "And you are way too sensitive on someone else's opinion.  I'm looking at this as objectively as I can.  I wanted the series to be worth watching.  But not only is it not directly following the character that it's advertised as following and the manga it's adapted from, but it's following an annoying fan girl with an awful personality.  That was obvious from the first episode.  From the comments, this hasn't changed.  They aren't even putting in a lot of the details people want from the manga, but instead making up new details based on this fan girl to give the show content.  I don't need to watch the show to realize that's not what I want.  I wanted the show to be fairly faithful to the manga and follow Aiz.\n\nBut you keep on holding on to your opinion and lashing out at people you don't agree with no matter the reason.  You can like whatever you want.  Just realize that just because you like something doesn't make it good."
  },
  {
   "score": 8,
   "id": "diqbv5x",
   "pid": "t1_diq884n",
   "date": "2017-06-10 14:14:33",
   "depth": 9,
   "text": "> I'm looking at this as objectively as I can.\n\nthere is so much wrong in that statement. Not only there is nothing objective there, nor could you be, since one's opinion on art is inherently subjective, but you aren't actually looking. You are only looking at some opinions of others (which are subjective too) and confirm your views.  \n\n>They aren't even putting in a lot of the details people want from the manga  \n\nMost people dont read manga, and i don't know the people you are talking about, nor do people care what some manga readers wanted.  \n\nIt's simple you haven't been watching the show so your opinion has little value on these episodes or the show as a whole. What you're saying boils down to \"not like manga= bad\" , that's all and to be honest no one's interested to hear that.  \n\nBut instead you chose to talk shit about some person's standards because they dared to like something you aren't watching and aren't interested it. Good one. \n\n>But you keep on holding on to your opinion and lashing out at people you don't agree with no matter the reason\n\nI wasn't the one who told someone they have low standards, which is why i replied which to me is a good reason. Can't stand that level of pretentious.  \n\n>Just realize that just because you like something doesn't make it good.\n\nyour point? Just realize that just because dont like something doesn't make it bad. Works both ways.   \n\nThere is nothing wrong with liking Lefiya, anime viewers know just one version of the story and the story they are getting gives many of them enjoyment. Why would you want to demean that?  \n\nAnd when you do, you dont even know what exactly they are enjoying, since youre not watching the show. So yes you need to watch it to judge what they like, not like it will make it any more than your opinion."
  },
  {
   "score": 4,
   "id": "dipld5j",
   "pid": "t1_dipl83i",
   "date": "2017-06-10 00:54:49",
   "depth": 2,
   "text": "By far.  This adaptation leaves out so much and honestly puts way more emphasis on Lefiya than she deserves."
  },
  {
   "score": 10,
   "id": "diplb6t",
   "pid": "t1_dipl83i",
   "date": "2017-06-10 00:52:17",
   "depth": 2,
   "text": "I haven't even read this far in the story since this volume hasn't come out in english yet. But after reading 10 volumes of this series, I know how these scenes would be described normally and it grinds my gears to see them so shallowly depicted. \n\nBut yes, the novels are much much better. Though I recommend starting with the main series which goes past the anime, while this one does not yet. "
  },
  {
   "score": 39,
   "id": "diph37h",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 22:00:47",
   "depth": 0,
   "text": "A whole episode focused on Lefiya's jealousy. Just what I wanted.\n\nPretty cool to see some internal monologues from Aiz this week. If only it was like this from the start, but I'll take why I can get from this show. Awesome that she seems conflicted that she's just using Bell. I need more.\n\nWelp, I hated Bell in DanMachi but Lefiya makes him look good by comparison, so that's worth something. The alleyway chase was so wacky, I couldn't hate it.\n\nBut if there's one positive from her, it's that she's making progress with Cursed Elf-chan. Much prefer their interactions to her with literally anyone else in the show."
  },
  {
   "score": 30,
   "id": "dipip6r",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 22:58:11",
   "depth": 0,
   "text": "Every week my expectations are lower, yet I'm still disappointed."
  },
  {
   "score": 12,
   "id": "diq2nj9",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 10:41:34",
   "depth": 0,
   "text": "Oh wow.. both Bell AND Hestia? I haven't watched so much Danmachi since S1. Makes one realize how much I missed Hestia. \n\nToo bad there was a lot of that Lefya retarded shit going on that I had to skip. Just like the rest of the episodes. "
  },
  {
   "score": 19,
   "id": "dipnj0v",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 02:48:13",
   "depth": 0,
   "text": "god lefiya is so annoying. still don't understand why they even bother with her "
  },
  {
   "score": 6,
   "id": "diplp3g",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 01:11:30",
   "depth": 0,
   "text": "I liked the establishment of Lefiya's one sided rivalry with Bell, I at least hoped these two interact in the main story."
  },
  {
   "score": 1,
   "id": "dp4npim",
   "pid": "t1_diplp3g",
   "date": "2017-10-30 21:04:27",
   "depth": 1,
   "text": "Af far as the LN for the main series has gotten, it hasn't even acknowledged that they had ever spoken "
  },
  {
   "score": 9,
   "id": "dipq4rt",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 04:58:08",
   "depth": 0,
   "text": "Are we even meant to like the elf at this point???"
  },
  {
   "score": 5,
   "id": "dixktpx",
   "pid": "t1_dipq4rt",
   "date": "2017-06-15 03:13:43",
   "depth": 1,
   "text": "My hate reduced when she was at least trying to comfort Filvis. Now, it's back to normal levels."
  },
  {
   "score": 17,
   "id": "dipfof5",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 21:18:30",
   "depth": 0,
   "text": "Best episode so far for Lefiya fans. "
  },
  {
   "score": 9,
   "id": "dipt8my",
   "pid": "t1_dipfof5",
   "date": "2017-06-10 06:49:09",
   "depth": 1,
   "text": "I'm Anime only, and I enjoyed this episode. I don't care if the novel/manga was better, if I care I'll go read those.\n\nGranted I'm not saying this anime is amazing. It's definitely one of the weaker ones this season for me, but I don't hate Lefiya, and as funny as those manga scenes are that another user posted, I think I prefer a serious Ais.\n\nI thought Lefiya's jealousy was hilarious this episode. It makes her much more amusing then the normal \"I'm in love with Ais\", and her budding relationship with the other elf girl is cute. I'm down for it."
  },
  {
   "score": 1,
   "id": "dki8kfk",
   "pid": "t1_dipt8my",
   "date": "2017-07-20 20:09:15",
   "depth": 2,
   "text": "The thing is, there is way too many female character with this exact set up of little background story with an enormous amount of creepy/ annoying scenes that you're done after the first few you come across in anime. \n\nI wanna say that this is the first time you've seen a character like this, but I have no idea. If you wish for more characters like this, then god help your soul 10 animes later."
  },
  {
   "score": 21,
   "id": "dipfqld",
   "pid": "t1_dipfof5",
   "date": "2017-06-09 21:20:10",
   "depth": 1,
   "text": "I liked her waaaaaay more in the manga , frankly i like everything way more. Especially last episode was entirely different in it too"
  },
  {
   "score": 6,
   "id": "dipt2bc",
   "pid": "t1_dipfqld",
   "date": "2017-06-10 06:43:38",
   "depth": 2,
   "text": "Because in the manga it didn't feel forced, it was just a small part of the whole thing. After watching 5 episodes, i went and just read the manga from the beggining and after being done I actually liked Lefiya almost as much as the other side characters... In the anime though... ugh."
  },
  {
   "score": 8,
   "id": "dipjbd1",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 23:22:20",
   "depth": 0,
   "text": "Lefiya going after Aiz needs to stop. Her and Filvis is much more interesting, if not tolerable. Aiz's parents and Hestia's screentime were the only things that caught my attention. Season 2 better be AOTY tier or else."
  },
  {
   "score": 1,
   "id": "dki8omo",
   "pid": "t1_dipjbd1",
   "date": "2017-07-20 20:11:55",
   "depth": 1,
   "text": "If it's gonna be attack on Titan tier then I'm guessing you want the next season to be terrible too? ( ͡° ͜ʖ ͡°)"
  },
  {
   "score": 6,
   "id": "diph41o",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 22:01:33",
   "depth": 0,
   "text": "This was a late release; I went to work and came back and I wasn't even that late to this thread...\n\nFirst off seeing Lefiya getting beat up must have been a blast to the haters. Also her imaginations of Bell are sadly not even close to what his relationship with Aiz appears to be.\n\nAnd a random surprise attack on Aiz? Gee wiz someone's out to get best girl."
  },
  {
   "score": 1,
   "id": "dp4nnd4",
   "pid": "t1_diph41o",
   "date": "2017-10-30 21:03:04",
   "depth": 1,
   "text": "They are close enough. Aiz gives him lap pillows, like she fantasized. They don't skip together. \n\nBell is also the only person, man or woman, that had made Aiz feel the feelings she feels towards him. Sucks it's not shown in the anime. "
  },
  {
   "score": 7,
   "id": "diplevp",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 00:57:10",
   "depth": 0,
   "text": "I had just enough of Lefiya's fangirling shit.. Even if it's for some sort of character development I don't give af about her fantasies. Heck, she's not even serious about improving, just an attention whore.\n\nEDIT: Filvis training her makes things a little better but she better not get anymore spotlight aside from battle. "
  },
  {
   "score": 9,
   "id": "diph3nb",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 22:01:10",
   "depth": 0,
   "text": "[LOL](http://i.imgur.com/erCtYtz.png)"
  },
  {
   "score": 3,
   "id": "dipg3d4",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 21:30:09",
   "depth": 0,
   "text": "I assumed the Jealousy part of this episode will be more about on Aiz but it looks like it was for Lefiya. Although it was nice to hear some of Aiz's thoughts while training with Bell, it's curious to know that to her she's just using him so she can better herself. \n\nI don't remember that final scene from the original DanMachi, so I guess we'll finally get to see a completely new scene that involves Bell and Hestia.  Oh and Crozzo makes an appearance too, not that anyone cares about him. "
  },
  {
   "score": 1,
   "id": "dki8rw4",
   "pid": "t1_dipg3d4",
   "date": "2017-07-20 20:14:04",
   "depth": 1,
   "text": "There is a post above that shows what actually happens and why aiz keeps acting as a pillow when he gets knocked out. It's pretty amazing, basically he won't lay on her lap while conscious so she decides to keep knocking him out so that he can rest on her lap "
  },
  {
   "score": 3,
   "id": "diphcvm",
   "pid": "t1_dipg3d4",
   "date": "2017-06-09 22:09:33",
   "depth": 1,
   "text": ">I don't remember that final scene from the original DanMachi, so I guess we'll finally get to see a completely new scene that involves Bell and Hestia.\n\nI think that scene was in the novel, but no it wasn't in the anime. "
  },
  {
   "score": 3,
   "id": "diqcbwx",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 14:25:31",
   "depth": 0,
   "text": "Filvis single-handedly saved this episode!"
  },
  {
   "score": 6,
   "id": "diphogu",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 22:20:34",
   "depth": 0,
   "text": "Well, I thought that was a pretty enjoyable episode.  Nice to see Leyfia's efforts paying off in unexpected ways via Filvis.  Also, Bell is hilarious in her imagination.  Got a nice combination of her thoughts and some of Aiz's as well, and a nice transition into Aiz kicking Bell in the face, which is always a good time."
  },
  {
   "score": 3,
   "id": "diq3zcb",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 11:11:03",
   "depth": 0,
   "text": "God I hate that useless elf!"
  },
  {
   "score": 2,
   "id": "dipl90s",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 00:49:19",
   "depth": 0,
   "text": "Is Lefiya's jealousy towards Bell actually a thing in the LNs? And if so, is it a lot worse in the anime?"
  },
  {
   "score": 17,
   "id": "dipls9x",
   "pid": "t1_dipl90s",
   "date": "2017-06-10 01:16:01",
   "depth": 1,
   "text": "Lefiya is actually enjoyable as a character in LN , less so in anime . Mostly because they kept too many plot about Lefiya and cut so many about Aiz. So I do feel sorry for Lefiya being ruined by the anime."
  },
  {
   "score": 4,
   "id": "dipmn6w",
   "pid": "t1_dipls9x",
   "date": "2017-06-10 02:01:31",
   "depth": 2,
   "text": "She is definitely more enjoyable in the LN than the anime. I've already read the first two volumes. I was just wondering if her jealousy towards Bell is expressed in later volumes."
  },
  {
   "score": 5,
   "id": "dippugd",
   "pid": "t1_dipmn6w",
   "date": "2017-06-10 04:45:41",
   "depth": 3,
   "text": "[spoiler not really] (/s \"You will love volume 5 of sword oratoria \")"
  },
  {
   "score": 1,
   "id": "dipx5hn",
   "pid": "t1_dippugd",
   "date": "2017-06-10 08:33:53",
   "depth": 4,
   "text": "Damn well I guess I'll have to wait a while for Yen Press."
  },
  {
   "score": 2,
   "id": "diqryp5",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 21:15:48",
   "depth": 0,
   "text": "Why couldn't they have just completely eliminated lefiya from the start? I love the premise of this but hestia finally getting some voice lines is the only reason I like this show right now "
  },
  {
   "score": 2,
   "id": "dir4ljt",
   "pid": "t3_6gdd23",
   "date": "2017-06-11 06:14:57",
   "depth": 0,
   "text": "I wanna slap Aiz's butt"
  },
  {
   "score": 2,
   "id": "diu421o",
   "pid": "t3_6gdd23",
   "date": "2017-06-13 01:48:31",
   "depth": 0,
   "text": "Every single time Lefiya gets remotely tolerable she becomes an insufferable bitch all over again. I understand that they're hamming up the yuri shit more and more. But they're literally cutting out internal monologues of a character who is supposed to be a main focus to have this introverted friendzone knife-ear hog screen time. I've had friends who tried watching this that were surprised when I said the main focus was supposed to be Aiz."
  },
  {
   "score": 2,
   "id": "divh14l",
   "pid": "t3_6gdd23",
   "date": "2017-06-13 19:10:56",
   "depth": 0,
   "text": "I still remember​ how hyped I was when they announced this show because Ainz is a really interesting character and her internal monologues really change your perspective of her character. How could they fuck this up so hard? Holy shit the director and the writers must think they are geniuses, changing all the interesting scenes to show their \"masterpiece\"."
  },
  {
   "score": 8,
   "id": "dipmu1q",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 02:11:28",
   "depth": 0,
   "text": "Is there a [Lefiya fan club](https://i.imgur.com/aqYq4iI.jpg) that I can join just to give the finger to the haters ?\n\nJokes aside, I like the development we got in this episode. Lefiya is quite [expressive](https://i.imgur.com/kakxDjY.jpg), at an [excessive](https://i.imgur.com/g6uqnsN.jpg) point for sure. But it's understandable as she both wants to get stronger and get closer to Aiz. Her [cheerfulness](https://i.imgur.com/kakxDjY.jpg) and honesty makes her a total contrast to [Filvis](https://i.imgur.com/bjQWVYS.jpg), but she's also naturally closer to her, being an elf and a caster, so I hope some of her fangirling would shift to Filvis. Also because [I ship them.](https://i.imgur.com/QWgIcN7.jpg)\n\nAlso important, it was really interesting to see to the relation between Aiz and Bell from her point of view. And after seeing her [reasons](https://i.imgur.com/E7z7lP9.png) (explicit or [not](https://i.imgur.com/8KfvEPA.jpg)), I'm not shipping them at all. [Good luck to you, Hestia.](https://i.imgur.com/Sef3Pu7.jpg)\n\n[Sick](https://i.imgur.com/0amcEzZ.jpg) [burn.](https://i.imgur.com/XGsIyyy.jpg)"
  },
  {
   "score": 1,
   "id": "diqume3",
   "pid": "t1_dipmu1q",
   "date": "2017-06-10 22:43:38",
   "depth": 1,
   "text": "I've never really liked the BellxAis ship, from the moment I first read the manga (which was before the first anime was even announced).  Hestia and Lili fit with him so much better.  I'm also a Lefiya fan, though I can understand why anime only viewers would dislike her.  It's not really her fault though that the anime leaves her stuff relatively intact while butchering Ais' material."
  },
  {
   "score": 3,
   "id": "dki8yxj",
   "pid": "t1_dipmu1q",
   "date": "2017-07-20 20:18:39",
   "depth": 1,
   "text": "Read this part from the manga and you'll ship them again. I felt the same till I saw this.\n\nhttps://m.imgur.com/a/0d7md"
  },
  {
   "score": 3,
   "id": "dips5br",
   "pid": "t1_dipmu1q",
   "date": "2017-06-10 06:14:21",
   "depth": 1,
   "text": "> so I hope some of her fangirling would shift to Filvis. Also because I ship them.\n\nShe has to forget about Aiz and focus on Filvis!"
  },
  {
   "score": 10,
   "id": "dipq0ss",
   "pid": "t1_dipmu1q",
   "date": "2017-06-10 04:53:21",
   "depth": 1,
   "text": ">Also because [I ship them.](https://i.imgur.com/QWgIcN7.jpg)\n\n[Fill up the form](http://i.imgur.com/xyJu1gn.jpg) to join the fan club bruh."
  },
  {
   "score": 8,
   "id": "dipqb2d",
   "pid": "t1_dipq0ss",
   "date": "2017-06-10 05:05:36",
   "depth": 2,
   "text": "What a weird name for a fan club. Form's in the mail, you should get it in a few days."
  },
  {
   "score": 3,
   "id": "dipuio1",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 07:25:44",
   "depth": 0,
   "text": "Okay. From reading these discussion threads it seemed that most people really hated Lefiya pretty much from the start. And honestly, up until this episode I thought that she was tolerable enough that she only annoyed me when they went too full on with her. \n\nBut this episode is where I'm completely done with Lefiya. The way that she fawns over Ais again and again and acts like she's getting NTR'd when she sees her with Bell (bearing in mind that Lefiya's feelings are EXTREMELY one-sided) just pisses me off to no end.\n\nMaybe they were trying to portray her more as a rival to Bell, but the way she's been presented over the whole series so far and in this episode especially just ruins that and turns her behavior towards Ais into an almost stalker-like possessiveness.  "
  },
  {
   "score": 2,
   "id": "dipqlyy",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 05:18:03",
   "depth": 0,
   "text": "After the last episode I'm going to edit a version of this that leaves out Lefiya"
  },
  {
   "score": 1,
   "id": "dipgnaz",
   "pid": "t3_6gdd23",
   "date": "2017-06-09 21:46:52",
   "depth": 0,
   "text": "Lefiya was actually funny this episode and you can be worse girl if Hestia appears."
  },
  {
   "score": 1,
   "id": "dipq3oo",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 04:56:49",
   "depth": 0,
   "text": "Is this worth watching/ got better, i watched the first episode and thought it is really boring compared to danmachi. "
  },
  {
   "score": 1,
   "id": "dki9405",
   "pid": "t1_dipq3oo",
   "date": "2017-07-20 20:22:02",
   "depth": 1,
   "text": "It's only worth it if you skip every part with lefiya, which is 80% of the anime\nAnd read this if you want proof of aiz love for bell https://m.imgur.com/a/0d7md\n\nOtherwise just read the manga apparently.\n\nI wasted so much time on this T_T"
  },
  {
   "score": 4,
   "id": "diqgrq3",
   "pid": "t1_dipq3oo",
   "date": "2017-06-10 16:13:08",
   "depth": 1,
   "text": "Just read man the LN or Manga every single good scene in this anime has been cut or butchered more than turkeys on thanksgiving day."
  },
  {
   "score": 1,
   "id": "dipr8xs",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 05:42:47",
   "depth": 0,
   "text": "I've heard of tit for tat but what about [tit for tit???](http://i.imgur.com/t9CyfL9.jpg)"
  },
  {
   "score": 1,
   "id": "diprefu",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 05:48:22",
   "depth": 0,
   "text": "I find it a little weird the sisters didn't jump on the conversation about her secretly meeting a guy seeing that they were right across from them."
  },
  {
   "score": 1,
   "id": "diqrl5f",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 21:04:58",
   "depth": 0,
   "text": "As an anime only watcher, this show isn't too bad, but Lefiya has her moments, as for the rest of the show she is really annoying. Still worth the watch for Aiz and others."
  },
  {
   "score": 1,
   "id": "diqg6u7",
   "pid": "t3_6gdd23",
   "date": "2017-06-10 15:58:42",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 2,
   "id": "diqurvk",
   "pid": "t1_diqg6u7",
   "date": "2017-06-10 22:49:16",
   "depth": 1,
   "text": "I hate to break it to you, but Lefiya is the deuteragonist in the source material.  Except for the daydreams, which were added by the anime, her scenes aren't that different and she does get this much focus.  If the anime didn't butcher the hell out of Ais' scenes it wouldn't be so obtrusive."
  }
 ]
}