{
 "score": 338,
 "id": "69g3ls",
 "num_comments": 179,
 "date": "2017-05-05 10:28:57",
 "comments": [
  {
   "score": 94,
   "id": "dh6ag7w",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 10:31:01",
   "depth": 0,
   "text": "Oh, yay, they're finally starting to include Ais's thoughts and such. That dream was actually supposed to be shown earlier, but I guess they just postponed it to this point...I really wish they'd shown her thoughts during the tavern scene, but oh well.\n\nWith this, some of my faith has been restored. Though it has had an awkward start, maybe this adaptation will end up being pretty decent after all... I will wait and hope."
  },
  {
   "score": 1,
   "id": "dh8bppb",
   "pid": "t1_dh6ag7w",
   "date": "2017-05-06 20:17:06",
   "depth": 1,
   "text": "I would have definitely dropped this show after this ep if they didn't bring the focus on Ais. I stayed this long only cause I knew it had potential from reading the manga. Hopefully they will keep Ais as the main focus from here on out. Lefiya is great but having to sacrifice Ais for her just makes the show weaker. "
  },
  {
   "score": 1,
   "id": "dh6mahp",
   "pid": "t1_dh6ag7w",
   "date": "2017-05-05 14:42:35",
   "depth": 1,
   "text": "They didn't failed at not putting in her thoughts and character development in the beginning and the middle. Not seeing Revis appear to her at all in this one was odd too."
  },
  {
   "score": 2,
   "id": "dh6exel",
   "pid": "t1_dh6ag7w",
   "date": "2017-05-05 12:12:31",
   "depth": 1,
   "text": "With the way things are getting adapted I think /r/anime will pull a 180 by the time we reach the final episode.\n\nedit: Oh hey happy cakeday!"
  },
  {
   "score": 3,
   "id": "dh7nn1e",
   "pid": "t1_dh6ag7w",
   "date": "2017-05-06 10:25:57",
   "depth": 1,
   "text": "They finally changed the screenwriter in this episode. That's why this episode is so much better. \n\nedit: wordings "
  },
  {
   "score": 4,
   "id": "dh6r0ka",
   "pid": "t1_dh6ag7w",
   "date": "2017-05-05 16:34:46",
   "depth": 1,
   "text": "Apart from the slow start, this show is pretty good in terms of worldbuilding and events. The sneaky stuff by the bad guys are interesting.   \n  \nCompared to this, season 1 was a disaster in terms of writing imo. A weak ass protagonist who serves as self-insert, a conveniently loner god who takes a huge liking to the MC, a super strong girl who happens to like the MC too, a little loli who is actually not completely a good girl but is \"saved\" by the MCs kindness, and of course the skill that allows the MC to get out of any bad situation. Why does the story around the same world at the same timeframe differ so much? Is it adaption's fault, or are the cliches simply a matter of taste, and many people liked events of season 1?  \n  \n"
  },
  {
   "score": 2,
   "id": "dhbpg34",
   "pid": "t1_dh6r0ka",
   "date": "2017-05-09 05:05:54",
   "depth": 2,
   "text": "Bell also has talent because [he is probably](/s \"Zeus's descendant\")\n"
  },
  {
   "score": 1,
   "id": "dhhi3my",
   "pid": "t1_dhbpg34",
   "date": "2017-05-12 15:27:13",
   "depth": 3,
   "text": "?"
  },
  {
   "score": 2,
   "id": "dh6xwfu",
   "pid": "t1_dh6r0ka",
   "date": "2017-05-05 19:28:11",
   "depth": 2,
   "text": "It is not the adaptation fault with the first one. I think what most people find attractive in the first one is that Bell doesn't quite start OP, even when he, in the end, is. "
  },
  {
   "score": 10,
   "id": "dh6bbpm",
   "pid": "t1_dh6ag7w",
   "date": "2017-05-05 10:47:18",
   "depth": 1,
   "text": "> they're finally starting to include Ais's thoughts and such.\n\nI was waiting for good news like this, I will pick up the show again. "
  },
  {
   "score": 38,
   "id": "dh6d2rt",
   "pid": "t1_dh6ag7w",
   "date": "2017-05-05 11:25:08",
   "depth": 1,
   "text": ">They're finally starting to include Ais' thoughts\n\nUnfortunately they still skipped the scene where [manga spoilers] (/s \"she showed her frustration from not leveling up for a couple years.\") "
  },
  {
   "score": 1,
   "id": "dh6e5so",
   "pid": "t1_dh6d2rt",
   "date": "2017-05-05 11:57:08",
   "depth": 2,
   "text": "Didn't we see a lot of that in the main show?"
  },
  {
   "score": 20,
   "id": "dh6eulj",
   "pid": "t1_dh6e5so",
   "date": "2017-05-05 12:10:59",
   "depth": 3,
   "text": "Nope, they gave all of Aiz's time to the most annoying character in the show"
  },
  {
   "score": 1,
   "id": "dh6fpzg",
   "pid": "t1_dh6eulj",
   "date": "2017-05-05 12:28:10",
   "depth": 4,
   "text": "Which character would that be?"
  },
  {
   "score": 1,
   "id": "dh7bu7g",
   "pid": "t1_dh6fpzg",
   "date": "2017-05-06 04:55:07",
   "depth": 5,
   "text": "something something spineless yuri bait with spiky ears maybe"
  },
  {
   "score": 2,
   "id": "dh7d9wr",
   "pid": "t1_dh7bu7g",
   "date": "2017-05-06 05:53:41",
   "depth": 6,
   "text": "I have literally no idea who the hell you're talking about."
  },
  {
   "score": 1,
   "id": "dh7e07b",
   "pid": "t1_dh7d9wr",
   "date": "2017-05-06 06:19:42",
   "depth": 7,
   "text": "Lefiya of course. "
  },
  {
   "score": 5,
   "id": "dh7e4zd",
   "pid": "t1_dh7e07b",
   "date": "2017-05-06 06:24:05",
   "depth": 8,
   "text": "I barely saw her in the main show."
  },
  {
   "score": 2,
   "id": "dh77r71",
   "pid": "t1_dh6fpzg",
   "date": "2017-05-06 01:09:31",
   "depth": 5,
   "text": "I don't know what they're talking about either. Are they referring to the original show centred around Bell?"
  },
  {
   "score": 15,
   "id": "dh6f5fw",
   "pid": "t1_dh6eulj",
   "date": "2017-05-05 12:16:57",
   "depth": 4,
   "text": "She really isn't annoying by herself but it's hard to enjoy a show centered around a character whose got it for Aiz *even though we know what will likely happen* even though Aiz is [front and center in the poster](https://myanimelist.cdn-dena.com/images/anime/7/85467l.jpg)\n\nIt's more of a *we expected this and got that* more than anything else. If all the previews and the darn title didn't suggest that Aiz would play a significantly bigger role I feel /r/anime would have received this a little better."
  },
  {
   "score": 4,
   "id": "dh6mkws",
   "pid": "t1_dh6f5fw",
   "date": "2017-05-05 14:48:54",
   "depth": 5,
   "text": "Aiz is also simply a character that is most likely to be appreciated than Lefiya."
  },
  {
   "score": 16,
   "id": "dh6dzd9",
   "pid": "t1_dh6d2rt",
   "date": "2017-05-05 11:53:24",
   "depth": 2,
   "text": "Maybe they'll still show it later when its more relevant "
  },
  {
   "score": 57,
   "id": "dh6epnp",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 12:08:16",
   "depth": 0,
   "text": "They put the focus on Ais and the story and suddenly the show gets so much better. Looks like I will keep watching this after all. Also the first three episodes are almost completly irrelevant so I wonder why they even exist."
  },
  {
   "score": -6,
   "id": "dh6joct",
   "pid": "t1_dh6epnp",
   "date": "2017-05-05 13:47:32",
   "depth": 1,
   "text": "> They put the focus on Ais and the story and suddenly the show gets so much better\n\nWas it really though? The focus on Ais being her needing money? If anything Loki stole this episode."
  },
  {
   "score": 3,
   "id": "dh7729a",
   "pid": "t1_dh6joct",
   "date": "2017-05-06 00:33:43",
   "depth": 2,
   "text": "The significantly reduction in Lefiya helped a bit I would say. It still doesn't feel enough in Aiz but I think it's a good start.\n\nI think the problem is we wanted a show on Aiz and everything about her from her backstory to motivation to her end goals, but instead we got a show about that boring yuri elf girl and the whole familia doing almost slice of life stuff."
  },
  {
   "score": 3,
   "id": "dh773i9",
   "pid": "t1_dh7729a",
   "date": "2017-05-06 00:35:24",
   "depth": 3,
   "text": "Yeah there was a ton less Lefiya but everyone here is acting like all that screen time went to Aiz instead when that wasn't the case. "
  },
  {
   "score": 20,
   "id": "dh6mwx2",
   "pid": "t1_dh6joct",
   "date": "2017-05-05 14:56:28",
   "depth": 2,
   "text": "https://www.xkcd.com/552/"
  },
  {
   "score": -1,
   "id": "dh6mzv8",
   "pid": "t1_dh6mwx2",
   "date": "2017-05-05 14:58:21",
   "depth": 3,
   "text": "Not sure what you're trying to say/prove here to be honest...rather you just come out and say things than meme it."
  },
  {
   "score": 4,
   "id": "dh6nul9",
   "pid": "t1_dh6mzv8",
   "date": "2017-05-05 15:18:12",
   "depth": 4,
   "text": "Ha, sorry, I got carried away.\n\nFirst, I'll say that both aspects, separately, are true. Hence why my link to xkcd : they put the story on Aiz, and the episode was better than the previous ones, notably the parts with Loki. Obviously those events are separate, so it should be a correlation without causality, even if fiction sometimes has ways to have events that should be unrelated be strangely similar.\n\nNow, of course it's also a bit more complicated than that. You seemed to mean that Aiz wasn't that good in this episode either.  On that aspect, I'll simply repeat a comment I made [somewhere else in the thread.](https://www.reddit.com/r/anime/comments/69g3ls/spoilers_dungeon_ni_deai_wo_motomeru_no_wa/dh6n6hf/?context=10000)\n\n> Something interesting is that Aiz took the initiative by herself in this episode - wen she decided to go to the Dungeon, and when she chased after the Hermes familia guy. Which, I think, is something people wanted to see - something fitting of a badass swordfighting girl with a strong personality.\n\n>I just hope we get actual sword badass swordfighting and strong personality in the later episodes.\n\nI don't mean that she wasn't independent in the previous episodes (her behavior with Loki and at the Monsterphilia are good examples), but I think this episode showed her in a much more proactive mood, while the previous ones had her make decisions in a reactive way instead."
  },
  {
   "score": -3,
   "id": "dh6o91f",
   "pid": "t1_dh6nul9",
   "date": "2017-05-05 15:27:38",
   "depth": 5,
   "text": "> . You seemed to mean that Aiz wasn't that good in this episode either. \n\nI thought Aiz was fine in this episode, I just don't think it's been a big change from how she was in the first few. She hasn't shown us too much yet. I love Aiz, she's probably my favourite character but everyone saying **now** the show is focusing on her? That's just silly. \n\n> something fitting of a badass swordfighting girl with a strong personality.\n\nI feel like we got a lot of that in the first 3 episodes as well, heck the last one we got to actually see her be a badass. "
  },
  {
   "score": 3,
   "id": "dh6slmk",
   "pid": "t1_dh6mwx2",
   "date": "2017-05-05 17:13:46",
   "depth": 3,
   "text": "Yep, I'm stealing that one"
  },
  {
   "score": 12,
   "id": "dh6i512",
   "pid": "t1_dh6epnp",
   "date": "2017-05-05 13:16:27",
   "depth": 1,
   "text": "Set up. Expecting the murder events and monsterphilia conspiracy are going to be very interconnected. Part of me also suspects (or wants to suspect) maybe Lefiya got so much screen time because they're setting up for a tragic occurence with her later on to develop Aiz a bit more."
  },
  {
   "score": 13,
   "id": "dh6vvee",
   "pid": "t1_dh6i512",
   "date": "2017-05-05 18:35:51",
   "depth": 2,
   "text": "Well if you watched the main series nothing happends to Lefiya or Aiz as this timeline is still before Bell reaches LV 2. I really get triggered by Lefiya because she is so annoying."
  },
  {
   "score": 11,
   "id": "dh73ggq",
   "pid": "t1_dh6vvee",
   "date": "2017-05-05 22:10:37",
   "depth": 3,
   "text": "Lefiya is not really annoying, the adaptation just made her like that. She's a likable character who can *actually* do stuff aside from oggling Ais."
  },
  {
   "score": 1,
   "id": "dnti8uq",
   "pid": "t1_dh73ggq",
   "date": "2017-10-02 14:31:42",
   "depth": 4,
   "text": "I've never heard of a likable character that blackmails someone imo :/ "
  },
  {
   "score": 1,
   "id": "dh74lim",
   "pid": "t1_dh73ggq",
   "date": "2017-05-05 22:49:45",
   "depth": 4,
   "text": "True I agree. But she seems overall more like a side character."
  },
  {
   "score": 78,
   "id": "dh6dj2r",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 11:42:43",
   "depth": 0,
   "text": "There's a deformed corpse in the room and a brutal killer is still on the loose. Do you really think it's the best fucking time for your boob jokes?!"
  },
  {
   "score": 1,
   "id": "dh6qmmr",
   "pid": "t1_dh6dj2r",
   "date": "2017-05-05 16:25:08",
   "depth": 1,
   "text": "Well, you aren't supposed to feel bad for dead guy though. Whenever you see some guy getting it on with naked woman saying lecherous(?) things like that, he must die. I mean it was expected from start of the scene that he will come under serious physical harm."
  },
  {
   "score": 1,
   "id": "dh6qd5i",
   "pid": "t1_dh6dj2r",
   "date": "2017-05-05 16:18:39",
   "depth": 1,
   "text": "Well, to be honest, I actually buy it, since Bors surely isn't the most... better? person out there, I can totally see him doing that despicable joke in that moment."
  },
  {
   "score": 1,
   "id": "dh6mse7",
   "pid": "t1_dh6dj2r",
   "date": "2017-05-05 14:53:36",
   "depth": 1,
   "text": "There is no better time. The jokes could have been better, though - I expected Tione to threaten to add two more corpses in the room. "
  },
  {
   "score": 6,
   "id": "dh6tauw",
   "pid": "t1_dh6mse7",
   "date": "2017-05-05 17:31:24",
   "depth": 2,
   "text": "[How I picture you right now](https://s-media-cache-ak0.pinimg.com/originals/2c/c3/26/2cc3260f4d1c2afa0c9d82588ad05582.jpg)"
  },
  {
   "score": 1,
   "id": "dhasaz1",
   "pid": "t1_dh6tauw",
   "date": "2017-05-08 13:22:33",
   "depth": 3,
   "text": "Source?"
  },
  {
   "score": 3,
   "id": "dhaxd8y",
   "pid": "t1_dhasaz1",
   "date": "2017-05-08 14:57:35",
   "depth": 4,
   "text": "shimoneta, it's about dirty jokes, it's not exceptional, but it's pretty ok."
  },
  {
   "score": 2,
   "id": "dh76074",
   "pid": "t1_dh6tauw",
   "date": "2017-05-05 23:45:18",
   "depth": 3,
   "text": "> How I picture you ~~right now~~\n\nFTFY"
  },
  {
   "score": 4,
   "id": "dh6n4wk",
   "pid": "t1_dh6dj2r",
   "date": "2017-05-05 15:01:30",
   "depth": 1,
   "text": "to be fair deformed corpses are a bit of a turn-on."
  },
  {
   "score": 1,
   "id": "di9kzga",
   "pid": "t1_dh6n4wk",
   "date": "2017-05-31 03:54:53",
   "depth": 2,
   "text": ".... "
  },
  {
   "score": 10,
   "id": "dh6mnpu",
   "pid": "t1_dh6dj2r",
   "date": "2017-05-05 14:50:37",
   "depth": 1,
   "text": "I paused the episode to decrease the score when the random dude suggested an inspection to the crowd. Couldn't do it in the end because overall it was the best episode so far and it's already sitting at a 7. "
  },
  {
   "score": 7,
   "id": "dh6e158",
   "pid": "t1_dh6dj2r",
   "date": "2017-05-05 11:54:28",
   "depth": 1,
   "text": "There's always time for boob jokes!"
  },
  {
   "score": 48,
   "id": "dh6evdp",
   "pid": "t1_dh6dj2r",
   "date": "2017-05-05 12:11:25",
   "depth": 1,
   "text": "*Welcome to LN adaptations, where you can have a beatup dead body in the room and someone will still pull a comedy sketch centered around boobs.*\n\nAt this point it's to be expected. I've become desensitized to them at this point."
  },
  {
   "score": 8,
   "id": "dh6q7d8",
   "pid": "t1_dh6evdp",
   "date": "2017-05-05 16:14:36",
   "depth": 2,
   "text": "I was actually surprised it bothered me. I expected to have been completely out of bother for boob jokes. "
  },
  {
   "score": 115,
   "id": "dh6ihw1",
   "pid": "t1_dh6dj2r",
   "date": "2017-05-05 13:23:38",
   "depth": 1,
   "text": "[When you are a LN author and haven't made a boob joke after 5 minutes](http://i3.kym-cdn.com/entries/icons/original/000/019/484/n08A8NO.jpg)"
  },
  {
   "score": 39,
   "id": "dh6dp6q",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 11:47:03",
   "depth": 0,
   "text": "Seems like they cut half of the sewer fight involving Loki getting chased by one of the plant monster. For those interested, Bete has a second name, or a title - like Ais is known as Sword Princess - which is revealed in Loki's monologue during the sewer fight. [LN/manga spoiler](/s \"Bete is given the name of Vanagandr - Wolf of Disaster, due to his fast and vicious attacks. He is also Loki familia's fastest member.\")\n\nAlso, they removed small part of chat between Bete and Loki when they were on the way to the sewer, which I think most would find interesting, because you get to see [this face of Loki](http://i.imgur.com/GHbuZXW.png) in it. I think this is one of the more interesting settings in Sword Oratoria, because in the main DanMachi series, only Freya is portrayed as the bad god among them. Yet, in actuality, there are many other gods that dwell in Orario, are actually quite cunning and cynical themselves; Loki included. They also tone down the [gore content](http://i.imgur.com/OfJZ3iL.png) for obvious reason I guess. \n\nOverall, I think the production team is removing a lot of important contents that could really put the settings into a more interesting state than the current one we have, but given that it's only 12 episodes, I can understand why they aren't present here. It's really a shame, wish that it could be a 2 cour anime."
  },
  {
   "score": 1,
   "id": "dh7bsiq",
   "pid": "t1_dh6dp6q",
   "date": "2017-05-06 04:52:58",
   "depth": 1,
   "text": "> It's really a shame, wish that it could be a 2 cour anime.\n\nYeah, considering that the first volume of Oratoria is basically layoung foundation for setting from the perspective of loki members and all the interesting stuff happens later on(aka the part which most likely won't be adapted)"
  },
  {
   "score": 5,
   "id": "dh6mvij",
   "pid": "t1_dh6dp6q",
   "date": "2017-05-05 14:55:32",
   "depth": 1,
   "text": "... thanks for the nightmare fuel."
  },
  {
   "score": 10,
   "id": "dh6ntuk",
   "pid": "t1_dh6dp6q",
   "date": "2017-05-05 15:17:43",
   "depth": 1,
   "text": "I assume you mean Freya is the only bad god in the anime, because the light novels have gods had several other gods as antagonists. Also, I would classify Soma as a bad god, do to his complete disinterest in his familia and their how shit they are because of it."
  },
  {
   "score": 43,
   "id": "dh6ay4u",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 10:40:17",
   "depth": 0,
   "text": "This series [needs more Loki](http://i.imgur.com/MmgFEMd.jpg), I liked the little bit of her we got in Danmachi, so the more we get in this series the better."
  },
  {
   "score": 2,
   "id": "dh6ke7y",
   "pid": "t1_dh6ay4u",
   "date": "2017-05-05 14:01:56",
   "depth": 1,
   "text": "> needs more Loki ~~booty~~\n\nI conccur. I love her humor and her accent. Is that supposed to be kansai ben? I often mix up the japanese accents.\n\n"
  },
  {
   "score": 15,
   "id": "dh6e085",
   "pid": "t1_dh6ay4u",
   "date": "2017-05-05 11:53:55",
   "depth": 1,
   "text": "Loki is the best"
  },
  {
   "score": 4,
   "id": "dh6o3t5",
   "pid": "t1_dh6e085",
   "date": "2017-05-05 15:24:13",
   "depth": 2,
   "text": "One true waifu. #DanmachiBestGirl"
  },
  {
   "score": 12,
   "id": "dh73ig4",
   "pid": "t1_dh6ay4u",
   "date": "2017-05-05 22:12:34",
   "depth": 1,
   "text": "> I liked the little bit of her \n\n( ͡° ͜ʖ ͡°)"
  },
  {
   "score": 27,
   "id": "dh6jlvl",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 13:46:09",
   "depth": 0,
   "text": ">Someone's brutally murdered\n\n\n>Happy upbeat OP starts playing\n\n\nggwp\n\n\n\n\nAlso [( ͡° ͜ʖ ͡°)](https://cdn.discordapp.com/attachments/297964772069081089/310151883664916482/unknown.png)"
  },
  {
   "score": 4,
   "id": "dh6scno",
   "pid": "t1_dh6jlvl",
   "date": "2017-05-05 17:07:39",
   "depth": 1,
   "text": "would watch ais futa."
  },
  {
   "score": 9,
   "id": "dh6apw2",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 10:36:01",
   "depth": 0,
   "text": "Finally the focus is back on the Sword Princess herself! If there's anyone that I'm starting to like more in this spin-off though it's Loki. For some reason I find her more likable here than in DanMachi. I guess it's because she's not bullying Hestia here. \n\n\nI am not good at keeping track with the timeline but around this time Bell should've met Lili right?"
  },
  {
   "score": 1,
   "id": "dh7n61q",
   "pid": "t1_dh6apw2",
   "date": "2017-05-06 10:15:20",
   "depth": 1,
   "text": "They are probably going to run into him with mind down on the way back to town."
  },
  {
   "score": 2,
   "id": "dh6b7j8",
   "pid": "t1_dh6apw2",
   "date": "2017-05-05 10:45:07",
   "depth": 1,
   "text": "If we base it purely on episodes then around this time Bell should be buying armor with the elf chick and, yeah, meeting Lili."
  },
  {
   "score": 7,
   "id": "dh6jlje",
   "pid": "t1_dh6apw2",
   "date": "2017-05-05 13:45:57",
   "depth": 1,
   "text": "> Finally the focus is back on the Sword Princess herself!\n\nWas it really though? Was it that she needed money or the orb at the end? That's not really being the focus too much. Loki if anything stole this episode."
  },
  {
   "score": 4,
   "id": "dh6u1p1",
   "pid": "t1_dh6jlje",
   "date": "2017-05-05 17:50:10",
   "depth": 2,
   "text": "Pardon the pun *bete* sewer part was *low-key* my favorite scene"
  },
  {
   "score": 32,
   "id": "dh6gx7z",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 12:51:55",
   "depth": 0,
   "text": "the whole tone of the part with the murder was not well handled. First they get accused out of nowhere and then everything turns into a giant ecchi joke. This is not how you treat a scneario like this, it just ruins all the tension and seriousness"
  },
  {
   "score": 1,
   "id": "dh6n37j",
   "pid": "t1_dh6gx7z",
   "date": "2017-05-05 15:00:26",
   "depth": 1,
   "text": "Was this joke part of the LN? \n\nOverall is the LN more serious? "
  },
  {
   "score": 11,
   "id": "dh6oce5",
   "pid": "t1_dh6n37j",
   "date": "2017-05-05 15:29:46",
   "depth": 2,
   "text": "> In the LN, the scene in the room is more somber, with Riveria being the one to cover his half destroyed head with a cloth and it being taken more seriously, and Bors is freaked out when they find out who the dead guy is, its more dramatic that a level 4 was killed so easily, and they don't make a claim about one of the girls having done it and there isn't a flat joke.\n> \n> The scene with all the grouped up adventurers is more accurate, but the Loki familia members discuss that it has to be a woman, and she has to be attractive, and thats when Bors screams about inspections, and they do call him an idiot.\n\nI would say yes mostly, it handles separating comedy and serious moments better, but it does have both."
  },
  {
   "score": 2,
   "id": "dh6qcn5",
   "pid": "t1_dh6gx7z",
   "date": "2017-05-05 16:18:16",
   "depth": 1,
   "text": "The inn manager or whatever just sitting on the bed is what ruined it for me. Like, you're a pretty normal guy, walk into a room with a freaking crushed head corpse or whatever it was, and you go tell everyone, then when you come back in to discuss things, go ahead and sit on the bed next to the corpse? Regular people usually aren't so casual about that sort of thing..."
  },
  {
   "score": 19,
   "id": "dh6oali",
   "pid": "t1_dh6gx7z",
   "date": "2017-05-05 15:28:37",
   "depth": 1,
   "text": "In the LN, the scene in the room is more somber, with Riveria being the one to cover his half destroyed head with a cloth and it being taken more seriously, and Bors is freaked out when they find out who the dead guy is, its more dramatic that a level 4 was killed so easily, and they don't make a claim about one of the girls having done it and there isn't a flat joke.\n\nThe scene with all the grouped up adventurers is more accurate, but the Loki familia members discuss that it has to be a woman, and she has to be attractive, and thats when Bors screams about inspections, and they do call him an idiot."
  },
  {
   "score": 2,
   "id": "dh826p3",
   "pid": "t1_dh6oali",
   "date": "2017-05-06 16:12:31",
   "depth": 2,
   "text": "As I recall, the scene in the anime carries out largely the same way as it does in the manga.  Maybe the adaptation is adapting the adaptation a little."
  },
  {
   "score": 2,
   "id": "dhbpmit",
   "pid": "t1_dh826p3",
   "date": "2017-05-09 05:11:26",
   "depth": 3,
   "text": "adeptception"
  },
  {
   "score": 8,
   "id": "dh6bbax",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 10:47:05",
   "depth": 0,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dh6msqw",
   "pid": "t1_dh6bbax",
   "date": "2017-05-05 14:53:48",
   "depth": 1,
   "text": "Who is he and who is she? \n\nI assume she is the killer, who is he? "
  },
  {
   "score": 1,
   "id": "dh6nl6f",
   "pid": "t1_dh6msqw",
   "date": "2017-05-05 15:12:04",
   "depth": 2,
   "text": "If your still talking about the start/flashback \n[Spoil](/s \"Parents \")"
  },
  {
   "score": 4,
   "id": "dh6iiu2",
   "pid": "t1_dh6bbax",
   "date": "2017-05-05 13:24:10",
   "depth": 1,
   "text": "Daughters are usually subconsciously attracted to guys that resemble their dad"
  },
  {
   "score": 7,
   "id": "dh6jzgn",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 13:53:48",
   "depth": 0,
   "text": "Did I miss something? Why is everyone attracted to the Boss.\nAlso the unnecessary capitalization was a bit annoying."
  },
  {
   "score": 25,
   "id": "dh6kudx",
   "pid": "t1_dh6jzgn",
   "date": "2017-05-05 14:11:16",
   "depth": 1,
   "text": "Finn is a very well known adventurer (Lv. 6, head of Loki's familia) and also a hero to the Pallum race. This has something to do the Pallum race background. Long story short, his race is in a decline and he fought hard as the beacon of hope for the Pallum race, being their pillar of strength. Something like \"if I can do it, so could you!\" kind of stuff.\n\nTL;DR: This midget is super famous for being the leader of Loki familia and a hero to his race.\n"
  },
  {
   "score": 1,
   "id": "dh6swh1",
   "pid": "t1_dh6kudx",
   "date": "2017-05-05 17:21:15",
   "depth": 2,
   "text": ">\"if I can do it, so could you!\"\n\nWhile he quietly ignores the inbuilt advantages he has, Famous people tend to be famous in these sort of situations via a combination of circumstance and personal aptitude at a particular activity \n\nNot everyone can do something that someone else can, That's why we have many people skilled at different things "
  },
  {
   "score": 6,
   "id": "dh788si",
   "pid": "t1_dh6swh1",
   "date": "2017-05-06 01:36:08",
   "depth": 3,
   "text": "Just so you know, Finn is over 40 years old, so he's very experienced. Also one of the reason why he's the leader, because of his experiences as a veteran adventurer.\n\nAnd from my knowledge, his status as the hero has affected people positively and even lead some to do heroic deeds. You'll see this by the end of the anime, I think. It has something to do with the fight against the red-haired woman."
  },
  {
   "score": 0,
   "id": "dh78vty",
   "pid": "t1_dh788si",
   "date": "2017-05-06 02:12:29",
   "depth": 4,
   "text": "You're really missing the point here\n\nPut him in a dumpster Familia and he likely wouldn't have gone anywhere. I was trying to point out that the \"If I can do it\" mentality is really silly given the sheer advantages of his familia \n\nIt's like how if you remove Bells ~~plot armour~~ argonaut he would be screwed because his familia is not that great "
  },
  {
   "score": 5,
   "id": "dh7952t",
   "pid": "t1_dh78vty",
   "date": "2017-05-06 02:27:11",
   "depth": 5,
   "text": "No, you're the one missing the point, lol.\n\nFinn was among the first to join Loki familia in the beginning. Loki familia was no bigger than any other familia in the first place. Everyone started almost equally. They only expanded to be big and strong after years of adventuring. \n\nI think the biggest point you're missing is that, without Finn, the Pallum race would have ceased to exist now. That's how important Finn is to the Pallum race. Even if the rest of the Pallum race can't reach where Finn is, being Lv. 6 and whatnot, they are still striving forward in their own pace, instead of giving up and become monster's food."
  },
  {
   "score": 0,
   "id": "dh796of",
   "pid": "t1_dh7952t",
   "date": "2017-05-06 02:29:44",
   "depth": 6,
   "text": "I think being among the first of a capable god such as Loki compared to say Hestia and some other gods who would be spoilers is an innate advantage no?\n\nYou're also exaggerating his role greatly "
  },
  {
   "score": 1,
   "id": "dhbpwpb",
   "pid": "t1_dh796of",
   "date": "2017-05-09 05:20:07",
   "depth": 7,
   "text": "i think most gods in Danmachi has no power except to grant that stats thingy on adventurers back. Hestia starts out late because she was mooching off Hephaestus when she descended from heaven. "
  },
  {
   "score": 5,
   "id": "dh79kvn",
   "pid": "t1_dh796of",
   "date": "2017-05-06 02:53:39",
   "depth": 7,
   "text": "No, I am no exaggerating his role. He is just as important as I said he is. Why do you think he's called the hero of Pallum race? Being a hero  to your race isn't any small feat. \n\nAll in all, Finn is the beacon of hope to the rest of his race. That's an undeniable fact that is set in the world of Orario. I think you're misunderstanding the \"I can do it\" phrase here, in Finn's context, because it didn't mean to ask the rest to reach his level, but more like \"if I can continue to live on and fight hard against the monsters in the dungeon, then so could you, so don't give up and fight hard\". \n\nedit: Nice salty downvote.\n"
  },
  {
   "score": 6,
   "id": "dh72swu",
   "pid": "t1_dh6swh1",
   "date": "2017-05-05 21:48:36",
   "depth": 3,
   "text": "Not really, Finn isn't some super prodigy like Aiz and he doesn't have any huge trump cards like Bell or Lefiya (that I know of). He and the other two level sixes have been with Loki from the beginning and have built themselves up over decades. "
  },
  {
   "score": 2,
   "id": "dh745zy",
   "pid": "t1_dh72swu",
   "date": "2017-05-05 22:34:32",
   "depth": 4,
   "text": "Aiz is a super prodigy because she is a main character, Same with Bell and Lefiya\n\nUnlike other family's Loki isn't a particularly terrible family to be in, The difference is like being born into a extremely poor family and being born into a wealthy well off family "
  },
  {
   "score": 2,
   "id": "dh7bogg",
   "pid": "t1_dh745zy",
   "date": "2017-05-06 04:47:43",
   "depth": 5,
   "text": "> Aiz is a super prodigy because she is a main character, Same with Bell and Lefiya\n\nActually the strength of Aiz and Bell comes from their unique origins. Lefiya in terms of firepower is no different than eny other mage, she has a skill that provides her versatility. "
  },
  {
   "score": 6,
   "id": "dh6qj6k",
   "pid": "t1_dh6kudx",
   "date": "2017-05-05 16:22:47",
   "depth": 2,
   "text": "Whatever it is, I just really appreciate that despite looking like Meliodas (Nanatsu no Taizai), he acts nothing alike. "
  },
  {
   "score": 10,
   "id": "dh6ean8",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 11:59:53",
   "depth": 0,
   "text": "That last scene was *pretty* freaky for Aiz.\n\nI mean when you consider how OP she was in Danmachi and we're only in the 4th episode and already seeing Aiz clearly being disturbed by that egg/capsule thing, that's pretty scary.\n\nWe're getting all serious now!\n\n[Hype train now?](#squee)"
  },
  {
   "score": 8,
   "id": "dh6egf1",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 12:03:08",
   "depth": 0,
   "text": "4 episodes in and I'm still triggered by \"Ais\" \n\n\"Lulune Louie\", I think it's the same VA of GATE's Lelei La Lelena... Someone's gotta be trolling her 'cuz of her accent. I know I'd be... Nao Touyama so cute."
  },
  {
   "score": 1,
   "id": "dh7p18i",
   "pid": "t1_dh6egf1",
   "date": "2017-05-06 10:57:23",
   "depth": 1,
   "text": "> \"Lulune Louie\", I think it's the same VA of GATE's Lelei La Lelena... Someone's gotta be trolling her 'cuz of her accent. I know I'd be... Nao Touyama so cute.\n\nNope, credits say [赤尾ひかる](http://www.animenewsnetwork.com/encyclopedia/people.php?id=150594).\n"
  },
  {
   "score": 7,
   "id": "dh6eoyt",
   "pid": "t1_dh6egf1",
   "date": "2017-05-05 12:07:53",
   "depth": 1,
   "text": ">4 episodes in and I'm still triggered by \"Ais\" \n\n*Apparently* that's how you're supposed to spell it based off what translators said  in future translations.\n\nI still prefer Aiz over Ais though; it just looks better to me."
  },
  {
   "score": 2,
   "id": "dh6f5y0",
   "pid": "t1_dh6eoyt",
   "date": "2017-05-05 12:17:13",
   "depth": 2,
   "text": "It looks a lot better, exactly! Besides, even though I'm nowhere near  fluent in Japanese, I'm capable enough of reading アイズ (which is her name is Katakana) as \"Aizu\". Why can't we simply drop the \"u\"?"
  },
  {
   "score": 1,
   "id": "dh6jpna",
   "pid": "t1_dh6f5y0",
   "date": "2017-05-05 13:48:17",
   "depth": 3,
   "text": "I think it's because the romanization works better if you always havea consanant+vowel pair. It's not a hard \"u\", it's like \"zuh\" or something because you just stop at the \"z\". This happens to for stuff like \"suki\" which is more like \"s ki\"."
  },
  {
   "score": 2,
   "id": "dh6g36k",
   "pid": "t1_dh6f5y0",
   "date": "2017-05-05 12:35:28",
   "depth": 3,
   "text": "It depends on where they got the translation from. The thing is in English there are also plenty of s sounds that is pronounced like a z like \"prism\". I'm not defending the translators nor going against them, it's just they might've received orders to follow a certain person who wrote them as Ais first to keep the consistency."
  },
  {
   "score": 0,
   "id": "dh6qhf0",
   "pid": "t1_dh6g36k",
   "date": "2017-05-05 16:21:35",
   "depth": 4,
   "text": "Ais just sounds like \"ice\" no matter how I look at it, which is weird for her. Maybe if she was an ice user, I'd appreciate it as kind of punny, but she uses wind so it's just like eh. Aiz makes more sense."
  },
  {
   "score": 2,
   "id": "dh6g86x",
   "pid": "t1_dh6g36k",
   "date": "2017-05-05 12:38:12",
   "depth": 4,
   "text": "I understand your point, but this way it's not consistent at all considering the whole 1st season was AiZ, what were they thinking I wonder?"
  },
  {
   "score": 2,
   "id": "dh6grf6",
   "pid": "t1_dh6g86x",
   "date": "2017-05-05 12:48:45",
   "depth": 5,
   "text": "There could be an official transcript from the author himself, or two different people handled it without communication due to poor infrastructure. I actually have no idea, just bringing out thoughts that came to my mind that could be the reason behind it."
  },
  {
   "score": 1,
   "id": "dh6sq8u",
   "pid": "t1_dh6grf6",
   "date": "2017-05-05 17:16:55",
   "depth": 6,
   "text": "People would argue even if we had official sources, Just look at the people outright refusing to use the Author given proper names in the SukaSuka threads\n\n"
  },
  {
   "score": 1,
   "id": "dh6gzvm",
   "pid": "t1_dh6grf6",
   "date": "2017-05-05 12:53:26",
   "depth": 6,
   "text": "[Ah well...](#yuishrug)"
  },
  {
   "score": 3,
   "id": "dh6qe5d",
   "pid": "t1_dh6eoyt",
   "date": "2017-05-05 16:19:20",
   "depth": 2,
   "text": "Aiz Naninanistein <3"
  },
  {
   "score": 10,
   "id": "dh6eybh",
   "pid": "t1_dh6eoyt",
   "date": "2017-05-05 12:13:01",
   "depth": 2,
   "text": "Aizu-tan 4 life"
  },
  {
   "score": 4,
   "id": "dh6f7vp",
   "pid": "t1_dh6eybh",
   "date": "2017-05-05 12:18:16",
   "depth": 3,
   "text": ">Aizu-tan 4 life\n\n[](#ok_hand)\n\nThe only answer my man!"
  },
  {
   "score": 4,
   "id": "dh6b53g",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 10:43:52",
   "depth": 0,
   "text": "pippin was too curious again"
  },
  {
   "score": 5,
   "id": "dh6i5g9",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 13:16:41",
   "depth": 0,
   "text": "Woohoo! An episode not focusing on elf-chan!"
  },
  {
   "score": 4,
   "id": "dh6n32a",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 15:00:20",
   "depth": 0,
   "text": "it's incredible how much more interesting an anime gets when it actually has a plot and develops it from multiple directions, instead of being slice of life stuff."
  },
  {
   "score": 16,
   "id": "dh6aem9",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 10:30:12",
   "depth": 0,
   "text": "Well nice, it took four episodes to get the ball rolling. I didn't really care enough but objectively this was the best episode so far definitely."
  },
  {
   "score": 6,
   "id": "dh6amwb",
   "pid": "t1_dh6aem9",
   "date": "2017-05-05 10:34:26",
   "depth": 1,
   "text": ">  I didn't really care enough but objectively this was the best episode so far definitely.\n\nBarely any fights, no hype moments and barely any good interactions. This was a straight up set up episode. "
  },
  {
   "score": 10,
   "id": "dh6dgg8",
   "pid": "t1_dh6amwb",
   "date": "2017-05-05 11:34:46",
   "depth": 2,
   "text": "which says a lot about what the show was missing. They made Lefiya the protagonist at first to show how other people view Ais, but we got that in the original. What was interesting about this was that it was supposed to make a more complex character out of the generally air-headed Ais."
  },
  {
   "score": 1,
   "id": "dh6jpae",
   "pid": "t1_dh6dgg8",
   "date": "2017-05-05 13:48:04",
   "depth": 3,
   "text": "> What was interesting about this was that it was supposed to make a more complex character out of the generally air-headed Ais.\n\nAnd did we really get that this episode?"
  },
  {
   "score": 2,
   "id": "dh6n6hf",
   "pid": "t1_dh6dgg8",
   "date": "2017-05-05 15:02:31",
   "depth": 3,
   "text": "Something interesting is that Aiz took the initiative by herself in this episode - wen she decided to go to the Dungeon, and when she chased after the Hermes familia guy. Which, I think, is something people wanted to see - something fitting of a badass swordfighting girl with a strong personality.\n\nI just hope we get actual sword badass swordfighting and strong personality in the later episodes."
  },
  {
   "score": 17,
   "id": "dh6fhpn",
   "pid": "t1_dh6aem9",
   "date": "2017-05-05 12:23:43",
   "depth": 1,
   "text": ">I didn't really care enough but **objectively this was the best episode** so far definitely.\n\nI mean I wasn't a fan of the earlier episodes either but using *objectively* and *best* doesn't sit right with me at all."
  },
  {
   "score": 1,
   "id": "dh6ssg2",
   "pid": "t1_dh6fhpn",
   "date": "2017-05-05 17:18:26",
   "depth": 2,
   "text": "Earlier episodes were weak but this episode was personally a lot better for me\n\nI think the general consensus is it was a lot stronger of an episode for the majority of peoples experience "
  },
  {
   "score": 9,
   "id": "dh6q5ck",
   "pid": "t1_dh6fhpn",
   "date": "2017-05-05 16:13:14",
   "depth": 2,
   "text": "OBJECTIVELY. BEST. "
  },
  {
   "score": 8,
   "id": "dh6zmbw",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 20:15:08",
   "depth": 0,
   "text": "Ah, just finished the episode, time to check the thread to see why I'm not allowed to like it"
  },
  {
   "score": 1,
   "id": "dh7bls4",
   "pid": "t1_dh6zmbw",
   "date": "2017-05-06 04:44:06",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 1,
   "id": "dh7dfs4",
   "pid": "t1_dh7bls4",
   "date": "2017-05-06 05:59:48",
   "depth": 2,
   "text": "I believe you have severely misinterpreted the intent of what I said"
  },
  {
   "score": 1,
   "id": "dh7dwnx",
   "pid": "t1_dh7dfs4",
   "date": "2017-05-06 06:16:20",
   "depth": 3,
   "text": "True, my apologies. "
  },
  {
   "score": 3,
   "id": "dh6y862",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 19:36:54",
   "depth": 0,
   "text": "How good is this? Does it do the LN any justice?"
  },
  {
   "score": 1,
   "id": "dh71zli",
   "pid": "t1_dh6y862",
   "date": "2017-05-05 21:22:22",
   "depth": 1,
   "text": "its meh so far"
  },
  {
   "score": 4,
   "id": "dh72w6j",
   "pid": "t1_dh6y862",
   "date": "2017-05-05 21:51:38",
   "depth": 1,
   "text": "IDK about the LN, but I can tell you that the manga is vastly superior to this adaption so far. This episode is much better than the last 3, but still doesn't quite live up to its source material."
  },
  {
   "score": 2,
   "id": "dh6omrc",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 15:36:33",
   "depth": 0,
   "text": "Oh thank god...something interesting is happening.\n"
  },
  {
   "score": 2,
   "id": "dh7beju",
   "pid": "t3_69g3ls",
   "date": "2017-05-06 04:34:26",
   "depth": 0,
   "text": "Wow. Stuff is continuing to happen, and we're not focused on that fangirl anymore!\n\nThis is a very interesting mystery. I'm getting into the buildup. Let's hope it gets somewhere interesting."
  },
  {
   "score": 2,
   "id": "dh7coyz",
   "pid": "t3_69g3ls",
   "date": "2017-05-06 05:31:08",
   "depth": 0,
   "text": "Oh hey, we're actually getting a decent mystery plot now. Cool."
  },
  {
   "score": 2,
   "id": "dh9ph23",
   "pid": "t3_69g3ls",
   "date": "2017-05-07 19:57:07",
   "depth": 0,
   "text": "Watched this episode and realized after it was over that I somehow completely ignored episodes 2 and 3. Didn't even see they came out, no idea how. Then I come here and everyone is shitting on the first 3 episodes. I guess I'm not even going to bother then, plus I didn't even feel like I was missing something. Maybe it was a signal, maybe god was saving me the suffering."
  },
  {
   "score": 2,
   "id": "dh6hyxz",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 13:13:01",
   "depth": 0,
   "text": "Shame so many people jumped ship 3 episodes in. Things look like they're picking up. Slower than I'd like for a 12 episode season, but still..."
  },
  {
   "score": 5,
   "id": "dh6iwf4",
   "pid": "t1_dh6hyxz",
   "date": "2017-05-05 13:31:45",
   "depth": 1,
   "text": "Wouldn't have happened if they actually focused on the character they were supposed to be focusing on, not some useless coward which we already got from the main series."
  },
  {
   "score": 1,
   "id": "dh83oh0",
   "pid": "t1_dh6iwf4",
   "date": "2017-05-06 16:50:03",
   "depth": 2,
   "text": "Except Lefiya is not a useless coward, and got as much focus as she was supposed to.  Contrary to popular misconception, this is not Ais' series, the series is about all the top members of the familia.  And the beginning is supposed to focus a fair amount on Lefiya, whether you like it or not.  The real issue is that they cut out all of Ais' inner thoughts."
  },
  {
   "score": 8,
   "id": "dh6nmtc",
   "pid": "t1_dh6hyxz",
   "date": "2017-05-05 15:13:08",
   "depth": 1,
   "text": "In all fairness they were not give a reason to stay the first 3 episodes where 4/10 at best."
  },
  {
   "score": 7,
   "id": "dh6ahfg",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 10:31:39",
   "depth": 0,
   "text": "Oh man Lefiya got screen time, is everyone here going to flip their shit again?\n\n[](#rinkek)\n\nThis episode has me interested in the female murderer who seems like she'll be a badass and the ball thing. Don't really care to much about the ball itself but wow Ais's reaction was on the scary side...\n\n[_I also want more of her pls_](http://i.imgur.com/Er2mEOX.png)"
  },
  {
   "score": 2,
   "id": "dh89cxb",
   "pid": "t1_dh6ahfg",
   "date": "2017-05-06 19:15:30",
   "depth": 1,
   "text": "I can get people finding Lefiya annoying, but when it's because it takes focus away from Aiz you've lost me.\n\nI think I'm just the only one who finds her yet another boringly bland, non-personality. She has the expressive range of a dead fish."
  },
  {
   "score": 12,
   "id": "dh6av3c",
   "pid": "t1_dh6ahfg",
   "date": "2017-05-05 10:38:43",
   "depth": 1,
   "text": "> Tfw people hating on that cutie Lefiya  \n  \nhttp://i.imgur.com/3TSemOr.jpg"
  },
  {
   "score": 4,
   "id": "dh6b5vx",
   "pid": "t1_dh6av3c",
   "date": "2017-05-05 10:44:17",
   "depth": 2,
   "text": "I went from +4 to -4 pretty quickly haha guess they still hate her with a passion."
  },
  {
   "score": 1,
   "id": "dh6qykg",
   "pid": "t1_dh6b5vx",
   "date": "2017-05-05 16:33:21",
   "depth": 3,
   "text": "I think commenting on people disliking Lefiya shouldn't lose you points. I can kind of understand the dislike though. She seems kind of ~~a lot~~ like a female Bell, and not many people liked him to begin with, so having a second one of him is a little frustrating to them I'm sure. \n\nThat aspect of her doesn't bother me that much, but her frequent daydreams about Aiz irritate the heck out of me because a) they look like they're straight out of a shoujo manga and b) (this one irritates me way more) she seems to have a food stuck on Aiz's face fetish. Like, why does that need to be a thing? \n\nAlso, despite her constant problem being that her chants get cut off because they take a while and monsters just generally don't want to sit down and wait, when she finally managed a chant, it wasn't because she was smart about it or anything. She spent for*ever* monologuing about how she was going to do this before she actually did it. She could have completed her chant twice before she started it. It was just frustrating to watch. If she *hadn't* managed to finish it, I would be right there with everyone on the passionately hating her because gosh darn it, she's not even trying to get this right. \n\nBut she did finish it, so whatever. She's not likely to become my favorite character, but I don't hate her. (But really, that food on Aiz's face thing is what makes me the most angry. I'm trying not to focus on it because it's such a silly thing to be angry about but why? Is food on your face cute in Japan?)"
  },
  {
   "score": 2,
   "id": "dh6rg27",
   "pid": "t1_dh6qykg",
   "date": "2017-05-05 16:45:21",
   "depth": 4,
   "text": "> She seems kind of a lot like a female Bell, and not many people liked him to begin with, so having a second one of him is a little frustrating to them I'm sure.\n\nI hated Bell so I'm partially in that group. \n\n> She spent forever monologuing about how she was going to do this before she actually did it.\n\nI mean this is an action show, talking is a free action, too bad chanting isn't. Her reasoning for not being able to chant wasn't the time involved but her own fear and dealing with bigger monsters. During episode 3 she realized she couldn't afford to be scared anymore. \n\n> Is food on your face cute in Japan?\n\nI've seen multiple anime use the rice grain on a face as a way to get closer.\n\n"
  },
  {
   "score": 2,
   "id": "dh6rnqw",
   "pid": "t1_dh6rg27",
   "date": "2017-05-05 16:50:32",
   "depth": 5,
   "text": "> talking is a free action\n\n> multiple anime use the rice grain on a face\n\nI guess basically, the thing that bothers me about Lefiya is that she takes the things that bother me in any show and puts them into one character XD "
  },
  {
   "score": 3,
   "id": "dh6both",
   "pid": "t1_dh6b5vx",
   "date": "2017-05-05 10:55:44",
   "depth": 3,
   "text": "Hating her has nothing todo with it really it's like if amagami had plot changed and viewed from a side character pov and important stuff cut."
  },
  {
   "score": -7,
   "id": "dh6bulk",
   "pid": "t1_dh6both",
   "date": "2017-05-05 11:00:15",
   "depth": 4,
   "text": ">  it's like if amagami had plot changed and viewed from a side character pov and important stuff cut.\n\n[Yeah that episode was great!](https://myanimelist.net/anime/9925/)"
  },
  {
   "score": 2,
   "id": "dh6c13j",
   "pid": "t1_dh6bulk",
   "date": "2017-05-05 11:04:22",
   "depth": 5,
   "text": "Don't you think there's a little difference a one-off special then changing the main plot views?"
  },
  {
   "score": 3,
   "id": "dh6c57q",
   "pid": "t1_dh6c13j",
   "date": "2017-05-05 11:06:47",
   "depth": 6,
   "text": "This story still moved forward in all the necessary ways. Felt more like a character arc than the main character changing. Ais was still a crucial part of the first 3 episodes. \n\nThat one off special could have been an arc and been just fine, we had 3 episodes of Lefiya focus and everyone lost their minds. \n\n"
  },
  {
   "score": 2,
   "id": "dh6mjvc",
   "pid": "t1_dh6b5vx",
   "date": "2017-05-05 14:48:14",
   "depth": 3,
   "text": "It's less her and more the fact that they're nto giving character development to Ais and this story is really more about Ais. One of the few time sI actually had a major difference in experience reading the manga from the anime after watching the anime. Usually you just see more content in the manga, but this was night and day.\n\nYou're one of the few on the anime circle jerk sub that I upvote quite a bit since you don't lie or troll, still I'm tempted :P"
  },
  {
   "score": 4,
   "id": "dh6g281",
   "pid": "t1_dh6b5vx",
   "date": "2017-05-05 12:34:57",
   "depth": 3,
   "text": "I feel a little bad for you in this thread.\n\nI'm pretty indifferent to the show so far. I don't mind lefiya, but a lot her scenes are her being unsure about how to fight, I'd personally rather just see the high levels destroy monsters.\n\nBut I don't really care if they focus Lefiya rather than Aiz a little bit, since it makes sense to appeal to those that haven't seen/read the original danmachi. Most of the other characters back story comes from the original. You either re-explain the characters which could be dull to people who know already, or you have a new character to explain to everyone, and for the new people to follow. It's a toss up at which works better.\n\nBasically, I can see why people don't like Lefiya, but I'm surprised you're getting such a bad reaction for enjoying her. "
  },
  {
   "score": 1,
   "id": "dh6mo8l",
   "pid": "t1_dh6g281",
   "date": "2017-05-05 14:50:57",
   "depth": 4,
   "text": "Well it is supposed to be about Ais.. I'll be interested to see how much I feel I knew from the Ais anime and how much I feel I knew from the Ais manga and compare."
  },
  {
   "score": 5,
   "id": "dh6jjmr",
   "pid": "t1_dh6g281",
   "date": "2017-05-05 13:44:53",
   "depth": 4,
   "text": "> but a lot her scenes are her being unsure about how to fight, I'd personally rather just see the high levels destroy monsters.\n\nI mean we got what 2 episodes of that and then she got over her fear and helped out, that's not that long of a wait.\n\n> but I'm surprised you're getting such a bad reaction for enjoying her.\n\nYeah this thread seems to be the \"toxic\" one of the season. I got downvoted for providing an example when someone else brought up Amagami SS out of the blue in an attempt to undermine my point...just silly."
  },
  {
   "score": 1,
   "id": "dh6x1g8",
   "pid": "t1_dh6jjmr",
   "date": "2017-05-05 19:05:41",
   "depth": 5,
   "text": ">Yeah this thread seems to be the \"toxic\" one of the season.\n\nIdk, I feel like in this season most of the discussion threads have been extremely toxic to opinions running against the thread's consensus.  \nI remember people getting downvoted for [Akashic records](/s \"critiquing  how the rape attempt scene was handled or not thinking the show was amazing.\")  Other than that very specific example, since after seeing all that shit I kinda stopped digging though those threads for discussions,  I've been seeing a lot more comments being melted away even if they add to the discussion.\n\nMaybe it was the same in other season and I just never noticed till now, but either way it kinda sucks and makes coming to episode discussion threads mainly good for memes."
  },
  {
   "score": 2,
   "id": "dh6xbf6",
   "pid": "t1_dh6x1g8",
   "date": "2017-05-05 19:13:05",
   "depth": 6,
   "text": "> have been extremely toxic to opinions running against the thread's consensus.\n\nThat's nothing new sadly, it's when you get downvoted for saying positive things is when you can really tell how bad a thread is..."
  },
  {
   "score": 4,
   "id": "dh6xpeh",
   "pid": "t1_dh6xbf6",
   "date": "2017-05-05 19:23:11",
   "depth": 7,
   "text": "Thats what you get for going against the hate circlejerk^^/s .  \n\nHell, I don't like Lefiya at all but I do enjoy seeing if and why others enjoy a character. Since their reasons might mention something unique that didn't occur to me.  Then  I get to reevaluate my stance on that character and maybe enjoy the show more."
  },
  {
   "score": 2,
   "id": "dh8cunm",
   "pid": "t1_dh6jjmr",
   "date": "2017-05-06 20:48:16",
   "depth": 5,
   "text": "> a lot her scenes are her being unsure about how to fight\n\nAs opposed to focusing on Aiz, which involves her saying very little and expressing one of her three trademark emotions, those being:\n\n1. Blank Stare\n1. Huh.\n1. Fight the thing.\n\nI mean, I've seen characters who are literally designed to be--or come across as--emotionless robots who are more expressive."
  },
  {
   "score": 3,
   "id": "dh6k32t",
   "pid": "t1_dh6jjmr",
   "date": "2017-05-05 13:55:47",
   "depth": 5,
   "text": "She got over her fear and helped out, but still, I'd personally have preferred to see them go hard in battles that they either shit stomped, or had a close fight becuase it was a tough enemy, rather than a character got too scared. I'm just down for OP MC'S or just characters that aren't timid. She's fine now, but still, probably one of the least interesting of the cast. So I can understand while people don't care for her, but yeah, I don't get the hate.\n\nAs for the thread, just keep posting, a lot of people here seem to have read the LN and they seem to be the ones pissed with the focus change more than anyone, and I'm sure it will start to even back out with more episodes. "
  },
  {
   "score": 4,
   "id": "dh6k9zr",
   "pid": "t1_dh6k32t",
   "date": "2017-05-05 13:59:36",
   "depth": 6,
   "text": ">  I'd personally have preferred to see them go hard in battles that they either shit stomped, or had a close fight becuase it was a tough enemy, rather than a character got too scared.\n\nI mean you did get a lot of that, we got to see the whole party kick ass except for one character. So instead of only getting a dull OP group kicking ass we _also_ get to see how it's like for someone who is new to those levels.\n\n> So I can understand while people don't care for her, but yeah, I don't get the hate.\n\nYeah same here, I understand why people don't like her but it's on a whole other level in these threads...\n\n"
  },
  {
   "score": 5,
   "id": "dh6msqa",
   "pid": "t1_dh6jjmr",
   "date": "2017-05-05 14:53:47",
   "depth": 5,
   "text": "So it's supposed to be: A bit nervous but finishes her spell when they're fighting huge amount of catepillars in a cave. Next time chickens out of using a spell. Then the next time uses her spell. But because they skipped the entire exploration stage of Cadmus Spring we really miss out on all that,w hich would have been nice to see the characters interact and discover something.\n\nInstead we basically see her fail the first time which is odd because she's level 3 and isn't new to adventuring... and then we see her succeed and everyone's like WOO YEAH OH MY GOSH YEAH SHE DID IT. :-/\n\nLefiya isn't portrayed right. Bell should be appearing after an episode or two and we should see the LEfiya - Bell rivalry ideally. which is one sided of course as Bell is basically a dog."
  },
  {
   "score": 1,
   "id": "dh6mxu8",
   "pid": "t1_dh6msqa",
   "date": "2017-05-05 14:57:02",
   "depth": 6,
   "text": "> Instead we basically see her fail the first time which is odd because she's level 3 and isn't new to adventuring\n\nBut she is new to the bigger mobs! I think that's fair for her to be nervous/scared don't you?\n"
  },
  {
   "score": 2,
   "id": "dh6niyi",
   "pid": "t1_dh6mxu8",
   "date": "2017-05-05 15:10:36",
   "depth": 7,
   "text": "She's not actually. As I said the manga showed a different portrayal. it seems more that she's not good with them being so close to her, and honestly it seems that's usually because the other saren't doing a good enough job of protecting her until they literally are about to attack the mage."
  },
  {
   "score": 2,
   "id": "dh6nqu0",
   "pid": "t1_dh6niyi",
   "date": "2017-05-05 15:15:45",
   "depth": 8,
   "text": "> She's not actually.\n\nIgnoring the manga since this isn't the manga I thought [these](http://i.imgur.com/PO6Gny9.png) [lines](http://i.imgur.com/zKFd9bJ.png) showed that she's still new to it. The line after straight up says she just lacks experience. "
  },
  {
   "score": 2,
   "id": "dh6pd14",
   "pid": "t1_dh6nqu0",
   "date": "2017-05-05 15:53:52",
   "depth": 9,
   "text": "Right in terms of the deeper levels but to be fair she's likely fought the goliath and that was a large beast, so it can't just be size. It really seems to bes he's confident until an enemy gets right up to her face which shouldn't happen to a mage with that many people dedicated. "
  },
  {
   "score": 1,
   "id": "dh6pfvb",
   "pid": "t1_dh6pd14",
   "date": "2017-05-05 15:55:46",
   "depth": 1,
   "text": "> she's likely fought the goliath and that was a large beast, so it can't just be size\n\nThat feels like an assumption out of nowhere to me. As an anime only watcher her fears make sense for the character that's been established. \n\n> It really seems to bes he's confident until an enemy gets right up to her face which shouldn't happen to a mage with that many people dedicated.\n\nI can see that playing a part in too ya!"
  },
  {
   "score": 1,
   "id": "dh6pjwl",
   "pid": "t1_dh6pfvb",
   "date": "2017-05-05 15:58:33",
   "depth": 2,
   "text": "How so? They for sure go through the goliath since it respawns every couple weeks.\n\nShe also later on mentions when meeting Bell that she was only able to take on minotaur at such and such level. Those are pretty scary, melee, and large."
  },
  {
   "score": 1,
   "id": "dh6pmkd",
   "pid": "t1_dh6pjwl",
   "date": "2017-05-05 16:00:20",
   "depth": 3,
   "text": "I mean we don't know how she reacted there, it could be the same as the first episode. Heck she could have just not been in the party during those fights."
  },
  {
   "score": 1,
   "id": "dh6pt13",
   "pid": "t1_dh6pmkd",
   "date": "2017-05-05 16:04:47",
   "depth": 4,
   "text": "She was always in a party since that's how Loki Familia works to upgrade their adventurers at a faster pace. Power leveling in a lot of ways would be appropriate to call it.\n\nAnyway, she's got a few more nervous spells to deal with but eventually she should learn Concurrent Chanting."
  },
  {
   "score": 8,
   "id": "dh6ne4r",
   "pid": "t1_dh6b5vx",
   "date": "2017-05-05 15:07:26",
   "depth": 3,
   "text": "Atronox got a few upvotes though... And I can understand. I like Lefiya (\"as a person\") a lot, but that doesn't mean that all the hate she got (\"as a character\") was undeserved.\n\nStill, people asking for her to die in the last thread made me feel pretty dead inside myself.\n\n[](#crumblingdespair)"
  },
  {
   "score": 2,
   "id": "dh6ngu2",
   "pid": "t1_dh6ne4r",
   "date": "2017-05-05 15:09:11",
   "depth": 4,
   "text": "> Atronox got a few upvotes though\n\nAtronox always gets upvotes, that's his thing :p\n\n"
  },
  {
   "score": 2,
   "id": "dhb1n2a",
   "pid": "t1_dh6ngu2",
   "date": "2017-05-08 16:30:15",
   "depth": 5,
   "text": "[](#whisperwhisper \"Hey, that's supposed to be a secret\")"
  },
  {
   "score": 1,
   "id": "dh6e0gi",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 11:54:04",
   "depth": 0,
   "text": "Damn, shit got going this episode!"
  },
  {
   "score": 1,
   "id": "dh6ec9m",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 12:00:48",
   "depth": 0,
   "text": "Easily the best adapted part yet. Skipped some relatively unimportant stuff, but they did a good job with the parallel story-lines. Next episode will be exciting. "
  },
  {
   "score": 1,
   "id": "dh6echk",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 12:00:57",
   "depth": 0,
   "text": "So after 3 episodes of floundering around with Lefiya, it seems like this series is actually starting to get kind of interesting. I wasn't expecting a straight-up brutal murder to happen, and it looks like the plot is going to pick up from here on out. \n\nRegardless of whether it's good or bad this would be worth watching just for Tiona."
  },
  {
   "score": 1,
   "id": "dh6ia89",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 13:19:25",
   "depth": 0,
   "text": "Talk about openings that don't mesh with the activity just before them XD"
  },
  {
   "score": 1,
   "id": "dh6jhxv",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 13:43:51",
   "depth": 0,
   "text": "Bete reminds me Accelerator, white hair, personality... got even the same voice "
  },
  {
   "score": 1,
   "id": "dh6wsg5",
   "pid": "t1_dh6jhxv",
   "date": "2017-05-05 18:59:10",
   "depth": 1,
   "text": "[Nobuhiko Okamoto](https://www.animenewsnetwork.com/encyclopedia/people.php?id=59411)\n\nis the voice actor.\n\nAnd yes, <throaty whisper> [\"Accelerata da.... Yoroshiku\"](https://www.youtube.com/watch?v=RWVAPAAOGR4)"
  },
  {
   "score": 1,
   "id": "dh6xry3",
   "pid": "t1_dh6wsg5",
   "date": "2017-05-05 19:25:02",
   "depth": 2,
   "text": "Railgun/Index s3 when"
  },
  {
   "score": 1,
   "id": "dh7e4hv",
   "pid": "t1_dh6xry3",
   "date": "2017-05-06 06:23:39",
   "depth": 3,
   "text": "I feel your pain, bro."
  },
  {
   "score": 1,
   "id": "dh7dm5q",
   "pid": "t1_dh6xry3",
   "date": "2017-05-06 06:06:17",
   "depth": 3,
   "text": "soon brotha..."
  },
  {
   "score": 2,
   "id": "dh70fn9",
   "pid": "t1_dh6wsg5",
   "date": "2017-05-05 20:38:20",
   "depth": 2,
   "text": "You can usually easily spot the character that Nobuhiko Okamoto is voicing in a series.\n\nEven if they're a good guy, they usually still have the evil voice/grin."
  },
  {
   "score": 1,
   "id": "dh6qy9k",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 16:33:09",
   "depth": 0,
   "text": "Well well, the plot was already starting to move since previous episode, but now it has taken speed. \n\nI see that there is still people hating Lefiya. It is pretty sad to see, and this is part thanks to the adaptation, with so little time and so much to adapt things get messy and Lefiya's portrayal as a character isn't well done. If you are curious to see how Lefiya is in the source and overall the story, read the manga, specially since in my opinion Lefiya carries hard half of the manga weight in all the translated episodes, and it should be that way all the way until around chapter 50.\n\nSadly, I don't think Lefiya's VA was well picked.\n\nOther than that, I think the best thing this adaptation has done is the portrayal of Tiona. I can't truly see another VA doing her job better, and all the mannerisms and movement are pretty much on point. Everytime Tiona appears from now on in the manga I will keep hearing this voice her VA is giving. It is on point."
  },
  {
   "score": 1,
   "id": "dh7e5sx",
   "pid": "t3_69g3ls",
   "date": "2017-05-06 06:24:49",
   "depth": 0,
   "text": "I need a Loki Detective Agency spinoff now."
  },
  {
   "score": 1,
   "id": "dh6aii9",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 10:32:11",
   "depth": 0,
   "text": "Looks like we're starting to step away from Lefiya's POV which is nice. And not to mention, the series is starting to get darker straight away. Hopefully this'll breathe some life into everything.\n\nIt's also nice to get a bit of Bete's view, honestly. I've always thought his character was entertaining to watch and giving him a bit more to do besides comic relief is always good.\n\nAlso, shameless self-plug here. I've made a Danmachi discord server with a few friends, and we're still looking to grow it. If anyone wants to join, here's a link. \nhttps://discord.gg/cSFSymN"
  },
  {
   "score": 0,
   "id": "dh71145",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 20:54:48",
   "depth": 0,
   "text": "Crap reaction from the tan girl with the large chest. What the hell does she expect from guys when your tits are hanging out like that. Did assume all nearby men were gay?\n\nAnd it was poor timing, I hate when serious moments get interrupted by out of place jokes (a lot of 2010 disney shows do this). At least use dark humor."
  },
  {
   "score": -5,
   "id": "dh6ilxv",
   "pid": "t3_69g3ls",
   "date": "2017-05-05 13:25:53",
   "depth": 0,
   "text": "Woah. The opening scene almost made it look like there's something interesting going on in this show.\n\nSkip. Skip. Skip. Nope. Hestia is not back this episode either. It's almost like this show isn't about her... Well,see you next week. \n\n[](/s \"Don't you question my motives\")"
  }
 ]
}