{
 "score": 1530,
 "id": "64k45v",
 "num_comments": 506,
 "date": "2017-04-10 08:05:35",
 "comments": [
  {
   "score": 551,
   "id": "dg2xajb",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:23:20",
   "depth": 0,
   "text": "Lmao I can't\n\nThat part where he ran the f*k away after she introduced herself\n\nAlso I'm really liking the soundtrack"
  },
  {
   "score": 1,
   "id": "dg77uww",
   "pid": "t1_dg2xajb",
   "date": "2017-04-12 22:51:42",
   "depth": 1,
   "text": "> Also I'm really liking the soundtrack  \n\nI'm enjoying it as well and after looking up who's responsible, I'm not surprised;  \n[He worked on the music for Hibike! Euphonium, Non Non Biyori, and Bokura wa Minna Kawaisou to name a few](https://myanimelist.net/people/14045/Matsuda_Akito).  "
  },
  {
   "score": 1,
   "id": "dg4kbd8",
   "pid": "t1_dg2xajb",
   "date": "2017-04-11 10:09:16",
   "depth": 1,
   "text": "[ so its this part  ] (https://gfycat.com/UntidyFastCrownofthornsstarfish)\n\n"
  },
  {
   "score": 1,
   "id": "dg3wkt6",
   "pid": "t1_dg2xajb",
   "date": "2017-04-10 22:21:46",
   "depth": 1,
   "text": "Lol, i am in office at lunch break. That scene almost makes me burst out laughing. "
  },
  {
   "score": 2,
   "id": "dg3iz94",
   "pid": "t1_dg2xajb",
   "date": "2017-04-10 17:10:10",
   "depth": 1,
   "text": "That and Zero eating soup fast really cracked me up."
  },
  {
   "score": 3,
   "id": "dg3fp9e",
   "pid": "t1_dg2xajb",
   "date": "2017-04-10 15:58:50",
   "depth": 1,
   "text": "I noticed how good the soundtrack was aswell"
  },
  {
   "score": 23,
   "id": "dg35mkt",
   "pid": "t1_dg2xajb",
   "date": "2017-04-10 12:48:37",
   "depth": 1,
   "text": "> That part where he ran the f*k away after she introduced herself\n\nI almost died from laughing when this happened."
  },
  {
   "score": 26,
   "id": "dg31pwk",
   "pid": "t1_dg2xajb",
   "date": "2017-04-10 11:40:46",
   "depth": 1,
   "text": "[removed]"
  },
  {
   "score": 0,
   "id": "dg3aam3",
   "pid": "t1_dg31pwk",
   "date": "2017-04-10 14:10:11",
   "depth": 2,
   "text": "This comment has been removed.\n\n- Links to or other obvious direction toward pirate, illegal, or unofficial anime content are not allowed. This includes links to unofficial translations/scanlations of light novels, visual novels, and manga, unofficial anime streams, torrent sites, unofficially uploaded full OSTs, and images and video containing **watermarks** from any of the previously mentioned websites. In addition, proxy services are also forbidden.\n\n  Repeated violations of this rule will result in a ban.\n\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 113,
   "id": "dg353u8",
   "pid": "t1_dg2xajb",
   "date": "2017-04-10 12:39:28",
   "depth": 1,
   "text": "I also liked it when she was writing up a soul binding contract that would totally bite them in the arse later in some heart wrenching tragic scene. But fortunately his response is, NOPE and proceeds to rip it up."
  },
  {
   "score": 11,
   "id": "dg3wofd",
   "pid": "t1_dg353u8",
   "date": "2017-04-10 22:25:01",
   "depth": 2,
   "text": "It also shows how much trust the Merc has for Zero as well. He basically says that he doesn't need no soul binding contract and that he trusts her enough."
  },
  {
   "score": 42,
   "id": "dg3yvb3",
   "pid": "t1_dg3wofd",
   "date": "2017-04-10 23:47:03",
   "depth": 3,
   "text": "Or he might not trust a crazy loli witch with his blood. How to survive the magic apocalypse 101:  don't give out your blood or name to anyone.\n\n(Granted, the way the scene played out, yours is probably the correct interpretation, but my point still stands.)"
  },
  {
   "score": 5,
   "id": "dg5yke7",
   "pid": "t1_dg3yvb3",
   "date": "2017-04-12 07:47:55",
   "depth": 4,
   "text": "The way neither gave up their names and her saying names are important leads me to believe that their names may come up later."
  },
  {
   "score": 1,
   "id": "dg62ihh",
   "pid": "t1_dg5yke7",
   "date": "2017-04-12 09:00:42",
   "depth": 5,
   "text": "Probably. I just read through the Dresden Files, so that stuff is still on my mind."
  },
  {
   "score": 34,
   "id": "dg3ymv2",
   "pid": "t1_dg353u8",
   "date": "2017-04-10 23:37:13",
   "depth": 2,
   "text": "Yeah! This was brilliant! When she was writing the contract, I was like \"Ah, I see where this is going\" but then a blood oath out of nowhere. I really appreciate that little twist."
  },
  {
   "score": 167,
   "id": "dg34o8a",
   "pid": "t1_dg2xajb",
   "date": "2017-04-10 12:32:01",
   "depth": 1,
   "text": "Best girl of the season already confirmed. \n\n\"Request denied\" Witch to human translation is \"Bitch please.\""
  },
  {
   "score": 1,
   "id": "dg3hof2",
   "pid": "t1_dg34o8a",
   "date": "2017-04-10 16:42:25",
   "depth": 2,
   "text": "Nah Nina has that on lockdown"
  },
  {
   "score": 4,
   "id": "dg4evwn",
   "pid": "t1_dg34o8a",
   "date": "2017-04-11 08:30:01",
   "depth": 2,
   "text": "Finally found my 403 error page."
  },
  {
   "score": 13,
   "id": "dg3jb2r",
   "pid": "t1_dg34o8a",
   "date": "2017-04-10 17:16:55",
   "depth": 2,
   "text": "We need a \"Request Denied\" comment face :D"
  },
  {
   "score": 66,
   "id": "dg3ktnt",
   "pid": "t1_dg34o8a",
   "date": "2017-04-10 17:48:22",
   "depth": 2,
   "text": "*sudo fireball*"
  },
  {
   "score": 34,
   "id": "dg3syak",
   "pid": "t1_dg3ktnt",
   "date": "2017-04-10 20:40:00",
   "depth": 3,
   "text": "You are not in the sudoers file.  \nThis incident will be reported. "
  },
  {
   "score": 350,
   "id": "dg2zzni",
   "pid": "t1_dg2xajb",
   "date": "2017-04-10 11:10:33",
   "depth": 1,
   "text": "Mercenary having more common sense than 90% of MCs combined and GTFO'ing when the magic-propelled loli shows up. And it's not like he's overly educated, either: that's just how he's managed to stay alive this long despite being a 7-foot tall catman.  \n\nHell, even Zero's great too - she's got her cutesy, teasing side to her, but she's not as tsun-tsun as I might have guessed, and she's a pint-sized badass in her own right. \n\nWith the way this show introduced the difference between magic and sorcery without just spouting pure exposition, this show is off to a very strong start. "
  },
  {
   "score": 1,
   "id": "dg5bxx5",
   "pid": "t1_dg2zzni",
   "date": "2017-04-11 19:23:00",
   "depth": 2,
   "text": "What was the difference I didn't catch it."
  },
  {
   "score": 2,
   "id": "dg3wgb2",
   "pid": "t1_dg2zzni",
   "date": "2017-04-10 22:17:44",
   "depth": 2,
   "text": "I get a Holo vibe from Zero and I love it. Series looked good just from the pv, but the first ep really landed with me."
  },
  {
   "score": 52,
   "id": "dg3fobe",
   "pid": "t1_dg2zzni",
   "date": "2017-04-10 15:58:15",
   "depth": 2,
   "text": "You must have understood the difference between magic and sorcery better than myself. I feel like it was an issue of translation rather than a problem on the writers' end, but some of what Zero said seemed a little inconclusive. \n\n\"No, I only did that because no one had tried to before,\" meaning she only summoned that demon because no one had before and didn't know what it was capable of? \n\n\"The power demons possess is limited by laws similar to those of nature, and there is no circumventing them.\" I thought this line was explaining sorcery and the next line was going to explain magic, but the next line called that explanation magic which didn't seem to mesh with the previously given definition.\n\nProbably just me, but some of the not \"pure exposition\" came off as confusing exposition to me.  "
  },
  {
   "score": 4,
   "id": "dg3imb7",
   "pid": "t1_dg3fobe",
   "date": "2017-04-10 17:02:59",
   "depth": 3,
   "text": "Just watched it, and am in the same boat as you. But from what I gather, Sorcery uses demons or borrows their power to do their will with the \"Laws\" she was speaking of, but magic seems to be more free will and unbounded, but they have to quote spell and where its from. Like her summoning the demon vs her shooting the arrows."
  },
  {
   "score": 1,
   "id": "dg3nwe3",
   "pid": "t1_dg3imb7",
   "date": "2017-04-10 18:52:32",
   "depth": 4,
   "text": "Yeah that's how I understood it. You want to set shit on fire. Summon a fire demon of your capability and it will do your bidding to the best of its ability. Magic, borrow on the power of some other shit that I didn't quite catch. It's not as restrained as outsourcing the task. \n\nEDIT: Maybe the magic casting relies on the book because it's a written contract with an appropriate demon/god/elf per page and you can call on the contract by citing the section you want."
  },
  {
   "score": 2,
   "id": "dg3shj2",
   "pid": "t1_dg3nwe3",
   "date": "2017-04-10 20:28:55",
   "depth": 5,
   "text": "Someone gave a pretty clear explanation up in the chain of comments. Check it to understand the difference."
  },
  {
   "score": 171,
   "id": "dg3jeyc",
   "pid": "t1_dg3fobe",
   "date": "2017-04-10 17:19:09",
   "depth": 3,
   "text": "sorcery and magic are basically the same thing, with couple of key differences that makes magic the better version of sorcery. Sorcery needs to create a magic circles and long spell to cast to achieve something, the magic circle is not only used to summon demons, but also protect the summoner from the demons. (demons can be elf, demon, god whatever, she uses demons as a common name).\n\nMagic, is a shortened, mobile version of sorcery, zero basically realized through research that each demon asks for the same sacrifice and does the same thing in return in general. So, she shortened the spell instead of doing the long winding magic circle thingy, now a person just need to say the right keyword to achieve the same thing done.\n\nBasically see each different magic as an app, zero is the creator of those apps, other people who read the book knows how the app functions, and can use it then. So, zero wants to get her book back because people will learn how to use the magic to do bad things, as it is very convenient and useful, and even get to the source code(how she found out what magic truely is), so it is very dangerous to let the book go around.\n\nZero can reject other people's spell is because she developed the app, and has a backdoor function so other people can't use her magic to hurt her."
  },
  {
   "score": 1,
   "id": "dgk0ft0",
   "pid": "t1_dg3jeyc",
   "date": "2017-04-21 03:41:37",
   "depth": 4,
   "text": ">sorcery and magic are basically the same thing, with couple of key differences that makes magic the better version of sorcery.\n\nSorcery is a higher tier of magic and will always win against Magic. Magic is pretty much Java while Sorcery is C"
  },
  {
   "score": 1,
   "id": "dg45ci1",
   "pid": "t1_dg3jeyc",
   "date": "2017-04-11 04:50:07",
   "depth": 4,
   "text": "Where's my Great Crystal Soul Spear\n"
  },
  {
   "score": 1,
   "id": "dg4c2vg",
   "pid": "t1_dg45ci1",
   "date": "2017-04-11 07:36:59",
   "depth": 5,
   "text": "Gotta kill the dukes archive mage first"
  },
  {
   "score": 3,
   "id": "dg3mugk",
   "pid": "t1_dg3jeyc",
   "date": "2017-04-10 18:31:15",
   "depth": 4,
   "text": "Ooh, this explanation makes significant sense."
  },
  {
   "score": 3,
   "id": "dg3mrzc",
   "pid": "t1_dg3jeyc",
   "date": "2017-04-10 18:29:54",
   "depth": 4,
   "text": "Thank you, this made the whole sequence pretty clear."
  },
  {
   "score": 37,
   "id": "dg3m90p",
   "pid": "t1_dg3jeyc",
   "date": "2017-04-10 18:18:48",
   "depth": 4,
   "text": "The apps explanation is an amazing analogy. \n\nWe haven't gotten into what these sacrifices are yet I don't think, so I'm curious what that entails. There weren't any visible negatives thus far. \n\nI guess we'll get the whole system of magic explained in greater detail later when it goes into more of Zero's backstory. "
  },
  {
   "score": 17,
   "id": "dg3qewh",
   "pid": "t1_dg3m90p",
   "date": "2017-04-10 19:42:49",
   "depth": 5,
   "text": "That kid burned what looked like a snake skin to cast his spell. Seems like sacrifices can be most anything depending on the type of spell being cast."
  },
  {
   "score": 0,
   "id": "dg4dhei",
   "pid": "t1_dg3qewh",
   "date": "2017-04-11 08:03:48",
   "depth": 6,
   "text": "but when zero cast the magic to catch the boar, she didn't sacrifice anything right? is she use the food that she gave to the demon as a sacrifice? "
  },
  {
   "score": 4,
   "id": "dg4e6uk",
   "pid": "t1_dg4dhei",
   "date": "2017-04-11 08:17:14",
   "depth": 7,
   "text": "It depends I think. What the demons may ask as a sacrifice may not need to be tied to being physical things, maybe they also could ask for memories or something like that. It could also be that she doesn't need to do a movement to sacrifice something, like she cast the vine thing and the sacrifice that is in her pocket is just taken away, without her needing to have it on her hand.\n\n... And since Zero calls every creature \"demons\", then there may be some when they simple don't ask for something.\n\nThat's how I see it."
  },
  {
   "score": 198,
   "id": "dg31wvp",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:43:58",
   "depth": 0,
   "text": "[Zero knows what we want](http://imgur.com/HKWmQvk)\n\n[The previous scene is less erotic than in the manga](http://imgur.com/K5qXHrt)"
  },
  {
   "score": 20,
   "id": "dg3xna8",
   "pid": "t1_dg31wvp",
   "date": "2017-04-10 22:58:52",
   "depth": 1,
   "text": ">Do you mean that ... ... about me, you have lustful thoughts?\n\nGood god, that syntax was terrible. Either the translator just translated the original text word-for-word without regard to sentence structure, or the author had a stroke. My money's on the former."
  },
  {
   "score": 1,
   "id": "dg4c60w",
   "pid": "t1_dg3xna8",
   "date": "2017-04-11 07:38:40",
   "depth": 2,
   "text": "I don't know, I'm giving the translator more credit than that---it maintains the information layout of the original. It's funnier to have the \"lustful thoughts\" part at the end, and to have \"about me?\" separated from the rest would be a little unnecessary. Maybe if it had instead been \"Do you mean that, about me... you're having... lustful thoughts?\" the syntax wouldn't seem as odd. But the sentence is still better laid out this way for humor."
  },
  {
   "score": 3,
   "id": "dg4fj5j",
   "pid": "t1_dg4c60w",
   "date": "2017-04-11 08:42:06",
   "depth": 3,
   "text": "They could have just said \"Do you mean that... your thoughts about me are... lustful?\" instead, or something along those lines if they wanted to preserve the humor.\n\nI'm going to go with /u/Afronerd's guess that the bubbles might have been kept separate during the translation process."
  },
  {
   "score": 1,
   "id": "dg404d7",
   "pid": "t1_dg3xna8",
   "date": "2017-04-11 00:43:09",
   "depth": 2,
   "text": "Fucking speaking like Yoda, holy shit. It's not hard to literally re arrange two parts of a small sentence god damnit."
  },
  {
   "score": 2,
   "id": "dg40dig",
   "pid": "t1_dg3xna8",
   "date": "2017-04-11 00:55:26",
   "depth": 2,
   "text": "I think they might have translated each bubble independently."
  },
  {
   "score": 4,
   "id": "dg3y5gn",
   "pid": "t1_dg3xna8",
   "date": "2017-04-10 23:17:55",
   "depth": 2,
   "text": "not to mention that the font looks different than the one used in the previous panel as if it was edited in the last minute."
  },
  {
   "score": 9,
   "id": "dg441m8",
   "pid": "t1_dg3y5gn",
   "date": "2017-04-11 03:59:48",
   "depth": 3,
   "text": "I'm pretty sure it's a common thing in scanlation to use different fonts for different tones (since she was speaking erotically the font changed)"
  },
  {
   "score": 45,
   "id": "dg39ojj",
   "pid": "t1_dg31wvp",
   "date": "2017-04-10 13:59:00",
   "depth": 1,
   "text": "> Zero knows what we want\n\nZero body pillow, when?"
  },
  {
   "score": 70,
   "id": "dg34h30",
   "pid": "t1_dg31wvp",
   "date": "2017-04-10 12:28:36",
   "depth": 1,
   "text": "I actually like the art style of the manga. Usually I don't. Odd."
  },
  {
   "score": 12,
   "id": "dg45z6y",
   "pid": "t1_dg34h30",
   "date": "2017-04-11 05:10:53",
   "depth": 2,
   "text": "Because I assume the manga was an adaptation of a LN, and those adaptations usually suck in most regards, especially the art."
  },
  {
   "score": 180,
   "id": "dg378q1",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:16:38",
   "depth": 0,
   "text": "Grimoire of Zero, the story of one girls struggle to return her library book before she gets fined."
  },
  {
   "score": 120,
   "id": "dg2q1jz",
   "pid": "t3_64k45v",
   "date": "2017-04-10 08:11:50",
   "depth": 0,
   "text": "Pretty good start. I hope Mercenary gives his name at some point. Liked the background of witches. Good chemistry between our MC's.\n\nCouldn't help but notice the similarities to Re:Zero like the title, witches, and Zero's appearance compared to Emilia."
  },
  {
   "score": 1,
   "id": "dg41ah4",
   "pid": "t1_dg2q1jz",
   "date": "2017-04-11 01:41:33",
   "depth": 1,
   "text": "I call Zero \"[Not](https://i.imgur.com/ymbxyPc.jpg)-[Shimakaze](http://vignette3.wikia.nocookie.net/p__/images/a/ae/Shimakaze.png/revision/latest?cb=20140214174658&path-prefix=protagonist)\"\n\nHer hair in the anime's design is white enough to deviate from the similarities her original artwork had due to the two characters being drawn by the same illustrator. "
  },
  {
   "score": 4,
   "id": "dg38vgy",
   "pid": "t1_dg2q1jz",
   "date": "2017-04-10 13:44:58",
   "depth": 1,
   "text": "Also: Same animation studio."
  },
  {
   "score": 9,
   "id": "dg3df36",
   "pid": "t1_dg2q1jz",
   "date": "2017-04-10 15:10:54",
   "depth": 1,
   "text": "I mean, the title's kind of similar, but the meaning's pretty different (Re:Zero kara Hajimeru Ikusei Seikatsu ~ Re: Starting Life Over from Zero more or less if I'm understanding jisho right, and Zero kara Hajimeru Mahou no Sho ~ The Magic Book (grimoire) from which Magic Begins kind of) and witches are something it also has in common with Buffy the Vampire Slayer, Harry Potter, and Little Witch Academia.\n\nI'm not against people comparing the shows given that the first part of the title has three words in common, but I don't want people to like, start expecting them to do anything remotely similar with their stories just because of that and some superficial physical similarities between the main girls. ... Sorry, just wanted to get that off my chest. "
  },
  {
   "score": 2,
   "id": "dg5d7bk",
   "pid": "t1_dg3df36",
   "date": "2017-04-11 19:52:13",
   "depth": 2,
   "text": "But Zero looks nothing like Ram."
  },
  {
   "score": 2,
   "id": "dg61qjj",
   "pid": "t1_dg5d7bk",
   "date": "2017-04-12 08:46:41",
   "depth": 3,
   "text": "-snorts- Quite true. My mistake."
  },
  {
   "score": 3,
   "id": "dg9i9hf",
   "pid": "t1_dg3df36",
   "date": "2017-04-14 11:08:03",
   "depth": 2,
   "text": "It's Re:Zero kara Hajimeru *Isekai* Seikatsu.\nI think you're were being affected by Magical Girl Rising Project (Mahou Shoujo *Ikusei* Keikaku) a bit there. I have seen plenty who have made that mistake after that series aired."
  },
  {
   "score": 1,
   "id": "dg9il4w",
   "pid": "t1_dg9i9hf",
   "date": "2017-04-14 11:14:29",
   "depth": 3,
   "text": "Ah, lulz. Yeah. Damn."
  },
  {
   "score": 5,
   "id": "dg3u682",
   "pid": "t1_dg3df36",
   "date": "2017-04-10 21:11:36",
   "depth": 2,
   "text": "Frankly the show seems like a very straightforward fantasy story much like Histugi no Chaika which has more in common with that with story's is setup than Re:Zero. \n\nRe:Zero is only being brought up because it share 3-4 words with that show. "
  },
  {
   "score": 8,
   "id": "dg3xf6y",
   "pid": "t1_dg3u682",
   "date": "2017-04-10 22:50:34",
   "depth": 3,
   "text": "Its expected that re:zero is brought , both animes are made by the same studio I think"
  },
  {
   "score": 31,
   "id": "dg34jg3",
   "pid": "t1_dg2q1jz",
   "date": "2017-04-10 12:29:44",
   "depth": 1,
   "text": "Im pretty sure them being nameless wont change.  Think of it like [Maoyuu Maou Yuusha](https://myanimelist.net/anime/14833/Maoyuu_Maou_Yuusha) where you never know anyones names, only thier roles \"Hero\" \"Demon Lord\" \"Female Knight\" etc.  Thats what they are going for with Zero and Mercenary.  "
  },
  {
   "score": 6,
   "id": "dg3j4ap",
   "pid": "t1_dg34jg3",
   "date": "2017-04-10 17:13:01",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 3,
   "id": "dg3jl8q",
   "pid": "t1_dg3j4ap",
   "date": "2017-04-10 17:22:48",
   "depth": 3,
   "text": "Who knows, maybe White Fox will do this show its second flagship IP. It would be pretty cool, but we will need to see if it does well selling."
  },
  {
   "score": 3,
   "id": "dg3u2qp",
   "pid": "t1_dg3jl8q",
   "date": "2017-04-10 21:09:01",
   "depth": 4,
   "text": "Studios don't own IP."
  },
  {
   "score": 1,
   "id": "dg4bj58",
   "pid": "t1_dg3u2qp",
   "date": "2017-04-11 07:25:58",
   "depth": 5,
   "text": "I know that. I just didn't know how to call it at the moment, but I think the idea of what I wanted to say is still delivered."
  },
  {
   "score": 14,
   "id": "dg3bbj6",
   "pid": "t1_dg34jg3",
   "date": "2017-04-10 14:29:26",
   "depth": 2,
   "text": "Also similar to [Bikini Warriors](https://myanimelist.net/anime/30782/) !"
  },
  {
   "score": 3,
   "id": "dg52qib",
   "pid": "t1_dg3bbj6",
   "date": "2017-04-11 15:59:10",
   "depth": 3,
   "text": "Dude what.... wait, why am I even surprised there is an anime like this?\n\nWonder if there is a rule something for animes, similarly to rule 34.\n\nI mean we even have an anime that is about programs fighting viruses (khm megaman)."
  },
  {
   "score": 255,
   "id": "dg2xr8c",
   "pid": "t1_dg2q1jz",
   "date": "2017-04-10 10:31:23",
   "depth": 1,
   "text": "His name is Furry Guts."
  },
  {
   "score": 1,
   "id": "dg3gzil",
   "pid": "t1_dg2xr8c",
   "date": "2017-04-10 16:27:01",
   "depth": 2,
   "text": "I had this same thought; I came here to see if anyone else agreed. That is all. "
  },
  {
   "score": 2,
   "id": "dg4hu8z",
   "pid": "t1_dg2xr8c",
   "date": "2017-04-11 09:24:12",
   "depth": 2,
   "text": "I'm just going to call him J'zargo"
  },
  {
   "score": 3,
   "id": "dg5d40g",
   "pid": "t1_dg4hu8z",
   "date": "2017-04-11 19:50:03",
   "depth": 3,
   "text": "But J'zargo is a mage.\n\nA mage that does scrolls that almost kill you, but at least they do remove the undead around you."
  },
  {
   "score": 3,
   "id": "dg5ty9q",
   "pid": "t1_dg5d40g",
   "date": "2017-04-12 06:08:40",
   "depth": 4,
   "text": "Khajit is innocent. Khajit knows not of these scrolls."
  },
  {
   "score": 3,
   "id": "dg5uky0",
   "pid": "t1_dg5ty9q",
   "date": "2017-04-12 06:24:10",
   "depth": 5,
   "text": "He is also my Khajiit best frend"
  },
  {
   "score": 2,
   "id": "dg3sz3z",
   "pid": "t1_dg2xr8c",
   "date": "2017-04-10 20:40:34",
   "depth": 2,
   "text": "I kept thinking of guts while watching. Glad im not the only one"
  },
  {
   "score": 2,
   "id": "dg3ncm7",
   "pid": "t1_dg2xr8c",
   "date": "2017-04-10 18:41:21",
   "depth": 2,
   "text": "Or just Guin."
  },
  {
   "score": 90,
   "id": "dg3629l",
   "pid": "t1_dg2xr8c",
   "date": "2017-04-10 12:56:01",
   "depth": 2,
   "text": "This thing was too beastly to be called a man, too agile, too furry, too fluffy, too cute. Yes, he was more like the a pure husbando. "
  },
  {
   "score": 109,
   "id": "dg2pr1x",
   "pid": "t3_64k45v",
   "date": "2017-04-10 08:06:17",
   "depth": 0,
   "text": "For those wondering, episode 1 is already out on **Anime Strike** (linked in the post). 24 minutes with theme songs although we'll probably get the OP song (with clips) next time.\n\nWonderful start so far. I love [Zero and Mercenery's character relationship already.](http://i.imgur.com/fpMFV1W.jpg)"
  },
  {
   "score": 1,
   "id": "dg3qjpa",
   "pid": "t1_dg2pr1x",
   "date": "2017-04-10 19:45:35",
   "depth": 1,
   "text": "It's also on [AnimeLab](https://www.animelab.com/shows/grimoire-of-zero) for Australian and New Zealand. So could you please add the link?"
  },
  {
   "score": 1,
   "id": "dg3epe1",
   "pid": "t1_dg2pr1x",
   "date": "2017-04-10 15:37:46",
   "depth": 1,
   "text": "Finally I can watch anime on a modern platform. I just dropped funimation so I guess I'll get strike. "
  },
  {
   "score": 2,
   "id": "dg325gm",
   "pid": "t1_dg2pr1x",
   "date": "2017-04-10 11:48:08",
   "depth": 1,
   "text": "Do English subtitles work for you? It tells me they are unavailable\n"
  },
  {
   "score": 1,
   "id": "dg32se5",
   "pid": "t1_dg325gm",
   "date": "2017-04-10 11:59:05",
   "depth": 2,
   "text": "It worked for me."
  },
  {
   "score": 2,
   "id": "dg3aboi",
   "pid": "t1_dg325gm",
   "date": "2017-04-10 14:10:44",
   "depth": 2,
   "text": "I had this problem. I had to expliclty allow one of cloudfront's servers on my NoScript, that fixed it."
  },
  {
   "score": 1,
   "id": "dg3aoxy",
   "pid": "t1_dg3aboi",
   "date": "2017-04-10 14:17:35",
   "depth": 3,
   "text": "That was the exact issue! Weird, I thought I had all of Amazon's scripts allowed, I guess they added new ones just for anime "
  },
  {
   "score": 15,
   "id": "dg2vmgd",
   "pid": "t1_dg2pr1x",
   "date": "2017-04-10 09:53:40",
   "depth": 1,
   "text": "For anyone still wondering, it's also out in other places."
  },
  {
   "score": 95,
   "id": "dg2rdu1",
   "pid": "t1_dg2pr1x",
   "date": "2017-04-10 08:36:59",
   "depth": 1,
   "text": "> For those wondering, episode 1 is already out on **Anime Strike**\n\nScrew their pricing model."
  },
  {
   "score": 1,
   "id": "dg35req",
   "pid": "t1_dg2rdu1",
   "date": "2017-04-10 12:50:54",
   "depth": 2,
   "text": "They probably want to test the waters first and see if people want to subscribe to the service as well build a bigger catalog of anime titles."
  },
  {
   "score": 1,
   "id": "dg3m96k",
   "pid": "t1_dg35req",
   "date": "2017-04-10 18:18:54",
   "depth": 3,
   "text": "This is a good point. I think it's far more effective to get the service, then let them know what they need to do to fix it (and keep your money) than it is to complain about it on Reddit and pirate anyways."
  },
  {
   "score": 16,
   "id": "dg3246k",
   "pid": "t1_dg2rdu1",
   "date": "2017-04-10 11:47:30",
   "depth": 2,
   "text": "I know a lot of people are mad about the double pay wall thing, but honestly I'm kind of glad that Crunchyroll has competition, maybe they will get their crap together and stop lowering video quality. "
  },
  {
   "score": 1,
   "id": "dg3ugrn",
   "pid": "t1_dg3246k",
   "date": "2017-04-10 21:19:35",
   "depth": 3,
   "text": "True, and overall, Prime may provide a true competitor to TV networks in the future too."
  },
  {
   "score": 19,
   "id": "dg2t5y4",
   "pid": "t1_dg2rdu1",
   "date": "2017-04-10 09:09:22",
   "depth": 2,
   "text": "At least they have good taste this season lol "
  },
  {
   "score": 1,
   "id": "dg3uvjk",
   "pid": "t1_dg2t5y4",
   "date": "2017-04-10 21:30:44",
   "depth": 3,
   "text": "I'm thankful their 'good taste' wasn't so good as to contain other great shows that CR (thankfully) got."
  },
  {
   "score": 35,
   "id": "dg30w5w",
   "pid": "t1_dg2t5y4",
   "date": "2017-04-10 11:26:21",
   "depth": 3,
   "text": "I just wish their subtitles weren't trash."
  },
  {
   "score": 20,
   "id": "dg330eu",
   "pid": "t1_dg30w5w",
   "date": "2017-04-10 12:02:59",
   "depth": 4,
   "text": "I agree wholeheartedly.  There is a link on the episode page linked to above for sending feedback- please send them feedback and let them know their subs are horrible.  Maybe if people complain they'll do something about it."
  },
  {
   "score": 8,
   "id": "dg3c017",
   "pid": "t1_dg330eu",
   "date": "2017-04-10 14:42:34",
   "depth": 5,
   "text": "Honestly, their subs would be fine if they stayed as good as they are during the first 5 minutes of an episode. They just start to desync slowly after that before becoming almost unwatchable towards the end of some episodes. It's great that I can finally legally stream Familiar of Zero, but when all 30 episodes I've watched started desyncing, there's a problem.\n\nI will also take Crunchy's bitrate as of a few weeks ago to Amazon's any day. Some scenes are unwatchable until it buffers enough to give a mostly clear image."
  },
  {
   "score": 2,
   "id": "dg5gn4f",
   "pid": "t1_dg3c017",
   "date": "2017-04-11 21:20:45",
   "depth": 6,
   "text": "You lost me at the end. Maybe if it doesn't buffer properly it can get bad, but Amazon has the best image quality of all the US streaming services, with the possible exception of Funimation's, which I haven't tried since their revamp.\n\nThe banding on Crunchyroll is absolutely terrible."
  },
  {
   "score": 2,
   "id": "dg5vdsm",
   "pid": "t1_dg5gn4f",
   "date": "2017-04-12 06:42:47",
   "depth": 7,
   "text": "I never use Netflix or Hulu, only Amazon and Crunchyroll. Crunchyroll looks loads better to me on every device, with Amazon set to best and CR set to 1080p."
  },
  {
   "score": 100,
   "id": "dg3pm31",
   "pid": "t3_64k45v",
   "date": "2017-04-10 19:26:40",
   "depth": 0,
   "text": "[Me when writing a English essay](https://i.imgur.com/9wi0SsI.jpg)"
  },
  {
   "score": 3,
   "id": "dg785rq",
   "pid": "t1_dg3pm31",
   "date": "2017-04-12 23:03:02",
   "depth": 1,
   "text": "Gold!"
  },
  {
   "score": 92,
   "id": "dg2xrcp",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:31:26",
   "depth": 0,
   "text": "i lol'd so hard when he ran away after knowing zero is a witch"
  },
  {
   "score": 3,
   "id": "dgad89x",
   "pid": "t1_dg2xrcp",
   "date": "2017-04-14 23:08:31",
   "depth": 1,
   "text": "LOL I like this cat. He's got more brains than 90% of the MCs out there."
  },
  {
   "score": 27,
   "id": "dg3uym3",
   "pid": "t1_dg2xrcp",
   "date": "2017-04-10 21:33:10",
   "depth": 1,
   "text": "[I'm fucking out of here!](https://puu.sh/vgoSp/fbfdd53f42.mp4)"
  },
  {
   "score": 81,
   "id": "dg2s492",
   "pid": "t3_64k45v",
   "date": "2017-04-10 08:50:20",
   "depth": 0,
   "text": "Grimoire's LN illustrator, Shizuma Yoshinori,  also designed Kancolle characters such as Shimakaze and Nagato."
  },
  {
   "score": 1,
   "id": "dg5poq8",
   "pid": "t1_dg2s492",
   "date": "2017-04-12 03:45:33",
   "depth": 1,
   "text": "This vn and the manga is called magical girl shimakaze from where i'm from."
  },
  {
   "score": 34,
   "id": "dg31s00",
   "pid": "t1_dg2s492",
   "date": "2017-04-10 11:41:42",
   "depth": 1,
   "text": "Well that explain why the girl looked like daughter of  amatsunkaze and shimakaze ( if two girls are somehow create a daughter)"
  },
  {
   "score": 1,
   "id": "dg3duyj",
   "pid": "t1_dg31s00",
   "date": "2017-04-10 15:20:07",
   "depth": 2,
   "text": "This. Go and look the first novel cover, It's totally Shimakaze cosplaying as Zero lol"
  },
  {
   "score": 31,
   "id": "dg363x2",
   "pid": "t1_dg31s00",
   "date": "2017-04-10 12:56:48",
   "depth": 2,
   "text": "[She definitely looks more a lot like Shimakaze in the light novel art](http://imgur.com/W5j2VYK), so it's not surprising to have people get confused with the two of them. \n\nHeck, there's even someone who posted over at the Kancolle subreddit [this picture of Zero in a bikini](http://imgur.com/kuxExo6) and called it \"Shimakaze in a bikini\", lol."
  },
  {
   "score": 8,
   "id": "dg37n4g",
   "pid": "t1_dg363x2",
   "date": "2017-04-10 13:23:32",
   "depth": 3,
   "text": "Considering Shimakaze(the ship) has displacement of approx. 3000t even the tattoo(?) makes sense. \n\nThe same-face syndrome is strong with this one."
  },
  {
   "score": 92,
   "id": "dg322s2",
   "pid": "t1_dg31s00",
   "date": "2017-04-10 11:46:49",
   "depth": 2,
   "text": "Yuri magic makes anything possible."
  },
  {
   "score": 4,
   "id": "dg3xq0d",
   "pid": "t1_dg322s2",
   "date": "2017-04-10 23:01:37",
   "depth": 3,
   "text": "This is *literally a world with magic capable of reshaping human bodies*."
  },
  {
   "score": 24,
   "id": "dg3j1te",
   "pid": "t1_dg322s2",
   "date": "2017-04-10 17:11:36",
   "depth": 3,
   "text": "[Damn ...straight.](http://i.imgur.com/Uya1LWU.jpg)"
  },
  {
   "score": 9,
   "id": "dg3rth5",
   "pid": "t1_dg3j1te",
   "date": "2017-04-10 20:13:19",
   "depth": 4,
   "text": "No, that's yuri."
  },
  {
   "score": 47,
   "id": "dg34tg9",
   "pid": "t1_dg322s2",
   "date": "2017-04-10 12:34:30",
   "depth": 3,
   "text": "If you couldn't ship those girls, they wouldn't be shipgirls."
  },
  {
   "score": 1,
   "id": "dg3g3fy",
   "pid": "t1_dg34tg9",
   "date": "2017-04-10 16:07:33",
   "depth": 4,
   "text": "I ship those two. They are practically made for each other. Even saw  a few doujins where both are tsun toward each other."
  },
  {
   "score": 15,
   "id": "dg3990r",
   "pid": "t1_dg34tg9",
   "date": "2017-04-10 13:51:34",
   "depth": 4,
   "text": "Words of wisdom."
  },
  {
   "score": 143,
   "id": "dg36ba9",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:00:18",
   "depth": 0,
   "text": "Khajiit has wares, if you have the coin..."
  },
  {
   "score": 3,
   "id": "dg6f3fy",
   "pid": "t1_dg36ba9",
   "date": "2017-04-12 12:36:27",
   "depth": 1,
   "text": "I had to scroll down too far to find this. "
  },
  {
   "score": 255,
   "id": "dg2rob2",
   "pid": "t3_64k45v",
   "date": "2017-04-10 08:42:20",
   "depth": 0,
   "text": "[Rawr!](http://i.imgur.com/Amf8H3V.jpg) Zero is cute! Mercenary looks pretty badass, they seem like a great pair."
  },
  {
   "score": -7,
   "id": "dg30gsq",
   "pid": "t1_dg2rob2",
   "date": "2017-04-10 11:18:53",
   "depth": 1,
   "text": "am a bit worried about the sexual tension."
  },
  {
   "score": 13,
   "id": "dg33dhc",
   "pid": "t1_dg30gsq",
   "date": "2017-04-10 12:09:24",
   "depth": 2,
   "text": "It's definitely a concern, but this didn't read to me like *Kuma Miko* did in its first episode."
  },
  {
   "score": 32,
   "id": "dg3he8i",
   "pid": "t1_dg2rob2",
   "date": "2017-04-10 16:36:09",
   "depth": 1,
   "text": "I really like the ahegao on her hair "
  },
  {
   "score": 9,
   "id": "dg3ymzj",
   "pid": "t1_dg3he8i",
   "date": "2017-04-10 23:37:22",
   "depth": 2,
   "text": "You mean ahoge right? \n\nAhegao, you read too many hentai."
  },
  {
   "score": 21,
   "id": "dg3zaws",
   "pid": "t1_dg3ymzj",
   "date": "2017-04-11 00:05:34",
   "depth": 3,
   "text": "https://www.reddit.com/r/anime/comments/5dabgd/whats_the_deal_with_ahegaos/\n\nIt's a meme"
  },
  {
   "score": 1,
   "id": "dgexcm9",
   "pid": "t1_dg3zaws",
   "date": "2017-04-18 03:04:49",
   "depth": 4,
   "text": "I still go back and read through this thread when I need a good laugh. "
  },
  {
   "score": 30,
   "id": "dg3hktr",
   "pid": "t1_dg3he8i",
   "date": "2017-04-10 16:40:10",
   "depth": 2,
   "text": "http://i.imgur.com/W0x62nr.jpg"
  },
  {
   "score": 89,
   "id": "dg3rauw",
   "pid": "t1_dg3he8i",
   "date": "2017-04-10 20:01:53",
   "depth": 2,
   "text": ">the ahegao on her hair\n\n[look what you made me do](http://imgur.com/a/aSf8m)"
  },
  {
   "score": 16,
   "id": "dg3wr7y",
   "pid": "t1_dg3rauw",
   "date": "2017-04-10 22:27:34",
   "depth": 3,
   "text": "That's actually a little scary."
  },
  {
   "score": 33,
   "id": "dg2spsz",
   "pid": "t1_dg2rob2",
   "date": "2017-04-10 09:01:08",
   "depth": 1,
   "text": "All that's missing is a waltz between the two...\nOh, and some talking utensils/tools too."
  },
  {
   "score": 4,
   "id": "dg45hlo",
   "pid": "t1_dg2spsz",
   "date": "2017-04-11 04:55:03",
   "depth": 2,
   "text": "And the revelation that the one who turned him into a Kemono friend was [Zero](http://vignette3.wikia.nocookie.net/codegeass/images/4/4b/Lelouch_Zero613.jpg) all along!"
  },
  {
   "score": 17,
   "id": "dg2tgcv",
   "pid": "t1_dg2spsz",
   "date": "2017-04-10 09:14:45",
   "depth": 2,
   "text": "And Gaston"
  },
  {
   "score": 1,
   "id": "dg3xoil",
   "pid": "t1_dg2tgcv",
   "date": "2017-04-10 23:00:06",
   "depth": 3,
   "text": "The others are tools because they got caught in the cursefire. Gaston doesn't have that excuse."
  },
  {
   "score": 16,
   "id": "dg2zb6b",
   "pid": "t1_dg2tgcv",
   "date": "2017-04-10 10:58:48",
   "depth": 3,
   "text": "[Gaston?](http://imgur.com/a/Yz7G0)"
  },
  {
   "score": 36,
   "id": "dg36ra6",
   "pid": "t1_dg2zb6b",
   "date": "2017-04-10 13:08:00",
   "depth": 4,
   "text": "Nobody deliberately misinterprets dated memes like Gaston!"
  },
  {
   "score": 155,
   "id": "dg2t9j3",
   "pid": "t1_dg2rob2",
   "date": "2017-04-10 09:11:13",
   "depth": 1,
   "text": "[Rawr!!](http://imgur.com/a/MGSaS) The cuteness battle in this show is a tight race."
  },
  {
   "score": 12,
   "id": "dg3z385",
   "pid": "t1_dg2t9j3",
   "date": "2017-04-10 23:56:14",
   "depth": 2,
   "text": "And people say there's no CGDCT show this season. "
  },
  {
   "score": 63,
   "id": "dg3jdni",
   "pid": "t3_64k45v",
   "date": "2017-04-10 17:18:22",
   "depth": 0,
   "text": "I guess I'm a furry now. Fuck"
  },
  {
   "score": 4,
   "id": "dg7z0mx",
   "pid": "t1_dg3jdni",
   "date": "2017-04-13 11:18:47",
   "depth": 1,
   "text": "Never have I thought that I would to this day to see people shifting their taste to furries.\n\nBut our spite to the IRL one continues..."
  },
  {
   "score": 187,
   "id": "dg2s3l8",
   "pid": "t3_64k45v",
   "date": "2017-04-10 08:50:01",
   "depth": 0,
   "text": "[The ED is SO adorable.](http://imgur.com/a/cnZo7)\n\nI really loved this first episode. I like that Zero has an attitude on her, but it's not your typical little anime girl. She's wise beyond her years, and without being an annoying tsundere like say, Victorique from *Gosick*. I especially liked her voice acting. Only other character I know Yumiri Hanamori from was Koyori from *Scorching Ping Pong Girls* who I also loved.\n\nI also like that we got insight into the Mercenary's backstory immediately. The way that Zero can see his true inner appearance, like only his mother could before, was a great way to bring them together.\n\nLoved the background music throughout the episode. Nicely orchestrated.\n\nThere were only very slight hints of fanservice or a potential relationship between Zero and the Mercenary, but that was mostly just playful stuff which he shut down pretty quickly, thankfully."
  },
  {
   "score": 2,
   "id": "dg41pf8",
   "pid": "t1_dg2s3l8",
   "date": "2017-04-11 02:03:23",
   "depth": 1,
   "text": "Yeah if there was a gif version of the first part of the ed that'd be great"
  },
  {
   "score": 2,
   "id": "dg3jfjk",
   "pid": "t1_dg2s3l8",
   "date": "2017-04-10 17:19:29",
   "depth": 1,
   "text": "Zero is done by the same VA that did freaking Koyori!? \n\nNow that is a surprise :o, for her VA it is almost a 180 turn in character, and she is nailing it."
  },
  {
   "score": 3,
   "id": "dg3yt2q",
   "pid": "t1_dg2s3l8",
   "date": "2017-04-10 23:44:26",
   "depth": 1,
   "text": "> There were only very slight hints of fanservice or a potential relationship between Zero and the Mercenary, but that was mostly just playful stuff which he shut down pretty quickly, thankfully.\n\nHonestly their relationship reads to me more as a surrogate father-daughter rather than anything romantic but that might just be me confusing Zero's smallness."
  },
  {
   "score": 32,
   "id": "dg2w8o2",
   "pid": "t1_dg2s3l8",
   "date": "2017-04-10 10:04:43",
   "depth": 1,
   "text": "From what I can understand there's supposed to be very little romance in this, although I have not read any kind of source material"
  },
  {
   "score": 18,
   "id": "dg30jgn",
   "pid": "t1_dg2w8o2",
   "date": "2017-04-10 11:20:11",
   "depth": 2,
   "text": "Obviously there won't be romance between a human and a half animal. Guaranteed. "
  },
  {
   "score": 17,
   "id": "dg3vrl7",
   "pid": "t1_dg30jgn",
   "date": "2017-04-10 21:56:30",
   "depth": 3,
   "text": "cough cough *Spice and Wolf* cogh cough"
  },
  {
   "score": 10,
   "id": "dg3wash",
   "pid": "t1_dg3vrl7",
   "date": "2017-04-10 22:12:56",
   "depth": 4,
   "text": "I don't count that as bestiality, since she always stays with him as a human (and a pair of wolf ears)."
  },
  {
   "score": 22,
   "id": "dg42f10",
   "pid": "t1_dg3wash",
   "date": "2017-04-11 02:40:42",
   "depth": 5,
   "text": "Whoa, whoa whoa. Don't forget her glorious tail."
  },
  {
   "score": 17,
   "id": "dg3irkc",
   "pid": "t1_dg30jgn",
   "date": "2017-04-10 17:06:01",
   "depth": 3,
   "text": "Well, she offered to turn him into a human for the contract, odds are she'll still do it when they complete their task if he still wants it. She could probably even turn him into a were-tiger, if she's powerful as she says. Let him have the social benefits of a human with the combat benefits of his animal form, should he so choose."
  },
  {
   "score": 146,
   "id": "dg35pno",
   "pid": "t1_dg30jgn",
   "date": "2017-04-10 12:50:04",
   "depth": 3,
   "text": "has that ever stopped deviantart"
  },
  {
   "score": 1,
   "id": "dg42qvu",
   "pid": "t1_dg35pno",
   "date": "2017-04-11 02:58:05",
   "depth": 4,
   "text": "I wish"
  },
  {
   "score": 1,
   "id": "dg3vk8l",
   "pid": "t1_dg35pno",
   "date": "2017-04-10 21:50:28",
   "depth": 4,
   "text": "Sigh"
  },
  {
   "score": 98,
   "id": "dg36x4u",
   "pid": "t1_dg35pno",
   "date": "2017-04-10 13:10:55",
   "depth": 4,
   "text": "> has that ever stopped ~~deviantart~~ disney?"
  },
  {
   "score": 64,
   "id": "dg38z49",
   "pid": "t1_dg36x4u",
   "date": "2017-04-10 13:46:46",
   "depth": 5,
   "text": "> has that ever stopped ~~deviantart~~ ~~disney~~ People?"
  },
  {
   "score": 11,
   "id": "dg33mju",
   "pid": "t1_dg2s3l8",
   "date": "2017-04-10 12:13:50",
   "depth": 1,
   "text": "Her voice acting really stood out to me. Obviously not knowing japanese is a slight hindrance, but it felt really good, unique."
  },
  {
   "score": 1,
   "id": "dg6yfux",
   "pid": "t1_dg33mju",
   "date": "2017-04-12 18:54:57",
   "depth": 2,
   "text": "She speaks ancient as fuck Japanese."
  },
  {
   "score": 19,
   "id": "dg3766p",
   "pid": "t1_dg2s3l8",
   "date": "2017-04-10 13:15:23",
   "depth": 1,
   "text": "> Only other character I know Yumiri Hanamori from was Koyori from Scorching Ping Pong Girls who I also loved.\n\nShe also voiced best girl Nemurin from Mahou Shoujo Ikusei Keikaku last Fall season."
  },
  {
   "score": 1,
   "id": "dg3vh8f",
   "pid": "t1_dg3766p",
   "date": "2017-04-10 21:48:03",
   "depth": 2,
   "text": "Nemurin did nothing wrong."
  },
  {
   "score": 2,
   "id": "dg3gnaj",
   "pid": "t1_dg3766p",
   "date": "2017-04-10 16:19:30",
   "depth": 2,
   "text": "> Keikaku\n\nOh hey, I know that word!  It means \"plan\"."
  },
  {
   "score": 9,
   "id": "dg3fhxu",
   "pid": "t1_dg3766p",
   "date": "2017-04-10 15:54:29",
   "depth": 2,
   "text": "She's also voicing the *Greatest Hero Ever*, Minowa Gin, in Yuuki Yuuna."
  },
  {
   "score": 5,
   "id": "dg3gd3f",
   "pid": "t1_dg3fhxu",
   "date": "2017-04-10 16:13:22",
   "depth": 3,
   "text": "Part 2 hype. No one is ready"
  },
  {
   "score": 1,
   "id": "dg3gmvj",
   "pid": "t1_dg3gd3f",
   "date": "2017-04-10 16:19:15",
   "depth": 4,
   "text": "Friday is just 4 days away..."
  },
  {
   "score": 40,
   "id": "dg32i0r",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:54:08",
   "depth": 0,
   "text": "Good job, White Fox. It was one one of the stronger premieres this season. I found the chemistry between the two main characters to be especially good, and I'm really interested in learning more of their backstory."
  },
  {
   "score": 11,
   "id": "dg39qau",
   "pid": "t1_dg32i0r",
   "date": "2017-04-10 13:59:53",
   "depth": 1,
   "text": "The characters even have personalitys. Thats amazing.\n\nThank you White Fox.\nTo bad its not licensed.\nIm definetly gonna buy the blue ray release. (If i can get my hands on it)"
  },
  {
   "score": 99,
   "id": "dg2rvgu",
   "pid": "t3_64k45v",
   "date": "2017-04-10 08:45:57",
   "depth": 0,
   "text": "Just a little change\n\nSmall to say the least\n\nBoth a little scared\n\nNeither one prepared\n\nBeauty and the Beast...\n\n"
  },
  {
   "score": 29,
   "id": "dg3xd50",
   "pid": "t1_dg2rvgu",
   "date": "2017-04-10 22:48:30",
   "depth": 1,
   "text": "~~Beauty~~ Loli and The Beast"
  },
  {
   "score": 1,
   "id": "dhr4m19",
   "pid": "t1_dg3xd50",
   "date": "2017-05-18 20:30:03",
   "depth": 2,
   "text": "Loli and The ~~Beast~~ Furry"
  },
  {
   "score": 12,
   "id": "dg463tz",
   "pid": "t1_dg3xd50",
   "date": "2017-04-11 05:14:51",
   "depth": 2,
   "text": "~~Beauty~~ Loli and ~~The Beast~~ r/anime"
  },
  {
   "score": 28,
   "id": "dg31vpi",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:43:25",
   "depth": 0,
   "text": "Reminds me of spice and wolf for some reason"
  },
  {
   "score": 36,
   "id": "dg366jw",
   "pid": "t1_dg31vpi",
   "date": "2017-04-10 12:58:04",
   "depth": 1,
   "text": "Only now the furry-gender is reversed"
  },
  {
   "score": 23,
   "id": "dg368z9",
   "pid": "t1_dg366jw",
   "date": "2017-04-10 12:59:12",
   "depth": 2,
   "text": "I'm not opposed to that"
  },
  {
   "score": 333,
   "id": "dg2qhrq",
   "pid": "t3_64k45v",
   "date": "2017-04-10 08:20:13",
   "depth": 0,
   "text": "GODDAMMIT, Im still thinking this is a Re zero sequel."
  },
  {
   "score": 1,
   "id": "dg31xpm",
   "pid": "t1_dg2qhrq",
   "date": "2017-04-10 11:44:22",
   "depth": 1,
   "text": "i thought so as well.. lol"
  },
  {
   "score": 1,
   "id": "dg37x1z",
   "pid": "t1_dg31xpm",
   "date": "2017-04-10 13:28:16",
   "depth": 2,
   "text": "same"
  },
  {
   "score": 1,
   "id": "dg3azf5",
   "pid": "t1_dg2qhrq",
   "date": "2017-04-10 14:23:07",
   "depth": 1,
   "text": "Don't worry, I'm sure it's coming... eventually"
  },
  {
   "score": 11,
   "id": "dg2zkvo",
   "pid": "t1_dg2qhrq",
   "date": "2017-04-10 11:03:23",
   "depth": 1,
   "text": "I thought it could possibly be a prequel, and the witch girl was the original Satella in the past creating magic & experimenting."
  },
  {
   "score": 8,
   "id": "dg33s6c",
   "pid": "t1_dg2zkvo",
   "date": "2017-04-10 12:16:38",
   "depth": 2,
   "text": "Still makes sense. Wonder how long it will remain that way."
  },
  {
   "score": 10,
   "id": "dg3czme",
   "pid": "t1_dg33s6c",
   "date": "2017-04-10 15:01:58",
   "depth": 3,
   "text": "Even if it doesn't, I'm sure someone somewhere will write that fanfic."
  },
  {
   "score": 2,
   "id": "dg3smou",
   "pid": "t1_dg3czme",
   "date": "2017-04-10 20:32:16",
   "depth": 4,
   "text": "inb4 White Fox trolling us with a Re:Zero cameo on later episodes."
  },
  {
   "score": 19,
   "id": "dg2sj70",
   "pid": "t1_dg2qhrq",
   "date": "2017-04-10 08:57:49",
   "depth": 1,
   "text": "[Baka](#kukuku)"
  },
  {
   "score": 160,
   "id": "dg2ww3e",
   "pid": "t1_dg2qhrq",
   "date": "2017-04-10 10:16:26",
   "depth": 1,
   "text": "Haha! You really though you'd get to see [Re:Zero After Anime Spoilers](/s \"idk I'm an anime-only watcher lol\") animated?"
  },
  {
   "score": 4,
   "id": "dg3aie2",
   "pid": "t1_dg2ww3e",
   "date": "2017-04-10 14:14:10",
   "depth": 2,
   "text": "whoa dude, you mean like... the witch and our boy subaru?"
  },
  {
   "score": 6,
   "id": "dg35wpq",
   "pid": "t1_dg2ww3e",
   "date": "2017-04-10 12:53:24",
   "depth": 2,
   "text": "I wish"
  },
  {
   "score": 41,
   "id": "dg363e8",
   "pid": "t1_dg2ww3e",
   "date": "2017-04-10 12:56:34",
   "depth": 2,
   "text": "**WARNING**: This is an extremely big spoiler, do not read it if you want to enjoy season 2 when it comes out."
  },
  {
   "score": 1,
   "id": "dg3p8da",
   "pid": "t1_dg363e8",
   "date": "2017-04-10 19:18:53",
   "depth": 3,
   "text": "Wait season 2 was announced or something?"
  },
  {
   "score": 2,
   "id": "dg4hhdh",
   "pid": "t1_dg3p8da",
   "date": "2017-04-11 09:17:46",
   "depth": 4,
   "text": "No the guy just wrote ''idk I'm an anime-only watcher lol'' and hid it behind a spoiler tag to fool people, people who then red it decided to just play along. "
  },
  {
   "score": 4,
   "id": "dg5y64f",
   "pid": "t1_dg4hhdh",
   "date": "2017-04-12 07:40:26",
   "depth": 5,
   "text": "Do you know why they^^^^^would, ^^^^^if ^^^^^you ^^^^^had ^^^^^any ^^^^^friends invite you to parties?\n\nBecause every party needs a pooper."
  },
  {
   "score": 17,
   "id": "dg391h2",
   "pid": "t1_dg363e8",
   "date": "2017-04-10 13:47:54",
   "depth": 3,
   "text": "Yea I can't believe he just spoilt that, might as well not bother watching the game god damn sequel^^that^^will^^never^^come now. "
  },
  {
   "score": 71,
   "id": "dg32yf1",
   "pid": "t1_dg2ww3e",
   "date": "2017-04-10 12:02:01",
   "depth": 2,
   "text": "Honestly, that's my favorite part. Thanks for reminding me :/"
  },
  {
   "score": 26,
   "id": "dg3470l",
   "pid": "t1_dg32yf1",
   "date": "2017-04-10 12:23:49",
   "depth": 3,
   "text": "Hm, I feel a little out of place here. It was definitely cool, but lacking in substance. And in the end I felt like we didn't forward the plot one bit. But I agree, seeing it animated might just add the extra flare it needs to stand on its own."
  },
  {
   "score": 1,
   "id": "dg3fuyf",
   "pid": "t1_dg3470l",
   "date": "2017-04-10 16:02:17",
   "depth": 4,
   "text": "You guys are pathetic..."
  },
  {
   "score": 2,
   "id": "dg4bph9",
   "pid": "t1_dg3fuyf",
   "date": "2017-04-11 07:29:29",
   "depth": 5,
   "text": "That's a compliment coming from you."
  },
  {
   "score": 47,
   "id": "dg3409j",
   "pid": "t1_dg2qhrq",
   "date": "2017-04-10 12:20:33",
   "depth": 1,
   "text": "White Fox trolling us by having another anime with Zero in the title. Imagine the hype if Zero is Satella's backstory tho. "
  },
  {
   "score": 3,
   "id": "dg5fuwj",
   "pid": "t1_dg3409j",
   "date": "2017-04-11 20:58:57",
   "depth": 2,
   "text": "Holy shit. Silver hair. AND 7FT TALL CAT MAN LOOKS LIKE 1FT TALL CAT DAD!"
  },
  {
   "score": 3,
   "id": "dg3cyxt",
   "pid": "t1_dg3409j",
   "date": "2017-04-10 15:01:36",
   "depth": 2,
   "text": "Well, let's find out: are the authors friends? If so, that's like a 70% hike in the probability that that could happen."
  },
  {
   "score": 6,
   "id": "dg3b2eb",
   "pid": "t1_dg3409j",
   "date": "2017-04-10 14:24:43",
   "depth": 2,
   "text": "still waiting on Steins;Gate 0 from them"
  },
  {
   "score": 19,
   "id": "dg3a6dq",
   "pid": "t1_dg3409j",
   "date": "2017-04-10 14:08:01",
   "depth": 2,
   "text": "I nearly shat my pants when I saw episode discussion of \"Zero kara hajimeru\", but then I saw the words following it aren't exactly \"isekai seikatsu\".  \nStill though, I could watch this. "
  },
  {
   "score": 265,
   "id": "dg2rz8q",
   "pid": "t1_dg2qhrq",
   "date": "2017-04-10 08:47:51",
   "depth": 1,
   "text": "Forget Emilia. I love Zero."
  },
  {
   "score": 1,
   "id": "dg3ruue",
   "pid": "t1_dg2rz8q",
   "date": "2017-04-10 20:14:10",
   "depth": 2,
   "text": "https://www.youtube.com/watch?v=tnkDuwTd8jw"
  },
  {
   "score": 4,
   "id": "dg2zurw",
   "pid": "t1_dg2rz8q",
   "date": "2017-04-10 11:08:12",
   "depth": 2,
   "text": "I love Emilia..."
  },
  {
   "score": 11,
   "id": "dg3i1pd",
   "pid": "t1_dg2zurw",
   "date": "2017-04-10 16:50:39",
   "depth": 3,
   "text": "Request denied."
  },
  {
   "score": 7,
   "id": "dg3uk8i",
   "pid": "t1_dg2rz8q",
   "date": "2017-04-10 21:22:15",
   "depth": 2,
   "text": "***[Orange Intensifies]***"
  },
  {
   "score": 10,
   "id": "dg35plx",
   "pid": "t1_dg2rz8q",
   "date": "2017-04-10 12:50:03",
   "depth": 2,
   "text": "Code Geass R3 isn't out yet."
  },
  {
   "score": 25,
   "id": "dg2sgy9",
   "pid": "t1_dg2rz8q",
   "date": "2017-04-10 08:56:43",
   "depth": 2,
   "text": "Probably because Zero looks a fair bit like Emilia."
  },
  {
   "score": 55,
   "id": "dg2s9a2",
   "pid": "t1_dg2rz8q",
   "date": "2017-04-10 08:52:50",
   "depth": 2,
   "text": "I want to see you in season 2."
  },
  {
   "score": 13,
   "id": "dg2tldu",
   "pid": "t1_dg2s9a2",
   "date": "2017-04-10 09:17:14",
   "depth": 3,
   "text": "but season 3 is coming out"
  },
  {
   "score": 125,
   "id": "dg2yktf",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:45:57",
   "depth": 0,
   "text": "When I went on reddit I saw this thread, didn't know the anime, watched the PV, thought it was a weird furry anime, watched ep 1, it is a weird furry anime. 8/10"
  },
  {
   "score": 8,
   "id": "dg34brp",
   "pid": "t1_dg2yktf",
   "date": "2017-04-10 12:26:04",
   "depth": 1,
   "text": "If you think about it, all anime is weird furry anime if you look at it hard enough."
  },
  {
   "score": 38,
   "id": "dg335e1",
   "pid": "t1_dg2yktf",
   "date": "2017-04-10 12:05:26",
   "depth": 1,
   "text": "I loved this first episode. Had a little action, funny moments, and actual explanations for the world and a little on how the magic works. I really like the characters too. The Mercenary is a big softie despite his gruff voice, and Zero is playful and fun.\n\nI had high hopes after reading the MAL description and seeing it was White Fox at the helm, and so far I'm quite please with it."
  },
  {
   "score": 7,
   "id": "dg33bzx",
   "pid": "t1_dg335e1",
   "date": "2017-04-10 12:08:42",
   "depth": 2,
   "text": "You're right, we already know quite a bit of history and what's happening. I didn't know about this anime until I saw it on reddit, I'm happy I saw it because it is indeed an interesting story."
  },
  {
   "score": 25,
   "id": "dg35zt7",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:54:52",
   "depth": 0,
   "text": "Hey, a high fantasy series that plays itself straight. Has an outcast protag teaming with a [*heretical* witch](http://i.imgur.com/mhLvhtU.png).  \nThey both have sad backstories but also play off each other well enough. There is thought put into the setting as well.  \nSeems like a solid action show, I'll keep watching it."
  },
  {
   "score": 13,
   "id": "dg4et08",
   "pid": "t1_dg35zt7",
   "date": "2017-04-11 08:28:30",
   "depth": 1,
   "text": "That slow-mo with the soup flipping in the air was hilarious xD, poor Zero and her soup."
  },
  {
   "score": 24,
   "id": "dg3l3gk",
   "pid": "t3_64k45v",
   "date": "2017-04-10 17:54:06",
   "depth": 0,
   "text": "[DO YOU WANT AIDS??!! CUZ THAT HOW YOU GET AIDS!!](http://imgur.com/gallery/fn7JcVZ)"
  },
  {
   "score": 1,
   "id": "dg79q6v",
   "pid": "t1_dg3l3gk",
   "date": "2017-04-13 00:08:16",
   "depth": 1,
   "text": "> ~~AIDS~~\n\nFIV"
  },
  {
   "score": 1,
   "id": "dg49fh6",
   "pid": "t1_dg3l3gk",
   "date": "2017-04-11 06:41:03",
   "depth": 1,
   "text": "As former lifeguard and frequent donor of blood, I thought this as well."
  },
  {
   "score": 12,
   "id": "dg4rzc6",
   "pid": "t1_dg3l3gk",
   "date": "2017-04-11 12:27:44",
   "depth": 1,
   "text": "AIDS only evolved to be human transmittable around the late 19th century. They're living in the [6th century](http://i.imgur.com/R2iWmon.jpg), so they should be safe from AIDS!\n\nStill not too healthy though."
  },
  {
   "score": 55,
   "id": "dg2y1sx",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:36:38",
   "depth": 0,
   "text": "Whoa, a fantasy world that actually explains how the magic works? I'm sold."
  },
  {
   "score": 43,
   "id": "dg30bsc",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:16:27",
   "depth": 0,
   "text": "So, the story revolves around a half-beast man, that gets asked to accompany a witch that goes by the name of \"Zero\", as a sort of, familiar, one could say...\n\nWhere have I heard this tagline before?"
  },
  {
   "score": 18,
   "id": "dg3575k",
   "pid": "t1_dg30bsc",
   "date": "2017-04-10 12:41:04",
   "depth": 1,
   "text": "You know this novel is like the spiritual successor to The Familiar of Zero right?  This was written shortly after the Author passed away to sort of fill the void left by Zero no Tsukaima ending.  Its widely speculated that [Zero](https://myanimelist.cdn-dena.com/images/manga/3/115585l.jpg) is an homage to [Louise the Zero](https://myanimelist.cdn-dena.com/images/manga/3/80001l.jpg)."
  },
  {
   "score": 3,
   "id": "dg4d83u",
   "pid": "t1_dg3575k",
   "date": "2017-04-11 07:58:53",
   "depth": 2,
   "text": "But thank god Zero doesn't act like Louise. "
  },
  {
   "score": 6,
   "id": "dg39687",
   "pid": "t1_dg3575k",
   "date": "2017-04-10 13:50:13",
   "depth": 2,
   "text": "Do you have a source on that? I've never heard of that before."
  },
  {
   "score": 1,
   "id": "dgwjb5r",
   "pid": "t1_dg39687",
   "date": "2017-04-29 02:56:57",
   "depth": 3,
   "text": "should be in the ln"
  },
  {
   "score": 23,
   "id": "dg35w7s",
   "pid": "t1_dg3575k",
   "date": "2017-04-10 12:53:10",
   "depth": 2,
   "text": "Wait, really? No joke?\n\nI found it humorous that this had so many similarities in the tag line, but isn't this a little too on the nose for an homage?\n\nAnyway, TIL."
  },
  {
   "score": -2,
   "id": "dg38u0k",
   "pid": "t1_dg35w7s",
   "date": "2017-04-10 13:44:16",
   "depth": 3,
   "text": "Well if you read up on the Author of Zero no Tsukaima, its a fairly tragic situation he was in and i know there were a lot of upset fans and what not, so it just feels like its probably the case since he had a huge following."
  },
  {
   "score": 2,
   "id": "dg39b8z",
   "pid": "t1_dg38u0k",
   "date": "2017-04-10 13:52:37",
   "depth": 4,
   "text": "I follow the light novel scene pretty heavily. I looked this up and could not find a source. Nothing on their twitters seem to imply the authors knew each other."
  },
  {
   "score": -2,
   "id": "dg3b7sp",
   "pid": "t1_dg39b8z",
   "date": "2017-04-10 14:27:32",
   "depth": 5,
   "text": "I mean i did say \"speculated\".  \n\nThere are a lot of elements that are similar to both series, and some very obvious.  It would be very closed minded to think that Zero no Tsukaima had 0 influence on Zero kara Hajimeru Mahou no Sho.  Which is why its speculation.  Yes there hasnt been any mention of the influence for the novel, but the fact that there isnt any info means its not impossible.  This is the only work by this author and he only started writing after the date of death.  Its just a lot of coincidences.  Which is why saying its like a spiritual successor feels right.  I mean how many other stories are there about a magician of zero?"
  },
  {
   "score": 3,
   "id": "dg3cjck",
   "pid": "t1_dg3b7sp",
   "date": "2017-04-10 14:53:06",
   "depth": 6,
   "text": "Also to add, in zero no tsukaima the girl's name isn't \"Zero\" it's Louise. It was called Zero's Familiar because of the type of magic she used. [Spoilers](/s \"Void magic\")\n\nAlso in Mahou no Sho [Spoilers](/s \"the reason she is called Zero is because she has a magic that can turn other people's magic null. \"Zeroing out their magic\". She also is the origin for the book she wrote. Almost like the origin mage. The name Zero makes sense given the above.\")\n\nIf you read what I typed above you'll see both author's choose the word \"Zero\" based on the story. I could not find anything that would imply Mahou no Sho is based off the other or is a \"spiritual succssor\". The reasons for using \"Zero\" are somewhat similar but not the same. Of course they're similar, they're using the same word/theme after all. Just because two authors use the same theme does not mean they are acknowledging each others work."
  },
  {
   "score": 5,
   "id": "dg3bh6n",
   "pid": "t1_dg3b7sp",
   "date": "2017-04-10 14:32:25",
   "depth": 6,
   "text": "If you actually read the story they are not similar at all. The only similarity is the girl is a mage and her name is zero. The character personalities are completely different. The plotlines are very different. I mean usually a \"spiritual successor\" feels similar, but these feel like completely different stories that just happen to have a magician named zero. If you follow the plot the name \"zero\" fits for a thematic/plot reason.\n\nThe way your original comment was worded \n\n>You know this novel is like the spiritual successor to The Familiar of Zero right?\n\nalmost implies that what you're saying is true. I really do not think it is. I don't know where you see the \"highly speculated\" because I read a lot of forums and never saw this discussed on the light novel reddits or the translation blog comments."
  },
  {
   "score": 0,
   "id": "dg3cjf2",
   "pid": "t1_dg3bh6n",
   "date": "2017-04-10 14:53:09",
   "depth": 7,
   "text": "The magic side of things is similar, the fantasy worlds are similar (both have magic and persecution, that power stuggle as well, and magical creatures created by the mages).  I know Zero and Louise are fairly different sides of the spectrum.  Zero is a grande mage of sorts, and Louise is a failure as a mage.  Personality wise they are different dere but are both quite snarky and playful.  Yes the plots are different but thats not unusual, even sequels to stories have different plots usually so that doesnt have any weight here.  I personally think they feel similar, you may not, but i always did, and i was a big fan of Zero no Tsukaima, having followed it until the authors death.  As far as speculation goes, reddit isnt the only source of discussion on the internet.  I myself have only been using it the past few years.  Before that it was surfing various web forums and review blogs and what not.  \n\nRegardless, i feel like there is a lot of the same feelings from both series, and in the past i had heard others mention it and note its similar feel as well.  So ive seen enough speculation to warrant agreeing with them and supporting the speculations.  I liked ZnT and i like Grimoir as well.  \n\n[](#whowouldathunkit)"
  },
  {
   "score": 3,
   "id": "dg3cp67",
   "pid": "t1_dg3cjf2",
   "date": "2017-04-10 14:56:14",
   "depth": 8,
   "text": "My other reply explains in more detail of why the name Zero shows up in both series. It's HIGHLY unlikely that this is the \"spiritual successor\" considering the author NEVER mentions it.\n\nYou can speculate all you want. But please don't try to pass it along as fact."
  },
  {
   "score": 15,
   "id": "dg3b5gw",
   "pid": "t1_dg35w7s",
   "date": "2017-04-10 14:26:21",
   "depth": 3,
   "text": "After reading the post King made I tried to look where the author talks about it. I could not find anything. He said it was \"widely speculated\". Because I read a lot and view the light novel community frequently and could not find anything that links the two series.\n\nAfter reading the light novel for both I could not find much similarity that would imply that Zero from Mahou no Sho is a homage to Zero no Tsukaima at all. The only similarity they share is a name (which fits thematically based on the story for Mahou no Sho). Their character personalities are very different.\n\nI don't know if I would trust MilleniumKing in regards to what he posted. It would be great if he could provide proof because it would be kind of cool but I HIGHLY doubt it."
  },
  {
   "score": 27,
   "id": "dg33nw4",
   "pid": "t1_dg30bsc",
   "date": "2017-04-10 12:14:29",
   "depth": 1,
   "text": "Surely not in \"Familiar of Zero\" no?"
  },
  {
   "score": 5,
   "id": "dg3dhsc",
   "pid": "t1_dg33nw4",
   "date": "2017-04-10 15:12:27",
   "depth": 2,
   "text": "woosh"
  },
  {
   "score": 159,
   "id": "dg2reu5",
   "pid": "t3_64k45v",
   "date": "2017-04-10 08:37:30",
   "depth": 0,
   "text": "And just like *Re:CREATORS*, a potential AOTS show is stuck behind the double paywall that is Amazon Anime Strike.\n\nWTF Amazon. \n\nHopefully the other sources can get it by tonight."
  },
  {
   "score": 1,
   "id": "dg3e88u",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 15:27:47",
   "depth": 1,
   "text": "Amazon just needs to fuck right off with this anime hosting shit."
  },
  {
   "score": 1,
   "id": "dg2tnv0",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 09:18:29",
   "depth": 1,
   "text": "wats the problem with amazon"
  },
  {
   "score": 12,
   "id": "dg2u49t",
   "pid": "t1_dg2tnv0",
   "date": "2017-04-10 09:26:32",
   "depth": 2,
   "text": "It's a monthly subscription on top of your Prime subscription for a library vastly smaller and with less depth than Crunchyroll, Funimation, Daisuke, etc. "
  },
  {
   "score": 1,
   "id": "dg3f2gw",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 15:45:27",
   "depth": 1,
   "text": "Yeah... since I subbed to Crunchy back in 2014 (and with Daisuki/Funimation/Crunchy sharing other shows), I've only had to resort to \"other sources\" for shows I wanted to check out for Amagi Brilliant Park, but even that one got licensed for streaming finally.\n\nHonestly, with how some shows from previous seasons were locked in Amazon Prime Video (which wasn't even available for Canada until a few months ago) and this new service requiring extra payment, I suspect that the market penetration of Grimoire of Zero and Saekano B is going to be horrible in the US and Canada."
  },
  {
   "score": 1,
   "id": "dg37171",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 13:12:53",
   "depth": 1,
   "text": "have prime, no way i am paying amazon more to watch this. high seas it is"
  },
  {
   "score": 1,
   "id": "dg2vq1w",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 09:55:25",
   "depth": 1,
   "text": "As someone who's most anticipated show is ID-0, trust me, it can be much worse."
  },
  {
   "score": 1,
   "id": "dg33l3t",
   "pid": "t1_dg2vq1w",
   "date": "2017-04-10 12:13:07",
   "depth": 2,
   "text": "Oh right... where the heck is that anime?"
  },
  {
   "score": 1,
   "id": "dg36zxv",
   "pid": "t1_dg33l3t",
   "date": "2017-04-10 13:12:17",
   "depth": 3,
   "text": "Netflix exclusive.  They only release in a batch at the end of the season."
  },
  {
   "score": 1,
   "id": "dg39g03",
   "pid": "t1_dg36zxv",
   "date": "2017-04-10 13:54:50",
   "depth": 4,
   "text": "At that point you might as well string together 4 episodes and release them as shorter movies instead lol. "
  },
  {
   "score": 21,
   "id": "dg2suf3",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 09:03:33",
   "depth": 1,
   "text": "Why not just do it like literally 90% of Western viewership and pirate it instead?"
  },
  {
   "score": 29,
   "id": "dg2thoo",
   "pid": "t1_dg2suf3",
   "date": "2017-04-10 09:15:24",
   "depth": 2,
   "text": "> Hopefully the other sources can get it by tonight.\n\nBy other sources he meant pirating."
  },
  {
   "score": 7,
   "id": "dg2u1hv",
   "pid": "t1_dg2thoo",
   "date": "2017-04-10 09:25:10",
   "depth": 3,
   "text": "Was pretty much directed at all the people complaining about Strike tho. Who even cares if you get it 5 or even 20 hours late."
  },
  {
   "score": 10,
   "id": "dg2v1ca",
   "pid": "t1_dg2u1hv",
   "date": "2017-04-10 09:43:00",
   "depth": 4,
   "text": "It ruins the opportunity to discuss the show at the same time. Kinda like the double discussion thread for Gi(a)rlish Number last season.\n\nI mean, 5 hours is fine (though that may depend on your timezone), 20 is not cool."
  },
  {
   "score": 2,
   "id": "dg33jqk",
   "pid": "t1_dg2v1ca",
   "date": "2017-04-10 12:12:25",
   "depth": 5,
   "text": "sounds more like some people need to learn some patience."
  },
  {
   "score": 11,
   "id": "dg2w4xj",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 10:02:52",
   "depth": 1,
   "text": "or just use a illegal anime source. easy peazy"
  },
  {
   "score": 9,
   "id": "dg32z6q",
   "pid": "t1_dg2w4xj",
   "date": "2017-04-10 12:02:23",
   "depth": 2,
   "text": "Honestly, I* really don't mind watching an anime 12+ hours after everyone else if it means I don't have to jump through paywall hoops. Small price to pay for sailing the high seas. "
  },
  {
   "score": 16,
   "id": "dg33pi4",
   "pid": "t1_dg2w4xj",
   "date": "2017-04-10 12:15:18",
   "depth": 2,
   "text": "Normally, I'm against pirating.  But when companies pull bullshit like this, I figure it's fair game."
  },
  {
   "score": 1,
   "id": "dg4bi1l",
   "pid": "t1_dg33pi4",
   "date": "2017-04-11 07:25:20",
   "depth": 3,
   "text": "AYy, join the dark side!"
  },
  {
   "score": 12,
   "id": "dg2rp0c",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 08:42:40",
   "depth": 1,
   "text": "Re:CREATORS took seven hours. I'd be fine with it if someone just recorded their screen and uploaded that."
  },
  {
   "score": 20,
   "id": "dg2suek",
   "pid": "t1_dg2rp0c",
   "date": "2017-04-10 09:03:33",
   "depth": 2,
   "text": "> I'd be fine with it if someone just recorded their screen and uploaded that.\n\nThat's literally what some people did for Re:Creators."
  },
  {
   "score": 1,
   "id": "dg3959d",
   "pid": "t1_dg2suek",
   "date": "2017-04-10 13:49:45",
   "depth": 3,
   "text": "You mean Saekano? There's a \"rip\" for Saekano that's just a screen recording. The Re:Creators release on a certain site isn't a screen recording as per the description of said release."
  },
  {
   "score": 2,
   "id": "dg3lv3m",
   "pid": "t1_dg3959d",
   "date": "2017-04-10 18:10:32",
   "depth": 4,
   "text": "Wasn't talking about that release, just in general someone from one of the chat rooms I frequent screen recorded it to share around. "
  },
  {
   "score": 2,
   "id": "dg2u392",
   "pid": "t1_dg2suek",
   "date": "2017-04-10 09:26:01",
   "depth": 3,
   "text": "I'm surprised it took that long just to do that."
  },
  {
   "score": 4,
   "id": "dg3bfpv",
   "pid": "t1_dg2u392",
   "date": "2017-04-10 14:31:37",
   "depth": 4,
   "text": "Anime rips tend to be a bit fanatical when it comes to quality and uploading/encodes "
  },
  {
   "score": 1,
   "id": "dg3fy6a",
   "pid": "t1_dg3bfpv",
   "date": "2017-04-10 16:04:16",
   "depth": 5,
   "text": "I'd be okay with a lower quality rip early on and then a better one later."
  },
  {
   "score": 28,
   "id": "dg2rwam",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 08:46:21",
   "depth": 1,
   "text": "A bit early to be calling AOTS contenders, don't you think?"
  },
  {
   "score": 1,
   "id": "dg3xglp",
   "pid": "t1_dg2rwam",
   "date": "2017-04-10 22:51:59",
   "depth": 2,
   "text": "The novel win an award, it should be at least aots if the they make a perfect adaptation. "
  },
  {
   "score": 1,
   "id": "dg396rc",
   "pid": "t1_dg2rwam",
   "date": "2017-04-10 13:50:29",
   "depth": 2,
   "text": "Yes, that said I pretty much knew what my AOTS was last season at week 1, and it never even got close after that."
  },
  {
   "score": 33,
   "id": "dg2svj8",
   "pid": "t1_dg2rwam",
   "date": "2017-04-10 09:04:06",
   "depth": 2,
   "text": "Normally I would say yes, but so many first episodes have been absolute trash that it's pretty easy to sift out the contenders at this point."
  },
  {
   "score": 3,
   "id": "dg3ovzy",
   "pid": "t1_dg2svj8",
   "date": "2017-04-10 19:11:56",
   "depth": 3,
   "text": "You cannot discount a show for its first episode imo."
  },
  {
   "score": 2,
   "id": "dg3yqks",
   "pid": "t1_dg3ovzy",
   "date": "2017-04-10 23:41:34",
   "depth": 4,
   "text": "Tell that to digibro. (I agree with you though)"
  },
  {
   "score": 3,
   "id": "dg39bfx",
   "pid": "t1_dg2svj8",
   "date": "2017-04-10 13:52:42",
   "depth": 3,
   "text": "Plenty of shows grows into something amazing as the shows goes on though, there is at least one of those every season. "
  },
  {
   "score": 2,
   "id": "dg3e810",
   "pid": "t1_dg39bfx",
   "date": "2017-04-10 15:27:38",
   "depth": 4,
   "text": "That's true, but I'd be literally flabbergasted if Eromanga Sensei, Clockwork Planet, or Frame Arms Girl could be turned around into something I actually liked."
  },
  {
   "score": 53,
   "id": "dg2t6oh",
   "pid": "t1_dg2svj8",
   "date": "2017-04-10 09:09:44",
   "depth": 3,
   "text": ">first episodes \n\nMaybe wait for more than one episode :\\^)\n\n"
  },
  {
   "score": 24,
   "id": "dg2yn74",
   "pid": "t1_dg2t6oh",
   "date": "2017-04-10 10:47:05",
   "depth": 4,
   "text": "Depends on the type of show.  Some shows you need to give time to set up, others you know right from the start how they'll be, for good or bad.  Take Gabriel Dropout from last season for example.  I greatly enjoyed that show, but from episode 1 I knew exactly what all 12 eps were going to be like, and they were.  That was fine, because I liked ep 1 so I wanted more.  If you didn't like ep 1 though, it wasn't going to change."
  },
  {
   "score": 53,
   "id": "dg3ah6q",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 14:13:33",
   "depth": 1,
   "text": "> a potential AOTS\n\nYou guys remember Kabaneri don't you?\n\n[](#happysaitama)\n\n"
  },
  {
   "score": -1,
   "id": "dg3i49l",
   "pid": "t1_dg3ah6q",
   "date": "2017-04-10 16:52:11",
   "depth": 2,
   "text": "Kabaneri was shit from the start though."
  },
  {
   "score": 3,
   "id": "dg3bchi",
   "pid": "t1_dg3ah6q",
   "date": "2017-04-10 14:29:56",
   "depth": 2,
   "text": "Kabaneri wasn't backed by a stellar source material though "
  },
  {
   "score": 18,
   "id": "dg3csab",
   "pid": "t1_dg3bchi",
   "date": "2017-04-10 14:57:55",
   "depth": 3,
   "text": "Any source can be stellar, but it's worth a bucket of piss if it's a poor adaptation due to direction deficiencies or poor writting.\n\nMost of the time I don't give a shit about the source, and I think best works come from anime original like Flip Flappers or Shirobako.\n\nAll I'm saying it's too soon to call AOTS with only one episode when it can go downhill after a few episodes."
  },
  {
   "score": 1,
   "id": "dg3eam5",
   "pid": "t1_dg3csab",
   "date": "2017-04-10 15:29:09",
   "depth": 4,
   "text": "Most of the time when i see an anime thats being adaptated from a novel/videogame/manga i just straigh up stop watching the anime and i go to read or play the source material since adaptations in general tend to fuckin rip apart the original works"
  },
  {
   "score": 7,
   "id": "dg3gpo1",
   "pid": "t1_dg3eam5",
   "date": "2017-04-10 16:20:57",
   "depth": 5,
   "text": "I plow through the anime first, and THEN read the source material, if only to find out that it is better. Also, I can use the anime's VAs as inner narrators for the dialogues"
  },
  {
   "score": 0,
   "id": "dg3gygq",
   "pid": "t1_dg3gpo1",
   "date": "2017-04-10 16:26:22",
   "depth": 6,
   "text": "Thats actually a good idea"
  },
  {
   "score": 2,
   "id": "dg3gy6m",
   "pid": "t1_dg3gpo1",
   "date": "2017-04-10 16:26:12",
   "depth": 6,
   "text": "Thats actually a good idea"
  },
  {
   "score": 29,
   "id": "dg3kjf9",
   "pid": "t1_dg3ah6q",
   "date": "2017-04-10 17:42:29",
   "depth": 2,
   "text": "First 3 episodes though... That was some really good stuff."
  },
  {
   "score": 2,
   "id": "dg4hroc",
   "pid": "t1_dg3kjf9",
   "date": "2017-04-11 09:22:56",
   "depth": 3,
   "text": "Back when it was just a balls-to-the-wall zombie slayer anime. Then it disappeared up its own ass."
  },
  {
   "score": 10,
   "id": "dg41xae",
   "pid": "t1_dg3kjf9",
   "date": "2017-04-11 02:14:37",
   "depth": 3,
   "text": "I was so hyped for the premise      \nZombies - ok I guess     \nBut Steampunk Edo Era? I never knew I wanted this but its perfect      \nTo bad they messed up on the long run, why onii-san?    "
  },
  {
   "score": 29,
   "id": "dg2tvj6",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 09:22:16",
   "depth": 1,
   "text": "Wait, so first you need to subscribe to Amazon Prime (pricey) in order to get access to pay an additional subscription for their amazon section? You can't just pay the $5 a month for anime by itself? That's kinda fucked. "
  },
  {
   "score": 1,
   "id": "dg47m2d",
   "pid": "t1_dg2tvj6",
   "date": "2017-04-11 05:56:59",
   "depth": 2,
   "text": "And if it is anything like Amazon Prime Video it will force feed you advertisements before every episode."
  },
  {
   "score": 1,
   "id": "dg4pmo1",
   "pid": "t1_dg47m2d",
   "date": "2017-04-11 11:46:12",
   "depth": 3,
   "text": "No advertisements on iOS, PS4, or PC. I would assume none at all."
  },
  {
   "score": 15,
   "id": "dg3b2zr",
   "pid": "t1_dg2tvj6",
   "date": "2017-04-10 14:25:02",
   "depth": 2,
   "text": "Prime has already been a staple of my life with it's many other benefits, and adding a service to pay $5 a month for the five shows I'm watching on Amazon is of enough value to me to be worth it.\n\nMY problem is with the awful subtitles, they're terribly out of sync-- saekano, they were delayed by almost two seconds, and now, in this episode, they're almost two seconds too early. The only show that hasn't had a problem yet is Re:Creators.\nThey also LOOK bad. The custom subtitle presets don't help at all, and many of the apps I have (PS4, Android, Smart TV, Roku)straight up ignore any of the drop shadows and transparent boxes, leaving a solid color on a narrow drawn font that is very hard on the eyes to read. \n\nOh, it's worth mentioning that if you are a student, you can get Amazon Prime for $49"
  },
  {
   "score": 86,
   "id": "dg2ry8b",
   "pid": "t1_dg2reu5",
   "date": "2017-04-10 08:47:20",
   "depth": 1,
   "text": "Ya know, I already have Prime, and with the amount of quality shows Anime Strike has this season I'd probably subscribe to it for a month or two, at least until the season ends. \n\nBut oh look, Amazon apparently doesn't want my money because I'm in the UK. Oh well. "
  },
  {
   "score": 2,
   "id": "dg2yec6",
   "pid": "t1_dg2ry8b",
   "date": "2017-04-10 10:42:47",
   "depth": 2,
   "text": "At that point it's time to sail the seven sea's my friend!"
  },
  {
   "score": 17,
   "id": "dg2srks",
   "pid": "t1_dg2ry8b",
   "date": "2017-04-10 09:02:03",
   "depth": 2,
   "text": "I wonder why we get series like Saekano in the UK, but none of the others. I'd be happy to pay monthly, if they gave us the option to actually pay for Anime Strike."
  },
  {
   "score": 2,
   "id": "dg320ji",
   "pid": "t1_dg2srks",
   "date": "2017-04-10 11:45:43",
   "depth": 3,
   "text": "We only get seem to get Amazon shows that aren't licensed by Sentai Filmworks."
  },
  {
   "score": 16,
   "id": "dg2tal1",
   "pid": "t1_dg2srks",
   "date": "2017-04-10 09:11:46",
   "depth": 3,
   "text": "Because Amazon has the streaming rights for Saekano S2 and Shingeki no Bahamut: Virgin Soul, and Sentai has the license for the other shows, and it seems like Sentai wants it to be US only."
  },
  {
   "score": 1,
   "id": "dg3otin",
   "pid": "t1_dg2tal1",
   "date": "2017-04-10 19:10:33",
   "depth": 4,
   "text": "So could crunchy licence it for us other countries? Pls"
  },
  {
   "score": 1,
   "id": "dg3l7cp",
   "pid": "t1_dg2tal1",
   "date": "2017-04-10 17:56:26",
   "depth": 4,
   "text": "> and it seems like Sentai wants it to be US only.\n\nIs this something they normally do or ??"
  },
  {
   "score": 1,
   "id": "dg3oi0o",
   "pid": "t1_dg3l7cp",
   "date": "2017-04-10 19:04:46",
   "depth": 5,
   "text": "They may also only have limited funds which need to be allocated amongst all their shows. They may want to branch out but without the money doing so is risky. "
  },
  {
   "score": 1,
   "id": "dg3q9wg",
   "pid": "t1_dg3oi0o",
   "date": "2017-04-10 19:40:03",
   "depth": 6,
   "text": "To be clear here, Sentai is what exactly?"
  },
  {
   "score": 3,
   "id": "dg528p9",
   "pid": "t1_dg3q9wg",
   "date": "2017-04-11 15:48:26",
   "depth": 7,
   "text": "A distribution company, they license shows so they can sell DVDs / Blu Rays in the west and provide the show to a streaming service. "
  },
  {
   "score": 2,
   "id": "dg5bzgn",
   "pid": "t1_dg528p9",
   "date": "2017-04-11 19:23:59",
   "depth": 8,
   "text": "Gotcha, and this time they only purchased the US distribution rights I assume because they figured the UK rights were not worth obtaining. Thanks."
  },
  {
   "score": 11,
   "id": "dg2wav2",
   "pid": "t1_dg2ry8b",
   "date": "2017-04-10 10:05:53",
   "depth": 2,
   "text": "What happened to Amazon? They're usually very good at making money. The way they've handled this anime thing is a major failure IMO compared to other Amazon projects"
  },
  {
   "score": 1,
   "id": "dg3un29",
   "pid": "t1_dg2wav2",
   "date": "2017-04-10 21:24:25",
   "depth": 3,
   "text": "It's early days my friend. Doesn't stop us (shouldn't stop us rather) from bitching about the issues, but the \"workin on it\" excuse works still for now."
  },
  {
   "score": 1,
   "id": "dg399aq",
   "pid": "t1_dg2wav2",
   "date": "2017-04-10 13:51:41",
   "depth": 3,
   "text": "I would have assumed they would have just done it via twitch, it is already the premier streaming service so why not build on it? "
  },
  {
   "score": 1,
   "id": "dg3fgcn",
   "pid": "t1_dg399aq",
   "date": "2017-04-10 15:53:34",
   "depth": 4,
   "text": "That would be interesting, integrating their Prime video library with Twitch. It'd be like Justin.tv again."
  },
  {
   "score": 19,
   "id": "dg2xcew",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:24:13",
   "depth": 0,
   "text": "I really liked that. Zero and Mercenary seem like a lot of fun together, and the world is interesting enough.\n\nAlso had  no idea how much I wanted to see a [tiger blush](http://i.imgur.com/EDKzUCZ.png) until right now!"
  },
  {
   "score": 20,
   "id": "dg34vmj",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:35:34",
   "depth": 0,
   "text": "I don't know if this will interest anybody but that my poor latin skills are telling me that the subbed text is way wrong.\nIt should be something like: \n\n*Vocare vester quo video omnis visis causam ego dicam maior eum audi qui habitetis ignem carae rex fiat*\n\nor: I, *your god**, call you to visit me and do my bidding. Fire king.\n\nAt least that's what I'm getting from using [this](http://latindictionary.wikidot.com/index) and remembering how latin much of a mess latin sentence structure is....\n\n*not sure about this part, but \"video omnis\" roughly translates too \"all seeing\" so I'm assuming."
  },
  {
   "score": 1,
   "id": "dg3ll3z",
   "pid": "t1_dg34vmj",
   "date": "2017-04-10 18:04:40",
   "depth": 1,
   "text": "Google Translate says:\n\n* \"I will say this I see that the whole is greater than the sight of your God, I will call them, Hear, those who will live in the fire, the cause may be the king of the feast of Dear\""
  },
  {
   "score": 9,
   "id": "dg3eoqc",
   "pid": "t1_dg34vmj",
   "date": "2017-04-10 15:37:24",
   "depth": 1,
   "text": "It's pretty meaningless if you attempt to translate it correctly, and given the awful grammar (Each sentence seems to have at least two subjects for a start), there are multiple potential meaningless translation (also I think it really is \"habitent in\"):\n\n\"To call your(plural), for whom(singular) I see the reason of everything seen, I, who am more, speak him. Listen, they who would live into fire, the king of [carorae???? could be \"caro\" but then what's the \"rae\"?] becomes.\"\n\n\"video\" is a verb, so it can't mean 'all seeing' unless it was a participle. I think they were going for 'all seeing' with \"omnis visis\", but really it can only mean 'all seen'."
  },
  {
   "score": 2,
   "id": "dgdr6j5",
   "pid": "t1_dg3eoqc",
   "date": "2017-04-17 09:58:20",
   "depth": 2,
   "text": "What if latin is the language of demons and witches really suck at speaking it?"
  },
  {
   "score": 15,
   "id": "dg42s01",
   "pid": "t3_64k45v",
   "date": "2017-04-11 02:59:44",
   "depth": 0,
   "text": "http://i.imgur.com/Wa201UT.png\n\n\noh.You should understand Japanese culture and language.\n\n\n\"Zero kara Hajimeru Nihonshi(2004)\"\n\n\n\"Zero kara Hajimeru Francego(2000)\"\n\n\n\"Zero kara Hajimeru Full Marathon no Hon(2008)\"\n"
  },
  {
   "score": 5,
   "id": "dg57gbt",
   "pid": "t1_dg42s01",
   "date": "2017-04-11 17:44:39",
   "depth": 1,
   "text": "So this anime's English title should really be \"Magic for Dummies\"\n\nand Re:Zero should be \"Cliched Fantasy Setting for Dummies\""
  },
  {
   "score": 2,
   "id": "dg7nl34",
   "pid": "t1_dg57gbt",
   "date": "2017-04-13 07:55:13",
   "depth": 2,
   "text": "Re:Cliched Fantasy Setting for Dummies"
  },
  {
   "score": 14,
   "id": "dg3cvxo",
   "pid": "t3_64k45v",
   "date": "2017-04-10 14:59:56",
   "depth": 0,
   "text": "This is not the Spice and Wolf S3 I asked for"
  },
  {
   "score": 22,
   "id": "dg3079i",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:14:14",
   "depth": 0,
   "text": "I was expecting a tracksuit"
  },
  {
   "score": 19,
   "id": "dg33fsm",
   "pid": "t1_dg3079i",
   "date": "2017-04-10 12:10:31",
   "depth": 1,
   "text": "I could get behind a jacked khajiit in a tracksuit as a protagonist!"
  },
  {
   "score": 11,
   "id": "dg386qv",
   "pid": "t1_dg33fsm",
   "date": "2017-04-10 13:32:53",
   "depth": 2,
   "text": "Khajiit has wares while doing squats "
  },
  {
   "score": 20,
   "id": "dg33vzy",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:18:32",
   "depth": 0,
   "text": "Wow this new season of Berserk took a strange turn! Still surprised that they went with 2D....\n\n\nWait."
  },
  {
   "score": 2,
   "id": "dg3bi1j",
   "pid": "t1_dg33vzy",
   "date": "2017-04-10 14:32:51",
   "depth": 1,
   "text": "An improvement for sure.\n\nNow we just need to wait for the *actual* Berserk anime. "
  },
  {
   "score": 2,
   "id": "dg3jlso",
   "pid": "t1_dg33vzy",
   "date": "2017-04-10 17:23:07",
   "depth": 1,
   "text": "a surprise for sure.....but a welcome one"
  },
  {
   "score": 29,
   "id": "dg308a8",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:14:45",
   "depth": 0,
   "text": "Huh we got ourselves a MC whose main weapon happens to be basically a giant hunk of metal. *Wonder what the influence is from*.\n\nZero is quite the interesting character. She's rather straightforward and her interactions with Mercenary were quite engaging.\n\nI do like how the show is differentiating sorcery and magic and the exposition didn't feel immersion breaking for me. I'm interested to see where this show goes.\n\nBut man Anime Strike is definitely making these threads just wack since most of us don't have access to it.\n\n"
  },
  {
   "score": 8,
   "id": "dg3o0i1",
   "pid": "t1_dg308a8",
   "date": "2017-04-10 18:54:58",
   "depth": 1,
   "text": "What is someone of that size supposed to use? A fucking teaspoon? His thumb is twice as big as Zero's entire hand. So go swing a toothpick around and see how that works out.  I imagine he doesn't have his own blacksmith. "
  },
  {
   "score": 41,
   "id": "dg34u4c",
   "pid": "t1_dg308a8",
   "date": "2017-04-10 12:34:50",
   "depth": 1,
   "text": "> Huh we got ourselves a MC whose main weapon happens to be basically a giant hunk of metal. Wonder what the influence is from.  \n\nWhen you are strong, the most effective weapon is something big and heavy to crush your opponents.  Mass > Sharpness  \n\nGuts also wasnt the first greatsword wielding mercenary, hes actually a reference to Fist of the North Stars characters."
  },
  {
   "score": 48,
   "id": "dg385c1",
   "pid": "t1_dg34u4c",
   "date": "2017-04-10 13:32:10",
   "depth": 2,
   "text": "I never understood why stupidly oversized hunks of metal are automatically Guts territory \n\nIt's been a RPG/fantasy staple since forever\n\nNot to mention that IRL greatswords are reliant on swinging a piece of metal at someone as their core design "
  },
  {
   "score": 1,
   "id": "dg3zjs0",
   "pid": "t1_dg385c1",
   "date": "2017-04-11 00:16:36",
   "depth": 3,
   "text": "Not that i'm the rpg/fantasy expert, but considering that berserk is just a little old, why not?"
  },
  {
   "score": 1,
   "id": "dg3z2e5",
   "pid": "t1_dg385c1",
   "date": "2017-04-10 23:55:17",
   "depth": 3,
   "text": "Cloud > Guts."
  },
  {
   "score": 1,
   "id": "dg3mkl1",
   "pid": "t1_dg385c1",
   "date": "2017-04-10 18:25:37",
   "depth": 3,
   "text": ">I never understood why stupidly oversized hunks of metal are automatically Guts territory \n\nwould've been Cloud but that's out of my system. Monster Hunter though..."
  },
  {
   "score": 18,
   "id": "dg3hh78",
   "pid": "t1_dg385c1",
   "date": "2017-04-10 16:37:56",
   "depth": 3,
   "text": "Most greatswords and claymores are actually quite light comparative to what you'd imagine.\n\nA closer representation would be a great axe, or great hammer, but even those have wooden handles to minimize weight and a sharpened or condensed end to create a more focused point of damage.\n\nA large blunt object is a poor weapon, a greatclub is not all that effective comparatively to any other large weapon, making it heavier by being made of metal just makes it worse.\n\nEven with immense strength you could use that strength to swing a different weapon with much more speed and lethality."
  },
  {
   "score": 5,
   "id": "dg3tom8",
   "pid": "t1_dg3hh78",
   "date": "2017-04-10 20:58:37",
   "depth": 4,
   "text": "2/3kg is still quite heavy for something to be swinging around all day\n\nLong swords were only about 1 to 1.1kg \n\nIf Guts were a real person he would be swinging something around about the 3kg mark and not the highly exaggerated weights in berserk\n\nAlso I have no idea why you think blunt weapons were ineffective, They were extremely effective against light and heavily armoured units simply by the nature of applying large amounts of force in a single area of their armour, Often causing internal damage \n\nCausing structural damage to someones armour had larger kill potential than to sit hacking at it all day as it restricted mobility  \n\n"
  },
  {
   "score": 5,
   "id": "dg41hln",
   "pid": "t1_dg3tom8",
   "date": "2017-04-11 01:51:57",
   "depth": 5,
   "text": "> in a single area of their armour\n\nThat's the key right there, clubs and large blunt objects really didn't do as much against plate mail with padding as the force is distributed over the entire width of the object, and they'd be too unwieldy to use on anything else really.  The blunt objects you speak of that damage armor structure are mauls and hammers, the weight is concentrated to a small point and they use a wooden handle so the speed can be higher and overall momentum can cause indents/gashes in the armor.\n\n"
  },
  {
   "score": 7,
   "id": "dg36on8",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:06:43",
   "depth": 0,
   "text": "Oye! This feels like a what-if Re:Zero spinoff of loli Emilia with Anastasia's beast-warrior mercenaries."
  },
  {
   "score": 3,
   "id": "dg4ez2z",
   "pid": "t1_dg36on8",
   "date": "2017-04-11 08:31:40",
   "depth": 1,
   "text": "Or a prequel following Satella creating the new magic. \n\nThat's my head canon, at least until it no longer fits together. "
  },
  {
   "score": 25,
   "id": "dg2ypid",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:48:14",
   "depth": 0,
   "text": "So this is the true sequel of **Kemono Friends**?\n\nOk, lets do a quick summary.\n\n*Sorcery\n\n*Race segregation\n\n*Witch Hunting\n\n*Swordplay\n\n*Mercenaries\n\n*Bit of tsundere lead\n\n*Dark past\n\n[**Where do I fucking sign?**](#edneedsdis)\n\nZero is such a darn cutie, and our mercenary is quite an interesting hero type. Wish he was a bit more receptive rather than the typical \"blushfest\" for almost everything, but looking at the ED seems he will open up eventually.\n\nI wonder how the boy mage will play out in this journey.\n\nShould I play Captain obvious and state how beautiful and moody the instrumental score in this series is?\n\nI had no expectations on this based I didn't even finish watching the PV. But this first episode sure gave me a pleasant surprise. I'll be keeping my eye on this one.\n\n"
  },
  {
   "score": 6,
   "id": "dg2zbgv",
   "pid": "t1_dg2ypid",
   "date": "2017-04-10 10:58:57",
   "depth": 1,
   "text": "> Wish he was a bit more receptive rather than the typical \"blushfest\" for almost everything\n\nI KNOW RIGHT\n\nHe's looks like a badass mercenary, sounds like an old man and then there's that. Disappointed me a little bit. "
  },
  {
   "score": 11,
   "id": "dg339t9",
   "pid": "t1_dg2ypid",
   "date": "2017-04-10 12:07:37",
   "depth": 1,
   "text": "I don't think The Mercenary is very old. From what I can gather he earned that nickname the old man mentioned after messing up those guys that were harassing his mom, and then I assume he left and became a mercenary. Based on how he acts and that, I think he might actually be in his teens and not older as his voice and appearance seem."
  },
  {
   "score": 71,
   "id": "dg33xhn",
   "pid": "t1_dg2ypid",
   "date": "2017-04-10 12:19:14",
   "depth": 1,
   "text": "> Where do I fucking sign?\n\n[Here](http://i.imgur.com/0FpmShk.jpg)"
  },
  {
   "score": 42,
   "id": "dg35yuo",
   "pid": "t1_dg33xhn",
   "date": "2017-04-10 12:54:25",
   "depth": 2,
   "text": "http://puu.sh/vfXC7/dd8472efac.jpg"
  },
  {
   "score": 20,
   "id": "dg39w6h",
   "pid": "t1_dg35yuo",
   "date": "2017-04-10 14:02:48",
   "depth": 3,
   "text": "ERIS PADS HER CHEST!!!"
  },
  {
   "score": 11,
   "id": "dg3hz21",
   "pid": "t1_dg39w6h",
   "date": "2017-04-10 16:49:00",
   "depth": 4,
   "text": "[deleted]"
  },
  {
   "score": 1,
   "id": "dg4efy9",
   "pid": "t1_dg3hz21",
   "date": "2017-04-11 08:21:55",
   "depth": 5,
   "text": "More than a handful is a waste anyway. "
  },
  {
   "score": 3,
   "id": "dg48brq",
   "pid": "t1_dg3hz21",
   "date": "2017-04-11 06:15:27",
   "depth": 5,
   "text": "Me neither.\n\nPraise Eris, the Goddess of Justice."
  },
  {
   "score": 7,
   "id": "dg2vaj3",
   "pid": "t3_64k45v",
   "date": "2017-04-10 09:47:43",
   "depth": 0,
   "text": "Yeah, it got licensed in my country, won't have to wait for rip"
  },
  {
   "score": 5,
   "id": "dg2wkpv",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:10:49",
   "depth": 0,
   "text": "Pretty solid ep overall, the world is relatively interesting and I hope to learn more about it's history and Zero is pretty fun. ED is quite nice too."
  },
  {
   "score": 8,
   "id": "dg30wix",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:26:32",
   "depth": 0,
   "text": "IT'S SO FLUFFY IM GONNA DIE"
  },
  {
   "score": 7,
   "id": "dg3236w",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:47:01",
   "depth": 0,
   "text": "\"They just think of us as inanimate objects.\nYou're the floor, and I'm a body pillow\"\nMade me laugh more than it should have."
  },
  {
   "score": 6,
   "id": "dg3495y",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:24:50",
   "depth": 0,
   "text": "#Hngggg~ This is amazing!  \n\nIve been waiting for this for a long time and seeing it finally here is just the best.  I love the characters and the setting and the visuals are gorgeous.  This really turned out great.  \n\nZero is snarky and hilarious, Mercenary is earnest and flashy, thier interactions are perfect and i just cant wait to see more.  Its also nice this series is fairly lengthy so plenty of material.  \n\n[**mfw Zero**](#feelsgoodman)"
  },
  {
   "score": 1,
   "id": "dg3jreq",
   "pid": "t1_dg3495y",
   "date": "2017-04-10 17:26:23",
   "depth": 1,
   "text": "your link is broken"
  },
  {
   "score": 1,
   "id": "dg4en97",
   "pid": "t1_dg3jreq",
   "date": "2017-04-11 08:25:36",
   "depth": 2,
   "text": "It's not a link, it's a comment face which requires subreddit CSS to be enabled. "
  },
  {
   "score": 2,
   "id": "dg34luj",
   "pid": "t1_dg3495y",
   "date": "2017-04-10 12:30:53",
   "depth": 1,
   "text": "I hadn't heard anything about it and just happened to check the MAL summary. Glad I did, because I think this is my favorite first episode of the season. I'm looking forward to it more than anything else now."
  },
  {
   "score": 1,
   "id": "dg35f69",
   "pid": "t1_dg34luj",
   "date": "2017-04-10 12:44:59",
   "depth": 2,
   "text": "Ive always known about this since i was a big fan of Zero no Tsukaima and this came out right after and had a similer world, but i really wanted to see it animated so i never read it, just waited for this day to come.  It should be pretty darn amnazing though."
  },
  {
   "score": 4,
   "id": "dg33do7",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:09:29",
   "depth": 0,
   "text": "They had me sold at the cute, cuddly plush man."
  },
  {
   "score": 1,
   "id": "dg3x4z4",
   "pid": "t1_dg33do7",
   "date": "2017-04-10 22:40:35",
   "depth": 1,
   "text": "Lifesize dakimakura comming to a store near you.... and if the other custom plush markets are any indication of price... this will be ~$5,000"
  },
  {
   "score": 4,
   "id": "dg3690d",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:59:13",
   "depth": 0,
   "text": "Zero's reaction after being thrown of her furry pillow was like me every Monday morning"
  },
  {
   "score": 6,
   "id": "dg3jb5s",
   "pid": "t3_64k45v",
   "date": "2017-04-10 17:16:58",
   "depth": 0,
   "text": "This show is a very strong and promising start for an adventure anime. There's not many out there that actually go in an adventure in the world they take place in, I imagine due to the cost of all the different backgrounds. The last one I remember doing so was Chaika and while I enjoyed that a lot, I hope this anime doesn't go down the same road as Season 2 did.\n\nThere's a lot of showing versus telling in this show so far, as well, which is already  the mark of better storytelling than you typically get from an anime, so I'm down to continue watching this as it grows through the story. Hopefully it stays on track\n\nZero is a fun character. Super powerful is fine if you can only beat one or two powerful people alone, because once more numbers, even weak ones, start coming up (as I can only imagine will happen in the series), the Mercenary is going to prove his worth as a companion.\n\nTheir characterization is also pretty well done. I like how Mercenary isn't all up for joining up immediately, but instead is as wary as his history would imply. Only the goodness inside of him keeps him from abandoning her in the woods, which is a good character feature in the tank of the series.\n\nThat they take the time to make sure the minutia of life in this medieval-style world is shown in some regard also speaks to a good understanding of how to build up a world to be believable within the rules stated as the series sets itself up. Similar to this, the difference between magic and sorcery is also interesting and reminds me of the way D&D tackles the different magic, though it's more warlock and Wizard than Sorcerer and Witch that this anime describes the difference as.\n\nAll told, I'm excited for the future of this series, and this along with Re:Creators bodes well for this season of anime even setting aside the popular anime like AoT and BnHA."
  },
  {
   "score": 14,
   "id": "dg36bz3",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:00:38",
   "depth": 0,
   "text": "Oh man, humans are after me. I want to dispel the notions that beastfallen are threats to society so I can live a peaceful life and I'll do that by running away instead.\n\nlol JK, I just popped one guy's head like a cherry and buried a dagger in the skull of another.\n\nI'm also a dedicated witch hunter, hate them with all of my being, and will attack on sight as a mercenary of great skill, but I'm running like a bitch from some amateur magician kid that aims like he's playing a shooter on a console, and also I get completely mentally disarmed by a harmless little witch girl. I want to live in peace with humans, but I casually killed at least two of them, and I want to kill all witches, but I can't simply step on the head of this passed out one and actually have some resolve for once this episode.\n\nAlso, I'm a significantly older giant beast of a man and am acting like a sexually frustrated tsundere with this little girl.\n\nShe also makes an entirely coincidental callback to an exact thing my mother said a long time ago. As well, she's ostensibly this incredibly powerful witch yet somehow needs a whole day to make a single bowl of soup.\n\nTo top everything off, 24 hours ago I was a badass witch hunting mercenary that killed easily and would show no mercy to the witches I hate with every fiber of my being, and now I'm probably going to be chaperoning the adventures of two childish witches, one of which I probably want to bone and of which depictions probably already exist on the internet of me doing.\n\n***\n\nwtf is this show"
  },
  {
   "score": 1,
   "id": "dg3r3l2",
   "pid": "t1_dg36bz3",
   "date": "2017-04-10 19:57:21",
   "depth": 1,
   "text": "[spoilers](/s \"The beastfallen were all made by witches to be their servants, because of that the magic that makes him the way he is also makes it so he is instinctively protective and subservient to witches\")"
  },
  {
   "score": 2,
   "id": "dg4hsoo",
   "pid": "t1_dg36bz3",
   "date": "2017-04-11 09:23:25",
   "depth": 1,
   "text": ">Oh man, humans are after me. I want to dispel the notions that beastfallen are threats to society so I can live a peaceful life and I'll do that by running away instead.\n\nI didn't particularly like the episode, but can you really fault a mercenary for defending himself? It's not like he went out of his way to kill the guys in the beginning. He left most of them alive. \n\nThe rest I agree with."
  },
  {
   "score": 15,
   "id": "dg3e1vq",
   "pid": "t1_dg36bz3",
   "date": "2017-04-10 15:24:04",
   "depth": 1,
   "text": "so... did you like it?"
  },
  {
   "score": 1,
   "id": "dg3rqg9",
   "pid": "t1_dg3e1vq",
   "date": "2017-04-10 20:11:26",
   "depth": 2,
   "text": "idk man. I give everything more than one episode after my Cross Ange experience, but things aren't looking good. The action scenes were good, the magic effect graphics well done, and a couple funny moments here and there, but that's about it. I got a feeling it's going to devolve into some generic fantasy loli pandering shit with a decent graphics budget siphoned from the writing team."
  },
  {
   "score": 5,
   "id": "dg3xq6h",
   "pid": "t1_dg3rqg9",
   "date": "2017-04-10 23:01:46",
   "depth": 3,
   "text": "If you worry about the writing, this novel win grand prize in Dengeki Novel Award in 2013. Spice and wolf won silver prize on 2005. Pretty sure its not a shit one. \n\n[wiki page of it](https://en.wikipedia.org/wiki/Dengeki_Novel_Prize#2008.E2.80.93present)   "
  },
  {
   "score": 1,
   "id": "dg3yh86",
   "pid": "t1_dg3xq6h",
   "date": "2017-04-10 23:30:49",
   "depth": 4,
   "text": "That's promising at least."
  },
  {
   "score": 1,
   "id": "dg3ybt4",
   "pid": "t1_dg3xq6h",
   "date": "2017-04-10 23:24:45",
   "depth": 4,
   "text": "Well, I guess I have another novel to add to my collection."
  },
  {
   "score": 4,
   "id": "dg3h8rw",
   "pid": "t1_dg3e1vq",
   "date": "2017-04-10 16:32:47",
   "depth": 2,
   "text": "> so... did you like it?\n\nI'm *assuming* -- based on how I have similarly negative (but not quite as sarcastic) thoughts about this anime -- that he/she did not like what was presented.\n\nCould be wrong, but that's the impression I got. :3"
  },
  {
   "score": 2,
   "id": "dg3hfoc",
   "pid": "t1_dg3h8rw",
   "date": "2017-04-10 16:37:00",
   "depth": 3,
   "text": "I was just teasing him. Anyway meh, is standart fantasy plot but im gonna give it the credit that is a lot more straight foward and simple in comparision with the mess of shows we have been seeing in the fantasy genre since 3-4 years ago. (Furries are gonna rejoice with the MC tho)"
  },
  {
   "score": 2,
   "id": "dg3nzew",
   "pid": "t1_dg3hfoc",
   "date": "2017-04-10 18:54:19",
   "depth": 4,
   "text": "> Anyway meh, is standart fantasy plot but im gonna give it the credit that is a lot more straight foward and simple in comparision with the mess of shows we have been seeing in the fantasy genre\n\nTrue, it's not going for anything convoluted in order to win over its audience with pizzazz. I can give it some credit for taking a more standard approach.\n\nThe anime is still very rough around the edges right now, though. There's obviously a lot of time left for the show to grow and improve, so I'm not going to be *too* harsh on it just yet. At the minimum, I enjoy these dichotomous relationships quite a bit, so I'm partially excited to see where theirs will head."
  },
  {
   "score": 4,
   "id": "dg32jll",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:54:54",
   "depth": 0,
   "text": "The comedy was on-point."
  },
  {
   "score": 4,
   "id": "dg3bazy",
   "pid": "t3_64k45v",
   "date": "2017-04-10 14:29:09",
   "depth": 0,
   "text": "With Zero's personality, I would not have been surprised if that blood contract had turned out to be a false motivator.  Like, Mercanary going through all hell to keep the terms of the contract and gets turned back into a human.  Then Zero nonchalatly saying blood contracts aren't actually real and she probably would have returned him to normal if he had pressed hard enough."
  },
  {
   "score": 11,
   "id": "dg2tmmz",
   "pid": "t3_64k45v",
   "date": "2017-04-10 09:17:53",
   "depth": 0,
   "text": "So I was actually willing to pay the stupidly expensive price for one month just to binge all of the quality anime they have. The Great Passage, Scum's Wish, Grimoire of Zero etc.\n\nSo I'm going through this whole ridiculous process, yes I'll have prime video, yes I'll have Amazon prime...  Wait aren't they the same thing? Turns out Anime Strike is US only. You've got to be joking.\n\nAt least AnimeLab have that time rest one that KanaHana is voicing. However there's no legal way for me to get that fortune teller anime or any of the others in Australia. So many good anime and I really don't want to pirate. Is there any legal way?\n\nI'm genuinely asking."
  },
  {
   "score": 1,
   "id": "dg4e39h",
   "pid": "t1_dg2tmmz",
   "date": "2017-04-11 08:15:22",
   "depth": 1,
   "text": "Nope, \"get fucked\", is what they are telling us. Path of least resistance is to just pirate or ignore that which can't be bought legally."
  },
  {
   "score": 5,
   "id": "dg2xp3z",
   "pid": "t1_dg2tmmz",
   "date": "2017-04-10 10:30:21",
   "depth": 1,
   "text": "I'd say make sure you tell Amazon's customer support; if enough people complain, it'll eventually be heard by management, right? "
  },
  {
   "score": 8,
   "id": "dg2xr8e",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:31:23",
   "depth": 0,
   "text": "That was actually not bad, despite my expectations. I expected this to be a pretty straightforward 'Transported to another world' story, but it actually was pretty nice. I like the setup of the protagonist being an outcast beast rather than a standard LN protagonist, and I'm glad he's not a kid/teen either. Both him and the Zero actually had some personality to them which was nice. So far the setup of the story and the world don't seem very unique or memorable, but the story setup seems better than most other fantasy adventures. Here's to hoping there's no romantic subplot between the protagonists, and that it's a story of comradery rather than romance. "
  },
  {
   "score": 1,
   "id": "dg45eck",
   "pid": "t1_dg2xr8e",
   "date": "2017-04-11 04:51:53",
   "depth": 1,
   "text": "> I expected this to be a pretty straightforward 'Transported to another world' story\n\n\nWas it the \"Zero kara Hajimeru\"? The summary mentions nothing about it being an isekai lol"
  },
  {
   "score": 16,
   "id": "dg33cf6",
   "pid": "t1_dg2xr8e",
   "date": "2017-04-10 12:08:53",
   "depth": 1,
   "text": "I genuinely think The Mercenary might be a teen, well, late teens at least. Maybe 17-19. Despite his looks and voice, he acts young and shy, and I don't think he's been a mercenary for very long since he left home in the flashback.\n\nI could be wrong though! Just the vibe I got."
  },
  {
   "score": 1,
   "id": "dg3y258",
   "pid": "t1_dg33cf6",
   "date": "2017-04-10 23:14:27",
   "depth": 2,
   "text": "You might be right, but still, he acts much more like a mature person rather than your usual angsty LN protagonist, which is great."
  },
  {
   "score": 2,
   "id": "dg3zai2",
   "pid": "t1_dg3y258",
   "date": "2017-04-11 00:05:05",
   "depth": 3,
   "text": "Oh absolutely, I was just giving my thoughts on his possible age. He seems very down to earth and relatable, which is awesome."
  },
  {
   "score": 3,
   "id": "dg358s5",
   "pid": "t1_dg33cf6",
   "date": "2017-04-10 12:41:52",
   "depth": 2,
   "text": "Huh, I read a bit of the manga and I had the impression he was in his early to mid 20's rather then anything older."
  },
  {
   "score": 3,
   "id": "dg3163p",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:31:08",
   "depth": 0,
   "text": "I loved it! The magic incantations seem like they're long and drawn out, and it'll be fun to see fights with two people shouting magic over each other. I can see this going somewhat like the Negima manga, with the whole magician-warrior partnership.\n\nAlso, idk if it's because Zero looks a ton like Emilia and talks a lot like Megumin, but I really thought it was Rie Takahashi voicing her. Welp, the VA is doing a good job, tho i haven't watched any of her previous shows. Definitely looking forward to this every week!"
  },
  {
   "score": 3,
   "id": "dg38fx5",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:37:27",
   "depth": 0,
   "text": "Definitely right next to Re:Creators for my top anime this season. Very strong opening and I already love the chemistry between Zero and Tiger Mask! Already excited for the next episode! "
  },
  {
   "score": 3,
   "id": "dg3dj6s",
   "pid": "t3_64k45v",
   "date": "2017-04-10 15:13:17",
   "depth": 0,
   "text": "Hm, while I enjoyed the LN (or what I've read so far anyway), this episode made me realize there's a lot of backstory kind of dumped on you and then a lot of conversations with not much else going on because they're mostly just walking and a fair number of time skips. It made the episode seem rushed, but really I just think it's something that's difficult to animate."
  },
  {
   "score": 3,
   "id": "dg3f90r",
   "pid": "t3_64k45v",
   "date": "2017-04-10 15:49:13",
   "depth": 0,
   "text": "Based on the reasons which Zero gives for convincing him to stay (his human face, his smell, his smile, etc.) it seems like she has access to his mind.  She knew what to say, what words and memories would calm him and lower his guard.  The show tipped its hand too soon, and it seems obvious Zero is emotionally manipulating the mercenary from the start.  I wouldn't be surprised if the concept of a blood contract was completely made up by her as well.  "
  },
  {
   "score": 4,
   "id": "dg3rm2i",
   "pid": "t3_64k45v",
   "date": "2017-04-10 20:08:47",
   "depth": 0,
   "text": "The story of Sabrina The Teenage Witch and her kitty!"
  },
  {
   "score": 3,
   "id": "dg40m3u",
   "pid": "t1_dg3rm2i",
   "date": "2017-04-11 01:07:23",
   "depth": 1,
   "text": "I'd be down for an anime about Salem Saberhagen."
  },
  {
   "score": 2,
   "id": "dg2zvf4",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:08:31",
   "depth": 0,
   "text": "The show of this season I've been the most hyped for. Hopefully this will encourage a scanlator group to pick up the manga from where it got left.\n\nZero is as cute as she should be, but damn the anime version of the Mercenary looks so badass, yet so fluffy. I want to hug him"
  },
  {
   "score": 2,
   "id": "dg31y8v",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:44:37",
   "depth": 0,
   "text": "Thankfully this only took about an hour or two to hit the high seas.\n\nIt's the first anime I've seen with an actual anthro protagonist, which is cool. Seems like it'll be a nice high fantasy series."
  },
  {
   "score": 2,
   "id": "dg35ocz",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:49:28",
   "depth": 0,
   "text": "I like this show so far."
  },
  {
   "score": 2,
   "id": "dg38wtm",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:45:37",
   "depth": 0,
   "text": "Hmm, not really feeling this first episode. Not massively keen on the two main characters right now and the episode was mostly exposition. Mercenary seemed to completely get over his apparent hatred of Witches incredibly bloody fast as well. Like, bro, you don't think she could be tricking you? You were ready to bail on her a second ago, starving and alone in the woods, and now you're cool making blood oaths with her in the span of a few minutes? \n\nIdk. I'll give it the three episode rule since I think it has potential but I'm not blown away by this introduction. "
  },
  {
   "score": 1,
   "id": "dg3tntd",
   "pid": "t1_dg38wtm",
   "date": "2017-04-10 20:58:01",
   "depth": 1,
   "text": "I mean it's kinda obvious that he has his own history with humans hunting him and murdering his village. So he can sort of sympathise with her. Plus he's not had any exposure to witches, as in face-to-face contact, and this was the first. So it'd be natural that he's getting to know them more as people than anything, especially since she offers to remove his beastside and what not. It stood out to me that his hatred of witches was only to get positive attention from humans who hated him. (Him saying he's tired of humans excluding him even though he hates witches.) Finally take into consideration that she's actually talking to him sincerely, and he is a bit naive (probably because of lack of contact), while most humans would just ignore or hunt him."
  },
  {
   "score": 2,
   "id": "dg3fcw3",
   "pid": "t3_64k45v",
   "date": "2017-04-10 15:51:31",
   "depth": 0,
   "text": "If only our furry MC wasn't so easily flustered. Oh boy."
  },
  {
   "score": 2,
   "id": "dg3jgkv",
   "pid": "t3_64k45v",
   "date": "2017-04-10 17:20:05",
   "depth": 0,
   "text": "Not a cat-boy...but a cat-MAN. My guess is that mercenary will be the iron-sensei of this season."
  },
  {
   "score": 2,
   "id": "dg3ljqp",
   "pid": "t3_64k45v",
   "date": "2017-04-10 18:03:49",
   "depth": 0,
   "text": "That was awesome. Zero seems cool, calm and collected and the way we were introduced to everything through demonstration and not tons of dialogue was so well done."
  },
  {
   "score": 2,
   "id": "dg3rm0n",
   "pid": "t3_64k45v",
   "date": "2017-04-10 20:08:45",
   "depth": 0,
   "text": "Seems like Zero plays the blue color, counter spelling that guy like a boss."
  },
  {
   "score": 2,
   "id": "dg5i8xr",
   "pid": "t3_64k45v",
   "date": "2017-04-11 22:09:41",
   "depth": 0,
   "text": "Shameless self plug, since the anime was released I created /r/GrimoireOfZero. Come check it out if you're interested in the series."
  },
  {
   "score": 5,
   "id": "dg3bmpx",
   "pid": "t3_64k45v",
   "date": "2017-04-10 14:35:19",
   "depth": 0,
   "text": "lmao I seriously thought this was like some sort of prequel to Re:zero where they explored the story of Satella or something. The heroine has the exact features of Satella... purple eyes, fair skin, silver hair. HER NAME IS FREAKING ZERO! I didn't realize this wasn't a prequel until I found out the author of the series is totally different from Re. "
  },
  {
   "score": 1,
   "id": "dg2vq87",
   "pid": "t3_64k45v",
   "date": "2017-04-10 09:55:30",
   "depth": 0,
   "text": "it is the work of one who consorts with beasts"
  },
  {
   "score": 1,
   "id": "dg2wtp9",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:15:17",
   "depth": 0,
   "text": "I haven't watched yet, but definitely will today. Out of everything airing this one caught my eye just reading the summary on MAL."
  },
  {
   "score": 1,
   "id": "dg2xjjk",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:27:40",
   "depth": 0,
   "text": "> Not licensed in Germany\n\nGod fucking dammit. First Re:Creators and now this."
  },
  {
   "score": 2,
   "id": "dg3ns2z",
   "pid": "t1_dg2xjjk",
   "date": "2017-04-10 18:50:04",
   "depth": 1,
   "text": "Tip: YARR!"
  },
  {
   "score": 2,
   "id": "dg324po",
   "pid": "t1_dg2xjjk",
   "date": "2017-04-10 11:47:47",
   "depth": 1,
   "text": "It's not licensed anywhere outside America."
  },
  {
   "score": 5,
   "id": "dg32z0g",
   "pid": "t1_dg324po",
   "date": "2017-04-10 12:02:18",
   "depth": 2,
   "text": "Looks like licensors over here just get everything that gets a reasonable amount of hype + every show with the \"ecchi\" tag and call it a day. Must be an easy job.\n\nBut it's hard to blame them as people will watch those series no matter how bad they turn out to be. But it's just sad how all the lesser known shows that actually have some effort put into get completely ignored."
  },
  {
   "score": 7,
   "id": "dg3j8nz",
   "pid": "t1_dg324po",
   "date": "2017-04-10 17:15:31",
   "depth": 2,
   "text": "It's in Australia and New Zealand on Animelab"
  },
  {
   "score": 1,
   "id": "dg3jxde",
   "pid": "t1_dg3j8nz",
   "date": "2017-04-10 17:29:47",
   "depth": 3,
   "text": "Oh, that must be why the torrent was so quick to go up."
  },
  {
   "score": 1,
   "id": "dg2xom6",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:30:07",
   "depth": 0,
   "text": "Seems pretty cool!\n\nDefinitely as a lot of potential. Kinda surprised there are male witches though. "
  },
  {
   "score": 1,
   "id": "dg2y500",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:38:13",
   "depth": 0,
   "text": "that was pretty good first episode \n\n\neven though this episode mostly just tell the basic info but it pretty enjoyable fun watching them interact with each other and the magic stuff and history is quite interesting\n\nmc backstory was simple and quick (struggle of beastfallen) but add a lot to his character i like it!\n\nalso that cape and sword remind me of gut"
  },
  {
   "score": 1,
   "id": "dg2yjx6",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:45:31",
   "depth": 0,
   "text": "That was good. Beastfallen are looked down upon and have to fight to stay alive. So are witches though but they can easily defend themselves. \n\nIt seems like the story is to find the Grimoire of Zero that Zero herself wrote. If it falls into the wrong hands, it's gonna cause a disaster. \n\nZero and Mercenary are pretty cool together. She's very playful and smart and he can deal with her just fine. "
  },
  {
   "score": 1,
   "id": "dg2z3jp",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:55:11",
   "depth": 0,
   "text": "Oho? Off to an interesting start. I'm definitely liking Zero, although with that revelation at the end I have to wonder just how old she is. And how did these people get their hands on her book? "
  },
  {
   "score": 1,
   "id": "dg30pn0",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:23:10",
   "depth": 0,
   "text": "That was a really good first episode! A lot of shows struggle with introductory stuff, and it comes off as clumsy, but this all felt really natural, and wasn't bogged down in backstory. \n\nIt was also surprisingly funny. Mercenary scuttling away from Zero after he found out she was a witch was a hilarious, and I love Zero's sass. She has a hint of the chuuni about her. \n\nThe visuals in the ED were absolutely lovely, I really like it when shows have radically different art styles in the ED or OP compared to the rest of the show. "
  },
  {
   "score": 3,
   "id": "dg3b5pp",
   "pid": "t1_dg30pn0",
   "date": "2017-04-10 14:26:28",
   "depth": 1,
   "text": "It's pretty hard to be chunni when you invented actual magic"
  },
  {
   "score": 1,
   "id": "dg31c8d",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:34:06",
   "depth": 0,
   "text": "I can already tell ill enjoy this ride. Zero's teasing is top notch. On a side note I'm only watching this because I bought [This](http://www.amiami.com/top/detail/detail?scode=FIGURE-022153) before the anime was announced knowing nothing about the characters. "
  },
  {
   "score": 1,
   "id": "dg32rjq",
   "pid": "t3_64k45v",
   "date": "2017-04-10 11:58:40",
   "depth": 0,
   "text": "Ay damn, for a second there I thought it was Koyama Rikiya, but this guy is okay I guess.\n\nInteresting mechanics with denying magic request which uses one's grimoire, I like it."
  },
  {
   "score": 1,
   "id": "dg340od",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:20:45",
   "depth": 0,
   "text": "Oh this was goooood. "
  },
  {
   "score": 1,
   "id": "dg34bll",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:26:00",
   "depth": 0,
   "text": "Great first episode! White Fox delivers again!"
  },
  {
   "score": 1,
   "id": "dg34elw",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:27:24",
   "depth": 0,
   "text": "Silver haired anime girls are saving anime this season \n\nLoved this and loved mercenary he is too cute. "
  },
  {
   "score": 1,
   "id": "dg364zm",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:57:18",
   "depth": 0,
   "text": "I really enjoyed this but I wonder what the significance of a beastmen head is. Is it a pride or ritualistic thing?"
  },
  {
   "score": 1,
   "id": "dg366s9",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:58:10",
   "depth": 0,
   "text": "So far so good."
  },
  {
   "score": 1,
   "id": "dg369t0",
   "pid": "t3_64k45v",
   "date": "2017-04-10 12:59:35",
   "depth": 0,
   "text": "Zero is a furry 0_o"
  },
  {
   "score": 3,
   "id": "dg3bmf6",
   "pid": "t1_dg369t0",
   "date": "2017-04-10 14:35:10",
   "depth": 1,
   "text": "Well she can also see past the fur and see the guy behind it. "
  },
  {
   "score": 1,
   "id": "dg36hun",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:03:28",
   "depth": 0,
   "text": "Beastmen, witches, awesome animation and nice music. AOTS INC"
  },
  {
   "score": 1,
   "id": "dg36mvv",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:05:51",
   "depth": 0,
   "text": "well this looks VERY promising. mondays just got better!"
  },
  {
   "score": 1,
   "id": "dg36qvq",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:07:49",
   "depth": 0,
   "text": "Felt a lot like Chaika except not as good. "
  },
  {
   "score": 1,
   "id": "dg36x7y",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:10:58",
   "depth": 0,
   "text": "Pretty solid first episode of a series. Really enjoyed the background music and ED."
  },
  {
   "score": 1,
   "id": "dg38v39",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:44:47",
   "depth": 0,
   "text": "Huh, I didn't know that Guin Saga was getting a sequel."
  },
  {
   "score": 1,
   "id": "dg39ffj",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:54:35",
   "depth": 0,
   "text": "Mercancy are Zero are both quite cute, and they're even cuter when together. I hope for more between the two of them.\n\nThe plot that they have so far seems to be interesting and a lot more creative than others from this season (looking at you Grandblue Fantasy.) So I have hope for it.\n\n.. > > I want more Mercancy plz. "
  },
  {
   "score": 1,
   "id": "dg3awyx",
   "pid": "t3_64k45v",
   "date": "2017-04-10 14:21:49",
   "depth": 0,
   "text": "Some \"Church\" vs \"Witches\" setting. Seriously, again with that? "
  },
  {
   "score": 1,
   "id": "dg458gp",
   "pid": "t1_dg3awyx",
   "date": "2017-04-11 04:46:04",
   "depth": 1,
   "text": "[Burn the witch!](https://www.famitsu.com/images/000/094/210/565bf66152f8b.jpg)"
  },
  {
   "score": 1,
   "id": "dg3bjnw",
   "pid": "t1_dg3awyx",
   "date": "2017-04-10 14:33:41",
   "depth": 1,
   "text": "This episode could be much better if action won't jump from place to place and scene to scene without any connections. "
  },
  {
   "score": 7,
   "id": "dg3cran",
   "pid": "t1_dg3awyx",
   "date": "2017-04-10 14:57:23",
   "depth": 1,
   "text": "https://en.wikipedia.org/wiki/Christian_views_on_magic"
  },
  {
   "score": 2,
   "id": "dg3g4rc",
   "pid": "t1_dg3cran",
   "date": "2017-04-10 16:08:19",
   "depth": 2,
   "text": "Catholic here. I'm talking about yet another western-ish fantasy anime with big, bad church against poor witches. It's just to generic. "
  },
  {
   "score": 1,
   "id": "dg3r8tt",
   "pid": "t1_dg3g4rc",
   "date": "2017-04-10 20:00:35",
   "depth": 3,
   "text": "[Spoilers](/s \"There is more to their conflict, the church has actual justification for the hunting of witches. The entire affair is a clusterfuck on both the witches side and the churches side though with both to be blamed for the conflict\")"
  },
  {
   "score": 5,
   "id": "dg3ja47",
   "pid": "t1_dg3g4rc",
   "date": "2017-04-10 17:16:23",
   "depth": 3,
   "text": "You gave the answer yourself. Generic stuff is *generic* because it works. Execution is what makes something good or bad.  \n\nIt's easy to write any *big institution* as corrupted/evil, it also doesn't help that during the *actual* Middle Age the Church was (and today is not really that different) exactly that."
  },
  {
   "score": 1,
   "id": "dg3c5c1",
   "pid": "t3_64k45v",
   "date": "2017-04-10 14:45:26",
   "depth": 0,
   "text": "idk why I thought this show would be bad, that was amazing.\n\nThis is some incredible world building, everything is so consistent."
  },
  {
   "score": 1,
   "id": "dg3cl0h",
   "pid": "t3_64k45v",
   "date": "2017-04-10 14:53:58",
   "depth": 0,
   "text": "This show is off to a great start"
  },
  {
   "score": 1,
   "id": "dg3cthv",
   "pid": "t3_64k45v",
   "date": "2017-04-10 14:58:35",
   "depth": 0,
   "text": "White Fox does it again. Great episode! Hopefully they can keep the quality up"
  },
  {
   "score": 1,
   "id": "dg3cv6n",
   "pid": "t3_64k45v",
   "date": "2017-04-10 14:59:30",
   "depth": 0,
   "text": "tiger Guts is pretty cute"
  },
  {
   "score": 1,
   "id": "dg3dzsk",
   "pid": "t3_64k45v",
   "date": "2017-04-10 15:22:53",
   "depth": 0,
   "text": "So Zero says that to use magic you need to sacrifice something and use magical words, but when she used her power to trap the boar what exactly sacrificed? Also, if i understand right the demons in this world are limited in power?"
  },
  {
   "score": 1,
   "id": "dg3rbdh",
   "pid": "t1_dg3dzsk",
   "date": "2017-04-10 20:02:13",
   "depth": 1,
   "text": "you can make pre arranged contracts. so she summons a demon that can make fire and pays the sacrifice, and then she can call on the power of the demon at a later time"
  },
  {
   "score": 1,
   "id": "dg3ezs6",
   "pid": "t3_64k45v",
   "date": "2017-04-10 15:43:53",
   "depth": 0,
   "text": "Ohhhh yeah, a fantasy/magic anime/manga that feels more like the olden days"
  },
  {
   "score": 1,
   "id": "dg3h3k2",
   "pid": "t3_64k45v",
   "date": "2017-04-10 16:29:32",
   "depth": 0,
   "text": "Thought it was re:zero it wasn't:("
  },
  {
   "score": 1,
   "id": "dg3hr06",
   "pid": "t3_64k45v",
   "date": "2017-04-10 16:44:02",
   "depth": 0,
   "text": "This white tiger .... have innocent face and not scary at all.\n\nI don't know how to react about that creature. I smell some Human x Animal for romance."
  },
  {
   "score": 1,
   "id": "dg3hztd",
   "pid": "t3_64k45v",
   "date": "2017-04-10 16:49:29",
   "depth": 0,
   "text": "If all the fight scenes are like the first one I'll be wildly disappointed by this show. It just seems extremely sluggish and the main character is awkward with his size."
  },
  {
   "score": 1,
   "id": "dg40k91",
   "pid": "t1_dg3hztd",
   "date": "2017-04-11 01:04:44",
   "depth": 1,
   "text": "Sluggish because of all the chanting? I do wonder how they'll reconcile their power levels though. Zero is practically god-level magic user and I assume being a fucking tiger means you're pretty apt when it comes to melee."
  },
  {
   "score": 1,
   "id": "dg4ccvp",
   "pid": "t1_dg40k91",
   "date": "2017-04-11 07:42:23",
   "depth": 2,
   "text": "No, the chanting is fine. But the first fight with the mercenaries in the city felt really slow. All the movements were a bit delayed."
  },
  {
   "score": 1,
   "id": "dg3jp9h",
   "pid": "t3_64k45v",
   "date": "2017-04-10 17:25:09",
   "depth": 0,
   "text": "Furries are gonna love this"
  },
  {
   "score": 1,
   "id": "dg3jt4c",
   "pid": "t3_64k45v",
   "date": "2017-04-10 17:27:23",
   "depth": 0,
   "text": "The character design looks so bland and forgettable, generic af. I cant explain it but all the characters looks so boring."
  },
  {
   "score": 1,
   "id": "dg3jtde",
   "pid": "t3_64k45v",
   "date": "2017-04-10 17:27:32",
   "depth": 0,
   "text": "I like the first episode as a setup. I loved the little humor. He was so cute how childlike he was(currently his name eludes me so i'll nickname him Grinny---since his mouth always looks like he's smiling. Her saying that as a hint to his awesome mom was cute too). Its a little common for Zero to turn out to be an uber witch but i like it. She is so tiny and cute. I can't wait til the next episode. I think i'll really like this one"
  },
  {
   "score": 1,
   "id": "dg3kcyi",
   "pid": "t3_64k45v",
   "date": "2017-04-10 17:38:42",
   "depth": 0,
   "text": "when zero used sorcery on the ebelboar, what exactly happened? nothing? was it to show that magic is way superior than sorcery? but what is confusing me is when mercenary asked if she needed to summon the demon she replied: \"because no one had tried to before\". im wondering what she means. no one had tried to do what exactly before? is it that vague on purpose and the exact details are gonna get revealed the next episode or am i just missing something completely different?"
  },
  {
   "score": 1,
   "id": "dg4hr2i",
   "pid": "t1_dg3kcyi",
   "date": "2017-04-11 09:22:38",
   "depth": 1,
   "text": "From what she demonstrated, Sorcery requires the user to draw a casting circle/diagram, summon a demon to use its power, and gifting it an offering after it has done what was requested. \n\nAs for Magic, those steps can be skipped by just immediately sacrificing an offering (I didn't catch her doing it but the boy witch did with his fire spell) and chanting the spell. This is a far quicker method of employing the use of a demon's power in the heat of the moment. \n\nSo, from what I could understand, Magic is superior in a sense that it can be use on the fly, whereas Sorcery is clunky and inconvenient. "
  },
  {
   "score": 1,
   "id": "dg4i1ly",
   "pid": "t1_dg4hr2i",
   "date": "2017-04-11 09:27:52",
   "depth": 2,
   "text": "yea i understand the difference between sorcery and magic. but i was wondering what exactly the summoned demon did to the ebelboar."
  },
  {
   "score": 1,
   "id": "dg5hmzh",
   "pid": "t1_dg4i1ly",
   "date": "2017-04-11 21:50:25",
   "depth": 3,
   "text": "Shot a fireball at it."
  },
  {
   "score": 1,
   "id": "dg3kzy1",
   "pid": "t3_64k45v",
   "date": "2017-04-10 17:52:03",
   "depth": 0,
   "text": "Wow, that's some nice 1st episode. Seems to be a pretty good adventure show and reminds me a tiny bit of Hitsugi no Chaika but a bit more serious. Pretty intriguing setting too.\n\nThe BGM reminded me a bit of Michiru Oshima's works(Sora no Woto, LWA, Akagami no Shirayuki-hime) but it's a different composer."
  },
  {
   "score": 1,
   "id": "dg3lm2l",
   "pid": "t3_64k45v",
   "date": "2017-04-10 18:05:14",
   "depth": 0,
   "text": "Hmmmm this was my (tentatively) most anticipated show this season, and along with re:creators, and Alice to zouroku, it's off to a good start. Hopefully at least one of those 3 maintains quality xD"
  },
  {
   "score": 1,
   "id": "dg3muyu",
   "pid": "t3_64k45v",
   "date": "2017-04-10 18:31:32",
   "depth": 0,
   "text": "I thought this was another season of the familiar of zero\n"
  },
  {
   "score": 1,
   "id": "dg3mynf",
   "pid": "t3_64k45v",
   "date": "2017-04-10 18:33:44",
   "depth": 0,
   "text": "When I watched the trailer+ the first episode I kept thinking this was related to the Re:Zero series also made by Kadokawa productions. They bamboozled me! I demand coverage! "
  },
  {
   "score": 1,
   "id": "dg3q8b7",
   "pid": "t3_64k45v",
   "date": "2017-04-10 19:39:10",
   "depth": 0,
   "text": "We have a promising start here, no doubt. I really hope the number of episodes won't get in the way."
  },
  {
   "score": 1,
   "id": "dg3q9qp",
   "pid": "t3_64k45v",
   "date": "2017-04-10 19:39:58",
   "depth": 0,
   "text": "The tiger dude's voice is so off putting. "
  },
  {
   "score": 1,
   "id": "dg3qwi3",
   "pid": "t3_64k45v",
   "date": "2017-04-10 19:53:10",
   "depth": 0,
   "text": "I'm feeling some AOTS vibes right here\n"
  },
  {
   "score": 1,
   "id": "dg3rn1x",
   "pid": "t3_64k45v",
   "date": "2017-04-10 20:09:23",
   "depth": 0,
   "text": "No one is mentioning how the mage that chased MC looks like Ezreal from League?"
  },
  {
   "score": 1,
   "id": "dg3sdjz",
   "pid": "t3_64k45v",
   "date": "2017-04-10 20:26:16",
   "depth": 0,
   "text": "This is REALLY promising, anyone know how many episodes it's gonna be?\n\nEdit: made a subreddit /r/GrimoireOfZero"
  },
  {
   "score": 1,
   "id": "dg3t4ro",
   "pid": "t3_64k45v",
   "date": "2017-04-10 20:44:29",
   "depth": 0,
   "text": "I really hope his name is guts."
  },
  {
   "score": 1,
   "id": "dg3wgcs",
   "pid": "t3_64k45v",
   "date": "2017-04-10 22:17:46",
   "depth": 0,
   "text": "Reminds me of inuyasha a little, with the whole animal like characters and the way they are already recruiting and forming a small group."
  },
  {
   "score": 1,
   "id": "dg3wo68",
   "pid": "t3_64k45v",
   "date": "2017-04-10 22:24:48",
   "depth": 0,
   "text": "Hm, I'm not huge on high fantasy. The lores rarely interest me. This looks promising though. The premise could be taken in any direction, good or bad, but main duo and their chemistry are great so far. They could've made Zero not be a loli given the romantic undertones, but whatever."
  },
  {
   "score": 1,
   "id": "dg3xazl",
   "pid": "t3_64k45v",
   "date": "2017-04-10 22:46:22",
   "depth": 0,
   "text": "Spice and ~~wolf~~ White Tiger season 3 finally here"
  },
  {
   "score": 1,
   "id": "dg3yjb8",
   "pid": "t3_64k45v",
   "date": "2017-04-10 23:33:10",
   "depth": 0,
   "text": "I love this show. Getting very similar vibes to when I watched FMA except these seems far more grounded but that depends on how silly the Magic gets.\n\nBoth characters are pretty likable and aren't played up to their extremes. I'm always wary around ostensibly loli's but really she played well. \n\nAnd MC is pretty cute like they've said in show."
  },
  {
   "score": 2,
   "id": "dg5165p",
   "pid": "t1_dg3yjb8",
   "date": "2017-04-11 15:25:36",
   "depth": 1,
   "text": "On the loli comment. She's more in her late teens and just looks small compared to how massive Merc is.   "
  },
  {
   "score": 1,
   "id": "dg51eac",
   "pid": "t1_dg5165p",
   "date": "2017-04-11 15:30:18",
   "depth": 2,
   "text": "Yeah hence the \"ostensibly\""
  },
  {
   "score": 1,
   "id": "dg3zc7k",
   "pid": "t3_64k45v",
   "date": "2017-04-11 00:07:07",
   "depth": 0,
   "text": "Gave in and watched it.. god damn it now I am watching 14 airing anime >.<"
  },
  {
   "score": 1,
   "id": "dg47zn9",
   "pid": "t3_64k45v",
   "date": "2017-04-11 06:07:00",
   "depth": 0,
   "text": "I really liked the mood of this show, and the characters are very intriguing so far."
  },
  {
   "score": 1,
   "id": "dg494qq",
   "pid": "t3_64k45v",
   "date": "2017-04-11 06:34:17",
   "depth": 0,
   "text": "This anime looks really good "
  },
  {
   "score": 1,
   "id": "dg4twrv",
   "pid": "t3_64k45v",
   "date": "2017-04-11 13:02:29",
   "depth": 0,
   "text": "Reading the few bits of manga that I could find, this show could go either way. The first episode felt a lot more cohesive than the manga, and the characters less random.\n\nLooks promising to me."
  },
  {
   "score": 1,
   "id": "dg50hzf",
   "pid": "t1_dg4twrv",
   "date": "2017-04-11 15:11:14",
   "depth": 1,
   "text": "You could try reading the LN as well on certain sites."
  },
  {
   "score": 1,
   "id": "dg52ksa",
   "pid": "t3_64k45v",
   "date": "2017-04-11 15:55:43",
   "depth": 0,
   "text": "I'm getting similar vibes to Spice and Wolf from this. "
  },
  {
   "score": 1,
   "id": "dg52p0q",
   "pid": "t3_64k45v",
   "date": "2017-04-11 15:58:16",
   "depth": 0,
   "text": "People trying so hard to hate this show.  >_<  Ridic too, because it's SO GOOD.  Or maybe I'm just shocked by having actually likable characters for once--the merc is clearly a guy who only ever started fighting because people kept attacking him, and if he's gotten skilled at it its because he's still here and they...aren't.  \n\nAnd Zero?  Man, how nice not to have a \"cute young girl\" playing a tsundere.  Her character motivations make sense and currently she's just trying to save the world (bet it ends up more than that) and tease this adorable cat-guy she found.  \n\nIt struck the right mix of dramatic and comedic, and almost feels like this season's Grimgar in a weird way."
  },
  {
   "score": 1,
   "id": "dg6odr4",
   "pid": "t3_64k45v",
   "date": "2017-04-12 15:29:09",
   "depth": 0,
   "text": "World looks amazing. Really like both our MCs. Main problem is with the look, the character designs and the general artstyle of it. Seems too \"generic\" I guess. Anyway, setting is very interesting so looking forward to it!"
  },
  {
   "score": 1,
   "id": "dgidt2o",
   "pid": "t3_64k45v",
   "date": "2017-04-20 04:20:44",
   "depth": 0,
   "text": "The two characters have great chemistry, which is was I hoped for in this anime, so that's awesome. World has great potential, hopefully they'll explore it more. Storyline was a bit predictable for me, and meh production values, but not a deal breaker. \n\nDefinitely gonna keep watching."
  },
  {
   "score": 1,
   "id": "dg37px7",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:24:54",
   "depth": 0,
   "text": "I need to ask... Am I the only one that disliked this episode? T_T\n\nIt seems that everyone loved it..."
  },
  {
   "score": 2,
   "id": "dg43jna",
   "pid": "t1_dg37px7",
   "date": "2017-04-11 03:37:44",
   "depth": 1,
   "text": "I'm actually tempted to rewatch it since I think I might be missing what everyone seems to love about this episode. \n\nIdk. Regardless I'm giving it the 3-eisode rule since it has potential, but nothing in this first episode has me particularly hooked. "
  },
  {
   "score": 1,
   "id": "dg443tq",
   "pid": "t1_dg43jna",
   "date": "2017-04-11 04:02:31",
   "depth": 2,
   "text": "I actually rewatched some of it and still don't get it xD\nI think that everyone likes the show because of the characters, and I honestly didn't. Especially the fact that you got info dumped on stuff from the mc on the 1st episode alone. This is my opinion, but make me like the characters first and then only after I care about them, start giving me some info... I didn't like the way that it was done..."
  },
  {
   "score": 2,
   "id": "dg44r7u",
   "pid": "t1_dg443tq",
   "date": "2017-04-11 04:28:26",
   "depth": 3,
   "text": "Yeah, I agree. This seems to be setting up a Fantasy-Adventure style of show, and for that to work, you *Need* to like the characters or else there is almost nothing to keep you invested in the journey. Right now, Zero and Merc are not that interesting to me. Merc is just some guy with a fairly standard backstory, and Zero seems to only have \"she's cute\" going for her so far.  \n\nThe heavy exposition didn't help me get attached to them either, and the speed at which they came into contact with each other, and immediately agreed to work together, felt forced. \n\nI'm probably being overly critical. This was just the first episode afterall, but it just feels like I watched a different show to everyone here. :P"
  },
  {
   "score": 1,
   "id": "dg455dl",
   "pid": "t1_dg44r7u",
   "date": "2017-04-11 04:42:56",
   "depth": 4,
   "text": ">the speed at which they came into contact with each other, and immediately agreed to work together, felt forced.\n\nIkr, he is being chased and while running bumps into a girl, instead of leaving her since she has nothing to do with that, he actually takes Zero with him... wasn't safer for her if he left her alone than take her with him, who had a guy trying to kill him at that exact moment. Yes, an arrow was going to hit Zero if he didn't anything, but he could have just taken her out of the way and leave her be. \n\nThen, when I see him carrying her and I'm there wondering why is he with Zero he answer with a \"It just happened!\" :/\n\n>I'm probably being overly critical. This was just the first episode afterall, but it just feels like I watched a different show to everyone here. :P\n\nExact same for me."
  },
  {
   "score": 2,
   "id": "dg3ziav",
   "pid": "t1_dg37px7",
   "date": "2017-04-11 00:14:40",
   "depth": 1,
   "text": "Well, its the overhyped anime of the season, what do you want."
  },
  {
   "score": 1,
   "id": "dg40ng1",
   "pid": "t1_dg3ziav",
   "date": "2017-04-11 01:09:14",
   "depth": 2,
   "text": "I'd give Re:Creators that title to be honest. I really want to like it but the first ep didn't do close to enough for me re: Re: C"
  },
  {
   "score": 1,
   "id": "dg37dk4",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:18:57",
   "depth": 0,
   "text": "I still dont get the difference between sorcery and magic.\n\nWas the demon she summoned through sorcery supposed to be the sacrifice for her magic?"
  },
  {
   "score": 1,
   "id": "dg3u4ka",
   "pid": "t3_64k45v",
   "date": "2017-04-10 21:10:24",
   "depth": 0,
   "text": "this gonna be in top seasons, im calling it!"
  },
  {
   "score": -11,
   "id": "dg2xx6n",
   "pid": "t3_64k45v",
   "date": "2017-04-10 10:34:20",
   "depth": 0,
   "text": "rather poor overall. A bit disappointing. Hope it'll get more interesting."
  },
  {
   "score": 3,
   "id": "dg330ed",
   "pid": "t1_dg2xx6n",
   "date": "2017-04-10 12:02:58",
   "depth": 1,
   "text": "Poor how?"
  },
  {
   "score": -4,
   "id": "dg3377d",
   "pid": "t1_dg330ed",
   "date": "2017-04-10 12:06:21",
   "depth": 2,
   "text": "By the end of the ep we don't know where the plot is even going. The characters and the world setup were fine but nothing special. The interactions weren't really interesting. The witch/beastmen/people dynamic is a bit confusing."
  },
  {
   "score": 8,
   "id": "dg33u8g",
   "pid": "t1_dg3377d",
   "date": "2017-04-10 12:17:42",
   "depth": 3,
   "text": "The whole contract scene literally told you the end game: to look for Thirteen and retrieve the Grimoire of Zero. How is the dynamic between witch/beastfallen/human confusing? Solena the witch was burned the Church, sparking the war between witches and humans, and beastfallen are discriminated by people because the way they look, and are hunted by witches for their heads, presumably for sorcery sacrifice."
  },
  {
   "score": -7,
   "id": "dg33xoc",
   "pid": "t1_dg33u8g",
   "date": "2017-04-10 12:19:20",
   "depth": 4,
   "text": "I'm also not a fan of opening info dumps."
  },
  {
   "score": 5,
   "id": "dg3aq6l",
   "pid": "t1_dg33xoc",
   "date": "2017-04-10 14:18:14",
   "depth": 5,
   "text": "You know, thats just something that can't be helped.  The setting is fantasy world that operates by very different rules than normal society.  A high school anime doesn't need to explain mid-terms or student to adult interactions or anxiety about ones future.  \n\n\nIn this world, there are at least threes classes of people.  Witches, Beastfallen, and normal humans.  The relations between each class dictates how Zero and Mercenary will behave.  If you want their actions to make sense, especially during their introduction, you are going to have to live with an opening info dump."
  },
  {
   "score": 0,
   "id": "dg3b3dq",
   "pid": "t1_dg3aq6l",
   "date": "2017-04-10 14:25:14",
   "depth": 6,
   "text": "it still feels silly. I mean the magic is crazy useful, as is the superhuman strength of the beastfallen, so why try to kill them?"
  },
  {
   "score": 4,
   "id": "dg36jqt",
   "pid": "t1_dg330ed",
   "date": "2017-04-10 13:04:21",
   "depth": 2,
   "text": "I have a better answer:\n\n-5+ minutes is Zero and beastman talking at the campfire. This is such a boring way to handle dialogue/exposition.\n\n-Beastman woke up from a flashback twice in this episode. I'm already annoyed when I see this just once in a show since it's so overdone, but I just couldn't believe that they used it twice in 15 minutes.\n\n-Already seems like a majority of \"jokes\" are gonna be Zero basically saying \"I'm open about sex but beastman isn't haha punchline\" This is one of the worst ways to handle comedy. Just shitty jokes that act as a way to weave in fanservice.\n\nThese three come together to form my opinion that this show is not going to be creative. A one dimensional plot with one dimensional events. This is the show you think of when you think \"light novel adaptation.\""
  },
  {
   "score": 1,
   "id": "dg40o9h",
   "pid": "t1_dg36jqt",
   "date": "2017-04-11 01:10:22",
   "depth": 3,
   "text": "The flashback thing was def a bit much at 2 in the opening."
  },
  {
   "score": 0,
   "id": "dg3h6qc",
   "pid": "t3_64k45v",
   "date": "2017-04-10 16:31:30",
   "depth": 0,
   "text": "I really underestimated the ability of the Re:Zero fans to distinguish between the two titles. Stop comparing the both of them already.\n\nYumiri Hanamori is proving to be a good seiyuu."
  },
  {
   "score": -3,
   "id": "dg3ab7u",
   "pid": "t3_64k45v",
   "date": "2017-04-10 14:10:30",
   "depth": 0,
   "text": "So this is not related to Re:Zero at all but is this made by the same studio? The style seems similar.\n\nThere's a difference between sorcery and magic in this? Seems like sorcery is a lot weaker then magic."
  },
  {
   "score": -2,
   "id": "dg3owz3",
   "pid": "t3_64k45v",
   "date": "2017-04-10 19:12:29",
   "depth": 0,
   "text": "How is this anime related to re zero? The one with satella and stuff? "
  },
  {
   "score": 2,
   "id": "dg3pbmt",
   "pid": "t1_dg3owz3",
   "date": "2017-04-10 19:20:44",
   "depth": 1,
   "text": "Its has no connection to Re Zero."
  },
  {
   "score": 4,
   "id": "dg3paet",
   "pid": "t1_dg3owz3",
   "date": "2017-04-10 19:20:04",
   "depth": 1,
   "text": "It's not related to Re:Zero at all.\n\"Zero Kara hajimeru\" part just means starting from zero. The English title of this anime is Grimoire of Zero.\nThe light novel of this came out before Re:Zero I believe, and won the grand prize of the 20th annual Dengeki Novel Award."
  },
  {
   "score": 2,
   "id": "dg3sa8l",
   "pid": "t1_dg3paet",
   "date": "2017-04-10 20:24:05",
   "depth": 2,
   "text": "Aww man :( "
  },
  {
   "score": -3,
   "id": "dg36yl8",
   "pid": "t3_64k45v",
   "date": "2017-04-10 13:11:37",
   "depth": 0,
   "text": "Before I jump on this series, I need to know:\n\nIs this a prequel, a spin-off or something totally different from [Re:Zero kara Hajimeru Isekai Seikatsu](https://myanimelist.net/anime/31240/Re_Zero_kara_Hajimeru_Isekai_Seikatsu)?"
  },
  {
   "score": 2,
   "id": "dg3bo24",
   "pid": "t1_dg36yl8",
   "date": "2017-04-10 14:36:03",
   "depth": 1,
   "text": "Completely unrelated. "
  },
  {
   "score": 2,
   "id": "dg436kv",
   "pid": "t1_dg36yl8",
   "date": "2017-04-11 03:20:37",
   "depth": 1,
   "text": "You know what, if you translate both title you'll get a very different meaning. one is starting in a parallel word from zero, another one is 'Begin with the Grimoire of Zero'. "
  },
  {
   "score": 2,
   "id": "dg4adpe",
   "pid": "t1_dg436kv",
   "date": "2017-04-11 07:01:51",
   "depth": 2,
   "text": "Begin the Grimoire from Zero would also be an acceptable translation"
  },
  {
   "score": 8,
   "id": "dg37olc",
   "pid": "t1_dg36yl8",
   "date": "2017-04-10 13:24:14",
   "depth": 1,
   "text": "They have nothing to do with each other..."
  },
  {
   "score": 1,
   "id": "dg3adsv",
   "pid": "t1_dg37olc",
   "date": "2017-04-10 14:11:48",
   "depth": 2,
   "text": "I kinda wish it turns out to be the backstory of Satella. \nAt least thats my crackpot theory, wich im going to prove right. ( Untill it is 120% sure, that its impossible)"
  },
  {
   "score": -31,
   "id": "dg2qlvz",
   "pid": "t3_64k45v",
   "date": "2017-04-10 08:22:25",
   "depth": 0,
   "text": "Random question : Is this a crossover of Madoka and Re:Zero?  Title is a mashup of these two shows, and I would love to see that crossover actually."
  },
  {
   "score": -22,
   "id": "dg2s037",
   "pid": "t1_dg2qlvz",
   "date": "2017-04-10 08:48:18",
   "depth": 1,
   "text": "No it's a prequel of Re:Zero, but it does have mahou shoujo's\n\nEdit: /s calm down guys "
  },
  {
   "score": 13,
   "id": "dg2tqwa",
   "pid": "t1_dg2s037",
   "date": "2017-04-10 09:20:00",
   "depth": 2,
   "text": "Re;Zero and this show have no connection whatsoever."
  },
  {
   "score": -1,
   "id": "dg33tq4",
   "pid": "t1_dg2tqwa",
   "date": "2017-04-10 12:17:25",
   "depth": 3,
   "text": "Except half the title, dammit nips be a little creative."
  },
  {
   "score": 0,
   "id": "dg36i1s",
   "pid": "t1_dg2tqwa",
   "date": "2017-04-10 13:03:34",
   "depth": 3,
   "text": "I was being sarcastic :p "
  },
  {
   "score": -1,
   "id": "dg30hzt",
   "pid": "t1_dg2tqwa",
   "date": "2017-04-10 11:19:28",
   "depth": 3,
   "text": "I'm gonna save this comment for when it's revealed in episode 12 that this actually *is* a prequel of how the jealous witch came to be.\n\nWe will all rue the day we laughed at Aramx42."
  },
  {
   "score": 3,
   "id": "dg36pws",
   "pid": "t1_dg30hzt",
   "date": "2017-04-10 13:07:21",
   "depth": 4,
   "text": "Can't wait for your reactions when y'all find out the real twist: Tokyo Ghoul:re:Zero"
  },
  {
   "score": 1,
   "id": "dg2vta5",
   "pid": "t1_dg2qlvz",
   "date": "2017-04-10 09:57:03",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 3,
   "id": "dg2w0in",
   "pid": "t1_dg2vta5",
   "date": "2017-04-10 10:00:37",
   "depth": 2,
   "text": "Because the answer can be found with a single click away and it is a stupid question to begin with anyway."
  },
  {
   "score": 4,
   "id": "dg3erzq",
   "pid": "t1_dg2qlvz",
   "date": "2017-04-10 15:39:21",
   "depth": 1,
   "text": "Um. Perhaps breaking down the titles will help you see why this is a *little* silly.\n\n1) **Re:Zero kara Hajimeru Isekai Seikatsu**\n\n* **Re**: this is nonsense\n* **Zero kara**: \"from zero\" / \"from scratch\"\n* **Hajimeru**: \"starting\"  \n*thus \"zero kara hajimeru\" means \"starting from scratch\"*\n* **Isekai**: \"a different world\"\n* **Seikatsu**: \"life\"\n\nPut it together, and you get \"Starting life from scratch in a different world\"\n\n2) **Mahou Shoujo Madoka Magica**\n\n* **Mahou**: magic / magical\n* **Shoujo**: girl\n\nSo this one means \"Magical Girl Madoka Magica\"\n\n3) **Zero kara Hajimeru Mahou no Sho**\n\n* **Zero kara Hajimeru**: \"starting from scratch\"\n* **Mahou no**: \"of magic\"\n* **Sho**: \"book\"\n\nThus this title translates to \"Starting the book of magic from scratch\"\n\nIf anything, the similarity between the titles serves to underscore the dearth of creativity in light novel naming conventions."
  },
  {
   "score": 7,
   "id": "dg2r1uw",
   "pid": "t1_dg2qlvz",
   "date": "2017-04-10 08:30:41",
   "depth": 1,
   "text": "It would be a fun crossover hah but the only crossover you might see one day animated is KonosubaXReZero"
  },
  {
   "score": 12,
   "id": "dg2r607",
   "pid": "t1_dg2r1uw",
   "date": "2017-04-10 08:32:49",
   "depth": 2,
   "text": "> KonosubaXReZero\n\nAnd in it, Aqua kills Subaru."
  },
  {
   "score": 18,
   "id": "dg2r54t",
   "pid": "t1_dg2qlvz",
   "date": "2017-04-10 08:32:23",
   "depth": 1,
   "text": "I hope you're joking."
  },
  {
   "score": -1,
   "id": "dg2rak1",
   "pid": "t1_dg2r54t",
   "date": "2017-04-10 08:35:17",
   "depth": 2,
   "text": "I was just intrigued by the title!"
  },
  {
   "score": 24,
   "id": "dg2qo8t",
   "pid": "t1_dg2qlvz",
   "date": "2017-04-10 08:23:38",
   "depth": 1,
   "text": "It is not."
  }
 ]
}