{
 "score": 482,
 "id": "6i9p0j",
 "num_comments": 178,
 "date": "2017-06-19 14:55:16",
 "comments": [
  {
   "score": 130,
   "id": "dj4j90t",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:00:58",
   "depth": 0,
   "text": "Only 7 hours late, gotta love amazon.\n\nSmall Zero is precious I wish I could see more of her. \n\nLoved the anticlimatic part the music cutting off was perfect.\n\nI didn't expect 13 to go alone with them, I'm enjoying him quite a lot I wonder how long he'll stick around."
  },
  {
   "score": 20,
   "id": "dj52isp",
   "pid": "t1_dj4j90t",
   "date": "2017-06-19 22:14:32",
   "depth": 1,
   "text": ">  Only 7 hours late, gotta love amazon.\n\n[Osoi!](https://streamable.com/zekr3)"
  },
  {
   "score": 1,
   "id": "dj6csjo",
   "pid": "t1_dj52isp",
   "date": "2017-06-20 16:28:52",
   "depth": 2,
   "text": "i wonder what they were doing at this scene. i mean, they are litteraly running towards the cells in the background"
  },
  {
   "score": 60,
   "id": "dj4pp1m",
   "pid": "t1_dj4j90t",
   "date": "2017-06-19 17:15:58",
   "depth": 1,
   "text": "I'd love to see 13 appear next to them in the OP for the final episode."
  },
  {
   "score": 11,
   "id": "dj51is9",
   "pid": "t1_dj4pp1m",
   "date": "2017-06-19 21:44:38",
   "depth": 2,
   "text": "Fuck it let's add that perverted guy who wanted Zero's clothes in the OP as well"
  },
  {
   "score": 44,
   "id": "dj4q3ib",
   "pid": "t1_dj4pp1m",
   "date": "2017-06-19 17:24:34",
   "depth": 2,
   "text": "That would be so dumb, I'd actually laugh at it.\n\nMy love for this show has fallen so much since the \"plot\" kicked in."
  },
  {
   "score": 21,
   "id": "dj4qej0",
   "pid": "t1_dj4q3ib",
   "date": "2017-06-19 17:31:16",
   "depth": 3,
   "text": "Wait, how would that be dumb ? 13 joined them, like Holdem did. The team is growing. The only reason they would not do it would be that it's not worth for a single episode."
  },
  {
   "score": 12,
   "id": "dj4qi1n",
   "pid": "t1_dj4qej0",
   "date": "2017-06-19 17:33:23",
   "depth": 4,
   "text": "Just would seem silly to me. \n\nDude does a heel face turn and gets thrown into the OP for one episode after being the villain the entire time."
  },
  {
   "score": 27,
   "id": "dj51fts",
   "pid": "t1_dj4qi1n",
   "date": "2017-06-19 21:42:16",
   "depth": 5,
   "text": "Well, I think the interesting part of the show is that in a lot of ways, everybody can kinda be blamed for the conflict going on except I suppose the mercenary. "
  },
  {
   "score": 7,
   "id": "dj7apz0",
   "pid": "t1_dj51fts",
   "date": "2017-06-21 07:58:02",
   "depth": 6,
   "text": "There were certainly problems long before Thirteen showed up on the scene. The beastfallen were created by witches for war and have been around much longer than this current conflict. Mercenary was born one long before Sorena was executed. "
  },
  {
   "score": 112,
   "id": "dj4le3p",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:44:19",
   "depth": 0,
   "text": "The last scene was really weird. Zero denied the sorcerer's spells, Thirteen binded them with vines and then they all just disappeared."
  },
  {
   "score": 3,
   "id": "dj5x5n6",
   "pid": "t1_dj4le3p",
   "date": "2017-06-20 11:43:36",
   "depth": 1,
   "text": "My headcanon explanation was that they realized that the person who denied their spells was the actual Zero and became too stunned to move!"
  },
  {
   "score": 4,
   "id": "dj57llt",
   "pid": "t1_dj4le3p",
   "date": "2017-06-20 01:32:35",
   "depth": 1,
   "text": "You'll find out in the dōjinshi."
  },
  {
   "score": 14,
   "id": "dj59u12",
   "pid": "t1_dj57llt",
   "date": "2017-06-20 03:19:14",
   "depth": 2,
   "text": "Now we know what was in Thirteen book"
  },
  {
   "score": 1,
   "id": "dj5p4y9",
   "pid": "t1_dj59u12",
   "date": "2017-06-20 09:25:48",
   "depth": 3,
   "text": "The page that disappeared was the one that had the Albus parts in it so now she'll never now."
  },
  {
   "score": 2,
   "id": "dj59xv1",
   "pid": "t1_dj59u12",
   "date": "2017-06-20 03:23:58",
   "depth": 3,
   "text": "That's the face melty spell part."
  },
  {
   "score": 5,
   "id": "dj5165n",
   "pid": "t1_dj4le3p",
   "date": "2017-06-19 21:34:44",
   "depth": 1,
   "text": "Ya- kinda was wondering this too... they suddenly- Vanished."
  },
  {
   "score": 10,
   "id": "dj50n54",
   "pid": "t1_dj4le3p",
   "date": "2017-06-19 21:20:10",
   "depth": 1,
   "text": "they don't allow hentai here"
  },
  {
   "score": 14,
   "id": "dj4ryoi",
   "pid": "t1_dj4le3p",
   "date": "2017-06-19 18:05:14",
   "depth": 1,
   "text": "It kinda looked like they got pulled out of the frame by the vines."
  },
  {
   "score": 24,
   "id": "dj4pt1z",
   "pid": "t1_dj4le3p",
   "date": "2017-06-19 17:18:18",
   "depth": 1,
   "text": "Maybe they cut the part where they disintegrated all the harmless prisoners ?"
  },
  {
   "score": 111,
   "id": "dj4mkki",
   "pid": "t1_dj4le3p",
   "date": "2017-06-19 16:08:54",
   "depth": 1,
   "text": "Well, you know, they weren't relevant anymore, so they vanished from the plot. ;)"
  },
  {
   "score": 86,
   "id": "dj4wgsg",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 19:42:11",
   "depth": 0,
   "text": "I loved it when Zero decided she was \"too slow!\" and threw her arms up in the air to let Mercenary pick her up to run for the first down."
  },
  {
   "score": 3,
   "id": "dj6d46u",
   "pid": "t1_dj4wgsg",
   "date": "2017-06-20 16:35:30",
   "depth": 1,
   "text": "and they run towards  the cell from the background"
  },
  {
   "score": 8,
   "id": "dj6752i",
   "pid": "t1_dj4wgsg",
   "date": "2017-06-20 14:38:48",
   "depth": 1,
   "text": "And then Thirteen just goes after them at a very leisurely pace."
  },
  {
   "score": 10,
   "id": "dj5auz0",
   "pid": "t1_dj4wgsg",
   "date": "2017-06-20 04:02:35",
   "depth": 1,
   "text": "Yes, that was so cute."
  },
  {
   "score": 21,
   "id": "dj57vbv",
   "pid": "t1_dj4wgsg",
   "date": "2017-06-20 01:45:19",
   "depth": 1,
   "text": "Best Part of the entire episode, I wonder why I had to scroll so far down to see anyone mention it"
  },
  {
   "score": 194,
   "id": "dj4jvad",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:13:19",
   "depth": 0,
   "text": "man, this show was so enjoyable the first couple episodes, but this story really doesnt do anything for me. Those sorcerers of Zero are just retarded and the whole plot is just... boring, even though the main characters (except albus) are so good. "
  },
  {
   "score": 1,
   "id": "dj4kt1r",
   "pid": "t1_dj4jvad",
   "date": "2017-06-19 15:32:18",
   "depth": 1,
   "text": "Pretty funny, there was basically the same message last week and likewise the downvote brigade sent it to oblivion too.\n\nNever change r/anime -_-'.\n\nYeah, dunno the reason, if it is the editor choice or the author's one but IMO they fail to understand why the manga (assuming the adaptation is faithful) was good and just turned it too an action manga with a blend story when the traveling part was so much better.\n\n\n"
  },
  {
   "score": 1,
   "id": "dj5xk4q",
   "pid": "t1_dj4kt1r",
   "date": "2017-06-20 11:50:30",
   "depth": 2,
   "text": "Definitely not a faithful adaptation. I did a little [write-up](https://www.reddit.com/r/anime/comments/6gt83j/comment/ditvpau) recently, although I haven't read the last few chapters of volume one lately. Seriously, light novel is better."
  },
  {
   "score": 2,
   "id": "dj51c6c",
   "pid": "t1_dj4jvad",
   "date": "2017-06-19 21:39:25",
   "depth": 1,
   "text": "This ending does seem kind of weird. It was better in the beginning. I wish it stayed more like spice and wolf, that's the vibe I got in eps 1-4 before the whole \"JUU-SUM-BUH\" nonsense started."
  },
  {
   "score": 3,
   "id": "dj4x284",
   "pid": "t1_dj4jvad",
   "date": "2017-06-19 19:54:57",
   "depth": 1,
   "text": "The characters are amazing but the plot is dumb. I dont really mind because I get to watch Zero and Mercenary interactions."
  },
  {
   "score": 8,
   "id": "dj4nhjb",
   "pid": "t1_dj4jvad",
   "date": "2017-06-19 16:28:27",
   "depth": 1,
   "text": "Same for me. Such a goood start and now here we are."
  },
  {
   "score": 13,
   "id": "dj5046h",
   "pid": "t1_dj4jvad",
   "date": "2017-06-19 21:05:59",
   "depth": 1,
   "text": "Seriously. What the fuck happened and why does some anime do this?\n\nStart off so epic-ly and then just shit the bed 3/4 the way in..."
  },
  {
   "score": 8,
   "id": "dj5807r",
   "pid": "t1_dj5046h",
   "date": "2017-06-20 01:51:46",
   "depth": 2,
   "text": "I think the reason for this case is it only adapts **one** volume of the LN, which makes things go *very* slowly."
  },
  {
   "score": 11,
   "id": "dj4ws97",
   "pid": "t1_dj4jvad",
   "date": "2017-06-19 19:49:08",
   "depth": 1,
   "text": "most people feel the same, the plot is not the strong point of the show, zero and merc is"
  },
  {
   "score": 60,
   "id": "dj4ll18",
   "pid": "t1_dj4jvad",
   "date": "2017-06-19 15:48:15",
   "depth": 1,
   "text": "I agree. At this point it seems like they are just delaying the end aswell and the story is just turning into shit bexause of it. \n\nShouldn't 13 just be able to contact the sorceres as \"Him\" tell them to blow off the attack, fix everything and we're done?!?! It wouldn't make for much of a story, but it has basically written itself into this hole where I question what is going on the entire time I watch it. \n\nPersonally I feel like mercenary and Zero deserved a show where it is just them travelling, their characters are good, but they are stuck in a shitty story."
  },
  {
   "score": 1,
   "id": "dj4tykx",
   "pid": "t1_dj4ll18",
   "date": "2017-06-19 18:48:31",
   "depth": 2,
   "text": "> Shouldn't 13 just be able to contact the sorceres as \"Him\" tell them to blow off the attack, fix everything and we're done?!?!\n\nNope. The sorcerers' primary motivation isn't coming from \"Him\". As one of the sorcerers said in this episode, everyone gathered in Sorena's name (see 6:35-6:53 of the episode).\n\n\"Him\" suddenly ordering the sorcerers to call off the attack would just cause confusion to the sorcerers and could possibly lead to more problematic situations like an uncontrollable uprising. "
  },
  {
   "score": 3,
   "id": "dj4w3g7",
   "pid": "t1_dj4tykx",
   "date": "2017-06-19 19:34:08",
   "depth": 3,
   "text": "Not of \"Him\" just told them the enemy was prepared, they were walking into a trap, or anything that just makes it a terrible idea to do it at that moment. Even just telling them the truth."
  },
  {
   "score": 3,
   "id": "dj4x5wr",
   "pid": "t1_dj4w3g7",
   "date": "2017-06-19 19:57:10",
   "depth": 4,
   "text": "That's easier said than done considering the sorcerers are blinded with their ideology. Let me try to assess the situation based on the information that we were given.\n\n> just told them the enemy was prepared\n\nOf course, they'd assume that the enemy is prepared. They're gong to a war. That's why they're preparing; sending scouts to monitor their enemies and their surroundings.\n\n> they were walking into a trap\n\nTo the eyes of these sorcerers, going to war is their only option. Remember that Albus, Sorena's only granddaughter, tried to reason out with them ***several*** times. But all of it was in vain. \n\nSuppose we say that Thirteen tries to reason out with them as \"Him\". Failing to justify the reason why they should hold off their plan will only result to more confusion among the sorcerers. This could result to the sorcerers acting independently; fueled by their ideology as their motivation.\n\n> Even just telling them the truth.\n\nI don't see that going well. \n\nTheir current task is now more viable considering they have three witches in their group (two if we assume that Zero should focus on a different matter).\n\nStalling them is possible but reasoning out with them in their current situation isn't something that's possible for now."
  },
  {
   "score": 2,
   "id": "dj4xa9w",
   "pid": "t1_dj4x5wr",
   "date": "2017-06-19 19:59:48",
   "depth": 5,
   "text": "The truth means they literally cannot win, because they will all die if they try to follow through with their plan."
  },
  {
   "score": 6,
   "id": "dj4zcco",
   "pid": "t1_dj4xa9w",
   "date": "2017-06-19 20:46:21",
   "depth": 6,
   "text": "> The truth means they literally cannot win, because they will all die if they try to follow through with their plan.\n\nLet's consider the fact that these sorcerers are *willing* to put their lives at risk just to accomplish their goal. And that includes dying.\n\nA good portion of sorcerers will probably end up in denial since the truth isn't something they can easily accept. Some may get discouraged, but there will still be a good number of sorcerers who will pursue with their plan.\n\nFrom the way I see it, one of the possible options of Zero and the group is to accomplish their plan before a war could even start. \n\nStalling them as your primary option is more viable than trying to reason out with them (considering Albus, Sorena's only granddaughter, already tried that and Thirteen trying to reason out with them would probably cause discord among the sorcerers).\n\nOn the other hand, reasoning out could be viable if Zero is the one who will lead the discussion with the sorcerers. "
  },
  {
   "score": 9,
   "id": "dj4ul3l",
   "pid": "t1_dj4ll18",
   "date": "2017-06-19 19:02:14",
   "depth": 2,
   "text": "iirc it actually does get more travely after this first arc"
  },
  {
   "score": 10,
   "id": "dj4o5zh",
   "pid": "t1_dj4ll18",
   "date": "2017-06-19 16:43:05",
   "depth": 2,
   "text": "I haven't read the novels but that's probably because they have to end the anime at a point that makes sense as an ending and the novel is still publishing. So they'd rather drag out one story than rush more I guess?"
  },
  {
   "score": 1,
   "id": "dj5xc48",
   "pid": "t1_dj4o5zh",
   "date": "2017-06-20 11:46:43",
   "depth": 3,
   "text": "Eh, I feel like they're going to do a second season, at least. There's a few subplots from the first few episodes that didn't lead anywhere yet, which weren't in the light novel."
  },
  {
   "score": 9,
   "id": "dj51mma",
   "pid": "t1_dj4o5zh",
   "date": "2017-06-19 21:47:42",
   "depth": 3,
   "text": "I think this whole season has just adapted 1 volume of the LNs so that's why the Thirteen plot has lasted so long. Honestly this is one of the times that I think an adaptation would have benefited from stuffing more volumes into a season."
  },
  {
   "score": 2,
   "id": "dj5zf7b",
   "pid": "t1_dj51mma",
   "date": "2017-06-20 12:22:48",
   "depth": 4,
   "text": "I don't know if they are similar length but meanwhile Akashic Records adapted I think 5 novels and was considered rushed. More shows need to hit the sweet spot around 2-4 like Overlord did with 3."
  },
  {
   "score": 5,
   "id": "dj5zng8",
   "pid": "t1_dj5zf7b",
   "date": "2017-06-20 12:26:47",
   "depth": 5,
   "text": "Nah Akashic Records has adapted 4 novels (1 per 3 episodes). I'm not sure that I would consider it rushed but I 100% that Overlord hit the sweet spot with 3. The [Overlord](/s \"Ainz vs Shalltear fight\") was a great way to end the season."
  },
  {
   "score": 2,
   "id": "dj60hlu",
   "pid": "t1_dj5zng8",
   "date": "2017-06-20 12:41:14",
   "depth": 6,
   "text": "I had just seen a few people saying the story went a little fast, but that is just their opinion. Whether 3 or 4 episodes per novel is better would probably depend on the story."
  },
  {
   "score": 2,
   "id": "dj6xtgh",
   "pid": "t1_dj60hlu",
   "date": "2017-06-21 01:21:14",
   "depth": 7,
   "text": "So I just finished the last episode of Akashic Records and those people were absolutely right. Damn that was a rushed episode. I didn't realize they put 5 novels into one season"
  },
  {
   "score": 10,
   "id": "dj4t7bl",
   "pid": "t1_dj4ll18",
   "date": "2017-06-19 18:31:54",
   "depth": 2,
   "text": "I would love a Spice and Wolf-esque show of Beastman and Wagahai's rambling travels"
  },
  {
   "score": 32,
   "id": "dj4w75f",
   "pid": "t1_dj4ll18",
   "date": "2017-06-19 19:36:22",
   "depth": 2,
   "text": "I think even the Mercenary is a fairly weak character, not bad, just nothing really special. If he wasn't a tiger-man I feel like he'd be rather forgettable."
  },
  {
   "score": 80,
   "id": "dj4pmnd",
   "pid": "t1_dj4jvad",
   "date": "2017-06-19 17:14:32",
   "depth": 1,
   "text": "Albus isn't even a bad character per se, but is more a victim of the plot than anything.\n\nI said it last week too, but this show would have been perfect if it had just been Zero and Merc traveling across the countryside in search of the Grimoire, dealing with the problems the Grimoire being stolen caused. Throw in Holdem much sooner and Albus isn't an insufferable third wheel, instead becoming a fun story with two witches and their Beast bodyguards.\n\nInstead we have a convoluted story with a wishy-washy, but not *terribly* written villain, and the Sorcerers of Zero who are arguably the *dumbest* group of people in the entire country. Like, they're legit 100% worthless and boring. Do any of them even have names?\n\nSuch a waste of what could have been something nearly as good as Spice and Wolf if done right."
  },
  {
   "score": 105,
   "id": "dj4jmc9",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:08:19",
   "depth": 0,
   "text": "Soooo..they BFFs now? I mean he kinda started a civil war, killed countless people and all it takes for them to take him with is \"I'm sorry\"? Wow.\n\nAlso that scene with Zero awaking was just stupidly anticlimax."
  },
  {
   "score": 5,
   "id": "dj667w0",
   "pid": "t1_dj4jmc9",
   "date": "2017-06-20 14:21:25",
   "depth": 1,
   "text": "Both Zero and Thirteen have stated at various times that witches only do what is in their own best interest / most convenient for themselves. I don't see any contradiction to that statement in their behavior.\n\n\nAs for Mercenary, he's been through enough s**t to be able to just roll with it. He is after all a mercenary, not a hero. His only task is protecting Zero, and following her orders. If Zero says they're BFFs now, then they're BFFs.\n\n\nAlso, in case someone points out Mercenary protecting Thirteen of his own volition from being killed by Zero, he did it to protect Zero herself. He knew she would regret doing it."
  },
  {
   "score": 3,
   "id": "djazz4s",
   "pid": "t1_dj667w0",
   "date": "2017-06-23 10:29:24",
   "depth": 2,
   "text": ">Also, in case someone points out Mercenary protecting Thirteen of his own volition from being killed by Zero, he did it to protect Zero herself. He knew she would regret doing it.\n\nThat may be true in the anime. He's portrayed to be a bit more noble in the light novel. His body count is way lower, and he states he avoids killing if possible."
  },
  {
   "score": 19,
   "id": "dj585g3",
   "pid": "t1_dj4jmc9",
   "date": "2017-06-20 01:58:38",
   "depth": 1,
   "text": "The same happened to the werewolf beastfallen having human slaves and now they treat him as if he was the best partner you could possibly have."
  },
  {
   "score": 11,
   "id": "dj66qma",
   "pid": "t1_dj585g3",
   "date": "2017-06-20 14:31:06",
   "depth": 2,
   "text": "That was clarified a little better in the LN. \n\n\nHe was searching for Sorena's granddaughter, so whenever he heard about a young, blonde witch, he would rush to the place thinking it might be Albus. \n\n\nOf course, it never was, but since he became Sorena's servant of his own will, and was on good terms with witches in general, he would take charge of the girls (most of whom were wrongfully accused), then let them go at a later time.\n\n\nI don't remember the LN going into any details as to exactly how far he went with the girls in the mean time, but I think it might have been implied he didn't actually do any of the things most people are imagining.\n\n\nI think it was more along the lines of what Zero did when they were trying to get into that city back then. That is, put up an act to make everyone think they're sex slaves. That tends to stop people from inquiring deeper."
  },
  {
   "score": 3,
   "id": "djazm7s",
   "pid": "t1_dj66qma",
   "date": "2017-06-23 10:23:14",
   "depth": 3,
   "text": "It was established in both sources that the girls were not witches. He had just abducted ordinary women from villages, unless I am missing something."
  },
  {
   "score": 3,
   "id": "djbz8nc",
   "pid": "t1_djazm7s",
   "date": "2017-06-23 23:31:22",
   "depth": 4,
   "text": "They were **accused** of being witches (it's enough for burning at the stake), which is in many cases how he heard about them in the first place. He then rushed over to them, because he only heard their description (often only one feature, like blonde hair), which was similar to Albus.\n\n\nThen, since he was already there, he took them with him. Villagers aren't going to argue too much with a Beastfallen, and they are known for hunting witches as well.\n\n\nAfter taking them somewhere far away, he would let them go."
  },
  {
   "score": 5,
   "id": "dje3jrk",
   "pid": "t1_djbz8nc",
   "date": "2017-06-25 14:02:19",
   "depth": 5,
   "text": "I have a question, and it's a sincere one, not to sound like an asshole. Is this your headcanon, or is it supported in the novel? I'll first admit that I haven't read all the way through the first volume, but I haven't seen anything that supports your statement. \n\nThe implication by both the novel and the anime, as different as they are, is that he's keeping the girls hostage because he's a pervert, and that he is making up the story of them being (or accused of being) witches in order to avoid suspicion. It is strongly denied that there is any truth to either possibility.\n\nMaybe you're right, and this gets explained later on, but the author isn't getting that point across. In fact, the author seems to punish his antics by reducing him to a comic relief character in the novel, which seems to have been lost in the anime."
  },
  {
   "score": 3,
   "id": "dje59nh",
   "pid": "t1_dje3jrk",
   "date": "2017-06-25 14:41:38",
   "depth": 6,
   "text": "You know, I just quickly looked for the part where it is first mentioned (just after Mercenary leaves Zero and gets ambushed), and it only says how he got them handed over (the girls we saw him with back then) and was going to let them go eventually.\n\n\nI don't remember when, or if, it's brought up again, and don't want to read those last 3 chapters again. So, let's just say it's my headcannon.\n\n\nI could have sworn it was explained in more detail, but it has been a while since I read it. Oh well. Sorry for the mess."
  },
  {
   "score": 2,
   "id": "djefq7v",
   "pid": "t1_dje59nh",
   "date": "2017-06-25 19:01:11",
   "depth": 7,
   "text": "Damn, I was hoping I was wrong!"
  },
  {
   "score": 25,
   "id": "dj515bs",
   "pid": "t1_dj4jmc9",
   "date": "2017-06-19 21:34:06",
   "depth": 1,
   "text": "I think it was meant to be taken as a joke obviously- as the sad music playing, the flashback and everything are tropes in an anime when a significant character dies. I legit thought she may have died or be out for the rest of the episode or more. The abrupt cut on the music and her jumping up got me."
  },
  {
   "score": 68,
   "id": "dj4llla",
   "pid": "t1_dj4jmc9",
   "date": "2017-06-19 15:48:33",
   "depth": 1,
   "text": "He is still stupidly powerful, second only to Zero. Even if he's an amoral jerk, he's still of much use."
  },
  {
   "score": 51,
   "id": "dj4mn75",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 16:10:28",
   "depth": 0,
   "text": "I have to admit, I'm mostly here for the characters. And I will admit, Albus has gotten slightly better. However, the plot seems to be exacerbated by convenient idiocy by way of the Sorcerers of Zero. This was a problem I also had with last week's episode, but I guess it's the usual trope of not killing an enemy until it's too late."
  },
  {
   "score": 17,
   "id": "dj4pt9c",
   "pid": "t1_dj4mn75",
   "date": "2017-06-19 17:18:25",
   "depth": 1,
   "text": "If they had brought Holdem in right after Albus and just turned it into the four of them traveling the land searching for the missing Grimoire, helping out people along the way, it would have been *amazing*. Just two witches and their bodyguards. It also would have made Albus much better, since she'd have Holdem to play off of while Zero has Merc."
  },
  {
   "score": 2,
   "id": "dj5ofhc",
   "pid": "t1_dj4pt9c",
   "date": "2017-06-20 09:13:31",
   "depth": 2,
   "text": "Quick. Make that a fanfic or have someone make that into a fanfic! I'd eagerly read that!"
  },
  {
   "score": 56,
   "id": "dj4kg3x",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:24:59",
   "depth": 0,
   "text": "So Thirteen switches sides like that despite everything he did?\n\n[That was fast](#kyonfacepalm)\n\nAnd while I got a good chuckle over Zero being alright despite being blasted, pulling a subversion like that in the middle of the scene felt too *oh look we're not following the typical recovery pattern* route.\n\nAnyway f-ing Amazon being late as usual. At least give a damn notice about production issues like CR if you're gonna be late. Hell even fansub groups do a better job at telling people about release times than them."
  },
  {
   "score": 1,
   "id": "dj5gayq",
   "pid": "t1_dj4kg3x",
   "date": "2017-06-20 06:40:21",
   "depth": 1,
   "text": "It's because he did nothing wrong! ^probably."
  },
  {
   "score": 4,
   "id": "dj4zok2",
   "pid": "t1_dj4kg3x",
   "date": "2017-06-19 20:54:51",
   "depth": 1,
   "text": "Wasn't the whole point that he was on no ones side. I mean isn't one of the major themes of this anime the danger of people picking polarizing sides."
  },
  {
   "score": 9,
   "id": "dj4pq1h",
   "pid": "t1_dj4kg3x",
   "date": "2017-06-19 17:16:33",
   "depth": 1,
   "text": "Thirteen is such a wishy-washy villain. He's not an evil guy, which is great for an antagonist, but the story is just *bad* and he suffers because of it.\n\nThis show has been pretty disappointing ever since they got to the town Thirteen destroyed, honestly. The Sorcerers of Zero are fucking idiots."
  },
  {
   "score": 35,
   "id": "dj4prv1",
   "pid": "t1_dj4kg3x",
   "date": "2017-06-19 17:17:36",
   "depth": 1,
   "text": "People have been calling out that 13's motivations aren't evil for a while now. His switching sides was unexpected, but not surprising."
  },
  {
   "score": 1,
   "id": "dj5c28k",
   "pid": "t1_dj4prv1",
   "date": "2017-06-20 04:46:09",
   "depth": 2,
   "text": "It was a surprise but a welcome one."
  },
  {
   "score": 4,
   "id": "dj4whgt",
   "pid": "t1_dj4prv1",
   "date": "2017-06-19 19:42:37",
   "depth": 2,
   "text": "The way he goes after his goal ARE pretty evil though. He was going to burn Albus alive, remember?"
  },
  {
   "score": 5,
   "id": "dj57zgy",
   "pid": "t1_dj4whgt",
   "date": "2017-06-20 01:50:45",
   "depth": 3,
   "text": "He's not the one who decided that witches should be burned at the stake.  He's only applying the law, after giving Albus a chance to redeem herself. Which is more neutral than evil.\n\nNow, we could mention all the no-name witches in the cave and in the village. But what measure is a background character ?"
  },
  {
   "score": 21,
   "id": "dj4wvyq",
   "pid": "t1_dj4whgt",
   "date": "2017-06-19 19:51:19",
   "depth": 3,
   "text": "He *did* give her many chances to save herself. It required her to join him in \"hunting down\" the Sorcerer's of Zero, but he knew they were all doomed anyway since they literally could not harm him. \n\nIt makes him more of a prick than anything else since he didn't *actually* need her help, but he was genuinely trying to give her an out in his own warped way since \"the plan\" required the deaths of all of his cultists."
  },
  {
   "score": 10,
   "id": "dj4x47m",
   "pid": "t1_dj4wvyq",
   "date": "2017-06-19 19:56:08",
   "depth": 4,
   "text": "Yes, a choice between 1)\"Help me kill the rest of your family that I haven't murdered yet\" or 2)\"Burn in a stake in the middle of town\".\n\nHow nice of him..."
  },
  {
   "score": 17,
   "id": "dj4xfcn",
   "pid": "t1_dj4x47m",
   "date": "2017-06-19 20:02:52",
   "depth": 5,
   "text": "Like I said, he's a massive prick. But an *evil* massive prick would have executed her with no remorse.\n\nAs the \"Sorcerer of the State\" in his plan to justly stand against the \"evil\" witches, he cannot suffer a witch to live. So the only way to let Albus live while preserving the sanctity of the all important \"plan\" was to let her \"join\" him as one of the \"good\" magic users serving the state. And then hunt down all her friends and family. Which she refused. Did I mention he's a massive prick? \n\nBut keep in mind there was no reason for him to try and spare her at all in regards to his \"plan.\""
  },
  {
   "score": 5,
   "id": "dj5pcox",
   "pid": "t1_dj4xfcn",
   "date": "2017-06-20 09:29:32",
   "depth": 6,
   "text": "> But an evil massive prick would have executed her with no remorse.\n\nI think we have different definitions of evil then. In my books if you burn people alive for not following you in killing their friends and family, you're pretty much evil."
  },
  {
   "score": 5,
   "id": "dj67xlq",
   "pid": "t1_dj5pcox",
   "date": "2017-06-20 14:53:56",
   "depth": 7,
   "text": "It's the kingdom that burns witches alive, and has long before Thirteen arrived. Thirteen simply now works for the kingdom as their \"Sorcerer of the State,\" and as a result must burn witches who suddenly show up in the capital. And of course, being the Sorcerer of the State is (was?) vital for \"the plan.\"\n\nNow whether the kingdom is evil or not is also muddy because humans and witches are at de facto war, rather than this being a classic Salem Witch Hunt or similar to the Inquisitions."
  },
  {
   "score": 78,
   "id": "dj4oz6h",
   "pid": "t1_dj4kg3x",
   "date": "2017-06-19 17:00:47",
   "depth": 1,
   "text": "> So Thirteen switches sides like that despite everything he did?\n\nHe was always on Zero's side though, in just a kinda warped way. "
  },
  {
   "score": 38,
   "id": "dj51gyk",
   "pid": "t1_dj4oz6h",
   "date": "2017-06-19 21:43:10",
   "depth": 2,
   "text": "I think that this is lost on a *lot* of people"
  },
  {
   "score": 12,
   "id": "dj80988",
   "pid": "t1_dj51gyk",
   "date": "2017-06-21 15:24:19",
   "depth": 3,
   "text": "Yeah. All his current actions make total sense.\n\nHe distances himself from Zero to go accomplish his interpretation of her dream. She later calls him out on his bullshit, and tells him what she REALLY wants, and he's all \"oh shit i fucked up. uh ok, lets go with your plan instead.\""
  },
  {
   "score": 22,
   "id": "dj4k296",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:17:06",
   "depth": 0,
   "text": "Kinda funny how Zero was there out cold and the music being all emotional, and suddenly she wakes up and everything is fine :P\n\nI must give it to her though, if what the subs told was right, her having the more powerful spells for her alone is a pretty smart way to overpower anyone who is using the book against her.\n\nNow I must ask, since this is what is feeling like this is coming to: to the LN readers, this anime is going for an anime original ending right? it truly feels that way, since I don't see how, in the LN, she destroys the book but still there is around 9 volumes left of story."
  },
  {
   "score": 10,
   "id": "dj4nqqt",
   "pid": "t1_dj4k296",
   "date": "2017-06-19 16:34:01",
   "depth": 1,
   "text": ">it truly feels that way, since I don't see how, in the LN, she destroys the book but still there is around 9 volumes left of story.\n\nThey go around the world preaching about best girl Zero. That's pretty much it (I haven't read the LNs)."
  },
  {
   "score": 6,
   "id": "dj4qde5",
   "pid": "t1_dj4nqqt",
   "date": "2017-06-19 17:30:35",
   "depth": 2,
   "text": "Ha! :p 13 is doing the talking and Mercenary is just carrying her, all while Zero pulls bodybuilding poses."
  },
  {
   "score": 2,
   "id": "dj59r11",
   "pid": "t1_dj4qde5",
   "date": "2017-06-20 03:15:28",
   "depth": 3,
   "text": "I would seriously watch that."
  },
  {
   "score": 17,
   "id": "dj4wb1b",
   "pid": "t1_dj4k296",
   "date": "2017-06-19 19:38:42",
   "depth": 1,
   "text": "> I must give it to her though, if what the subs told was right, her having the more powerful spells for her alone is a pretty smart way to overpower anyone who is using the book against her.\n\nI mean, she could just have not written a \"call souls from hell to fucking murder a dude\" spell in the same book as the spell \"get fish\"..."
  },
  {
   "score": 6,
   "id": "dj4yu8g",
   "pid": "t1_dj4wb1b",
   "date": "2017-06-19 20:33:58",
   "depth": 2,
   "text": "It certainly makes one wonder: What the heck was Zero thinking when she was writting the book \"so it could help everybody and ease their lives\"? I truly wonder how invocating the souls of hell to kill a dude would fit right there... but it could very well be there to fend off beasts that are too large for swords and arrows to do a thing to them... especially if those beasts can fly.\n\nAlthough it could very well be her researcher side that overcame her and so she felt the need to put everything there. At least she was smart to put a lot of little things that would make the book useless against her."
  },
  {
   "score": 6,
   "id": "dj5jto2",
   "pid": "t1_dj4yu8g",
   "date": "2017-06-20 07:51:44",
   "depth": 3,
   "text": "Knowing how she thinks, I think those were meant for self-defence (which *is* kind of an important aspect). It's not like beginners can blast those complicated spells right off the bat, and by the time a sorcerer reaches their level, it could be well expected that they have also learnt a thing or two about self-restraint as well."
  },
  {
   "score": 1,
   "id": "dj5llf7",
   "pid": "t1_dj5jto2",
   "date": "2017-06-20 08:24:03",
   "depth": 4,
   "text": "Yeah, I was thinking something around that as well, though we would need to know what the heck defines the magic capacity of people to see if we could truly see a witch that is pretty young blasting those high level spells \"just because he/she was born with that capacity\"."
  },
  {
   "score": 3,
   "id": "dj5mfcd",
   "pid": "t1_dj5llf7",
   "date": "2017-06-20 08:38:33",
   "depth": 5,
   "text": "I doubt she's pretty young. She had the time to come up with a whole new system of magic (even 13 learnt from her!), compiled all of that knowledge into a tome. Those things don't happen overnight, especially when one considers how her magic came to be: summoning every single damn demon and replicating their abilities. With how troublesome summoning magic is, it must have decades or more... and she had to trial-and-error the whole thing at the beginning, as she was the first person to successfully pull all that off.\n\nI think 0 and 13 both have some magic that prevents them from ageing."
  },
  {
   "score": 1,
   "id": "dj5rtdk",
   "pid": "t1_dj5mfcd",
   "date": "2017-06-20 10:11:58",
   "depth": 6,
   "text": "I agree with what you say, but I was thinking more on other thing:\n\nYou mentioned that someone who would get to the spells that summons souls from hell in the book of Zero would be pretty... advanced, and had learned one thing or two of restrain by then, but I was wondering on exactly what defines magic capacity, that one that allows a person to use magic, in the context of the show, since if it where to work as it does in other works of fiction, then there could be persons that just are born with a high magic capacity and could theoretically perform the most advanced spells at a young age. It is something pretty interesting to ponder."
  },
  {
   "score": 2,
   "id": "dj5wbdd",
   "pid": "t1_dj5rtdk",
   "date": "2017-06-20 11:29:06",
   "depth": 7,
   "text": "Thing is, doing magic *properly* in that setting is difficult, and even if there's talent involved there's a heck lot of self-control required. For example: on one hand, emotions determine how effective one can be in a \"book\" of magic (as Zero explained to Albus), but the same emotions can cloud one's mind and affect intelligence, rendering magic weaker (as 13 explained to the merc). It's an interesting duality, and it seems to require extreme self-control of a sorcerer. That doesn't come easy, and I doubt anyone just has it from birth!"
  },
  {
   "score": 1,
   "id": "dj670dn",
   "pid": "t1_dj5wbdd",
   "date": "2017-06-20 14:36:22",
   "depth": 8,
   "text": "It could be, but maybe the thing is that one emotion disables someone from performing magic from one book but boosts your skill with another one. It is pretty interesting to think off, it is not entirely clear how exactly it works."
  },
  {
   "score": 14,
   "id": "dj4kh8n",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:25:36",
   "depth": 0,
   "text": "[D'aw, mini-Zero](http://i.imgur.com/v6DvxAP.jpg)\n\n[HAH, I guffawed](http://i.imgur.com/LlbS1yM.jpg)\n\n[Shit, you guys shoulda told him that a long time ago then](http://i.imgur.com/7xSEtuB.jpg)\n\n[Thirteen is a spy agency and those chokers are cell phones](http://i.imgur.com/8Jkso4p.jpg)"
  },
  {
   "score": 3,
   "id": "dj4raam",
   "pid": "t1_dj4kh8n",
   "date": "2017-06-19 17:50:33",
   "depth": 1,
   "text": "Loli Zero was super cute.\n\nAlso, when she got up I let out a small laugh.\n\nI can't say the plot went the direction I wanted, but I like learning about the backstory of Thirteen and Zero."
  },
  {
   "score": 21,
   "id": "dj4pv8x",
   "pid": "t1_dj4kh8n",
   "date": "2017-06-19 17:19:38",
   "depth": 1,
   "text": "\"So you see, when you started your iPhone for the first time you signed a blood contract with the NSA. Now if you use encryption, you will vanish.\""
  },
  {
   "score": 8,
   "id": "dj4qk44",
   "pid": "t1_dj4pv8x",
   "date": "2017-06-19 17:34:37",
   "depth": 2,
   "text": "Sounds plausible, nobody reads the EULA"
  },
  {
   "score": 28,
   "id": "dj4k9r4",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:21:23",
   "depth": 0,
   "text": "#And people still try to defend Amazon.  \n\n[](#yousaidsomethingdumb)\n\nA lot happened this ep but it was a lot of interesting happenings.  \n\nI have a feeling that this is just a situation where Thirteen was trying to prove he was beter and do something he thought would impress Zero, but then she wasnt and was really pissed at him, so he decided to stop.  It seems he has some heavy attachments to her if he started everything for her and ended it at the drop of a hat for her.  \n\nIll be curious to see how it all ends though.  I wonder if... remove magic from the kingdom... will remove the beastman curse too... hmmmmmmmm  \n\nUntil next week!  "
  },
  {
   "score": 1,
   "id": "dj5ngeh",
   "pid": "t1_dj4k9r4",
   "date": "2017-06-20 08:56:27",
   "depth": 1,
   "text": "> And people still try to defend Amazon.\n\nI would blame Sentai since they are the ones with the license and subbing this."
  },
  {
   "score": 21,
   "id": "dj4pojl",
   "pid": "t1_dj4k9r4",
   "date": "2017-06-19 17:15:41",
   "depth": 1,
   "text": "I still defend Amazon for several reasons:\n\n1. They're still new to airing Anime. At least they're doing it, unlike Netflix.\n2. They responded reasonably fast to my report about missing subtitles in the Nanoha shows.\n3. I don't see any major voices in the Anime community organizing any sort of reasonable campaign, so maybe It hasn't reached the ears of the people at Amazon with the power to make decisions.\n4. Amazon has some of the best infrastructure already in place for streaming services. With some fixes to their subtitles, and an expanded library, and easier search methods, and removal of the double paywall, they will be by far the best service for anime out there. But the only way they'll make those changes is if it seems profitable.\n5. Competition is ultimately good for the consumer, even if it's inconvenient to pay for multiple services.\n\nActually, you know what, I'm going to set up the social media campaign this week and post it here this Saturday. If people want Amazon to change, then they need to make their voice heard, instead of whining on discussion threads that will never be seen by the suits at Amazon."
  },
  {
   "score": 26,
   "id": "dj4u1vq",
   "pid": "t1_dj4pojl",
   "date": "2017-06-19 18:50:34",
   "depth": 2,
   "text": "> Competition is ultimately good for the consumer, even if it's inconvenient to pay for multiple services.\n\nRight, that's the problem. It's not competition. It would be competition if they all had the same shows. The existence of exclusives means amazon can be as bad as they want so long as they pick good exclusives.\n\nThe \"competition\" here is between illegal services and paid services, and really none of the paid services are stepping up to the plate. Amazon's whole service is borderline unusable, and crunchyroll's video player is *terrible* despite theoretically having great quality."
  },
  {
   "score": 1,
   "id": "dj576rz",
   "pid": "t1_dj4u1vq",
   "date": "2017-06-20 01:13:41",
   "depth": 3,
   "text": "They compete against others, bidding for the sole rights to stream shows"
  },
  {
   "score": 7,
   "id": "dj5nn0v",
   "pid": "t1_dj576rz",
   "date": "2017-06-20 08:59:34",
   "depth": 4,
   "text": "Instead of competing to provide a better service. Which is the problem."
  },
  {
   "score": 1,
   "id": "dj5udgu",
   "pid": "t1_dj5nn0v",
   "date": "2017-06-20 10:55:53",
   "depth": 5,
   "text": "They do try to increase view count, by bidding on popular shows and by releasing them conveniently with an adequate service and quality. If they don't provide the quality, they will not get as many views, thus not generating enough revenue to offset the bidding cost. What you said earlier is not how businesses work, how licensing works. For instance, selling Harry Potter in the east will not generate good revenue if the quality is bad. Thus it is in the interest of the publishers to provide a good translation.  \n  \nThere is nothing to worry about currently. "
  },
  {
   "score": 2,
   "id": "dj7p3h1",
   "pid": "t1_dj5udgu",
   "date": "2017-06-21 12:05:28",
   "depth": 6,
   "text": "Then explain the current quality. I agree with you that's how it should work in theory, but in practice they aren't stepping up to the plate."
  },
  {
   "score": 1,
   "id": "dj7qkrf",
   "pid": "t1_dj7p3h1",
   "date": "2017-06-21 12:30:38",
   "depth": 7,
   "text": "There's nothing to explain. First of all, your original statement was that the services do not compete against eachother. That is wrong, and is akin to saying Samsung and Apple don't compete because they have different products. Streaming services compete in providing streaming entertainment, and anime also competes against normal 3D shows.  \n  \nSecondly, quality is adequate to receive views. It obviously generates money, even if some fansubbers do a better job. Even if Amazon provided good and professional translations, you could still say \"explain the quality, because Asenshi colored their subs depending on what is being said\". Also, competition takes time. Iphone (original) took much time before the first real comparable competitor arrived, that could also take a significant market share. It took time, but it happened. Over time Amazon, CR, Netflix, FM and others may realize that they can further improve to increase views. At a certain point, improving quality will just cost more without adding significant revenue (for extreme example, when quality is best, improvements will not add views). Finding balance for these companies will take time, but it will happen. \n  \nLegal anime in the west will compete and keep improving, eventually getting more market shares and improving the market in Japan by paying for licensing. There is nothing major to worry about at this moment, and small things like honorifics or sub fonts can be affected by complaining on their official forums.  \n  \nAs an aside, anime is special as a streamed entertainment. There are (economic) whales that will spend thousands for stuff like merchandise and blu-ray. These diehard fans will not settle for bad quality. Companies will have to up their quality to milk these whales, similar to how some niche anime are made with extreme care and quality in Japan (mostly SoL), despite having low view count."
  },
  {
   "score": 2,
   "id": "dj54x77",
   "pid": "t1_dj4u1vq",
   "date": "2017-06-19 23:38:20",
   "depth": 3,
   "text": "> The existence of exclusives means Amazon can be as bad as they want so long as they pick good exclusives.\n\nHowever, that doesn't solve the piracy issue. I don't pirate because I'm at a point in life where I can afford to pay & I feel better doing so but I'm in the minority when it comes to not wanting to pirate."
  },
  {
   "score": 3,
   "id": "dj5nrg3",
   "pid": "t1_dj54x77",
   "date": "2017-06-20 09:01:46",
   "depth": 4,
   "text": "Exactly. Solving the piracy issue requires reasonable pricing and an acceptable user experience. I would say of those two things, the major services right now have 0.5 of them. Half-decent pricing, but they all have WORSE user experiences than free illegal streaming sites. They can't win against piracy if the free product is better than the paid product."
  },
  {
   "score": 34,
   "id": "dj4l8oa",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:41:15",
   "depth": 0,
   "text": "That part where the dramatic music just suddenly stops as Zero gets up from her injury got me. It was so unexpected I actually laughed.\n\nAlthough I'm really irked on how nice Merc is. Did he really have to protect the guy that has caused all this shit? :ike don't forget all the horrible things Thirteen did. I want to see some sort of punishment. :|"
  },
  {
   "score": 14,
   "id": "dj4o25e",
   "pid": "t1_dj4l8oa",
   "date": "2017-06-19 16:40:49",
   "depth": 1,
   "text": "I think he didn't expect Thirteen to survive that and thought Zero might regret killing him."
  },
  {
   "score": 5,
   "id": "dj80e9l",
   "pid": "t1_dj4o25e",
   "date": "2017-06-21 15:27:06",
   "depth": 2,
   "text": "If Thirteen died, then everyone under the blood contract would die too. Merc stopped her because she couldn't control the spell and would've killed him, thus killing the Sorcerers of Zero."
  },
  {
   "score": 1,
   "id": "dj80p2x",
   "pid": "t1_dj80e9l",
   "date": "2017-06-21 15:33:10",
   "depth": 3,
   "text": "I probably missed that, or forgot completely.  \nIt's just not holding much of my attention, other than the (not serious) interaction between Zero and Mercenary."
  },
  {
   "score": 14,
   "id": "dj4x9bj",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 19:59:13",
   "depth": 0,
   "text": "What kind of amateur translated this episode? They mistranslated the following:\n\nAmazon TL:\n\n> Thirteen: It seems like Sorena's granddaughter is about to be killed.\n\n> Zero: No excuses!\n\nWhat it should be:\n\n> Thirteen: This Sorena's descendent that you speak of, she's about to be killed, is that alright?\n\n> Zero: Of course it's not alright!\n\nThirteen's line is more about retaining manner of speech, so I'm ok with what they did, but Zero's line is completely wrong! They're both iiwake, but there's no excuse for getting it wrong in that context. There's also a bunch of other bad translations all over the episode. Just terrible."
  },
  {
   "score": 13,
   "id": "dj538ps",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 22:37:47",
   "depth": 0,
   "text": "It's kind of funny how at the start of this show it made the Holy Crusade knights or whatever seem like a bunch of savages ruthlessly murdering all of the witches for no reason (kinda like the real crusades). But now it truly seems like the Sorcerers of Zero are just a bunch of annoying pests and the kingdom is trying to just keep the peace."
  },
  {
   "score": 4,
   "id": "dj5c0l4",
   "pid": "t1_dj538ps",
   "date": "2017-06-20 04:44:36",
   "depth": 1,
   "text": "Man just let thirteen kill those Sorcerers of Zero. Those who aren't all that bad won't attack him in the first place."
  },
  {
   "score": 13,
   "id": "dj586sl",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 02:00:21",
   "depth": 0,
   "text": "[Zero stitch this episode, taken from /a/](http://i.imgur.com/forLwPs.jpg)"
  },
  {
   "score": 56,
   "id": "dj4jv34",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:13:12",
   "depth": 0,
   "text": "So Thirteen is not bad just misunderstood, i mean genocide, starting a civil war, trying  to kill one of the heirs of one of the good witches is just his way of showing affection and care for Zero.\nOh well if you happen to meet Hitler in the street let him know that I get his motives and i forgive him "
  },
  {
   "score": 36,
   "id": "dj4ltac",
   "pid": "t1_dj4jv34",
   "date": "2017-06-19 15:53:00",
   "depth": 1,
   "text": "Thing is, the civil war would have happened even without him. He manipulated both sides for sure, but it's not like he created the underlying issue himself - people hated witches and witches hated people back even before his arrival on the stage. Not this absolves him, but blaming the whole mess on him is equally wrong."
  },
  {
   "score": 5,
   "id": "dj4w66c",
   "pid": "t1_dj4ltac",
   "date": "2017-06-19 19:35:48",
   "depth": 2,
   "text": "He did murder an entire village of Zero's sorcerers though. For pretty much no reason.\n\n"
  },
  {
   "score": 15,
   "id": "dj4x4pp",
   "pid": "t1_dj4w66c",
   "date": "2017-06-19 19:56:27",
   "depth": 3,
   "text": "Technically they murdered themselves by trying to attack him. I guess the question is who shot first?\n\nAnd it wasn't really for no reason. I'm pretty sure he was \"stealing\" the grimoire from them and they all died \"defending\" it."
  },
  {
   "score": 7,
   "id": "dj4xcx0",
   "pid": "t1_dj4x4pp",
   "date": "2017-06-19 20:01:24",
   "depth": 4,
   "text": "If they attack him they just disappear, but many of the villagers were incinerated and some guy got his face fused to a rock"
  },
  {
   "score": -1,
   "id": "dj4xn4u",
   "pid": "t1_dj4xcx0",
   "date": "2017-06-19 20:07:36",
   "depth": 5,
   "text": "\"Thirteen shot first\" it is, then. I guess considering his endgame was for all of them to die anyway, he didn't consider it important whether they die then or in a few days."
  },
  {
   "score": 10,
   "id": "dj51znc",
   "pid": "t1_dj4xcx0",
   "date": "2017-06-19 21:58:21",
   "depth": 5,
   "text": "Those deaths were from the battle with the rogue mages. After the Zeros and Rogues duked it out, then Thirteen came and cleaned up. The only ones he killed were the ones \"drained of magic\" which might be how the blood contract kills them."
  },
  {
   "score": 3,
   "id": "dj523q0",
   "pid": "t1_dj51znc",
   "date": "2017-06-19 22:01:50",
   "depth": 6,
   "text": "No, the contract \"disappears\" them, the others were just murdered. Fuck, the flashback shows him doing it"
  },
  {
   "score": 37,
   "id": "dj4lt6q",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:52:57",
   "depth": 0,
   "text": "i have to say this show has become a disappointment to me :( \n\nthe first couple of episodes are really enjoyable but then the story becomes nothing, no impact at all (could be that im spoiled by the great shows in this season).\n\n last episode they hate each other and then in the next one they become friends over one conversation, come on"
  },
  {
   "score": 7,
   "id": "dj4x8j3",
   "pid": "t1_dj4lt6q",
   "date": "2017-06-19 19:58:45",
   "depth": 1,
   "text": "Not to mention that if 13 really wants to \"grant the city to zero\" and in the end he figures out that \"it's not what she wants\", isn't better to tell her beforehand instead of force your desire on others? Not to mention Zero already said she didn't like what 13 was doing in previous episode, why after a \"Fight\"(a bad one I must say) you have to give up and be friends? This is unbelievably bad.\n\nLike I said in other discussion threads of this show, high expectation that turned out into a mediocre show with no high points whatsoever. The \"Action\" tag is misleading at best, the two most powerful magic users on the show decided the plot with a mirror match, disgusting!"
  },
  {
   "score": 1,
   "id": "dj5hs9n",
   "pid": "t1_dj4x8j3",
   "date": "2017-06-20 07:12:09",
   "depth": 2,
   "text": "lmao yeah there is almost no action in this series at all compare to other anime\n\nThe plot is really bad im not sure if thats because of bad adaptation or bad source material :("
  },
  {
   "score": 14,
   "id": "dj55lhl",
   "pid": "t1_dj4x8j3",
   "date": "2017-06-20 00:04:26",
   "depth": 2,
   "text": "> Not to mention that if 13 really wants to \"grant the city to zero\" and in the end he figures out that \"it's not what she wants\", isn't better to tell her beforehand instead of force your desire on others?\n\nFor the longest time, 13 thought he had to follow through with his duty of raising Zero. He's like a helicopter parent who can't trust his child to think on her own. He trusts only his own judgement.\n\n> why after a \"Fight\"(a bad one I must say) you have to give up and be friends?\n\n13 was outwitted and overpowered in that \"fight\", proving him that he was wrong. Most especially, this means to him, Zero has \"grown up\". Watching the figure of Zero being carried off by the Mercenary (as 13 had used to) reinforced that thought. At that point, 13 was able to let go.\n\nJust my 2 cents"
  },
  {
   "score": 11,
   "id": "dj4wsow",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 19:49:25",
   "depth": 0,
   "text": "Huh, the magic had [spellcheck](http://imgur.com/gallery/dgDZDqC)"
  },
  {
   "score": 16,
   "id": "dj4koe7",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:29:37",
   "depth": 0,
   "text": "This feels like one of those anime-only divergences where they need to provide an ending for the series. Does anyone know if the manga proceeded in the same way?"
  },
  {
   "score": 5,
   "id": "dj4wphd",
   "pid": "t1_dj4koe7",
   "date": "2017-06-19 19:47:30",
   "depth": 1,
   "text": "I want to know this, too."
  },
  {
   "score": 6,
   "id": "dj513gs",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 21:32:37",
   "depth": 0,
   "text": "...WHO THE HELL IS THE ANTAGONIST?! *thoughts in my head after watching this anime*\n\n...honestly this is an amazing anime- the plot is great imo as Thirteen is honestly not an \"evil\" person it seems but, simply misguided and goes about his goals in a way that causes him to be portrayed as evil. I can't think of too many anime (none off the top of my head) where I truly felt the big bad be a good guy in the villain shoes."
  },
  {
   "score": 1,
   "id": "dj80hp7",
   "pid": "t1_dj513gs",
   "date": "2017-06-21 15:29:01",
   "depth": 1,
   "text": "There is no antagonist. Just misguided motives."
  },
  {
   "score": 4,
   "id": "dj54lui",
   "pid": "t1_dj513gs",
   "date": "2017-06-19 23:26:08",
   "depth": 1,
   "text": "The antagonist has always been fear of the unknown. Thirteen was just trying to solve it in the only way his supremely logical mind knew how to: get all the power in his hands so he can give it to Zero.\n\nIt's a dick move, but it would have worked had Zero not intervened."
  },
  {
   "score": 10,
   "id": "dj521po",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 22:00:07",
   "depth": 0,
   "text": "[Gotta love when anime just titles the last episode the name of the show](http://i.imgur.com/4HfomHl.png)\n\nAny chance the plot is wrapped up in the first five minutes and the rest of the time we get Zero and Mercenary shenanigans? \n\n[](#elsiesigh \"I guess not\")\n"
  },
  {
   "score": 4,
   "id": "dj4lc8g",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 15:43:16",
   "depth": 0,
   "text": "Damn the punch Holdem gave Thirteen looked very painful."
  },
  {
   "score": 5,
   "id": "dj4q6nj",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 17:26:31",
   "depth": 0,
   "text": "Was really enjoying this series but these past couple episodes have just had the plot meander around and really souring it for me.\n\nIts like they have zero idea what they want to do with Thirteen and the Sorcerors of Zero"
  },
  {
   "score": 4,
   "id": "dj557ee",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 23:49:10",
   "depth": 0,
   "text": "Perhaps my favorite part of this anime is how it very purposely makes the antagonists more \"grey\" characters with believable intentions behind their motives without anyone being exclusively \"evil\"."
  },
  {
   "score": 9,
   "id": "dj5e4sf",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 05:47:38",
   "depth": 0,
   "text": "I'm not actually as disappointed as most here. \n\nThirteen explains every single thing thrown at him without any hesitation, no matter how good or bad it is. He doesn't know (or care?) about the emotions of others. He for himself has good reason why he should go with the group. \n\nI found this pretty surprising and i don't think i have seen this kind of turn around for a supposedly ''bad'' character in like how long? It makes sense though."
  },
  {
   "score": 2,
   "id": "djc32qq",
   "pid": "t1_dj5e4sf",
   "date": "2017-06-24 02:21:20",
   "depth": 1,
   "text": "I think you hit the nail on the head when you said he doesn't know or care about emotions.\n\nHe did everything according to a plan without taking in consideration how it would make others feel, he only aimed for the end goal of taking care of the witch problem."
  },
  {
   "score": 3,
   "id": "dj4tjr2",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 18:39:33",
   "depth": 0,
   "text": "thirteen's eyes at the end of this episode arent lifeless anymore"
  },
  {
   "score": 3,
   "id": "dj4rg2n",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 17:54:02",
   "depth": 0,
   "text": "Oh... I see where this is going.\n\nZero is going to end up leading the sorcerers of zero in some sort of ironic twist of fate.\n\nI mean, in this episode the sorcerers said they need a leader and just because \"he\" is Sorena's granddaughter doesn't cut it, that they need someone with decisveness, like Thirteen, but then Thirteen is an asshole who honestly couldn't care less for the sorcerers and is only in it for Zero... so he's going to bail.\n\nNotice how the sorceres of zero love 13 because he was the one who gave them magic? Imagine what they are going to do when they find the one who made magic in first place!\n\nWhich means that Zero is probably going to become the leader of the sorcerers.\n\nI just want to note how fucking retarded it is for sorcerers of ZERO not noticed THIRTEEN is another goddamn number. One'd think that somebody could realize this obvious relationship, but noooooo."
  },
  {
   "score": 4,
   "id": "dj4mgew",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 16:06:22",
   "depth": 0,
   "text": "hmm seems like this anime is going down the shit drain, but is this just a bad adaption? or is the novel worth it to read, I am kind of interested in reading the novel, can someone who has read give me some idea of if the novel is worth reading?"
  },
  {
   "score": 4,
   "id": "dj4q14e",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 17:23:10",
   "depth": 0,
   "text": "I'm gonna have to do a big write-up when this series is finished, assuming Amazon doesn't get worse and forget to release it entirely.\n\nBut man, talk about a show losing it's way. I haven't been this disappointed with how an anime progressed since I think Kabaneri. We could have had an entire premise of Zero, Merc, Albus, and Holdem just wandering the countryside in search of the Grimoire, and it would have been *amazing*. The characters are good, even Albus when Holdem is there to play off of, and I loved Zero and Merc's relationship.\n\nInstead we have a boring plot that progresses only because the Sorcerers of Zero are complete morons.\n\nI can't really blame the anime though, since I assume it's just following the LN for the most part."
  },
  {
   "score": 3,
   "id": "dj4sylw",
   "pid": "t1_dj4q14e",
   "date": "2017-06-19 18:26:35",
   "depth": 1,
   "text": "For me Kabaneri had a higher high, but also a lower low.\n\nI thought the show was pretty slow for the most part and didn't start actually liking it until maybe 3 or so episodes before this one. But yeah it looks like this is just going to end up with a meh ending."
  },
  {
   "score": 2,
   "id": "dj51raz",
   "pid": "t1_dj4sylw",
   "date": "2017-06-19 21:51:30",
   "depth": 2,
   "text": "Yeah as much as I hate Kabaneri I think its first 4 episodes blow this entire show out of the water. After this show is over I'm probably gonna forget all about it tbh"
  },
  {
   "score": 2,
   "id": "dj57r02",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 01:39:41",
   "depth": 0,
   "text": "Huh, going from the novel's descriptions I always imagined Zectal Medis would be creepier and more gruesome than what was pictured in the anime. I guess Zectal Medis in the anime was nerfed down. Merc and Thirteen wasn't thrown to the floor for instance. Zero's and Thirteen's wounds also seemed way less severe. At least I won't have nightmares, I suppose.\n\nThirteen seems to be too calm when he was explaining to Mercenary why Zero got wounded, too. Like, Merc's stupidity just killed your beloved Zero for all you know! The Thirteen in the novel seemed like he was mad, at least!\n\nAnd why was Merc's stupid decision to save Thirteen was paid no mind at all? The novel explored it a little, not much, but at least it wasn't ignored.\n\nThe anime's expansion upon Albus and Holdem's quest to draw the magic circles while the Sorcerers of Zero gather to take down Thirteen is pretty boring. I thought I'd love it expanded, but if this is how it's expanded I'd rather it not expanded at all. It adds a lot of screen time, though, so I guess that makes sense why it was added."
  },
  {
   "score": 2,
   "id": "dj5aeju",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 03:43:58",
   "depth": 0,
   "text": "The part where Zero goes \"No excuses!\" for seemingly no reason is a mistranslation. She said \"Ii wake ga nai!\" (\"Of course that's not okay!\") in response to Thirteen showing them Albus about to get killed and asking if they were alright with that. \"Excuse\" would be \"iiwake\", so it's pronounced the same way but it doesn't make sense in context."
  },
  {
   "score": 2,
   "id": "dj819p9",
   "pid": "t3_6i9p0j",
   "date": "2017-06-21 15:44:52",
   "depth": 0,
   "text": "Well, I like this show, despite all the naysayers.\n\nIt's a very comfy show. It's got some obvious plot twists, sure, but that's the type of show this is.\n\nI can't wait to see how it ends. I'm gonna miss this show."
  },
  {
   "score": 5,
   "id": "dj4n52y",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 16:21:03",
   "depth": 0,
   "text": "dropped this at episode 8 and judging by the comments I'm not missing out on anything"
  },
  {
   "score": 5,
   "id": "dj4pvvx",
   "pid": "t1_dj4n52y",
   "date": "2017-06-19 17:20:02",
   "depth": 1,
   "text": "I hate to say it but you're right.\n\nSo much potential! But it fell into a lazy, dumb plot with a wishy-washy villain. Just give us Zero and Merc!"
  },
  {
   "score": 6,
   "id": "dj51u8j",
   "pid": "t1_dj4n52y",
   "date": "2017-06-19 21:53:53",
   "depth": 1,
   "text": "Wise choice. I should've dropped this but now I'm one episode away from finishing it...\n\n\n[](#nyanpasu \"Yay for another MAL entry I guess\")\n\n"
  },
  {
   "score": 12,
   "id": "dj53xlm",
   "pid": "t1_dj4n52y",
   "date": "2017-06-19 23:01:31",
   "depth": 1,
   "text": "You're missing out on Zero being cute as fuck"
  },
  {
   "score": 2,
   "id": "dj54qc1",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 23:30:53",
   "depth": 0,
   "text": "The Sorcerors of Zero are legitimately the biggest problem this anime has. The lack of focus on the intruging war between magic and those without was much more interesting than this plot Thirteen cooked up.\n\nThe anime's saving grace is it's main characters, which I'll watch through any bullshit to experience the Wagahai."
  },
  {
   "score": 3,
   "id": "dj4olho",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 16:52:30",
   "depth": 0,
   "text": "skipped through the episode. did 13 suddenly become a good guy in this 1 episode?"
  },
  {
   "score": 1,
   "id": "dj51vyo",
   "pid": "t1_dj4olho",
   "date": "2017-06-19 21:55:19",
   "depth": 1,
   "text": "It turns out he was a giant tsundere for Zero this whole time"
  },
  {
   "score": 8,
   "id": "dj4puwc",
   "pid": "t1_dj4olho",
   "date": "2017-06-19 17:19:25",
   "depth": 1,
   "text": "Yeah, something like that.\n\nThe plot is pretty dumb, which sucks because the main characters are great."
  },
  {
   "score": 14,
   "id": "dj4p3tg",
   "pid": "t1_dj4olho",
   "date": "2017-06-19 17:03:31",
   "depth": 1,
   "text": "No, but Zero told him to behave so like the good puppy he is he will listen. "
  },
  {
   "score": 7,
   "id": "dj54odt",
   "pid": "t1_dj4olho",
   "date": "2017-06-19 23:28:46",
   "depth": 1,
   "text": "Thirteen was never the bad guy. He was just the antagonist to Zero's true wishes unkowningly. He did everything he did so he could serve Zero all the power in the world on a silver platter, because he loves her, platonically or otherwise.\n\nHe sees her ideals as the perfect world, so he tries to remove the holes in that ideaology that humanity constantly pokes into it so she doesn't have to see it and her world can exist."
  },
  {
   "score": 1,
   "id": "dj4ztnl",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 20:58:23",
   "depth": 0,
   "text": "The stalker points was right."
  },
  {
   "score": 1,
   "id": "dj575ta",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 01:12:30",
   "depth": 0,
   "text": "Okay? I guess we're all friends now."
  },
  {
   "score": 1,
   "id": "dj5znm8",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 12:26:52",
   "depth": 0,
   "text": "Best part of the entire episode was Zero throwing her arms up and shouting \"Too slow!\". This show would have been much better if the characters weren't held hostage by the story, even Albus isn't as bad as I think people are making her out to be."
  },
  {
   "score": 1,
   "id": "dj8m3kr",
   "pid": "t3_6i9p0j",
   "date": "2017-06-22 00:31:02",
   "depth": 0,
   "text": " \\#ThirteenDidNothingWrong"
  },
  {
   "score": 1,
   "id": "djaez0j",
   "pid": "t3_6i9p0j",
   "date": "2017-06-23 01:40:31",
   "depth": 0,
   "text": "Zero: You can't beat me 13 because I purposely put an error to the spells.\n13: So this is why you are confident. In this case I will agree to whatever you are planning.\nMerc, Albus, Holdem: Just like that we're supposed to be cool?!\n\n\nLittle zero is pretty cute though."
  },
  {
   "score": 1,
   "id": "dj4mclm",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 16:04:07",
   "depth": 0,
   "text": "Zero best troll"
  },
  {
   "score": 1,
   "id": "dj5cjus",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 05:01:53",
   "depth": 0,
   "text": "Watching Zero sitting on merc is more enjoyable than watching this mediocre plot evolving"
  },
  {
   "score": 1,
   "id": "dj5mxgv",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 08:47:20",
   "depth": 0,
   "text": "The best part of the show was the scenes with the tailor. Everything else went downhill from there."
  },
  {
   "score": 0,
   "id": "dj4u53d",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 18:52:31",
   "depth": 0,
   "text": "So I watched this show caught up to this episode. To what everyone else is saying,  this show is lost potential and I am only here for the Zero, Merc, and 13. At least the anime is easy to binge. Can somebody point out the differences the anime made from the source? I saw it in past threads and I want to see it in detail. "
  },
  {
   "score": 0,
   "id": "dj4xbl6",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 20:00:35",
   "depth": 0,
   "text": "This feels like a kids show for me right now. The obvious plot twists hinted throughout. Also the extremely quick change of Thirteen's mind when he still had so much pride despite Zero telling him that's not what she wanted for I don't know how many times, and just one defeat then he's like you're actually right, I don't really care about my original plan because you don't want it.\n\n\nAlso there is a translation error where Thirteen said, \"seems like Sorena's descendant is about to be killed, are you fine with that?\" (\"So no Sorena no chokkei, korosarekaketeiru you da ga, ii no ka?\") and Zero replies with \"Ii wake ga nai da rou!\", which is translated to \"no excuses\" in the text, but it is actually \"There's no way I'm fine with that!\". I wasn't paying too much attention to this show so there could've been multiple errors like this too, which kinda sucks but I guess I wasn't enjoying the show much anyway with the obvious turnabouts."
  },
  {
   "score": 0,
   "id": "dj4znw2",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 20:54:23",
   "depth": 0,
   "text": "So Mr. Stone Cold Logic just decided to entrust his life to a person he can't trust? A person who still hates him? A person who was just about to try and kill him? Cool beans. "
  },
  {
   "score": 0,
   "id": "dj50zmm",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 21:29:41",
   "depth": 0,
   "text": "I liked this show when it started, but for the last episodes I just feel bored. It is a shame, Zero's and the Mercenary's interactions were really good and I feel like they are being wasted in this plotline. "
  },
  {
   "score": 0,
   "id": "dj570bf",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 01:05:46",
   "depth": 0,
   "text": "Is it just me or did that wrap up way too neatly?\n\nThirteen tricked dozens of witches into killing themselves, tried to burn Albus at a stake, tried to drive a wedge between Youhei (I don't remember his real name) and Zero, and shoved Zero into a cage for his amusement.\n\nSure, he might be innocent in Sorena's death (the fact that the \"novice witch\" who killed her has never been mentioned by name means that it was probably Albus's fault), but that doesn't excuse him for any of the rest of the shit."
  },
  {
   "score": 0,
   "id": "dj60jfz",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 12:42:06",
   "depth": 0,
   "text": "Of all shows I decided not to drop this season, Zero Kara might be the most mediocre one. \n\nMCs / bad guy that was just misunderstood and instantly forgiven (I hate this). All point toward a happy ending for everyone."
  },
  {
   "score": -1,
   "id": "dj4pu5z",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 17:18:57",
   "depth": 0,
   "text": "didalbusgetcapturedtoday.com"
  },
  {
   "score": -1,
   "id": "dj4yom8",
   "pid": "t3_6i9p0j",
   "date": "2017-06-19 20:30:25",
   "depth": 0,
   "text": "I had reservations about this show when Albus first became friendly at the very beginning.  But I didn't think everything would just go to shit in one episode.  I mean, 9 and 10 weren't great, but this episode was a shit show.  I didn't even finish it.  I'm so mad.  Fuck this series.  Wasting my time by getting my hopes up."
  },
  {
   "score": -1,
   "id": "dj57ujq",
   "pid": "t3_6i9p0j",
   "date": "2017-06-20 01:44:19",
   "depth": 0,
   "text": "So this is some poorly written garbage....  The story is just throwing plot holes and inconsistencies everywhere, just to end."
  }
 ]
}