{
 "score": 1358,
 "id": "64qza0",
 "num_comments": 700,
 "date": "2017-04-11 07:00:26",
 "comments": [
  {
   "score": 478,
   "id": "dg4bmn3",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:27:54",
   "depth": 0,
   "text": "My favorite part about this episode was his explanation on magic. There was a lot of world building in that speech, and I love when a series takes its time to actually explain whatever magic thing its going to be used. I hope there is more stuff like that in the future!"
  },
  {
   "score": 2,
   "id": "dg5aw8b",
   "pid": "t1_dg4bmn3",
   "date": "2017-04-11 18:59:22",
   "depth": 1,
   "text": "That's why I love magi so much. It's ridiculous in it's explanations, but it does explain."
  },
  {
   "score": 11,
   "id": "dg56rk7",
   "pid": "t1_dg4bmn3",
   "date": "2017-04-11 17:29:34",
   "depth": 1,
   "text": "I guess it was good, but his whole rant right before that about how magic could only be used to kill was incredibly laughable to me. Like, really? Healing any wounds, curing any sickness,  creating massive amounts of energy, all from nothing but words, not a single material required, has no application other than killing? Infinite energy, no sickness, no famine, all that is worthless to pursue? And that's just from the simple spells we have seen in 2 episodes. I'm assuming there will be spells that create matter from nothing, maybe even life. \nMy problem with this anime is that it has too many moment like that that break from the normal tone so that it can fit magical girl tropes, have an edgy MC, and get that fanservice in. Ridiculous \"uniforms\", the changing scene from last ep., and now this fucking rape scene that they tried to play off as a joke. Honestly if it fixes those a little I'll stay, otherwise I'm not gonna put myself through it past ep. 3."
  },
  {
   "score": 1,
   "id": "dg8lnzp",
   "pid": "t1_dg56rk7",
   "date": "2017-04-13 19:05:02",
   "depth": 2,
   "text": "It's not that magic can't be used to anything besides killing, we see in episode one that it's used to healing.\n\nIt's that in the hands of powerful people, magic is exploited and used primarily for warfare and killing, and the reasons that he hates it or has a distaste to it, is war, it's obvious in episode two that he was trained in the army, and he also was a part of it, can't blame him for saying or having those beliefs."
  },
  {
   "score": 1,
   "id": "dg5r523",
   "pid": "t1_dg56rk7",
   "date": "2017-04-12 04:44:53",
   "depth": 2,
   "text": "Well the MC is clearly some kind of war-traumatized veteran due to his insane talent. So I imagine he kind of just wanted to push her buttons, but also was projecting a bit of his frustrations with genius magical talent being used in war over anything else. "
  },
  {
   "score": 1,
   "id": "dg5bhq5",
   "pid": "t1_dg56rk7",
   "date": "2017-04-11 19:12:39",
   "depth": 2,
   "text": "To be honest, we only see that spell used only by Lumia or whateverhernameis.\n"
  },
  {
   "score": 2,
   "id": "dg5nmw6",
   "pid": "t1_dg56rk7",
   "date": "2017-04-12 02:00:18",
   "depth": 2,
   "text": "The uniforms are ridiculous but they're also hot so... I dig it. I like edgy MCs, I like me that fanservice, and rape scene was top notch. What's not to like about it? The part about \"Oh you're busy... I'll come back..\" was fucking hilarious. "
  },
  {
   "score": 3,
   "id": "dg6auby",
   "pid": "t1_dg56rk7",
   "date": "2017-04-12 11:23:33",
   "depth": 2,
   "text": "they pretty much revealed the mc's entire backstory / relation with magic in this episode. loved magic as a child. ex-military. very powerful / skilled, since i'm assuming he's the one that saved the girl in the past. based on his attitude (pre-motivation to start doing things seriously), and reluctance to reveal more of his past beyond the past year of freeloading, you can assume that something happened to change him.\n\nwith the military thing, that relates with how things are in the US. if you work in a research lab that is funded by military, it doesn't matter what you do, the first question they ask will be how can we use this to kill people, or support our people that are killing people? after enough time, it'd be reasonable that he'd become jaded, viewing magic as a tool for killing. then, assuming some event where either he was ordered to kill a lot of people or he witnessed a lot of people get killed by magic, he quits the military and goes to bum around for a year.\n\nwhen he sees the girl trying to perform the magic circle and helps her out, it reminds him of the love and awe he had for magic as a child, which leads to him gaining some motivation to actually teach.\n\nfor the uniforms, it'd be bland if every anime/manga had standard uniforms. maybe i've just been de-sensitized to it over the years, but i hardly noticed them beyond the first time seeing it and going \"lol, really?\". the rape joke, at least in my head is sort of not part of the main timeline. it's a gag they slipped in for fun, not truely part of the story. this is just my opinion / how i'm approaching it, it doesnt really take away from the show for me unless they start doing it too often."
  },
  {
   "score": 3,
   "id": "dg5b2xk",
   "pid": "t1_dg56rk7",
   "date": "2017-04-11 19:03:25",
   "depth": 2,
   "text": "Wait, where did we see healing spells? And I'm not sure this world is scientifically advanced enough to understand the laws of thermodynamics. Medieval settings tend to not be impressed by infinite energy, after all, there are tons of things around them like waterfalls and the sun that seem like \"infinite\" energy. "
  },
  {
   "score": 1,
   "id": "dg5dawe",
   "pid": "t1_dg5b2xk",
   "date": "2017-04-11 19:54:32",
   "depth": 3,
   "text": "Very beginning of first episode she heals the guys finger. "
  },
  {
   "score": 8,
   "id": "dg5bhsk",
   "pid": "t1_dg5b2xk",
   "date": "2017-04-11 19:12:41",
   "depth": 3,
   "text": "Lumia casts a healing spell on some old guys finger right at the start of the 1st episode. "
  },
  {
   "score": 1,
   "id": "dg5hwl6",
   "pid": "t1_dg5bhsk",
   "date": "2017-04-11 21:58:45",
   "depth": 4,
   "text": "Oh. I forgot about that. Yeah, weird that Glenn doesn't mention that then. "
  },
  {
   "score": 1,
   "id": "dg8xqmt",
   "pid": "t1_dg5hwl6",
   "date": "2017-04-14 01:44:49",
   "depth": 5,
   "text": "It's true though, the amount of times healing magic is used as opposed to military grade magic in that world is quite small. [Mild spoiler](/s \"Especially Glenn should know this, given his past.\")"
  },
  {
   "score": 3,
   "id": "dg743td",
   "pid": "t1_dg56rk7",
   "date": "2017-04-12 21:01:41",
   "depth": 2,
   "text": ">but his whole rant right before that about how magic could only be used to kill was incredibly laughable to me. \n\nGive it a chance I found it good\n\n[Manga/LN](/s \"He killed a lot of people, to him magic really is good for nothing else but killing \")\n\n\n"
  },
  {
   "score": 3,
   "id": "dg6nrl8",
   "pid": "t1_dg56rk7",
   "date": "2017-04-12 15:16:17",
   "depth": 2,
   "text": "He didn't say it could only be used to kill, he said it was the only thing magic excels at. For healing he already mentioned that the medical field is making a far more significant change to people's general health than anything magic is capable of, as someone else mentioned it's not a source of infinite energy as mana burnout is a thing, and so on. Thus, the only thing you can really do better with magic than anyone who has studied literally anything else is killing people.  \n[](#nico-heart)"
  },
  {
   "score": 7,
   "id": "dg5qswp",
   "pid": "t1_dg56rk7",
   "date": "2017-04-12 04:32:33",
   "depth": 2,
   "text": "I think his rant came from someone who was scarred from war. \n\ngot a friend from America, said he was in service in the army for several years, handling explosives and stuff (I dont know the details since im not American). When he came back he somehow got really scared when seeing cables from a computer power supply. guess that's what happened to this bastard teacher."
  },
  {
   "score": 7,
   "id": "dg5omge",
   "pid": "t1_dg56rk7",
   "date": "2017-04-12 02:52:27",
   "depth": 2,
   "text": "[Simple Spells](/s \"healing isn't something every mage can do, on the energy mana burn out exists\")\n\nthis episode misses a lot out compared to LN/Manga in this world magic is very niche\n\n"
  },
  {
   "score": 22,
   "id": "dg58eip",
   "pid": "t1_dg56rk7",
   "date": "2017-04-11 18:05:22",
   "depth": 2,
   "text": "For the magic part, i'm not really sure what magic can do in this world so i just assumed that it might not be able to cure stuff about disease, but yeah its a little odd that noone said anything like that in response. Though to be fair i imagine that much of magics progress was fueled by war.\nAnd yeah, the whole playing the attempted rape off like a joke really irked me. there was no reason that that couldn't have been him trying to torture her for information or something."
  },
  {
   "score": 13,
   "id": "dg5j4jb",
   "pid": "t1_dg58eip",
   "date": "2017-04-11 22:38:35",
   "depth": 3,
   "text": "yeah a lot of the things the person above you mentioned can be rerouted into power of control.\n\nHealing creates better super soldiers with no down time\n\ninfinite energy, infinite weapons\n\nno famine, infinite battlefield rations with morale boosting properties (IE: not hardtack)\n\nas long as humans fail to resolve differences, or simply there are a few people wanting to have the power of control, there will always be some level of conflict, with a high chance of escalating into another level of conflict.\n\nBut then, that's what makes humans interesting yes?"
  },
  {
   "score": 6,
   "id": "dg5ncde",
   "pid": "t1_dg4bmn3",
   "date": "2017-04-12 01:44:47",
   "depth": 1,
   "text": "> I love when a series takes its time to actually explain whatever magic thing its going to be used. I hope there is more \n\n[Manga](/s \"If the anime gets to the school tournament arc, there's plenty of exposition on the magic system there\")"
  },
  {
   "score": 1,
   "id": "dg73w00",
   "pid": "t1_dg5ncde",
   "date": "2017-04-12 20:56:13",
   "depth": 2,
   "text": "That was my favorite arc so far. Recent chapters though.....\n\n[Anime Show/Manga/LN](/s \"I just don't like Riel, I love me some psycho girls, i.e. Kurumi, Vira, Gasai Yuno, Riel's version of mental instability just rubs me the wrong way Also I stand fast on Celica being best girl, but Rumia I hold close to my heart as well \")\n\n"
  },
  {
   "score": 20,
   "id": "dg5046y",
   "pid": "t1_dg4bmn3",
   "date": "2017-04-11 15:03:09",
   "depth": 1,
   "text": "If you want this is the link to one of the chapters in this episode. It goes a bit more in depth of the magic system since you're interested.  Also suggest reading the chapter before to learn a bit more about Lumia and her ideals/motivations which is nice :)\n\nhttps://crimsonmagic.me/2016/10/27/akashic-1-3/#more-1231"
  },
  {
   "score": 49,
   "id": "dg4k22b",
   "pid": "t1_dg4bmn3",
   "date": "2017-04-11 10:04:30",
   "depth": 1,
   "text": "I actually was reacting like how the shironeko girl reacted in the anime lol. I was surprised that words could affect the magic lol. He's pretty cool 1 on 1 lol."
  },
  {
   "score": 2,
   "id": "dg5it84",
   "pid": "t1_dg4k22b",
   "date": "2017-04-11 22:27:48",
   "depth": 2,
   "text": "> words \n\nIn his eyes the greatest symbiotic parasite the worlds ever known isn't microbial - it's linguistic. Words are what keep civilization, our world - alive. Free the world, Not by taking mens lives. But by taking their tongues. Words can kill.\n"
  },
  {
   "score": 51,
   "id": "dg52xnv",
   "pid": "t1_dg4k22b",
   "date": "2017-04-11 16:03:38",
   "depth": 2,
   "text": "lol lol."
  },
  {
   "score": 9,
   "id": "dg55bpo",
   "pid": "t1_dg52xnv",
   "date": "2017-04-11 16:57:48",
   "depth": 3,
   "text": "*1o1 lol"
  },
  {
   "score": 31,
   "id": "dg4vzdy",
   "pid": "t1_dg4bmn3",
   "date": "2017-04-11 13:41:13",
   "depth": 1,
   "text": "I really like The Grimoire of Zero's magic/sorcery explanation scene better, but this one was pretty close to the same level."
  },
  {
   "score": 1,
   "id": "dgdutvj",
   "pid": "t1_dg4vzdy",
   "date": "2017-04-17 11:05:33",
   "depth": 2,
   "text": "I found that one confusing, but that might be on the translation side. "
  },
  {
   "score": 5,
   "id": "dg4w1xt",
   "pid": "t1_dg4vzdy",
   "date": "2017-04-11 13:42:29",
   "depth": 2,
   "text": "Yeah that was another good one!"
  },
  {
   "score": 155,
   "id": "dg4cvld",
   "pid": "t1_dg4bmn3",
   "date": "2017-04-11 07:52:24",
   "depth": 1,
   "text": "Also a favorite for that reason but also him getting serious had a little sense of fufillment(best way I can put it), It might have been bothersome otherwise if he kept being a joker. I look forward to him being more of a teacher now."
  },
  {
   "score": 26,
   "id": "dg5gfxj",
   "pid": "t1_dg4cvld",
   "date": "2017-04-11 21:15:00",
   "depth": 2,
   "text": "If he is a teacher in the classroom and a Joker everywhere else. It will most likely be the perfect balance."
  },
  {
   "score": 414,
   "id": "dg4ccfv",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:42:07",
   "depth": 0,
   "text": "People are *actually* learning magic in a magic school anime?!\n\n\nMan, really wasn't expecting this show to get interesting. The magic system is really unique honestly, don't think I've seen something like this before. Was really expecting this just to get generic and fanservice-y through and through but it really did surprise me. The slapstick does still feel a bit lackluster though.\n\n\nIn most magic-based anime, you just see characters spouting cool-sounding words to look cool but this one's actually giving a reasoning behind this, I liked how he equated magic to autosuggestion, linking magic to the human psyche is quite interesting, really looking forward to how far they can take this system. Hope it's not just for this episode. Also liked the way he teaches as well, hopefully they don't mess up the student-teacher relationship by giving him a harem."
  },
  {
   "score": 1,
   "id": "dga2pa6",
   "pid": "t1_dg4ccfv",
   "date": "2017-04-14 18:21:35",
   "depth": 1,
   "text": "This is exactly why I also like Mahouka. Especially the LNs. "
  },
  {
   "score": 1,
   "id": "dg7a88q",
   "pid": "t1_dg4ccfv",
   "date": "2017-04-13 00:31:12",
   "depth": 1,
   "text": "Its pretty standard magic rules.  Words have power.  Language gives structure to that power, but if you an wrap your head around altering the words, you canalter the rules.  And also bow everybody's nips off because they learned the simple way.\n\n\nIm assuming at some point somebody learns to silent cast through sheer willpower/discipline.  After-all, words are just a good way to structure thought."
  },
  {
   "score": 2,
   "id": "dg5a8ig",
   "pid": "t1_dg4ccfv",
   "date": "2017-04-11 18:44:43",
   "depth": 1,
   "text": "Without that second paragraph it would be easy to mistake this for sarcasm. As for the last bit about the harem, I honestly doubt it. Considering what he said to that one woman who got him the job in the first place. "
  },
  {
   "score": 1,
   "id": "dg5vi2v",
   "pid": "t1_dg5a8ig",
   "date": "2017-04-12 06:45:27",
   "depth": 2,
   "text": "> As for the last bit about the harem, I honestly doubt it. Considering what he said to that one woman who got him the job in the first place.\n\n\nI agree but most people think, based on the way the girls seem to be falling in love with him, that he'll eventually get himself a harem. A harem doesn't require the MC to *want* a harem, so I can't say their suspicion is completely baseless, but yeah this show doesn't have a harem tag and I really hope it doesn't turn into one."
  },
  {
   "score": 1,
   "id": "dg6kt93",
   "pid": "t1_dg5vi2v",
   "date": "2017-04-12 14:16:54",
   "depth": 3,
   "text": "I was thinking that, and I figured that even if a girl liked him it would be one or two. I don't classify that as a harem."
  },
  {
   "score": 12,
   "id": "dg4utmw",
   "pid": "t1_dg4ccfv",
   "date": "2017-04-11 13:19:30",
   "depth": 1,
   "text": "It's how I'd always thought that magic should work.  Magic seems like far too fundamental a phenomenon to require something like a particular language, so I figured that incantations and such must be mind hacks to help your mind do something more elementary."
  },
  {
   "score": 1,
   "id": "dg72zn0",
   "pid": "t1_dg4utmw",
   "date": "2017-04-12 20:34:02",
   "depth": 2,
   "text": "Same, that was my general impression of magic as a whole in fiction. The words just make you feel or think a certain way, and then the magic happens~"
  },
  {
   "score": 1,
   "id": "dg5j5pp",
   "pid": "t1_dg4utmw",
   "date": "2017-04-11 22:39:42",
   "depth": 2,
   "text": "indeed, like casting Explosion."
  },
  {
   "score": 2,
   "id": "dgex08d",
   "pid": "t1_dg5j5pp",
   "date": "2017-04-18 02:47:02",
   "depth": 3,
   "text": "Probably true since Megumin has no definitive chants when casting it. She's just spouting hammy phrases while materializing it her only spell. Probably to help her concentrate better."
  },
  {
   "score": 2,
   "id": "dgex1k8",
   "pid": "t1_dgex08d",
   "date": "2017-04-18 02:48:56",
   "depth": 4,
   "text": "and she once proved she doesn't even need hammy phrases or time to concentrate.\n\nShe churned out an Explosion using only Explosion."
  },
  {
   "score": 1,
   "id": "dg5ipc3",
   "pid": "t1_dg4utmw",
   "date": "2017-04-11 22:24:13",
   "depth": 2,
   "text": "MINDHAX"
  },
  {
   "score": 2,
   "id": "dgi2lrc",
   "pid": "t1_dg4utmw",
   "date": "2017-04-19 20:54:46",
   "depth": 2,
   "text": "It's basically Harry Potter then eh? Plenty of casting without incantation, despite being taught a standard language. Spells can fail in various ways with incorrect usage. Not to mention original magics like Sectum Sempra."
  },
  {
   "score": 89,
   "id": "dg4kzi9",
   "pid": "t1_dg4ccfv",
   "date": "2017-04-11 10:21:33",
   "depth": 1,
   "text": "Yea the magic system is really cool, I'm hoping they explain more in future episodes."
  },
  {
   "score": 7,
   "id": "dg5c4xn",
   "pid": "t1_dg4kzi9",
   "date": "2017-04-11 19:27:28",
   "depth": 2,
   "text": "Makes me think that if magic is just the result of changing someone's thoughts, then his illustration of changing *others'* thoughts (via \"I love you\") will maybe cause the ability to alter (or even induce) others' magic."
  },
  {
   "score": 1,
   "id": "dg8nv9q",
   "pid": "t1_dg5c4xn",
   "date": "2017-04-13 19:57:42",
   "depth": 3,
   "text": "That's might be the basis of his unique spell. "
  },
  {
   "score": 127,
   "id": "dg4szl3",
   "pid": "t1_dg4kzi9",
   "date": "2017-04-11 12:45:50",
   "depth": 2,
   "text": "assuming they follow the source material, there should be a tournament type arc that does a lot to explain it"
  },
  {
   "score": 71,
   "id": "dg4txu6",
   "pid": "t1_dg4szl3",
   "date": "2017-04-11 13:03:02",
   "depth": 3,
   "text": "oooooh tournament arc, I'm bout it"
  },
  {
   "score": 195,
   "id": "dg4wi89",
   "pid": "t1_dg4szl3",
   "date": "2017-04-11 13:50:55",
   "depth": 3,
   "text": "Tournament arc?? TOURNAMENT ARC!!!"
  },
  {
   "score": 91,
   "id": "dg559s3",
   "pid": "t1_dg4wi89",
   "date": "2017-04-11 16:56:34",
   "depth": 4,
   "text": "TOOOOOOURNAMENT AAAAAAAAAAARC"
  },
  {
   "score": 1,
   "id": "dg74axd",
   "pid": "t1_dg559s3",
   "date": "2017-04-12 21:06:36",
   "depth": 5,
   "text": "Very much best arc"
  },
  {
   "score": 27,
   "id": "dg5g28x",
   "pid": "t1_dg559s3",
   "date": "2017-04-11 21:04:22",
   "depth": 5,
   "text": "I see you've come from gigguk \n"
  },
  {
   "score": 579,
   "id": "dg4blzv",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:27:34",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 1,
   "id": "dgnzon2",
   "pid": "t1_dg4blzv",
   "date": "2017-04-23 18:42:34",
   "depth": 1,
   "text": "Only say that the day we see him pinch women.\n\nGender equality all the way!!!"
  },
  {
   "score": 1,
   "id": "dgbu4r3",
   "pid": "t1_dg4blzv",
   "date": "2017-04-16 01:00:49",
   "depth": 1,
   "text": "JUSTICE PUNCH!"
  },
  {
   "score": 1,
   "id": "dg8r7zm",
   "pid": "t1_dg4blzv",
   "date": "2017-04-13 21:26:09",
   "depth": 1,
   "text": "Except he can use magic whenever he wants, and he's kind of a d***.\n\nThat just makes him a little better than the Touman!"
  },
  {
   "score": 1,
   "id": "dg4r5ag",
   "pid": "t1_dg4blzv",
   "date": "2017-04-11 12:12:44",
   "depth": 1,
   "text": "Hey , you left [this](https://youtu.be/Qx6YL1ld0iY)"
  },
  {
   "score": 2,
   "id": "dg6b9b1",
   "pid": "t1_dg4blzv",
   "date": "2017-04-12 11:30:29",
   "depth": 1,
   "text": "i'm viewing him more like onii-sama. relatively poor raw metrics when it comes to magic, but has such a thorough understanding of it that he can wreck anyone in an actual fight. also, military / ex-military, at (im assuming) some sort of special forces level."
  },
  {
   "score": 43,
   "id": "dg537bd",
   "pid": "t1_dg4blzv",
   "date": "2017-04-11 16:09:40",
   "depth": 1,
   "text": "He seems to be more powerful than Touma though. Not only does he have a radius, instead of just his hand, it also doesn't seem to have a cooldown. Also, given the radius, indirect/AoE attacks are less dangerous to him than to Touma. You could easily blow Touma up simply by aiming your explosion magic at the ground below his feet. Not going to work here.\n\nAlso, Touma literally can't use magic. If he were to, he would self-destruct eventually due to being an esper. This guy, while bad at magic, doesn't have such a restriction to deal with.\n\nThus, *if we discount the dragon king*, this guy seems to be more powerful than Touma in every way."
  },
  {
   "score": 1,
   "id": "dga5mxb",
   "pid": "t1_dg537bd",
   "date": "2017-04-14 19:30:47",
   "depth": 2,
   "text": "Touma regularly beats up monsters far more powerful than Glenn. Wing mode Accelerator would wipe the floor with most anime characters and Touma's beaten him twice. We haven't even gotten to all the even more terrifying foes Touma has defeated throughout Index/New Testament."
  },
  {
   "score": 1,
   "id": "dg5l874",
   "pid": "t1_dg537bd",
   "date": "2017-04-12 00:01:55",
   "depth": 2,
   "text": "He's not even bad at magic at all. He just lacking in some conventional things like chant speed but he clearly has a great repertoire of spells."
  },
  {
   "score": 3,
   "id": "dg65gl1",
   "pid": "t1_dg5l874",
   "date": "2017-04-12 09:52:26",
   "depth": 3,
   "text": "So far, as someone who hasn't read the novels. I got the impression that he's basically the Waver Velvet (Fate/) of this universe.  \nWaver Velvet is known as the best and most popular magic teacher in the Nasuverse, his students constantly reaching unthinkably high ranks within record time, with a 0% failure rate. However, he's a subpar magus, and in his free time he's extremely lazy, playing video games all the time.  \nThis guy gives me the impression he's the same type of character. The best teacher around, with revolutionary methods that defy the status quo, he quickly became extremely popular among the student body. But on the inside, and initially the outside, he's extremely lazy, and he lacks talent as a mage."
  },
  {
   "score": 5,
   "id": "dg5ih0j",
   "pid": "t1_dg537bd",
   "date": "2017-04-11 22:16:46",
   "depth": 2,
   "text": "Glenn can't stop a magic spell coming from long range. He specifies it's magic activation. So while Touma can stop any supernatural attack from any range, Glenn is screwed if he can't get his opponent in his circle."
  },
  {
   "score": 4,
   "id": "dg5e4z1",
   "pid": "t1_dg537bd",
   "date": "2017-04-11 20:14:31",
   "depth": 2,
   "text": "Who's negation would be stronger? Touma's is an absolute condition (reverting the world to its original state, though it is often in a limited state), but the dude's negation requires a magic chant, and most probably can't be transported as much as Touman's. We also don't know if his anti-magic area can negate spells casted from outside. This is coming from a non LN/Manga reader."
  },
  {
   "score": 6,
   "id": "dg5pps7",
   "pid": "t1_dg5e4z1",
   "date": "2017-04-12 03:46:55",
   "depth": 3,
   "text": "[Well....] ( /s \"It'll be shown in the next episode anyway but if you really want to know, from reading the manga his magic only stops other magic from activating so an already activated spell will still work in his field, so sniping magic will SCREW HIM. I still prefer him over touma since at least he actually knows hand to hand combat \")"
  },
  {
   "score": 10,
   "id": "dg5fn5w",
   "pid": "t1_dg537bd",
   "date": "2017-04-11 20:53:06",
   "depth": 2,
   "text": "i think the key difference between Glenn and Touma is Glenn seems to have a near absolute understanding of the dynamics of how magic can work and his ZA FOOL card.\n\nTouma does not (i think even to this date) fully understands imagine breaker, he has a decent idea of how to work it but he can't fully exercise it. \n\nUltimately Glenn has the potential i believe to be very powerful at magic but for the most part is either too lazy or outright doesn't fucking care enough "
  },
  {
   "score": 4,
   "id": "dg8yckd",
   "pid": "t1_dg5fn5w",
   "date": "2017-04-14 02:18:13",
   "depth": 3,
   "text": "It's the other way around, he has been very diligent in his magic studies, but he is still \"just a third rate magician\". I mean, if he hadn't  done that, he hardly would've been so good at teaching magic, right?"
  },
  {
   "score": 19,
   "id": "dg57rd5",
   "pid": "t1_dg537bd",
   "date": "2017-04-11 17:51:25",
   "depth": 2,
   "text": "Yeah but Touma does have he's magic precog "
  },
  {
   "score": 10,
   "id": "dg59nie",
   "pid": "t1_dg57rd5",
   "date": "2017-04-11 18:31:57",
   "depth": 3,
   "text": "It's more of an experience thing though with Touma, or an inate ability to cold read someone in battle. Wiki specifies that's it's more of an instinctual thing, like someone being really good at snapping fingers really fast, further expounded upon by his accumulated battle experience. Who's to say that Glenn doesn't have such a thing like it anyway?"
  },
  {
   "score": 13,
   "id": "dg586jn",
   "pid": "t1_dg57rd5",
   "date": "2017-04-11 18:00:50",
   "depth": 3,
   "text": "Magic precognition? Don't really remember that, which episode/volume/arc?"
  },
  {
   "score": 2,
   "id": "dg597ka",
   "pid": "t1_dg586jn",
   "date": "2017-04-11 18:22:31",
   "depth": 4,
   "text": "[removed]"
  },
  {
   "score": 2,
   "id": "dg59du8",
   "pid": "t1_dg597ka",
   "date": "2017-04-11 18:26:13",
   "depth": 5,
   "text": "> Don't really remember that, which episode/volume/arc?"
  },
  {
   "score": 3,
   "id": "dg5dsg1",
   "pid": "t1_dg59du8",
   "date": "2017-04-11 20:06:10",
   "depth": 6,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dg64in7",
   "pid": "t1_dg5dsg1",
   "date": "2017-04-12 09:36:08",
   "depth": 7,
   "text": "Thanks. The one I least remember from NT, should have expected it's that one :D"
  },
  {
   "score": 4,
   "id": "dg5iu6s",
   "pid": "t1_dg5dsg1",
   "date": "2017-04-11 22:28:41",
   "depth": 7,
   "text": "Snow Halation?"
  },
  {
   "score": 1,
   "id": "dg5ucjl",
   "pid": "t1_dg5iu6s",
   "date": "2017-04-12 06:18:34",
   "depth": 8,
   "text": "I love that song!"
  },
  {
   "score": 3,
   "id": "dg6jwlz",
   "pid": "t1_dg586jn",
   "date": "2017-04-12 13:59:39",
   "depth": 4,
   "text": "its pretty bullshit to be honest. If i remember correctly he randomly developed it after fighting a bunch."
  },
  {
   "score": 314,
   "id": "dg4bxzd",
   "pid": "t1_dg4blzv",
   "date": "2017-04-11 07:34:19",
   "depth": 1,
   "text": "Nothing like a good old equality punch to the jaw "
  },
  {
   "score": 10,
   "id": "dg52xnz",
   "pid": "t1_dg4bxzd",
   "date": "2017-04-11 16:03:38",
   "depth": 2,
   "text": "Hold on, it's not Touma's Equality Punch until he punches a girl in the face. "
  },
  {
   "score": 33,
   "id": "dg4q752",
   "pid": "t1_dg4bxzd",
   "date": "2017-04-11 11:56:08",
   "depth": 2,
   "text": "God bless *Gender Equality*"
  },
  {
   "score": 63,
   "id": "dg53b7c",
   "pid": "t1_dg4q752",
   "date": "2017-04-11 16:12:05",
   "depth": 3,
   "text": "It's not only gender equality though. Touma even punches fetuses if he has to.\n\nHe's simply considering *everyone* equal, not only different genders. Be it race, ethnicity, nationality, gender, age... they are all equally likely to get a punch if they deserve it."
  },
  {
   "score": 17,
   "id": "dg54kiq",
   "pid": "t1_dg53b7c",
   "date": "2017-04-11 16:40:33",
   "depth": 4,
   "text": "Yeah It's great. \n\nI was just making a joke that the series made back when the movie came out where the characters joked about Touma administering gender equality to the world."
  },
  {
   "score": 79,
   "id": "dg4f43y",
   "pid": "t1_dg4bxzd",
   "date": "2017-04-11 08:34:18",
   "depth": 2,
   "text": "are you sure it wasn't a kick though?"
  },
  {
   "score": 92,
   "id": "dg4g1fp",
   "pid": "t1_dg4f43y",
   "date": "2017-04-11 08:51:24",
   "depth": 3,
   "text": "It was a punch filled with so much magical power that it looks like a kick to the eyes of unskilled mortals."
  },
  {
   "score": 1,
   "id": "dgbsrib",
   "pid": "t1_dg4g1fp",
   "date": "2017-04-15 23:57:09",
   "depth": 4,
   "text": "Kickpuncher?"
  },
  {
   "score": 3,
   "id": "dg5rcq2",
   "pid": "t1_dg4g1fp",
   "date": "2017-04-12 04:52:21",
   "depth": 4,
   "text": "Looks like I'm a skilled immortal! Hahaha, fear me, peasants!"
  },
  {
   "score": 259,
   "id": "dg4fk40",
   "pid": "t1_dg4f43y",
   "date": "2017-04-11 08:42:35",
   "depth": 3,
   "text": "Was pretty clearly a magic punch"
  },
  {
   "score": 224,
   "id": "dg4di8d",
   "pid": "t1_dg4bxzd",
   "date": "2017-04-11 08:04:16",
   "depth": 2,
   "text": "[deleted]"
  },
  {
   "score": 83,
   "id": "dg4dpaf",
   "pid": "t1_dg4di8d",
   "date": "2017-04-11 08:08:04",
   "depth": 3,
   "text": "**INTENSITY INTENSIFIES**"
  },
  {
   "score": 77,
   "id": "dg4mgd5",
   "pid": "t1_dg4dpaf",
   "date": "2017-04-11 10:48:11",
   "depth": 4,
   "text": "**SUCH MISFORTUNE**"
  },
  {
   "score": 34,
   "id": "dg5lme5",
   "pid": "t1_dg4mgd5",
   "date": "2017-04-12 00:19:29",
   "depth": 5,
   "text": "**FUKOU DA**"
  },
  {
   "score": 239,
   "id": "dg4bfgn",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:23:54",
   "depth": 0,
   "text": "http://imgur.com/a/fkhPN Lmao look at his crotch."
  },
  {
   "score": 2,
   "id": "dg5hrqr",
   "pid": "t1_dg4bfgn",
   "date": "2017-04-11 21:54:35",
   "depth": 1,
   "text": "Or that fierce circle triangle tattoo emblazoned on his chest. I wonder what it could mean?"
  },
  {
   "score": 44,
   "id": "dg4liso",
   "pid": "t1_dg4bfgn",
   "date": "2017-04-11 10:31:15",
   "depth": 1,
   "text": "That english ... at least they tried"
  },
  {
   "score": 1,
   "id": "dga5f8g",
   "pid": "t1_dg4liso",
   "date": "2017-04-14 19:25:43",
   "depth": 2,
   "text": "Maybe they hired Mario for their english?"
  },
  {
   "score": 1,
   "id": "dg8yvxm",
   "pid": "t1_dg4liso",
   "date": "2017-04-14 02:47:16",
   "depth": 2,
   "text": "The level of humiliation is the same, tho."
  },
  {
   "score": 1,
   "id": "dg5fs5t",
   "pid": "t1_dg4liso",
   "date": "2017-04-11 20:56:50",
   "depth": 2,
   "text": "Sounds fine when you read it in italian "
  },
  {
   "score": 1,
   "id": "dg4ql5d",
   "pid": "t1_dg4liso",
   "date": "2017-04-11 12:03:01",
   "depth": 2,
   "text": "Yeah, english is so **a** good..."
  },
  {
   "score": 2,
   "id": "dg54sdp",
   "pid": "t1_dg4liso",
   "date": "2017-04-11 16:45:32",
   "depth": 2,
   "text": "Well if you wear a small t-shirt you would say \"this t-shirt is a small\" or \"it's a small\"\n"
  },
  {
   "score": 16,
   "id": "dg4pk6l",
   "pid": "t1_dg4liso",
   "date": "2017-04-11 11:45:02",
   "depth": 2,
   "text": "But what if what we assumed was a punctuation mark is actually 1? It's a small 1. \n\n(☉_☉)"
  },
  {
   "score": 107,
   "id": "dg4sfjy",
   "pid": "t1_dg4liso",
   "date": "2017-04-11 12:35:58",
   "depth": 2,
   "text": "The English seems fine to me. It's saying that it's a small as in part of the category of smalls, not that it is small. Think about if it were referring to clothing."
  },
  {
   "score": 1,
   "id": "dgfnpbt",
   "pid": "t1_dg4sfjy",
   "date": "2017-04-18 12:41:19",
   "depth": 3,
   "text": "Or it was Mario who put it there."
  },
  {
   "score": 7,
   "id": "dg4xaey",
   "pid": "t1_dg4sfjy",
   "date": "2017-04-11 14:06:01",
   "depth": 3,
   "text": "I mean, if you analyze it yeah."
  },
  {
   "score": 4,
   "id": "dg8rd0l",
   "pid": "t1_dg4xaey",
   "date": "2017-04-13 21:30:11",
   "depth": 4,
   "text": "The English on the resume in episode 1 seemed pretty good grammatically, I'll give them the benefit of the doubt."
  },
  {
   "score": 82,
   "id": "dg4bufb",
   "pid": "t1_dg4bfgn",
   "date": "2017-04-11 07:32:19",
   "depth": 1,
   "text": "I can only imagine that it was actually Mario who did this."
  },
  {
   "score": 3,
   "id": "dg4qr8l",
   "pid": "t1_dg4bufb",
   "date": "2017-04-11 12:06:02",
   "depth": 2,
   "text": "I remember some people playing hearts of iron 4 on youtube talking about how they can't monetize their videos if they say Hitler, so they say Mario instead. In other words, Hitler did it."
  },
  {
   "score": 108,
   "id": "dg4i51f",
   "pid": "t1_dg4bfgn",
   "date": "2017-04-11 09:29:37",
   "depth": 1,
   "text": "I just noticed those are roses, and don't roses have thorns all over them?"
  },
  {
   "score": 75,
   "id": "dg4s3p0",
   "pid": "t1_dg4i51f",
   "date": "2017-04-11 12:29:59",
   "depth": 2,
   "text": "He hired Zoroku to do the arrangement."
  },
  {
   "score": 1,
   "id": "dgfnnez",
   "pid": "t1_dg4s3p0",
   "date": "2017-04-18 12:40:24",
   "depth": 3,
   "text": "More than likely that it was actually Kurama."
  },
  {
   "score": 1,
   "id": "dgfnmnc",
   "pid": "t1_dg4s3p0",
   "date": "2017-04-18 12:40:01",
   "depth": 3,
   "text": "More than likely that it was actually Kurama."
  },
  {
   "score": 197,
   "id": "dg4c9ep",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:40:30",
   "depth": 0,
   "text": "Wow no OP & ED for 2 episode straight? Looks like they really went all out and giving us more content. Not like I'm complaining.\n\n[Endcard](http://i.imgur.com/dSaE9d1.jpg)\n\nSo the real question is Sisti actually a catgirl? [Those](http://i.imgur.com/SmMA9lU.jpg) [cute](http://i.imgur.com/jQaOvyl.jpg) [blushes](http://i.imgur.com/2613BMP.jpg)"
  },
  {
   "score": 1,
   "id": "dg50x5g",
   "pid": "t1_dg4c9ep",
   "date": "2017-04-11 15:20:13",
   "depth": 1,
   "text": "It seems the ending includes sisti and rumia + a char that will appear later. Make sense actually. (according to MAL)\n\nWas wondering how they are going to squeeze the first few chapter that requires some time but yeah, this works. \n\nEp 2 ends at Chapter 4 of Manga."
  },
  {
   "score": 8,
   "id": "dg4k51x",
   "pid": "t1_dg4c9ep",
   "date": "2017-04-11 10:06:01",
   "depth": 1,
   "text": "I didn't even notice the anime had no op and ending lol!!! I was too engrossed to not realise haha. "
  },
  {
   "score": 38,
   "id": "dg4eyrv",
   "pid": "t1_dg4c9ep",
   "date": "2017-04-11 08:31:30",
   "depth": 1,
   "text": "> Those cute blushes\n\nPreach it brother, Sisti > all"
  },
  {
   "score": 119,
   "id": "dg4fcb8",
   "pid": "t1_dg4eyrv",
   "date": "2017-04-11 08:38:32",
   "depth": 2,
   "text": "Big boob blondie gothic professor > all"
  },
  {
   "score": -8,
   "id": "dg4ffb5",
   "pid": "t1_dg4fcb8",
   "date": "2017-04-11 08:40:06",
   "depth": 3,
   "text": "Well, *someone's* clearly got shit taste :>"
  },
  {
   "score": 36,
   "id": "dg4ftnw",
   "pid": "t1_dg4ffb5",
   "date": "2017-04-11 08:47:26",
   "depth": 4,
   "text": "That someone would be you, sir."
  },
  {
   "score": 9,
   "id": "dg4gxiy",
   "pid": "t1_dg4ftnw",
   "date": "2017-04-11 09:07:46",
   "depth": 5,
   "text": "Who am I to argue with heretics that can't appreciate the power of cat ear ribbons. You lot are beyond saving."
  },
  {
   "score": 1,
   "id": "dg4monx",
   "pid": "t1_dg4gxiy",
   "date": "2017-04-11 10:52:21",
   "depth": 6,
   "text": "She's a tsundere, that's why most don't want to appreciate her."
  },
  {
   "score": 2,
   "id": "dg6wfh3",
   "pid": "t1_dg4monx",
   "date": "2017-04-12 18:13:27",
   "depth": 7,
   "text": "Not talking about any of you guys.\n\nBut it's kinda funny that some people that claim to dislike tsunderes, don't realize that they actually like some of them.\n\nTypically they dislike the type A incarnations. And are not aware of that some characters they like are type B."
  },
  {
   "score": 3,
   "id": "dg7bkqt",
   "pid": "t1_dg6wfh3",
   "date": "2017-04-13 01:36:36",
   "depth": 8,
   "text": "That the thing it all depends on how well written they are.\n\nTsuderes usually are poorly written characters, however if they are well written and aren't just using MC as a punching bag then they are pretty good in my book."
  },
  {
   "score": 2,
   "id": "dg7kc11",
   "pid": "t1_dg7bkqt",
   "date": "2017-04-13 06:50:15",
   "depth": 9,
   "text": "To this day, tsunderes are still my favorite archetype no matter what flavor they come in. \n\n\nWhen I first started watching anime online, I was introduced to the concept of tsundere and started to love it.\n\nHowever even after watching hundreds of animated series over the years, I discovered that I genuinely still love them. Didn't get tired of them\n\nBe it classic ones likes Asuka, modern ones like Shana, parody ones like Aki Adagaki, male ones like Seigen Amawaka, big breasted ones like Tsukiumi, tsundere/yandere hybrids like Reika Houjou, Type B ones like Yamada from B gata H kei or ones that take until the last season to showed their full development like Louise( 4th season with her). I like them.\n\nGranted there are few I dont like much like Haruna from Kore was Zombie or Im kinda indifferent towards like Kirino. Most of the time, I like them. They are my favorite archetype. \n\nThis doesn't mean that they will become my favorite character in a series, in general they are in my top 1-5.\n\n"
  },
  {
   "score": 4,
   "id": "dg4n41l",
   "pid": "t1_dg4monx",
   "date": "2017-04-11 11:00:14",
   "depth": 7,
   "text": "A *good* Tsundere though. I usually hate them with a passion, but this one is surprisingly well done."
  },
  {
   "score": 2,
   "id": "dg4npi2",
   "pid": "t1_dg4n41l",
   "date": "2017-04-11 11:11:09",
   "depth": 8,
   "text": "Ehh, she doesn't have enough time for us to judge her yet, imo."
  },
  {
   "score": 1,
   "id": "dg6wj49",
   "pid": "t1_dg4npi2",
   "date": "2017-04-12 18:15:30",
   "depth": 9,
   "text": "She is a tsundere."
  },
  {
   "score": 1,
   "id": "dg7bldm",
   "pid": "t1_dg6wj49",
   "date": "2017-04-13 01:37:31",
   "depth": 1,
   "text": "If you followed the comment chain you would see that I stated that she was a tsundere. What we are talking about after that is if she is a good one or not."
  },
  {
   "score": 1,
   "id": "dg4ogbg",
   "pid": "t1_dg4npi2",
   "date": "2017-04-11 11:24:55",
   "depth": 9,
   "text": "What I mean is, I feel like she's already been different enough from other tsunderes so far. Doesn't physically abuse anyone and has an in my opinion much more endearing side to her than other Tsunderes of the past seasons."
  },
  {
   "score": 1,
   "id": "dg5kq07",
   "pid": "t1_dg4ogbg",
   "date": "2017-04-11 23:40:01",
   "depth": 1,
   "text": "\"Doesn't physically abuse anyone\"\n\n*girl has already thrown her textbook at MC twice*\n"
  },
  {
   "score": 1,
   "id": "dg5l037",
   "pid": "t1_dg5kq07",
   "date": "2017-04-11 23:51:53",
   "depth": 2,
   "text": "Well, MC was being kind of an ass. And twice? I only remember the one time he said I love you in order to demonstrate the effects of words. What was the other time?"
  },
  {
   "score": 1,
   "id": "dg5uqg5",
   "pid": "t1_dg5l037",
   "date": "2017-04-12 06:27:50",
   "depth": 3,
   "text": "Huh. I thought episode 1 had one instance? Maybe I'm just too high."
  },
  {
   "score": 1,
   "id": "dg5w4t3",
   "pid": "t1_dg5uqg5",
   "date": "2017-04-12 06:59:17",
   "depth": 4,
   "text": "Or maybe I just forgot about it. Dunno, I guess I'll skim through it again when I get back home."
  },
  {
   "score": 3,
   "id": "dg4r019",
   "pid": "t1_dg4ogbg",
   "date": "2017-04-11 12:10:12",
   "depth": 1,
   "text": "Agreed. Still not best girl though."
  },
  {
   "score": 10,
   "id": "dg4ledg",
   "pid": "t1_dg4gxiy",
   "date": "2017-04-11 10:29:03",
   "depth": 6,
   "text": "Y'all mother fuckers need to get with the program and just go the harem route\n\nYou get all the best girls "
  },
  {
   "score": 2,
   "id": "dg4lhv8",
   "pid": "t1_dg4ledg",
   "date": "2017-04-11 10:30:47",
   "depth": 7,
   "text": "Yeah but the harem route always has the risk of ending in death. It's too damn easy to trigger them death flags"
  },
  {
   "score": 1,
   "id": "dg6w5k6",
   "pid": "t1_dg4lhv8",
   "date": "2017-04-12 18:07:51",
   "depth": 8,
   "text": "But Arata already has the harem route secured, and he's okay so far."
  },
  {
   "score": 3,
   "id": "dg4meu0",
   "pid": "t1_dg4lhv8",
   "date": "2017-04-11 10:47:24",
   "depth": 8,
   "text": "That's why harem route is best route\n\nGotta get dat perfect end "
  },
  {
   "score": 1,
   "id": "dg4n2ta",
   "pid": "t1_dg4meu0",
   "date": "2017-04-11 10:59:35",
   "depth": 9,
   "text": "Just that there's no reload button after you've been backstabbed by Yandere #4..."
  },
  {
   "score": 1,
   "id": "dg4s7ir",
   "pid": "t1_dg4n2ta",
   "date": "2017-04-11 12:31:57",
   "depth": 1,
   "text": "Nesting level exceeded."
  },
  {
   "score": 1,
   "id": "dg4ngdy",
   "pid": "t1_dg4n2ta",
   "date": "2017-04-11 11:06:28",
   "depth": 1,
   "text": "Put them in a arena and make them fight to the death, Put it on pay per view if you want to make some profit on the side "
  },
  {
   "score": 1,
   "id": "dg4xdch",
   "pid": "t1_dg4ngdy",
   "date": "2017-04-11 14:07:40",
   "depth": 2,
   "text": "Waifu war, literal version."
  },
  {
   "score": 14,
   "id": "dg4fvbn",
   "pid": "t1_dg4ftnw",
   "date": "2017-04-11 08:48:17",
   "depth": 5,
   "text": "Definitely. "
  },
  {
   "score": 2,
   "id": "dg6ukzl",
   "pid": "t1_dg4fcb8",
   "date": "2017-04-12 17:36:25",
   "depth": 3,
   "text": "You know it's funny. I started reading the manga cause the cover I saw featured the blonde teacher. However the more I read, the more White Cat became my fav.\n\nStarted for Celica, stayed for Sisti."
  },
  {
   "score": 3,
   "id": "dg74fit",
   "pid": "t1_dg6ukzl",
   "date": "2017-04-12 21:09:54",
   "depth": 4,
   "text": "You stray from your path!\n\nI stand firm in my stance Celica is best girl!\n\nBut Rumia is bae too"
  },
  {
   "score": 3,
   "id": "dg5iqby",
   "pid": "t1_dg4fcb8",
   "date": "2017-04-11 22:25:07",
   "depth": 3,
   "text": "Christmas cake lel"
  },
  {
   "score": 39,
   "id": "dg4jpzk",
   "pid": "t1_dg4fcb8",
   "date": "2017-04-11 09:58:24",
   "depth": 3,
   "text": "Nah, t h i c c blondie kind sister princess has got to be best."
  },
  {
   "score": 67,
   "id": "dg4fem9",
   "pid": "t1_dg4c9ep",
   "date": "2017-04-11 08:39:44",
   "depth": 1,
   "text": "nah, she sadly isn't, in the hairbrushing scene her cat ears dissappear, and if those were real, she would have 4 ears"
  },
  {
   "score": 3,
   "id": "dg4o05m",
   "pid": "t1_dg4fem9",
   "date": "2017-04-11 11:16:40",
   "depth": 2,
   "text": "But then they added a tail on the next episode part ._."
  },
  {
   "score": 119,
   "id": "dg4hmou",
   "pid": "t1_dg4fem9",
   "date": "2017-04-11 09:20:25",
   "depth": 2,
   "text": "You're saying as if 4-eared catgirls wasn't already a norm."
  },
  {
   "score": 3,
   "id": "dg5m6l0",
   "pid": "t1_dg4hmou",
   "date": "2017-04-12 00:45:57",
   "depth": 3,
   "text": "I was hoping someone would follow up with a picture of a cat girl that actually has 4 cat ears"
  },
  {
   "score": 2,
   "id": "dgxtbbv",
   "pid": "t1_dg5m6l0",
   "date": "2017-04-30 00:47:26",
   "depth": 4,
   "text": "[Wagaya no Oinari-sama](https://myanimelist.net/manga/11411/Wagaya_no_Oinari-sama) off the top of my head. "
  },
  {
   "score": 5,
   "id": "dg4iomq",
   "pid": "t1_dg4hmou",
   "date": "2017-04-11 09:39:42",
   "depth": 3,
   "text": "Even if that's a norm it's just... weird"
  },
  {
   "score": 92,
   "id": "dg4exuh",
   "pid": "t1_dg4c9ep",
   "date": "2017-04-11 08:31:01",
   "depth": 1,
   "text": ">So the real question is Sisti actually a catgirl?\n\nNot sure if you're joking but those \"ears\" are ribbons."
  },
  {
   "score": 2,
   "id": "dg5j7vy",
   "pid": "t1_dg4exuh",
   "date": "2017-04-11 22:41:45",
   "depth": 2,
   "text": "it's just like Kon having fox ears."
  },
  {
   "score": 211,
   "id": "dg54sqp",
   "pid": "t1_dg4exuh",
   "date": "2017-04-11 16:45:46",
   "depth": 2,
   "text": "AHH LA LA LA I CANT HEAR YOUR LIES!!!"
  },
  {
   "score": 510,
   "id": "dg4aqao",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:09:26",
   "depth": 0,
   "text": "Hah, that final scene was actually pretty funny.\n\nThis episode was a lot better than the first, I'll keep watching it."
  },
  {
   "score": 1,
   "id": "dg52i4h",
   "pid": "t1_dg4aqao",
   "date": "2017-04-11 15:54:06",
   "depth": 1,
   "text": "pretty funny?  Made me literally lol. Normally I just smile or chuckle. I even expected it not to be a punch but for some reason I didn't expect it to be a kick, the exact opposite. And I loled... Maybe I'm just to easy. "
  },
  {
   "score": 1,
   "id": "dg4qgjj",
   "pid": "t1_dg4aqao",
   "date": "2017-04-11 12:00:42",
   "depth": 1,
   "text": "> This episode was a lot better than the first\n\nhmmmm, the pacing of this anime is faster than I thought after watching the first, this second episode didn't necessarily skip much, but the pacing is like lightspeed compared to the first episode\n\nif this episode is at the same pacing as the previous, we would probably end with a cliff hanger where the two guys break into the classroom while glenn just meets that guy in the plaza"
  },
  {
   "score": 25,
   "id": "dg4owos",
   "pid": "t1_dg4aqao",
   "date": "2017-04-11 11:33:10",
   "depth": 1,
   "text": "dude this show is criminally underrated\n\nthere's so many 7's on MAL (yes, i know, it's still something) that were being looked forward to this season, and this is way better than all of them\n\nis the high school battle cliche dead? this show has everything, all the cliches and a lot of fun, with great comedic spin, this show looks promising. this should explode in popularity soon."
  },
  {
   "score": 21,
   "id": "dg53bob",
   "pid": "t1_dg4owos",
   "date": "2017-04-11 16:12:25",
   "depth": 2,
   "text": "The first episode painted the MC to be a completely useless jackass, so a lot of people, including myself, figured this would just be a typical battle harem in a school setting. After the first episode, i only had this show at a 5, but I've upped it to a seven, and if next week's episode is as good as this one, it'll keep getting higher."
  },
  {
   "score": 3,
   "id": "dg6vwpr",
   "pid": "t1_dg53bob",
   "date": "2017-04-12 18:02:42",
   "depth": 3,
   "text": "> there's so many 7's on MAL (yes, i know, it's still something)\n\nFor MAL, 7 means average or worse..."
  },
  {
   "score": 2,
   "id": "dg865x7",
   "pid": "t1_dg6vwpr",
   "date": "2017-04-13 13:27:58",
   "depth": 4,
   "text": "http://i.imgur.com/RYEA00E.png"
  },
  {
   "score": 5,
   "id": "dga9oc7",
   "pid": "t1_dg865x7",
   "date": "2017-04-14 21:15:04",
   "depth": 5,
   "text": "Yep. It says that. Doesn't mean that's how the majority of members use it."
  },
  {
   "score": 1,
   "id": "dgeuok6",
   "pid": "t1_dga9oc7",
   "date": "2017-04-18 00:43:04",
   "depth": 6,
   "text": "Agreed. I feel like most people just think of it as a grading system in school. If you get a 70/100 on an essay or something it means there was a decent amount of things wrong with it. Most shows I think are fairly just average I give 7's."
  },
  {
   "score": 214,
   "id": "dg4c263",
   "pid": "t1_dg4aqao",
   "date": "2017-04-11 07:36:36",
   "depth": 1,
   "text": "Yep, it gets better and better. Already have high expectations for this anime, hope it won't disappoint us. \n\nEdit: Read that some people already dropped this show from episode 1? Too bad. \n\n[](#taigasigh)"
  },
  {
   "score": 1,
   "id": "dgbl9pt",
   "pid": "t1_dg4c263",
   "date": "2017-04-15 20:02:51",
   "depth": 2,
   "text": "I was going to because it seemed to shit other than the parts where he was acting retarded, but this episode was actually marked improvement.\n\nI wouldn't exactly say it's good yet (that rapey scene though....) but I can appreciate what it did here.\n\nMeta jokes are still dumb meta jokes though."
  },
  {
   "score": 2,
   "id": "dg7xwzb",
   "pid": "t1_dg4c263",
   "date": "2017-04-13 10:59:09",
   "depth": 2,
   "text": "tbh if it wasn't for the [good things I saw about episode 2 on reddit,](https://www.reddit.com/r/anime/comments/64wuhg/not_a_new_joke_but_it_never_gets_old) I'd have dropped it partway through episode 1. The humor was really off-putting and it all just felt cliche and *tired*.  \n\nI really liked it once he actually got into the magic system, since I love stuff like that, but even the first half of ep 2 was painful to sit through. So I can see why a lot of people dropped it already.  \n\nIf the series continues to focus more on the magical system I think it could be a pretty awesome show. I hope they don't keep playing up the cringey sexual power-fantasy humor though. "
  },
  {
   "score": 2,
   "id": "dg5fpjn",
   "pid": "t1_dg4c263",
   "date": "2017-04-11 20:54:51",
   "depth": 2,
   "text": "to be fair episode one wasn't very promising. Infact it was very misleading that it would at its soul rely heavily on tropes. for some. That on episode 1 alone is enough to drop it. and i don't blame em"
  },
  {
   "score": 23,
   "id": "dg4lsgu",
   "pid": "t1_dg4c263",
   "date": "2017-04-11 10:36:07",
   "depth": 2,
   "text": "I'm considering picking it up but man, those are the stupidest uniforms I've ever seen"
  },
  {
   "score": 20,
   "id": "dg4mq67",
   "pid": "t1_dg4lsgu",
   "date": "2017-04-11 10:53:08",
   "depth": 3,
   "text": "yeah they've lost their way with those uniforms."
  },
  {
   "score": 11,
   "id": "dg59ii0",
   "pid": "t1_dg4mq67",
   "date": "2017-04-11 18:28:59",
   "depth": 4,
   "text": "*from two rooms over with only the bass carrying over*\n^^Dohn ^^luuse ^^youh ^^weyyyyy\n"
  },
  {
   "score": 85,
   "id": "dg4lxsm",
   "pid": "t1_dg4lsgu",
   "date": "2017-04-11 10:38:49",
   "depth": 3,
   "text": "So a mere uniform stopped you from watching the show? \n\n[](#peasants)"
  },
  {
   "score": 2,
   "id": "dg5bzp1",
   "pid": "t1_dg4lxsm",
   "date": "2017-04-11 19:24:09",
   "depth": 4,
   "text": "small details can make one drop a show. Some dropped Ajin for merely being CGI despite the good adaptation."
  },
  {
   "score": 58,
   "id": "dg4rb7v",
   "pid": "t1_dg4lxsm",
   "date": "2017-04-11 12:15:39",
   "depth": 4,
   "text": "I love fanservice as much as the next guy, but you have to admit those uniforms are ludicrous. I mean, suspenders, upboob, zettai, midriff, and sailor design all-in-one screams lonely otaku wankery. "
  },
  {
   "score": 35,
   "id": "dg4ruaa",
   "pid": "t1_dg4rb7v",
   "date": "2017-04-11 12:25:12",
   "depth": 5,
   "text": "No no no... it's *Swiss*."
  },
  {
   "score": 61,
   "id": "dg4ocj2",
   "pid": "t1_dg4lsgu",
   "date": "2017-04-11 11:23:00",
   "depth": 3,
   "text": "Midriffs and ZR are good fetishes though."
  },
  {
   "score": 4,
   "id": "dg589on",
   "pid": "t1_dg4ocj2",
   "date": "2017-04-11 18:02:39",
   "depth": 4,
   "text": "ok but who puts middle school children in that sort of outfit?\n\nI mean seriously, how did the local magical PTA not throw a conniption fit over this"
  },
  {
   "score": 1,
   "id": "dg5nha7",
   "pid": "t1_dg589on",
   "date": "2017-04-12 01:51:54",
   "depth": 5,
   "text": "TBH these outfits aren't that bad compared to Senketsu in Kill la Kill."
  },
  {
   "score": 1,
   "id": "dg5ztmv",
   "pid": "t1_dg5nha7",
   "date": "2017-04-12 08:11:34",
   "depth": 6,
   "text": "The difference is that a major theme of Kill la Kill is how ridiculous Senketsu is as far as showing skin. This series is playing these outfits off as if they're completely normal."
  },
  {
   "score": 1,
   "id": "dg60huw",
   "pid": "t1_dg5ztmv",
   "date": "2017-04-12 08:23:59",
   "depth": 7,
   "text": "You don't need to respond and downvote my every comment bro. I agree completely with what your saying though. I loved Kill la Kill's theme on Nudity and it was a great show. There's still a lot worse in anime than these outfits though and I therefore don't think too much of it. "
  },
  {
   "score": 1,
   "id": "dg61ueq",
   "pid": "t1_dg60huw",
   "date": "2017-04-12 08:48:39",
   "depth": 8,
   "text": "I honestly thought it was just an interesting comment to reply to, otherwise I wouldn't have. I think there are worse outfits too, but typically those types of shows are tagged as ecchi."
  },
  {
   "score": 1,
   "id": "dg5zs7r",
   "pid": "t1_dg589on",
   "date": "2017-04-12 08:10:51",
   "depth": 5,
   "text": "Middle School? Isn't this High School? Sistine is 15, and I believe the entrance requirement is to be 14 at least, which is the average age everyone starts High School."
  },
  {
   "score": 1,
   "id": "dg5oeix",
   "pid": "t1_dg589on",
   "date": "2017-04-12 02:40:56",
   "depth": 5,
   "text": "But what's a PTA?"
  },
  {
   "score": 1,
   "id": "dg5jj24",
   "pid": "t1_dg589on",
   "date": "2017-04-11 22:52:39",
   "depth": 5,
   "text": "Assuming magic school have PTAs..."
  },
  {
   "score": 14,
   "id": "dg4g0vc",
   "pid": "t1_dg4c263",
   "date": "2017-04-11 08:51:07",
   "depth": 2,
   "text": "I understand why they dropped it but the source material is pretty good. I have a lot of fun reading it."
  },
  {
   "score": 2,
   "id": "dg4q4fp",
   "pid": "t1_dg4g0vc",
   "date": "2017-04-11 11:54:50",
   "depth": 3,
   "text": "Shit gets pretty spicy soon, and I can't wait."
  },
  {
   "score": 267,
   "id": "dg4gtoi",
   "pid": "t1_dg4c263",
   "date": "2017-04-11 09:05:46",
   "depth": 2,
   "text": "> Edit: Read that some people already dropped this show from episode 1? Too bad.\n\nA lot of people are allergic to the words \"Magical School\".\n\n[](#miyamoriunimpressed)"
  },
  {
   "score": 1,
   "id": "dgbu6dc",
   "pid": "t1_dg4gtoi",
   "date": "2017-04-16 01:03:05",
   "depth": 3,
   "text": "Why, though? Onii-sama is our one true God."
  },
  {
   "score": 1,
   "id": "dg8ty4o",
   "pid": "t1_dg4gtoi",
   "date": "2017-04-13 22:53:34",
   "depth": 3,
   "text": "In their defense, these past few years have been rough. Still recommend this show though"
  },
  {
   "score": 1,
   "id": "dg8fyoq",
   "pid": "t1_dg4gtoi",
   "date": "2017-04-13 16:54:06",
   "depth": 3,
   "text": "I was about to drop it after the duel. Decided I'd give it another just in case and feel extremely rewarded now. Very happy I waited until 2 episodes were out before starting this one."
  },
  {
   "score": 1,
   "id": "dg5hbm0",
   "pid": "t1_dg4gtoi",
   "date": "2017-04-11 21:40:50",
   "depth": 3,
   "text": "haha those lost lambs :D"
  },
  {
   "score": 2,
   "id": "dg5g3ot",
   "pid": "t1_dg4gtoi",
   "date": "2017-04-11 21:05:26",
   "depth": 3,
   "text": "eh, the first episode was pretty shit, I don't blame them"
  },
  {
   "score": 6,
   "id": "dg4qlmp",
   "pid": "t1_dg4gtoi",
   "date": "2017-04-11 12:03:15",
   "depth": 3,
   "text": "It's because the magic part tends to be very superficial and lacking in flavour and imagination."
  },
  {
   "score": 7,
   "id": "dg5434q",
   "pid": "t1_dg4gtoi",
   "date": "2017-04-11 16:29:43",
   "depth": 3,
   "text": "I think it was more a case of being allergic to dodgy fanservice and really tired cliches, which is something that wasn't nearly so much of an issue this episode."
  },
  {
   "score": 13,
   "id": "dg4gzp2",
   "pid": "t1_dg4gtoi",
   "date": "2017-04-11 09:08:51",
   "depth": 3,
   "text": "That's what I thought as well. \n\n[](#mug5)"
  },
  {
   "score": 189,
   "id": "dg4hb8r",
   "pid": "t1_dg4gtoi",
   "date": "2017-04-11 09:14:42",
   "depth": 3,
   "text": "actually a hell lot of people watch Little Witch Academia\n\nIt's the \"Harem battle magical school\" that turned off people..."
  },
  {
   "score": -1,
   "id": "dg4p3zp",
   "pid": "t1_dg4hb8r",
   "date": "2017-04-11 11:36:55",
   "depth": 4,
   "text": "Yeah, LWA is great. I'm gonna watch this show cause I have nothing else to watch right now, and I want something stupid, but anyone wanting some a little more mature will be turned off so hard by that."
  },
  {
   "score": 3,
   "id": "dg554l7",
   "pid": "t1_dg4p3zp",
   "date": "2017-04-11 16:53:13",
   "depth": 5,
   "text": "If they want something more mature they should not be looking at Magic School animes."
  },
  {
   "score": 3,
   "id": "dg58qr0",
   "pid": "t1_dg554l7",
   "date": "2017-04-11 18:12:37",
   "depth": 6,
   "text": "That's the point.....? My entire point is that the magical school turns people off because it usually isn't something mature."
  },
  {
   "score": 1,
   "id": "dg5dv2d",
   "pid": "t1_dg58qr0",
   "date": "2017-04-11 20:07:52",
   "depth": 7,
   "text": "Sorry, I thought you were talking specifically about LWA and saying this show was the little more mature kind."
  },
  {
   "score": 2,
   "id": "dg5eag0",
   "pid": "t1_dg5dv2d",
   "date": "2017-04-11 20:18:16",
   "depth": 8,
   "text": "Oh, of course not. It's a childish show about following your dreams, with lots of feels and a chuuni protag. It's just a really good show."
  },
  {
   "score": 1,
   "id": "dg5a0y2",
   "pid": "t1_dg4hb8r",
   "date": "2017-04-11 18:40:01",
   "depth": 4,
   "text": "Theres no harem in this show though"
  },
  {
   "score": 26,
   "id": "dg4uvsq",
   "pid": "t1_dg4hb8r",
   "date": "2017-04-11 13:20:38",
   "depth": 4,
   "text": "And that's too bad, because there are some hidden pearls like Rakudai for example."
  },
  {
   "score": 20,
   "id": "dg56s4s",
   "pid": "t1_dg4uvsq",
   "date": "2017-04-11 17:29:55",
   "depth": 5,
   "text": "I wouldn't call raukdai a harem"
  },
  {
   "score": 2,
   "id": "dg5n8e6",
   "pid": "t1_dg56s4s",
   "date": "2017-04-12 01:39:06",
   "depth": 6,
   "text": "I agree, although it may seem like that at just a first glance. It's one of the series that is about 3 episodes rule. "
  },
  {
   "score": 8,
   "id": "dg5i82y",
   "pid": "t1_dg56s4s",
   "date": "2017-04-11 22:08:58",
   "depth": 6,
   "text": "This either"
  },
  {
   "score": 3,
   "id": "dg62lb4",
   "pid": "t1_dg5i82y",
   "date": "2017-04-12 09:02:07",
   "depth": 7,
   "text": "lmao did we really not watch the same show. \n\nRumia is definitely infatuated with him and he should be the one [probably spoiler that you can inferred from this ep](/s \"who saved her\")\n\nSisti is your typical tsundere who will become (or already have) infatuated with him and looks like the main girl.\n\nI can guess they will introduce more and more love interests as the show goes on. Although 2 is already qualified as harem."
  },
  {
   "score": 1,
   "id": "dg6vrmi",
   "pid": "t1_dg62lb4",
   "date": "2017-04-12 17:59:46",
   "depth": 8,
   "text": " There's another girl. She's probably going to get introduced at the end of episode 3 or during episode 4\n\nUghh >_>\nI apologize I tried to put this in spoiler but I couldn't find how to post a spoiler black cover (it is very minor so it shouldn't affect much)"
  },
  {
   "score": 1,
   "id": "dg724ul",
   "pid": "t1_dg6vrmi",
   "date": "2017-04-12 20:13:56",
   "depth": 9,
   "text": "install res and click \"source\" whenever you forgot how to use the spoiler tag I guess.\n\nDamn 3 is less than I imagined. I was thinking 10 lol."
  },
  {
   "score": 3,
   "id": "dg6bdod",
   "pid": "t1_dg62lb4",
   "date": "2017-04-12 11:32:33",
   "depth": 8,
   "text": "This is about as much of a harem as rakudai. I've read the manga, I don't know if the LN has gone full harem tho. Anyway, I consider Harem a genre, not a characteristic of a show.  A Harem is an episodic series with multiple girls that generally get a development episode/arc each. Like IS."
  },
  {
   "score": 94,
   "id": "dg4xe6p",
   "pid": "t1_dg4hb8r",
   "date": "2017-04-11 14:08:07",
   "depth": 4,
   "text": "But Trinity Seven is so fun "
  },
  {
   "score": 1,
   "id": "dg6un93",
   "pid": "t1_dg4xe6p",
   "date": "2017-04-12 17:37:36",
   "depth": 5,
   "text": "Second season is going to be so good."
  },
  {
   "score": 1,
   "id": "dg5c7kn",
   "pid": "t1_dg4xe6p",
   "date": "2017-04-11 19:29:09",
   "depth": 5,
   "text": "Most of them are pretty fun"
  },
  {
   "score": 60,
   "id": "dg57uaz",
   "pid": "t1_dg4xe6p",
   "date": "2017-04-11 17:53:16",
   "depth": 5,
   "text": "But that's because the MC isn't beta af.\n\nAnd all girls are best girls."
  },
  {
   "score": 11,
   "id": "dg58bhz",
   "pid": "t1_dg57uaz",
   "date": "2017-04-11 18:03:37",
   "depth": 6,
   "text": "This MC isn't beta either. Literally brings a knife to a gunfight and wins."
  },
  {
   "score": 5,
   "id": "dg74h44",
   "pid": "t1_dg58bhz",
   "date": "2017-04-12 21:11:02",
   "depth": 7,
   "text": "Brings a knife to a gunfight where he bans guns =P"
  },
  {
   "score": 6,
   "id": "dg5j8sj",
   "pid": "t1_dg58bhz",
   "date": "2017-04-11 22:42:37",
   "depth": 7,
   "text": "more he brings a knife to a nuclear fight because he has a portable N-Jammer.\n\nNot even Kira can do that."
  },
  {
   "score": 6,
   "id": "dg5lrl8",
   "pid": "t1_dg5j8sj",
   "date": "2017-04-12 00:26:10",
   "depth": 8,
   "text": "But Kira just wants to live a quiet life..."
  },
  {
   "score": 8,
   "id": "dg5b9hi",
   "pid": "t1_dg58bhz",
   "date": "2017-04-11 19:07:31",
   "depth": 7,
   "text": "Yeah and the people who didn't give it a chance wouldn't know that.\n\nLike me, cuz I haven't watched it yet."
  },
  {
   "score": 259,
   "id": "dg4b62c",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:18:36",
   "depth": 0,
   "text": "the magical punch that turned into a kick. sick move.\n\nSeems like Rumia is the princess MC saved. I wonder if she recognizes him and thats why she told him her story etc. At least he kind of recognized her.\n\n\"The fool\" card negates magic, so I guess it's all about hand to hand combat if he fights. I like it, but I hope he will involve magic into his fights, since there apparently is much more to it.\n\nI really like this show and hope the animation during fighting scenes will be good, because good animation in magic high school anime is pretty rare. At least thats what I have experienced.\n\nAlso MCs taste in woman is top notch. blonde prof > everyone."
  },
  {
   "score": 1,
   "id": "dgex6fs",
   "pid": "t1_dg4b62c",
   "date": "2017-04-18 02:56:07",
   "depth": 1,
   "text": "> \"The fool\" card negates magic, so I guess it's all about hand to hand combat if he fights. I like it, but I hope he will involve magic into his fights, since there apparently is much more to it.\n\nWell he already demonstrated that he can actually use and alter magic according to his will. Even actually cast a certain spell without using the textbook incantations.\n\nSo I'm really excited and expecting great things from this sensei going forward. His Fool card is merely his \"original\" spell. That doesn't mean he doesn't know how to use military grade spells."
  },
  {
   "score": 1,
   "id": "dg74kcx",
   "pid": "t1_dg4b62c",
   "date": "2017-04-12 21:13:12",
   "depth": 1,
   "text": "> Also MCs taste in woman is top notch. blonde prof > everyone.\n\nPREACH IT BROTHER!\n"
  },
  {
   "score": 1,
   "id": "dgb72xh",
   "pid": "t1_dg74kcx",
   "date": "2017-04-15 14:23:38",
   "depth": 2,
   "text": "DAYONE"
  },
  {
   "score": 1,
   "id": "dg5cb82",
   "pid": "t1_dg4b62c",
   "date": "2017-04-11 19:31:30",
   "depth": 1,
   "text": "> \"The fool\" card negates magic, so I guess it's all about hand to hand combat if he fights.\n\nIf he fights *high-level mages*, I bet"
  },
  {
   "score": 35,
   "id": "dg4pnff",
   "pid": "t1_dg4b62c",
   "date": "2017-04-11 11:46:36",
   "depth": 1,
   "text": "> \"The fool\" card negates magic \n\nSlightly misworded there.\n\nGlenn said \"I can completely seal the **activation of all magic** within a **set range centered around me\"**.\n\nSo technically if bandanna dude had used Bang on Glenn from a distance, Glen wouldn't be so lucky.\n\n[This phrasing also implies](/s \"long range offensive magic users are the sort of people Glenn would have trouble with.\") \n\n"
  },
  {
   "score": 1,
   "id": "dg5ivgc",
   "pid": "t1_dg4pnff",
   "date": "2017-04-11 22:29:54",
   "depth": 2,
   "text": "Magus Killer"
  },
  {
   "score": 25,
   "id": "dg4q73c",
   "pid": "t1_dg4pnff",
   "date": "2017-04-11 11:56:07",
   "depth": 2,
   "text": "[Mechanics explantion](/s \" You are correct that long range absolutely wrecks him, It also doesn't stop magic if it's already cast. It's a very finnicky ability that's reliant on picking his battles and surprise factor\")"
  },
  {
   "score": 1,
   "id": "dg57bnv",
   "pid": "t1_dg4q73c",
   "date": "2017-04-11 17:41:52",
   "depth": 3,
   "text": "So he's screwed if any battle mage just packs a pocket knife? Or doesn't sit still and let him beat them up one at a time?"
  },
  {
   "score": 1,
   "id": "dg865nh",
   "pid": "t1_dg57bnv",
   "date": "2017-04-13 13:27:49",
   "depth": 4,
   "text": "He probably uses a sword or something in battle, here he was in his teacher uniform."
  },
  {
   "score": 1,
   "id": "dg8ylcz",
   "pid": "t1_dg865nh",
   "date": "2017-04-14 02:31:18",
   "depth": 5,
   "text": "[Lumia-Glenn ln vol 1 spoiler?](/s \"In the ln, Lumia said he used a gun-like weapon when fending off her assassins in the past.\")\n[Spoiler](/s \"We should see him use it in arc 3 for the first time. He also uses various magics when fighting then.\")"
  },
  {
   "score": 4,
   "id": "dg5je9m",
   "pid": "t1_dg57bnv",
   "date": "2017-04-11 22:47:55",
   "depth": 4,
   "text": "maybe, looking at what has been implied so far in this episode, Glenn has been through some pretty serious bullshit. (possibly child soldier, I don't know if that one turned into an anime) One can make the assumption that his brand of magic grew from utmost efficiency on the battlefield. The Fool may not be his only way of combat, but one of many tools in his arsenal to dispatch foes.\n\nIn a way he's like Tatsuya, except he didn't lose his emotions in the process of efficiency and he has no existing anchor like Miyuki."
  },
  {
   "score": 3,
   "id": "dg6uhqn",
   "pid": "t1_dg5je9m",
   "date": "2017-04-12 17:34:43",
   "depth": 5,
   "text": "I also got the vibe that he has seen war, and killed LOTS of magicians. Specialists like that will have one seemingly restrictive ability, but their true skill is always adapting and controlling the engagement to fit the conditions necessary for that ability."
  },
  {
   "score": 1,
   "id": "dg50m3d",
   "pid": "t1_dg4q73c",
   "date": "2017-04-11 15:13:44",
   "depth": 3,
   "text": "Pretty sure next episode and/or future episode will explain that. Don't worry guys. \n\nEverything can't be explained in 2 ep."
  },
  {
   "score": 41,
   "id": "dg4fzr8",
   "pid": "t1_dg4b62c",
   "date": "2017-04-11 08:50:34",
   "depth": 1,
   "text": "> Seems like Rumia is the princess MC saved. I wonder if she recognizes him and thats why she told him her story etc. At least he kind of recognized her.\n\nI think this is true because she is also the one who was confident how Glenn will save everyone when students got invaded. Also the fact that in the first episode, MC specifically ask Rumia whether they have met before, so yeah, I think Rumia also knows Glenn is the one who saved her"
  },
  {
   "score": 234,
   "id": "dg4c5mk",
   "pid": "t1_dg4b62c",
   "date": "2017-04-11 07:38:28",
   "depth": 1,
   "text": "> the magical punch that turned into a kick\n\nwhat do you mean?! All I saw was a Magical Punch!\n\n> Also MCs taste in woman is top notch. blonde prof > everyone.\n\n100%"
  },
  {
   "score": 4,
   "id": "dg4s3xt",
   "pid": "t1_dg4c5mk",
   "date": "2017-04-11 12:30:06",
   "depth": 2,
   "text": "So it even appears to be a different attack to different people? The magic there is deeper than I thought!"
  },
  {
   "score": 127,
   "id": "dg4f84b",
   "pid": "t1_dg4c5mk",
   "date": "2017-04-11 08:36:23",
   "depth": 2,
   "text": "A gothic blondie with big boobs is the best."
  },
  {
   "score": 37,
   "id": "dg5fx0s",
   "pid": "t1_dg4f84b",
   "date": "2017-04-11 21:00:29",
   "depth": 3,
   "text": ">A gothic blondie with big boobs is the best.\n\n[Pokemon said it best.](https://i.imgur.com/wdM6Rt8.png)"
  },
  {
   "score": 5,
   "id": "dgi2d7z",
   "pid": "t1_dg5fx0s",
   "date": "2017-04-19 20:49:03",
   "depth": 4,
   "text": "Man, Pokemon has really...uh..changed."
  },
  {
   "score": 3,
   "id": "dijx0i0",
   "pid": "t1_dgi2d7z",
   "date": "2017-06-06 15:29:13",
   "depth": 5,
   "text": "Pokemon ... uh.. finds a way"
  },
  {
   "score": 43,
   "id": "dg4getd",
   "pid": "t1_dg4f84b",
   "date": "2017-04-11 08:58:06",
   "depth": 3,
   "text": "Can't leave out crazy! somehow they're always crazy to some degree. Kinda okay with that though. "
  },
  {
   "score": 92,
   "id": "dg4im0o",
   "pid": "t1_dg4getd",
   "date": "2017-04-11 09:38:24",
   "depth": 4,
   "text": "[Of course.](https://images-cdn.9gag.com/photo/aj6YyEx_700b_v1.jpg) "
  },
  {
   "score": 2,
   "id": "dh2g19o",
   "pid": "t1_dg4im0o",
   "date": "2017-05-03 01:39:42",
   "depth": 5,
   "text": "\"Below 4 crazy, but at least 8 hot? It's a guy.\""
  },
  {
   "score": 10,
   "id": "dg4l5ll",
   "pid": "t1_dg4im0o",
   "date": "2017-04-11 10:24:36",
   "depth": 5,
   "text": "Lmao I showed that to my friend and she's like \"that's too low, it's at least a 5.\""
  },
  {
   "score": 42,
   "id": "dg4iyfh",
   "pid": "t1_dg4im0o",
   "date": "2017-04-11 09:44:42",
   "depth": 5,
   "text": "lol, starts at 4"
  },
  {
   "score": 27,
   "id": "dg4jo5j",
   "pid": "t1_dg4iyfh",
   "date": "2017-04-11 09:57:29",
   "depth": 6,
   "text": "Unfortunately true. I've yet to meet a girl who isn't crazy."
  },
  {
   "score": 1,
   "id": "dg4k0nj",
   "pid": "t1_dg4jo5j",
   "date": "2017-04-11 10:03:47",
   "depth": 7,
   "text": "Know only a handful, maybe 5 or so. They were all cool people."
  },
  {
   "score": 21,
   "id": "dg54zte",
   "pid": "t1_dg4k0nj",
   "date": "2017-04-11 16:50:13",
   "depth": 8,
   "text": "Those were dudes dude.  "
  },
  {
   "score": 2,
   "id": "dg5ldo4",
   "pid": "t1_dg54zte",
   "date": "2017-04-12 00:08:31",
   "depth": 9,
   "text": "Well according to the chart, only when they're above 8 in the hot axis"
  },
  {
   "score": 293,
   "id": "dg4aswr",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:10:58",
   "depth": 0,
   "text": "Shit got real fast,glad he showed up and finally revealed he's OP."
  },
  {
   "score": 1,
   "id": "dg4otll",
   "pid": "t1_dg4aswr",
   "date": "2017-04-11 11:31:38",
   "depth": 1,
   "text": "Considering punching mage that can't cast spell in the face is fair. Yeah, he's OP AF."
  },
  {
   "score": 17,
   "id": "dg4fqj4",
   "pid": "t1_dg4aswr",
   "date": "2017-04-11 08:45:50",
   "depth": 1,
   "text": "i liked it, he is op but not hacksuya lvl op."
  },
  {
   "score": 5,
   "id": "dg5bwdk",
   "pid": "t1_dg4fqj4",
   "date": "2017-04-11 19:22:01",
   "depth": 2,
   "text": "But I love me some hacksuya OP."
  },
  {
   "score": 196,
   "id": "dg4awla",
   "pid": "t1_dg4aswr",
   "date": "2017-04-11 07:13:08",
   "depth": 1,
   "text": "He's not the typical OP MC, he's more average  "
  },
  {
   "score": 8,
   "id": "dg4j2e1",
   "pid": "t1_dg4awla",
   "date": "2017-04-11 09:46:38",
   "depth": 2,
   "text": "So while not on the level as Mahouka, still like Rakudai & Asterisk War, having weaknesses and strength to overcompensate for them."
  },
  {
   "score": 373,
   "id": "dg4b2ib",
   "pid": "t1_dg4awla",
   "date": "2017-04-11 07:16:32",
   "depth": 2,
   "text": "I think it's more like he's the unconventional Mage. He just fights smarter than everyone else. Kinda like how Kiritsugu mainly uses guns and espionage instead of directly using magic to fight."
  },
  {
   "score": 1,
   "id": "dg5hqei",
   "pid": "t1_dg4b2ib",
   "date": "2017-04-11 21:53:23",
   "depth": 3,
   "text": "Or like how Mr Siscon is so much smarter at magic that he comes back from the dead. /sarcasm\n\n^^hopefully ^^thats ^^vague ^^enough ^^to ^^not ^^be ^^a ^^spoiler"
  },
  {
   "score": 1,
   "id": "dg5ea7h",
   "pid": "t1_dg4b2ib",
   "date": "2017-04-11 20:18:07",
   "depth": 3,
   "text": "I actually can't stop thinking about how much similar he is with Kiritsugu "
  },
  {
   "score": 3,
   "id": "dg4mrm9",
   "pid": "t1_dg4b2ib",
   "date": "2017-04-11 10:53:53",
   "depth": 3,
   "text": "diet joseph joestar."
  },
  {
   "score": 1,
   "id": "dg5jamp",
   "pid": "t1_dg4mrm9",
   "date": "2017-04-11 22:44:19",
   "depth": 4,
   "text": "ZA FOOL"
  },
  {
   "score": 40,
   "id": "dg4f8uh",
   "pid": "t1_dg4b2ib",
   "date": "2017-04-11 08:36:46",
   "depth": 3,
   "text": "/r/onetrueTatsuya"
  },
  {
   "score": 4,
   "id": "dg5amrm",
   "pid": "t1_dg4f8uh",
   "date": "2017-04-11 18:53:33",
   "depth": 4,
   "text": "Tatsuya is another plane of existence. Love the series and am reading the LN atm, but his character is broken OP. Tried thinking of ways to defeat him and it's like coming up with how to kill wolverine. I think instant disintegration is the most viable method so far."
  },
  {
   "score": 1,
   "id": "dg5syg1",
   "pid": "t1_dg5amrm",
   "date": "2017-04-12 05:42:17",
   "depth": 5,
   "text": "Then he'll come back alive, even if it kills him!"
  },
  {
   "score": 1,
   "id": "dg6ktv7",
   "pid": "t1_dg5syg1",
   "date": "2017-04-12 14:17:12",
   "depth": 6,
   "text": "Somehow, he will make it happen."
  },
  {
   "score": 4,
   "id": "dg7s4ru",
   "pid": "t1_dg5amrm",
   "date": "2017-04-13 09:16:43",
   "depth": 5,
   "text": "Well, considering that his ability isnt supernatural in nature, but rather it's just a magical process in his head on standby. That means that even he can be killed by rendering his brain unable to complete that process via intense trauma. Basically, blowing his head up or something like that will make him unable to recover, and effectively killing him in the process."
  },
  {
   "score": 1,
   "id": "dg8yn5u",
   "pid": "t1_dg7s4ru",
   "date": "2017-04-14 02:34:02",
   "depth": 6,
   "text": "It is still unsure if that works, since it is not the brain that contains the magic calculation area, but the pushion (thought particle) body."
  },
  {
   "score": 2,
   "id": "dg7y8r5",
   "pid": "t1_dg7s4ru",
   "date": "2017-04-13 11:04:58",
   "depth": 6,
   "text": "Yes that is understandable, but I always figured due to the nature of the magic. He would heal the trauma before it takes full effect unless it is instant, because as he said it only takes an instant to heal himself. As for blowing his head up, you can't blow his head up if nothing can hit it. "
  },
  {
   "score": 15,
   "id": "dg4ncst",
   "pid": "t1_dg4f8uh",
   "date": "2017-04-11 11:04:37",
   "depth": 4,
   "text": "no where near tatsuya levels of OP"
  },
  {
   "score": 69,
   "id": "dg4l9eo",
   "pid": "t1_dg4f8uh",
   "date": "2017-04-11 10:26:33",
   "depth": 4,
   "text": "/r/OneTrueTatsuya/\n\nYou disappointed me man."
  },
  {
   "score": 2,
   "id": "dg4soz6",
   "pid": "t1_dg4l9eo",
   "date": "2017-04-11 12:40:36",
   "depth": 5,
   "text": "An attempt was made."
  },
  {
   "score": 15,
   "id": "dg4o5ay",
   "pid": "t1_dg4l9eo",
   "date": "2017-04-11 11:19:17",
   "depth": 5,
   "text": "At least he tried.\n\nMay the One True Tatsuya guide him, and us, to enlightenment, for He will lead us to salvation.\n\n/r/OneTrueTatsuya "
  },
  {
   "score": 135,
   "id": "dg4bud5",
   "pid": "t1_dg4b2ib",
   "date": "2017-04-11 07:32:17",
   "depth": 3,
   "text": "I'd describe it more as his interpretation/application of magic is different to others\n\nHaving a silence in magical society is slightly broken even if it shafts himself as most mages would be reliant on having their magic instead of physical ability \n\nCombat applications are enormous but the development of it is rather ironic considering his character "
  },
  {
   "score": 43,
   "id": "dg4s83m",
   "pid": "t1_dg4bud5",
   "date": "2017-04-11 12:32:15",
   "depth": 4,
   "text": "You have to remember it's within a certain range, while most magic seems to be very effective at long range, too. So he needs to get up close before its useful in any way."
  },
  {
   "score": 2,
   "id": "dg5a8ri",
   "pid": "t1_dg4s83m",
   "date": "2017-04-11 18:44:53",
   "depth": 5,
   "text": "Assuming he can't throw it"
  },
  {
   "score": 2,
   "id": "dg5ocy1",
   "pid": "t1_dg5a8ri",
   "date": "2017-04-12 02:38:38",
   "depth": 6,
   "text": "Naturally, but in that case, it's simply the case of dodging it like any other spell. One would assume a card is significantly harder to throw than a lightning spell."
  },
  {
   "score": 189,
   "id": "dg4bthh",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:31:48",
   "depth": 0,
   "text": "[This] (http://imgur.com/QP0jGnk) sure looks [familiar...](https://www.youtube.com/watch?v=oJdYf0PH-T0&ab_channel=WithStylePetite)\n\nOverall I like the direction this is going. Badass Not-Really-OP MC Magical Girl Glenn-sensei has me hooked."
  },
  {
   "score": 1,
   "id": "dgbu777",
   "pid": "t1_dg4bthh",
   "date": "2017-04-16 01:04:18",
   "depth": 1,
   "text": "Instantly thought of Zombie when he kicked!"
  },
  {
   "score": 1,
   "id": "dg96p8v",
   "pid": "t1_dg4bthh",
   "date": "2017-04-14 07:21:43",
   "depth": 1,
   "text": "I really, really want my proper sequel for this show..."
  },
  {
   "score": 2,
   "id": "dg5ee3c",
   "pid": "t1_dg4bthh",
   "date": "2017-04-11 20:20:46",
   "depth": 1,
   "text": "This [Scene](https://www.youtube.com/watch?v=eNIj8s1TVSA) come to my mind, why? I don't know\n"
  },
  {
   "score": 3,
   "id": "dg4t076",
   "pid": "t1_dg4bthh",
   "date": "2017-04-11 12:46:08",
   "depth": 1,
   "text": "lol i had the exact thought."
  },
  {
   "score": 7,
   "id": "dg4gd5z",
   "pid": "t1_dg4bthh",
   "date": "2017-04-11 08:57:17",
   "depth": 1,
   "text": "was gonna note that xD"
  },
  {
   "score": 25,
   "id": "dg4ptbr",
   "pid": "t1_dg4bthh",
   "date": "2017-04-11 11:49:29",
   "depth": 1,
   "text": "I was looking at that kick and I was like... oooh that's why it's magical, then he said that it was! \n\nI'm sold"
  },
  {
   "score": 111,
   "id": "dg4hefe",
   "pid": "t1_dg4bthh",
   "date": "2017-04-11 09:16:18",
   "depth": 1,
   "text": "I ended up saying \"That's not a kick!\" in my head before he did it lol. Masou shoujo Glenn FTW"
  },
  {
   "score": 10,
   "id": "dg5ipac",
   "pid": "t1_dg4hefe",
   "date": "2017-04-11 22:24:11",
   "depth": 2,
   "text": "[Another great moment in lying to your enemy's face](https://youtu.be/-DMBNvs4vkQ?t=180)"
  },
  {
   "score": 180,
   "id": "dg4io80",
   "pid": "t3_64qza0",
   "date": "2017-04-11 09:39:30",
   "depth": 0,
   "text": "\"That was a kick\"\n\n\"Thats what makes it magical\"\n\nThis show is going places"
  },
  {
   "score": 86,
   "id": "dg4cyo7",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:54:01",
   "depth": 0,
   "text": "This is why you don't drop an anime after its first episode (*^▽^*)"
  },
  {
   "score": 1,
   "id": "dgfu6th",
   "pid": "t1_dg4cyo7",
   "date": "2017-04-18 14:35:32",
   "depth": 1,
   "text": "I actually liked the first episode though."
  },
  {
   "score": 1,
   "id": "dgbu7rg",
   "pid": "t1_dg4cyo7",
   "date": "2017-04-16 01:05:10",
   "depth": 1,
   "text": "Who the fuck drops an Anime after 1 episode, anyway? I thought the general rule was 3 eps?"
  },
  {
   "score": 1,
   "id": "dgb7a3f",
   "pid": "t1_dg4cyo7",
   "date": "2017-04-15 14:28:15",
   "depth": 1,
   "text": "I only kept watching because some jokes in episode 1 were a tad bit funny (which is not a low bar to pass tbh). I'm glad that MC is not completely worthless and overshadowed by the tsundere shironeko."
  },
  {
   "score": 1,
   "id": "dg5ce4e",
   "pid": "t1_dg4cyo7",
   "date": "2017-04-11 19:33:21",
   "depth": 1,
   "text": "You dropped this:  \\\\"
  },
  {
   "score": 1,
   "id": "dg531sr",
   "pid": "t1_dg4cyo7",
   "date": "2017-04-11 16:06:11",
   "depth": 1,
   "text": "It was better than the first episode, but not that much better. I'm hopeful it keeps getting better though. "
  },
  {
   "score": 5,
   "id": "dg8r7t4",
   "pid": "t1_dg4cyo7",
   "date": "2017-04-13 21:26:00",
   "depth": 1,
   "text": "Unless something is completely boring or totally different than what I thought it would be, I try to give it 3 or 4 episodes to pull me in. You never know how quickly a show can turn around or pull one over on you like the first episode of re:Zero."
  },
  {
   "score": 18,
   "id": "dg4zegn",
   "pid": "t1_dg4cyo7",
   "date": "2017-04-11 14:48:26",
   "depth": 1,
   "text": "Yep, sadly many redditors will have the same perception of this anime as it would be another generic one, I guess it can surprise us all and be a favorite at the end of the season "
  },
  {
   "score": 203,
   "id": "dg4asfp",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:10:42",
   "depth": 0,
   "text": "GLENNS INVINCIBLE SPECIAL MOVE... [MAGICAL PUUUUUUUUUUUNCH](http://i.imgur.com/yRaZYeI.png)"
  },
  {
   "score": 11,
   "id": "dg4bro8",
   "pid": "t1_dg4asfp",
   "date": "2017-04-11 07:30:46",
   "depth": 1,
   "text": "it looks just like the dreaded [Goblin Punch](https://www.nuklearpower.com/2006/03/09/episode-670-gettin-tchaikovsky-wit-it/)"
  },
  {
   "score": 28,
   "id": "dg4axjp",
   "pid": "t1_dg4asfp",
   "date": "2017-04-11 07:13:42",
   "depth": 1,
   "text": "I've seen this joke be used in some anime before, but for the love of god, I can't remember where. Does anyone know?:D"
  },
  {
   "score": 91,
   "id": "dg4b3lm",
   "pid": "t1_dg4axjp",
   "date": "2017-04-11 07:17:10",
   "depth": 2,
   "text": "That was \"Kore wa Zombie Desu ka?\" but kick and punch are reversed\n\nhttps://www.youtube.com/watch?v=OuGbcWIqIIM"
  },
  {
   "score": 5,
   "id": "dg4l1ir",
   "pid": "t1_dg4b3lm",
   "date": "2017-04-11 10:22:33",
   "depth": 3,
   "text": "Oh yeah, that's it :D thanks"
  },
  {
   "score": 53,
   "id": "dg4bbgr",
   "pid": "t1_dg4b3lm",
   "date": "2017-04-11 07:21:39",
   "depth": 3,
   "text": "Reigen from Mob Psycho 100 does a similar move where he punches an enemy, while pretending to use hypnosis. "
  },
  {
   "score": 26,
   "id": "dg4debv",
   "pid": "t1_dg4bbgr",
   "date": "2017-04-11 08:02:08",
   "depth": 4,
   "text": "He had me fooled. Even when we thought [Mob Psycho 100](/s \"He was the boss, never been bamboozled that hard before lol\")"
  },
  {
   "score": 1,
   "id": "dg6hvaz",
   "pid": "t1_dg4debv",
   "date": "2017-04-12 13:23:44",
   "depth": 5,
   "text": "The discussion threads really trolled us good."
  },
  {
   "score": 90,
   "id": "dg4de4d",
   "pid": "t1_dg4asfp",
   "date": "2017-04-11 08:02:01",
   "depth": 1,
   "text": "[In the LN/Manga](/s \"He actually goes on the explain how the Magical Punch works before the guy gets knocked out. It was glorious.\")"
  },
  {
   "score": 52,
   "id": "dg4lud3",
   "pid": "t1_dg4de4d",
   "date": "2017-04-11 10:37:04",
   "depth": 2,
   "text": "Yep! He's so full of shit I love the dude."
  },
  {
   "score": 297,
   "id": "dg4c95u",
   "pid": "t1_dg4asfp",
   "date": "2017-04-11 07:40:22",
   "depth": 1,
   "text": "> That's a kick\n\n> That's the part that makes it so magical"
  },
  {
   "score": 126,
   "id": "dg4e1sy",
   "pid": "t1_dg4c95u",
   "date": "2017-04-11 08:14:36",
   "depth": 2,
   "text": "This had me fucking laughing. A bastard magical instructor indeed."
  },
  {
   "score": 45,
   "id": "dg4lmkh",
   "pid": "t1_dg4e1sy",
   "date": "2017-04-11 10:33:08",
   "depth": 3,
   "text": "Also it's kinda nice for him to not be almighty and god-chosen or stuff - he is just smart and cancels off everyone magic. That's kinda deep"
  },
  {
   "score": 28,
   "id": "dg4px64",
   "pid": "t1_dg4lmkh",
   "date": "2017-04-11 11:51:21",
   "depth": 4,
   "text": "I'm just waiting for him to cancel magic and find someone whose better at him in martial arts\n\nfrom the looks of our MC he seems to fight the fight with his brain and I always love that shit"
  },
  {
   "score": 120,
   "id": "dg4awgc",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:13:03",
   "depth": 0,
   "text": "I remember saying last week that Glenn is an incompetent asshole but it looks like he's actually a badass pretending to be an incompetent asshole. Also it looks like I was a bit right from last week's discussion that it will be Glenn learning from his students, what I didn't expect though is that he can actually teach! So I guess it will be a mutual thing.\n\nWe get to see a little bit of Glenn's past and from what we know something about it made Glenn hate magic and see that it's only purpose is to kill humans. Whatever that reason is it looks like it's the same reason that turned him into a shut-in NEET these past few years.\n\nCompared to last week this episode is definitely an improvement. Too bad a lot of people probably already dropped this because of that. Sure it had it's cliches but it's not as bad as people think it is."
  },
  {
   "score": 1,
   "id": "dg55e36",
   "pid": "t1_dg4awgc",
   "date": "2017-04-11 16:59:18",
   "depth": 1,
   "text": "I've watched too much Mahouka Koukou no Rettousei to know OP would be Overpowered."
  },
  {
   "score": 1,
   "id": "dg5j125",
   "pid": "t1_dg55e36",
   "date": "2017-04-11 22:35:13",
   "depth": 2,
   "text": "sasuga [onii-sama](https://lh5.googleusercontent.com/-7kBtnDtefrw/UeHUQomBDbI/AAAAAAAAYjc/9EFHMJL3bQs/s640/Ore%2520no%2520Imouto%2520ga%2520Konnani%2520Kawaii%2520Wake%2520ga%2520Nai.%2520-%252011%2520-%2520Large%252017.jpg)"
  },
  {
   "score": 8,
   "id": "dg4c0lf",
   "pid": "t1_dg4awgc",
   "date": "2017-04-11 07:35:44",
   "depth": 1,
   "text": "> We get to see a little bit of Glenn's past and from what we know something about it made Glenn hate magic and see that it's the only purpose is to kill humans.\n\nI want to know about that, I would think it has to do with the woman he had a flashback of because so looks similar to Sistine, The flashbacks have been super enjoyable. Can't wait for next weeks episode!\n\n> Compared to last week this episode is definitely an improvement. Too bad a lot of people probably already dropped this because of that.\n\nWhile this episode is an improvement lasts wasn't terrible in any way, If people can't give it more than that too bad I guess."
  },
  {
   "score": 1,
   "id": "dg4krmt",
   "pid": "t1_dg4c0lf",
   "date": "2017-04-11 10:17:32",
   "depth": 2,
   "text": "Hmm. I thought he was the guy who rescued the blonde girl in the blonde girl's flashback. I think Glenn was the one who saved her but i'm not so sure though :/"
  },
  {
   "score": 5,
   "id": "dg4f81i",
   "pid": "t1_dg4c0lf",
   "date": "2017-04-11 08:36:21",
   "depth": 2,
   "text": "> I want to know about that\n\nyou'll find out a large part of it in the next episode"
  },
  {
   "score": 114,
   "id": "dg4cgmd",
   "pid": "t1_dg4awgc",
   "date": "2017-04-11 07:44:24",
   "depth": 1,
   "text": "> Too bad a lot of people probably already dropped this because of that.\n\n\n[People who drop after **watching only ep 1**](#peasants)\n"
  },
  {
   "score": 1,
   "id": "dg4o48t",
   "pid": "t1_dg4cgmd",
   "date": "2017-04-11 11:18:44",
   "depth": 2,
   "text": "Some people don't have much time to watch anime, so if the first episode doesn't grab them why would they keep watching?\n\nThe first episode of this show repulsed me. I hated it. Just because it gets better doesn't mean I'm going to keep watching when I have little time to watch anime. 3 episode rule is just a guideline, not a strict rule imo."
  },
  {
   "score": 1,
   "id": "dg6k8nu",
   "pid": "t1_dg4cgmd",
   "date": "2017-04-12 14:06:01",
   "depth": 2,
   "text": "honestly speaking if it wasn't for reddit i would have dropped this after the first ep. It was really bad :/. It was chock full of cliches and the MC was a giant douche for no reason who thought he was funny."
  },
  {
   "score": 1,
   "id": "dg4p7wq",
   "pid": "t1_dg4cgmd",
   "date": "2017-04-11 11:38:56",
   "depth": 2,
   "text": "I knew there *had* to be some kind of catch with him being portrayed as \"weak\" at the start."
  },
  {
   "score": 4,
   "id": "dg4ihvw",
   "pid": "t1_dg4cgmd",
   "date": "2017-04-11 09:36:15",
   "depth": 2,
   "text": "I'm reading these comments and I still haven't undropped it. :|"
  },
  {
   "score": 1,
   "id": "dg50tec",
   "pid": "t1_dg4ihvw",
   "date": "2017-04-11 15:18:00",
   "depth": 3,
   "text": "The series is continuously hindered by the uniforms of the girls, but the first episode isn't remotely representative of what it later becomes.  Like 60-90% of the fanservicey stuff from early on is dropped.  It gets *a lot* better and there's far fewer implications it could be going for the \"teacher gets with the students\" ending."
  },
  {
   "score": 2,
   "id": "dg5cctd",
   "pid": "t1_dg4cgmd",
   "date": "2017-04-11 19:32:31",
   "depth": 2,
   "text": "They don't deserve good things anyway"
  },
  {
   "score": 3,
   "id": "dg5bxbh",
   "pid": "t1_dg4cgmd",
   "date": "2017-04-11 19:22:38",
   "depth": 2,
   "text": "I have dropped shows without watching them."
  },
  {
   "score": 3,
   "id": "dg5aaoo",
   "pid": "t1_dg4cgmd",
   "date": "2017-04-11 18:46:05",
   "depth": 2,
   "text": "[People who drop](#peasants )"
  },
  {
   "score": 8,
   "id": "dg4owl2",
   "pid": "t1_dg4cgmd",
   "date": "2017-04-11 11:33:07",
   "depth": 2,
   "text": "Some don't deserve even that much. ¯\\\\_ _(ツ)_ _/¯"
  },
  {
   "score": 65,
   "id": "dg4ckl0",
   "pid": "t1_dg4cgmd",
   "date": "2017-04-11 07:46:33",
   "depth": 2,
   "text": "People should really learn to at least try for the 3 episode rule. I know a lot of people dropped Youjo Senki because of episode 1 and missed a whole lot."
  },
  {
   "score": 2,
   "id": "dg4nxbz",
   "pid": "t1_dg4ckl0",
   "date": "2017-04-11 11:15:13",
   "depth": 3,
   "text": "No this rule is stupid. For some shows, five minutes is enough to notice poor writing, terrible directing, or simply that they aren't really trying to make something at least good.\n\nFor this show, it was obvious the MC was hiding his strong point, so I would have waited until they reveal it. But if it wasn't shown at this episode, it would have been legitimately bad writing, so I would have probably quit unless there was another mystery introduced.\n\nFortunately, the reveal was pretty good. So I'll continue to watch.\n\nThough I didn't intend to even try this show because the uniforms are horribly bad, they couldn't be more unappropriate, it's like the best way to waste a good show, the man who did this should be fired seriously."
  },
  {
   "score": 2,
   "id": "dg4dt6e",
   "pid": "t1_dg4ckl0",
   "date": "2017-04-11 08:10:07",
   "depth": 3,
   "text": "Honestly, the three episode rule isn't very reliable. I'd say five would be much better."
  },
  {
   "score": 2,
   "id": "dg4f8yl",
   "pid": "t1_dg4dt6e",
   "date": "2017-04-11 08:36:49",
   "depth": 4,
   "text": "Nah, you apply the Gintama rule. It's not good by ep x, it will get better at ep x+20 "
  },
  {
   "score": 3,
   "id": "dg4nyz4",
   "pid": "t1_dg4f8yl",
   "date": "2017-04-11 11:16:04",
   "depth": 5,
   "text": "If only my favorite shows kept going forever like that..."
  },
  {
   "score": 5,
   "id": "dg4gj0g",
   "pid": "t1_dg4dt6e",
   "date": "2017-04-11 09:00:18",
   "depth": 4,
   "text": "3 when is a 12/13 episode series is better"
  },
  {
   "score": 45,
   "id": "dg4f3oz",
   "pid": "t1_dg4dt6e",
   "date": "2017-04-11 08:34:04",
   "depth": 4,
   "text": "3 episodes are around 1 hour, that should almost always be enough time for something to catch your attention and keep you interested, if you have to watch almost half of an anime before you decide you wanna keep watching it, chances are it wasn't worth it"
  },
  {
   "score": 11,
   "id": "dg4i8o7",
   "pid": "t1_dg4f3oz",
   "date": "2017-04-11 09:31:31",
   "depth": 5,
   "text": "Chances, but damn if it didn't take me 12 episodes to get interested in Steins;Gate even though it's one of my favorite shows. And one time a friend of mine lent me a book saying \"the first third or so is pretty boring but it's a really good book I swear!\" And gosh darn if that book wasn't really great after the first third. \n\nBeing part of the no drop master race is painful 99% of the time, but those rare occasions when it pays off must be extremely satisfying. "
  },
  {
   "score": 6,
   "id": "dg4lnqc",
   "pid": "t1_dg4i8o7",
   "date": "2017-04-11 10:33:43",
   "depth": 6,
   "text": "I can never recommend shows like Steins to friends, Telling them they have to watch half the show that is boring to get to the actually interesting part is not a good way to sell it\n\nPersonally, I've always felt that a show that takes that long to get decent is usually fairly weak or reliant on tone switching for shock factor "
  },
  {
   "score": 0,
   "id": "dg5ahxi",
   "pid": "t1_dg4lnqc",
   "date": "2017-04-11 18:50:37",
   "depth": 7,
   "text": "I'm going to have to disagree with you on that. Juxtaposition is a powerful tool. Stories are about events, and events cause change, so a huge part of a story is the end point. You obviously want to have a good trip to that endpoint, but if your endpoint wasn't good, why'd you take the trip? "
  },
  {
   "score": 7,
   "id": "dg4luez",
   "pid": "t1_dg4lnqc",
   "date": "2017-04-11 10:37:05",
   "depth": 7,
   "text": "Hm, I think it's kind of like the Silmarillion. Now, I know I'm going to get some hate for this, but I didn't really enjoy Lord of the Rings. I mean, it was a good story, but I desperately wanted a cliffnotes version. However, I really enjoyed the Silmarillion. But without forcing myself to sit through LotR first, I wouldn't be able to appreciate the Silmarillion. (I should probably be capitalizing those \"the\"s shouldn't I... oh well.)"
  },
  {
   "score": 2,
   "id": "dg4mpme",
   "pid": "t1_dg4luez",
   "date": "2017-04-11 10:52:50",
   "depth": 8,
   "text": "I get where you're going with that and I can agree with it as well (Why do all the best stories happen before the actual plot?)\n\nBut I also can't begrudge people when they complain that the majority of the story is boring and that makes what would have been 10/10 content 8/10\n\nI have plenty of friends who dropped steins because the first half was straight up boring and pointless, I can totally see why\n\nMeanwhile I'm sitting here polishing my Comet Lucifer medal \n\n"
  },
  {
   "score": 3,
   "id": "dg4obc4",
   "pid": "t1_dg4mpme",
   "date": "2017-04-11 11:22:24",
   "depth": 9,
   "text": "> Comet Lucifer\n\n-hangs head- I too finished that, but I just... I really didn't realize it was bad until the last episode. And then out of nowhere it slapped me in the face and I was like \"how did I not see it sooner?\""
  },
  {
   "score": 3,
   "id": "dg4pxlc",
   "pid": "t1_dg4obc4",
   "date": "2017-04-11 11:51:33",
   "depth": 1,
   "text": "You got a sweet medal, It was worth the sacrifice"
  },
  {
   "score": 2,
   "id": "dg4r0un",
   "pid": "t1_dg4pxlc",
   "date": "2017-04-11 12:10:35",
   "depth": 2,
   "text": "Actually, I didn't get a medal. I didn't even know that was a thing people did until Hand Shakers. But it's all good. "
  },
  {
   "score": 3,
   "id": "dg4rcwq",
   "pid": "t1_dg4r0un",
   "date": "2017-04-11 12:16:28",
   "depth": 3,
   "text": "Well, I will just give you a [medal](http://i.imgur.com/80WYVwI.jpg)\n\nNow you are one of us"
  },
  {
   "score": 2,
   "id": "dg4sfcb",
   "pid": "t1_dg4rcwq",
   "date": "2017-04-11 12:35:51",
   "depth": 4,
   "text": "Woot!"
  },
  {
   "score": 2,
   "id": "dg5q5g9",
   "pid": "t1_dg4ckl0",
   "date": "2017-04-12 04:06:27",
   "depth": 3,
   "text": "Well...i didnt like youjo senki very much. [youjo senki]( /s \"I couldnt hold my suspension of disbielief too much because of the protag being 10-11 years old\" . I dont like powers that make you practicly invincible which salary man possesed from being x\" ). It was a nice concept and it did have some nice things but ultimately i personally didnt like it. I would rate it like 6/10 because it was good in the end and presented some well executed ideas. But i really wanted to drop youjo senki after ep 3 or smth.\n\nIn this anime i saw some potential in the first ep so i said to myself that i will wait another week and see if its any good. First episode besides a couple of funny gags wasnt very captivating. It was worth it. Second episode is much better, eplores the magic system and gives characterization and much more development to the cast+ some action. The main character here is actually experienced in terms of fighting so its easier for me to belive in his prowess. He is already a grown up man so having a lot of knowledge about magic (which is really cool to boot) isnt weird. And he isnt totally OP, although he has in his possesion the unique magic of \"fools world\" ( i like when stories reference tarrot but i wonder if they will do something more with it...besides some cool names and references) it isnt totally uncounterable. Due to the magic he cant casts spells himself and needs to train his body, he cant cancel long range magic cuz of the range of the spell. Its powerfull but not totally overpowered( what i hate the most in stories are totally overpowered characters that just roll over anything, especially those characters that are only written for easy wishfulfillment for the viewer meaning self insertion, i hate it...fuck xianxia novels)\n\nedit: i just wonder if they will continue with the tarrots theme and if they will go with the card \"the world\"what will the ability be called ? \"the worlds world\" ?\n\nobviously it rather wouldnt be called like that but just a fun tought"
  },
  {
   "score": 1,
   "id": "dg5sn2d",
   "pid": "t1_dg5q5g9",
   "date": "2017-04-12 05:33:19",
   "depth": 4,
   "text": "This comment has been removed. Please review for any tags you may have missed and reply to this message to have your post re-approved.\n\nUntagged or improperly tagged spoilers are not allowed.\n\nRepeated violations of this rule will result in a ban.\n\n\n\n---\n^(Have a question or think this removal was an error?) [^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)\n^(Don't know the rules? Read them )[^(here)](/r/anime/wiki/rules)^."
  },
  {
   "score": 1,
   "id": "dg5t8x0",
   "pid": "t1_dg5sn2d",
   "date": "2017-04-12 05:50:11",
   "depth": 5,
   "text": "i think the spoilers are now tagged, sorry\n\n"
  },
  {
   "score": 1,
   "id": "dg5ta60",
   "pid": "t1_dg5t8x0",
   "date": "2017-04-12 05:51:05",
   "depth": 6,
   "text": "All set!"
  },
  {
   "score": 2,
   "id": "dg4cveq",
   "pid": "t1_dg4ckl0",
   "date": "2017-04-11 07:52:18",
   "depth": 3,
   "text": "There are a lot of people like that out there. That's why pilot episode most likely to contain a 2 episode worth (48 minutes) to make people stick.\n\nBut not a lot of studio have the budget to make that, and people seem to have a short attention span this day. Hence the problem."
  },
  {
   "score": 1,
   "id": "dg5j9r7",
   "pid": "t1_dg4cveq",
   "date": "2017-04-11 22:43:29",
   "depth": 4,
   "text": "I remember that 40min rezero"
  },
  {
   "score": 3,
   "id": "dg4g26a",
   "pid": "t1_dg4cveq",
   "date": "2017-04-11 08:51:47",
   "depth": 4,
   "text": "Just giving some insight here but I dropped the first episode halfway in as it just didn't hook me in. I came back after looking at this thread but I am still probably not going to stick through with it as I'm still not hooked.\n\nThere's just other anime I still need to get through on my to watch as well as the many games I haven't played that I got on sale. Its sort of like when I go browsing for books in a store, if the first few pages let alone the first chapter doesn't hook me in to its story I would prefer going to look for something else."
  },
  {
   "score": 3,
   "id": "dg52x15",
   "pid": "t1_dg4ckl0",
   "date": "2017-04-11 16:03:14",
   "depth": 3,
   "text": "> I know a lot of people dropped Youjo Senki because of episode 1 \n\nWait, people thought episode 1 of Youjo Senki was bad? I thought it was awesome and got me hyped for a great anime I didn't even see coming. What was it that people didn't like about it?"
  },
  {
   "score": 3,
   "id": "dg532mf",
   "pid": "t1_dg52x15",
   "date": "2017-04-11 16:06:41",
   "depth": 4,
   "text": "It's the Magic + World War vibes. It's not the first time it's been done, with Izetta being a disappointment from the previous season people just didn't bother. Another reasoning is that they were put off by Tanya's art."
  },
  {
   "score": 3,
   "id": "dg53mcf",
   "pid": "t1_dg532mf",
   "date": "2017-04-11 16:19:13",
   "depth": 5,
   "text": "> It's the Magic + World War vibes. It's not the first time it's been done\n\nFair enough. it is an overplayed genre to an extent. \n\n > with Izetta being a disappointment from the previous season people just didn't bother\n\nIzetta was definitely a travesty. But I distinctly remember finishing episode 1 of YouJo Senki and felt that it was not going to be like Izetta and that it had done a good job of distinguishing itself. It wasn't a \"I hope it's different this time\" but more of a \"wow.. this IS different...\"\n\n> they were put off by Tanya's art.\n\nI guess aesthetic differences certainly play a role. I thought the art was amazing for everyone except I wasn't a huge fan of Viktoriya. But, the character design for Tanya was amazeballs, IMO. "
  },
  {
   "score": 1,
   "id": "dg5j8u9",
   "pid": "t1_dg53mcf",
   "date": "2017-04-11 22:42:39",
   "depth": 6,
   "text": "But its more WW1 than 2."
  },
  {
   "score": 17,
   "id": "dg4ihb0",
   "pid": "t1_dg4awgc",
   "date": "2017-04-11 09:35:58",
   "depth": 1,
   "text": "Last week I was watching people drop it in despair at their reasoning of him being useless because I was pretty certain something like this would happen. "
  },
  {
   "score": 1,
   "id": "dg5j4km",
   "pid": "t1_dg4ihb0",
   "date": "2017-04-11 22:38:37",
   "depth": 2,
   "text": "It's a staple fantasy [trope](http://tvtropes.org/pmwiki/pmwiki.php/Main/HiddenBadass). If he was useless, then it'd be [more](http://tvtropes.org/pmwiki/pmwiki.php/Main/UselessProtagonist)."
  },
  {
   "score": 2,
   "id": "dg5l0nh",
   "pid": "t1_dg4ihb0",
   "date": "2017-04-11 23:52:34",
   "depth": 2,
   "text": "I really don't get that, like, people really expected an anime about a useless teacher that has no skill? It seemed pretty damn obvious there would be something about him despite initial appearances what with him being forced into the position. Eh, maybe I watch too much anime/tv shows in general or people just really wanted to believe they would make that stupid of an anime."
  },
  {
   "score": 1,
   "id": "dg63ilv",
   "pid": "t1_dg5l0nh",
   "date": "2017-04-12 09:18:42",
   "depth": 3,
   "text": "I think I was putting a lot of faith in busty-sensei. She seems to be well-respected, so it'd be strange for her to be strongly advocating this guy if there wasn't something to him. That he has apparently zero pride also made me think he probably has a pretty dark past full of doing things that make him hate himself. Or just has mental issues. But stories usually go for the former."
  },
  {
   "score": 1,
   "id": "dg68mhf",
   "pid": "t1_dg63ilv",
   "date": "2017-04-12 10:45:42",
   "depth": 4,
   "text": "I mean since he took out those dark mages, he is probably was some sort of assassin, and probably saw the darkest uses of magic. So he probably got pulled into that and became bitter towards magic, hence his bleak view compared to the girls positive outlook."
  },
  {
   "score": 1,
   "id": "dg69h8n",
   "pid": "t1_dg68mhf",
   "date": "2017-04-12 11:00:04",
   "depth": 5,
   "text": "I never understand why so many assassins hate themselves. I mean, yeah, the crushing guilt of countless murders staining your soul etc etc, but that *is* in the job description after all, so they can hardly say they didn't know what they were getting into. And I accept that probably *some* assassins are.... somehow... forced into the job, but it can't be *that* many. You'd think more of them would be psychopaths (who would, of course, *not* experience said crushing guilt). Though I guess in terms of making a character likeable, them being totally heartless is problematic, and once you start giving them some semblance of a heart, you've gotta give them soul-crushing guilt about being an assassin too.... .... ... Whelp, that's that question answered."
  },
  {
   "score": 2,
   "id": "dg6a5jc",
   "pid": "t1_dg69h8n",
   "date": "2017-04-12 11:11:43",
   "depth": 6,
   "text": "It could also be kinda like cops, they really don't hate themselves, but they see the worst in human society and become bitter. He might not hate himself, he might just see the worst people using magic in the worst way, and so he has become bitter."
  },
  {
   "score": 1,
   "id": "dg6baho",
   "pid": "t1_dg6a5jc",
   "date": "2017-04-12 11:31:03",
   "depth": 7,
   "text": "Ah, I hadn't considered the possible results of constantly dealing with shitty people. Good thinking."
  },
  {
   "score": 19,
   "id": "dg4jvlk",
   "pid": "t1_dg4ihb0",
   "date": "2017-04-11 10:01:11",
   "depth": 2,
   "text": "To be fair, and while I don't condone dropping after a single episode, I blame the script for that one. Why have him make a heel turn on episode 2 and suddenly become very competent after being completely useless in the first episode ? If they had given just a hint of badassery, it wouldn't have happened and this episode would feel less forced."
  },
  {
   "score": 1,
   "id": "dg512a8",
   "pid": "t1_dg4jvlk",
   "date": "2017-04-11 15:23:18",
   "depth": 3,
   "text": "I think at first the author was going for a generic fanservicey comedy, but after the first few chapters decided to take it in a better route.  Having read through the manga, an enormous chunk of the fanservicey stuff gets dropped."
  },
  {
   "score": 19,
   "id": "dg4ly7s",
   "pid": "t1_dg4jvlk",
   "date": "2017-04-11 10:39:02",
   "depth": 3,
   "text": "But there must have been a hint of badassery there or I wouldn't have expected it to be there."
  },
  {
   "score": 2,
   "id": "dg4pcw6",
   "pid": "t1_dg4ly7s",
   "date": "2017-04-11 11:41:27",
   "depth": 4,
   "text": "The mere fact that he's the MC in a magical high school harem-esque show should be enough of a flag to signal that there was a catch with him being portrayed as \"weak\"/\"average\". I was waiting for the payoff at the end of EP 1 but knew that if it didn't come there then it would be coming in the next episode, and boy did it deliver."
  },
  {
   "score": 37,
   "id": "dg4mwel",
   "pid": "t1_dg4ly7s",
   "date": "2017-04-11 10:56:18",
   "depth": 4,
   "text": "Well, I trust you to be genre-savvy enough to expect it with or without hint.\n\nAlso there were plenty of indirect hints such as him having the trust of a professor, being overconfident and hiding something (shown through his brief serious glances after some comments).\n\nThe point wasn't so much to tell the viewers, because he *is* a protagonist, after all, so the viewers knew. It would set the tone more seriously, though. They could have made him arrogant because he's able to trump any opponent's move, scornful of magic because he knows exactly how powerful it is and what it can't achieve, or lazy because he privileges efficiency. They did none of this, in my opinion.\n\nThe first episode is typically reserved for character introduction, and that's what I think they missed by not giving any explicit indication. I have my reasons to not believe it myself, but I wouldn't blame someone for considering Glenn as \"an annoying brat that got some magical motivation to show MC-level OP powers after a completely unrelated dialogue\".\n\n~~Maybe~~ I'm definitely reading too much in this (as evidenced by the length of this answer. Crap), but it is enough to see how many comments are saying that the second episode was much better to conclude that the first episode did things wrong. The most obvious difference (Glenn being a badass) is likely correlated with that."
  },
  {
   "score": 1,
   "id": "dg4vgpv",
   "pid": "t1_dg4mwel",
   "date": "2017-04-11 13:31:31",
   "depth": 5,
   "text": "I think it'd have helped if they had managed to work the \"what is magic good for\" bit in the first episode, because, while it doesn't really hint at his power level, it does present him as a \"thinker\", and hint to more about his character and history."
  },
  {
   "score": 9,
   "id": "dg4n5bc",
   "pid": "t1_dg4mwel",
   "date": "2017-04-11 11:00:52",
   "depth": 5,
   "text": "I like you. You almost always think things through reasonably. \n\nAnd yeah, I think Glenn was trying way to hard to appear incompetent and that ended up making a lot of people dislike the show. It didn't really bother me, but I can see where it would make others frustrated."
  },
  {
   "score": 1,
   "id": "dg4svak",
   "pid": "t1_dg4n5bc",
   "date": "2017-04-11 12:43:46",
   "depth": 6,
   "text": "\"I'm the cook.\""
  },
  {
   "score": 10,
   "id": "dg4nvqb",
   "pid": "t1_dg4n5bc",
   "date": "2017-04-11 11:14:23",
   "depth": 6,
   "text": "[](#flattered)"
  },
  {
   "score": 16,
   "id": "dg5dcki",
   "pid": "t1_dg4mwel",
   "date": "2017-04-11 19:55:35",
   "depth": 5,
   "text": "But the reason why he acted so extremely incompetent was pretty obvious imo.  \n  \nHe obviously didn't want to teach since he was forced into the job and so he just fucked around as much as possible until the school could no longer tolerate him.  \n  \nHe even got happy when Sistine said she has enough influence to maybe get him fired. So there was a solid reason for his goofy act."
  },
  {
   "score": 35,
   "id": "dg4lug8",
   "pid": "t1_dg4ihb0",
   "date": "2017-04-11 10:37:06",
   "depth": 2,
   "text": "It's kinda amusing how the sub has a hate boner for being generic when it comes to these shows \n\nBut wouldn't an actually useless MC be something a little more creative? Usually, they have some super duper hidden power or trait that makes them OP\n\n\n\n"
  },
  {
   "score": 1,
   "id": "dg59vnb",
   "pid": "t1_dg4lug8",
   "date": "2017-04-11 18:36:49",
   "depth": 3,
   "text": "You basically described Inou-battle, right? The fact that it's underappreciated as a whole anime TRIGGERS me (get it get it?)"
  },
  {
   "score": 3,
   "id": "dg4x5ua",
   "pid": "t1_dg4lug8",
   "date": "2017-04-11 14:03:32",
   "depth": 3,
   "text": "useless mc is good for a comedy, like Inou-Battle wa Nichijou-kei no Naka de . Gets pretty annoying in any other genre though."
  },
  {
   "score": 13,
   "id": "dg4m6ej",
   "pid": "t1_dg4lug8",
   "date": "2017-04-11 10:43:07",
   "depth": 3,
   "text": "I'm pretty sure that ends up just becoming SOL. But yeah, generic's not so bad."
  },
  {
   "score": -4,
   "id": "dg4mgyk",
   "pid": "t1_dg4m6ej",
   "date": "2017-04-11 10:48:29",
   "depth": 4,
   "text": "Keep the girls superpowered, have the MC be completely normal\n\nApply MC dick thirst for good measure and we have a show"
  },
  {
   "score": 3,
   "id": "dg4ohb3",
   "pid": "t1_dg4mgyk",
   "date": "2017-04-11 11:25:25",
   "depth": 5,
   "text": "=_= that's the kind of show that irritates me actually. I'm in this for the self-insertion where I can pretend I ended up being awesome, not for the self-insertion where I'm just as useless as always. I can just go to real life for that."
  },
  {
   "score": 2,
   "id": "dg4pp9r",
   "pid": "t1_dg4ohb3",
   "date": "2017-04-11 11:47:30",
   "depth": 6,
   "text": "But are you surrounded by girls IRL who all want to bang you?\n\nIt still has self insert factor "
  },
  {
   "score": 3,
   "id": "dg4r85t",
   "pid": "t1_dg4pp9r",
   "date": "2017-04-11 12:14:09",
   "depth": 7,
   "text": "I want to claim that this isn't important to me because I'm a girl, but it's actually mostly because those girls aren't interested in forming an *actual* harem. If they were though, I'd probably enjoy that show."
  },
  {
   "score": 3,
   "id": "dg4rjch",
   "pid": "t1_dg4r85t",
   "date": "2017-04-11 12:19:45",
   "depth": 8,
   "text": "I feel super bad now because until now I assumed you was a boy\n\nYou could become the MC of your own Yuri harem though? Just make sure Kyoani doesn't do it unless you want it to be purely bait\n\nAlso, You must love Momo"
  },
  {
   "score": 1,
   "id": "dg4seqm",
   "pid": "t1_dg4rjch",
   "date": "2017-04-11 12:35:32",
   "depth": 9,
   "text": "> Momo\n\n? Who's that?\n\nAnd no need to feel bad lulz. It's not like I have a picture of myself next to my name or something (if I did and you still thought I was a boy though....). Hm, I'd rather be a girl in a traditional harem. There are benefits to both genders, and I'd rather not limit myself. But yeah, definitely not having KyoAni do it either way XD"
  },
  {
   "score": 2,
   "id": "dg4so4r",
   "pid": "t1_dg4seqm",
   "date": "2017-04-11 12:40:10",
   "depth": 1,
   "text": "To Love Ru, Momo? If you haven't seen it go watch it, It's stupid and charming at the same time\n\nI could see benefits of being a girl in a traditional harem, Just go the yuri kohai route and you can bang the MC and the harem"
  },
  {
   "score": 1,
   "id": "dg4sxcj",
   "pid": "t1_dg4so4r",
   "date": "2017-04-11 12:44:45",
   "depth": 2,
   "text": "Ah, yeah, haven't seen that yet."
  },
  {
   "score": 1,
   "id": "dgfp4ws",
   "pid": "t1_dg4m6ej",
   "date": "2017-04-18 13:06:49",
   "depth": 4,
   "text": "Generic isnt bad. Its how well you do it that makes it good or bad."
  },
  {
   "score": 53,
   "id": "dg4bvdq",
   "pid": "t1_dg4awgc",
   "date": "2017-04-11 07:32:52",
   "depth": 1,
   "text": ">  Glenn is an incompetent asshole but it looks like he's actually a badass pretending to be an incompetent asshole.\n\nWhat about both?"
  },
  {
   "score": 28,
   "id": "dg4c06r",
   "pid": "t1_dg4bvdq",
   "date": "2017-04-11 07:35:32",
   "depth": 2,
   "text": "The asshole part yes but I don't think I can say true about the incompetent part since he was able to activate Shock Bolt with only a single half hearted phrase. If he was motivated enough he could've beaten Sistine during their duel."
  },
  {
   "score": -2,
   "id": "dg4ch1v",
   "pid": "t1_dg4c06r",
   "date": "2017-04-11 07:44:37",
   "depth": 3,
   "text": "[deleted]"
  },
  {
   "score": 13,
   "id": "dg4clek",
   "pid": "t1_dg4ch1v",
   "date": "2017-04-11 07:47:00",
   "depth": 4,
   "text": "> Remember the guy was sitting at home being completely worthless feeling sorry for himself\n\nSounds like he understands the world *too* well! And freeloading off a hot girl, too? We all wish we were so lucky."
  },
  {
   "score": 1,
   "id": "dg4idoq",
   "pid": "t1_dg4clek",
   "date": "2017-04-11 09:34:07",
   "depth": 5,
   "text": "Yeah, it's a pretty great lifestyle as long as you remember that pride is a sin."
  },
  {
   "score": 51,
   "id": "dg4dcze",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:01:26",
   "depth": 0,
   "text": "Woah. I'm speechless. I take back everything I said during first episode. This is nice. Quite nice. Rather, what's with this comeback? Why the hell are you trying to have such bad first impression on me, when this is your true self?\n\nI seriously love my habit of almost never dropping anime. To find and discover these kind of things. This truly is blissful.\n\nNow I can proudly say that I'm probably going to enjoy this. \n\nNice job. You have my thanks, for whatever they may be worth."
  },
  {
   "score": 1,
   "id": "dg4jzap",
   "pid": "t1_dg4dcze",
   "date": "2017-04-11 10:03:04",
   "depth": 1,
   "text": "> Rather, what's with this comeback? Why the hell are you trying to have such bad first impression on me, when this is your true self?\n\nGood question. He got his discussion with Rumia and that's it ? Nothing that should have made him change direction..."
  },
  {
   "score": 1,
   "id": "dg5amlj",
   "pid": "t1_dg4dcze",
   "date": "2017-04-11 18:53:27",
   "depth": 1,
   "text": "he just wanted to get fired\n"
  },
  {
   "score": 1,
   "id": "dg4pzyb",
   "pid": "t1_dg4dcze",
   "date": "2017-04-11 11:52:43",
   "depth": 1,
   "text": "As a fellow member of the no drop masochi-*ahem*-master race, I salute you."
  },
  {
   "score": 3,
   "id": "dg4ta95",
   "pid": "t1_dg4pzyb",
   "date": "2017-04-11 12:51:06",
   "depth": 2,
   "text": "It seems like we should get a hobby... oh wait. We already have one, killing time watching every anime that comes out every season.^because ^it's ^our ^duty"
  },
  {
   "score": 23,
   "id": "dg4tzdy",
   "pid": "t1_dg4dcze",
   "date": "2017-04-11 13:03:50",
   "depth": 1,
   "text": "The first episode wasn't that bad imo, even though it did show the MC as just weak. Pretty easy to figure out that he has something in his sleeve though.\n\nThen again, nothing seems that terrible after episode 1 of Sagrada (or Sakurada) Reset. That was some shit. "
  },
  {
   "score": 1,
   "id": "dg5im2w",
   "pid": "t1_dg4tzdy",
   "date": "2017-04-11 22:21:16",
   "depth": 2,
   "text": "Yeah they reallyed messed up Sakurada reset. You have Hanakana and Aoi Yuuki. and it was still boring. Director messed up somehwere"
  },
  {
   "score": 1,
   "id": "dg55xjx",
   "pid": "t1_dg4tzdy",
   "date": "2017-04-11 17:11:04",
   "depth": 2,
   "text": "I was so hyped for Sakurada reset from its premise but it is like the first episode deliberately tried to not hook me in."
  },
  {
   "score": 1,
   "id": "dg5l6j0",
   "pid": "t1_dg55xjx",
   "date": "2017-04-11 23:59:50",
   "depth": 3,
   "text": "Yeah, for some reasons I thought that the problem lied in me for not understanding it, so I rewatched the first episode and... nope still not hooked up. I can only pray."
  },
  {
   "score": 3,
   "id": "dg4ujvl",
   "pid": "t1_dg4tzdy",
   "date": "2017-04-11 13:14:29",
   "depth": 2,
   "text": "Rather than he being weak, I just disliked his attitude. Even if you're the strongest in the world, it just pisses me off that kind of behaviour. But second episode was really good compared to the first IMO, so I'll wait before judging it.\n\nIf you find Sagrada/Sakurada Reset shit, you should try some of the wonderful masterpiece (of mindfucking and wut) of the previous seasons. For \"it's so bad that's you actually can't understand most of it\" I would suggest Big Order, for \"most average story about a guy and another guy in another pseudo world, extremely boring with a yaoi feeling towards the end\" Endride, but let's not forget about Scared Rider Xechs which was simply... huh awful IMO."
  },
  {
   "score": 1,
   "id": "dg5lwhx",
   "pid": "t1_dg4ujvl",
   "date": "2017-04-12 00:32:40",
   "depth": 3,
   "text": "Ah Big Order, a poor man's Jojo in a season that decided to air during the same season as actual Jojo.  Really don't understand how that show got off of the air.  The only real difference between Orders and Stands was that they had to literally say 'order _____' every time they used their powers, which was really dumb"
  },
  {
   "score": 1,
   "id": "dg5m7mb",
   "pid": "t1_dg5lwhx",
   "date": "2017-04-12 00:47:20",
   "depth": 4,
   "text": "To tell the truth, I did enjoy Big Order. I was waiting every week thinking \"how, just how will it surprise me this week? I can't wait to spill my milk for the n time\". \n\nJokes aside, I don't really think that the true difference between Orders and Stands was really having to say aloud their names... you know, I think I've heard more \"ZA WARUDO\" than \"ORDER: XXXXX\". I would rather say that actually Jojo's MCs use their ~~brain cells~~ testosterones."
  },
  {
   "score": 1,
   "id": "dg4w681",
   "pid": "t1_dg4ujvl",
   "date": "2017-04-11 13:44:38",
   "depth": 3,
   "text": "It was in no way so bad it was almost good, it was simply so fucking boring I could barely get through one episode. I'm sure it'll pick up and get better later since it's 24 episodes, but I'm done lol."
  },
  {
   "score": 2,
   "id": "dg5l5n1",
   "pid": "t1_dg4w681",
   "date": "2017-04-11 23:58:47",
   "depth": 4,
   "text": "Are you referring to Sagrada? I was quite sarcastic anyways, but I suppose that a boring anime is worse than a bad anime. At least for the latter ones you can pinpoint its bad point and trash-talk to them (so getting at least some enjoyment(?)), while for boring anime... well they are just boring. They do not entertain you in any ways. \n\nBut as I'm a maso- *cough a no-drop idiotic otaku, I'll hope for the best. You never know what may happen."
  },
  {
   "score": 7,
   "id": "dg4zbie",
   "pid": "t1_dg4ujvl",
   "date": "2017-04-11 14:46:46",
   "depth": 3,
   "text": "I really liked his attitude, it reminds me of kasuma. And I'm tired of the \"white knights\" in anime and magical schools in particular, being nice is just boring "
  },
  {
   "score": 1,
   "id": "dg5l8za",
   "pid": "t1_dg4zbie",
   "date": "2017-04-12 00:02:47",
   "depth": 4,
   "text": "For some reasons, I just love Kazuma as he's not the stereotype white knight, but I can't just like this MC.\n\nI find Kazuma funny, but this... is more like 70%-80% scumbag and annoying and 20% funny. But, as I've said, this second episode really surprised me, so I won't judge it anymore for a while. Though I really wonder why it gave me such a bad first impression."
  },
  {
   "score": 1,
   "id": "dg8yyxu",
   "pid": "t1_dg5l8za",
   "date": "2017-04-14 02:51:46",
   "depth": 5,
   "text": "I'm not surprised. I mean, he *is* in \"scumbag unmotivated hikki-NEET\"-mode in the first episode after all. Of course dropping the \"unmotivated hikki-NEET\" part would make one's opinion of him better."
  },
  {
   "score": 3,
   "id": "dg674q6",
   "pid": "t1_dg5l8za",
   "date": "2017-04-12 10:20:50",
   "depth": 5,
   "text": "Yeah, I'd be pretty pissed if my professor has his attitude from episode 1 too XD"
  },
  {
   "score": 3,
   "id": "dg5inso",
   "pid": "t1_dg4zbie",
   "date": "2017-04-11 22:22:49",
   "depth": 4,
   "text": "Reminds me of Kazuma."
  },
  {
   "score": 157,
   "id": "dg4dtco",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:10:13",
   "depth": 0,
   "text": "Using the great words \"I love you\" to teach stuff........\n\nJUST HOW MUCH COOLER COULD THIS MC GET?!?!\n\nThis is easily a top AOTS contender!"
  },
  {
   "score": 52,
   "id": "dg4g27r",
   "pid": "t1_dg4dtco",
   "date": "2017-04-11 08:51:48",
   "depth": 1,
   "text": "That part was pretty funny since it literally came out of nowhere."
  },
  {
   "score": 13,
   "id": "dg4hgrm",
   "pid": "t1_dg4g27r",
   "date": "2017-04-11 09:17:29",
   "depth": 2,
   "text": "I've seen it in a hell a lot of other series/books, but it still made me respect Glenn more for some reason\n"
  },
  {
   "score": 6,
   "id": "dg4q8yp",
   "pid": "t1_dg4hgrm",
   "date": "2017-04-11 11:57:01",
   "depth": 3,
   "text": "I think it was the point he was making with it was what sold it"
  },
  {
   "score": 12,
   "id": "dg4zayo",
   "pid": "t1_dg4q8yp",
   "date": "2017-04-11 14:46:27",
   "depth": 4,
   "text": "I love how they used it to further explain auto-suggestion. He blows my mind b/c right before all this happened, I was thinking in my head, saying random words of a language shouldn't technically have an effect on a spell, but auto-suggestion explains it."
  },
  {
   "score": 84,
   "id": "dg4c1ct",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:36:09",
   "depth": 0,
   "text": "Holy shit I have missed my magical high schools HAHAHA LOVE THIS.  Best magical punch 2017."
  },
  {
   "score": 2,
   "id": "dg5nyfu",
   "pid": "t1_dg4c1ct",
   "date": "2017-04-12 02:17:31",
   "depth": 1,
   "text": "Any recommendations for other school ones?>"
  },
  {
   "score": 10,
   "id": "dg5y73b",
   "pid": "t1_dg5nyfu",
   "date": "2017-04-12 07:40:57",
   "depth": 2,
   "text": "Rakudai Kishi no Cavalry."
  },
  {
   "score": 42,
   "id": "dg4k3gb",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:05:12",
   "depth": 0,
   "text": "No one expects the mage that doesn't use magic, it's fucking genius."
  },
  {
   "score": 29,
   "id": "dg4n3tf",
   "pid": "t3_64qza0",
   "date": "2017-04-11 11:00:07",
   "depth": 0,
   "text": "MC looks better in this episode. I like how they indirectly explained why MC thought that magic is only good for killing people. For instance, the lecture about Shock Bolt made his initial notion about magic sensible. The school and its students approach the spell as something that can be used to attack people. That is why in the textbooks they were taught to shorten the chant. But they didn't actually understand the entirety of the spell. During the lecture, by chanting the spell in different ways, they were able to find different purposes of Shock Bolt. For example, when one line of the chant was erased, the power output plummeted which can be used to power some electric-powered machine without overcharging it. Anyway, it's actually nice to learn the magic in this world. \n\n"
  },
  {
   "score": 1,
   "id": "dg6uz5m",
   "pid": "t1_dg4n3tf",
   "date": "2017-04-12 17:44:07",
   "depth": 1,
   "text": "Definitely noticed that. It impressed me, how it basically just proved his point."
  },
  {
   "score": 30,
   "id": "dg4x6oc",
   "pid": "t3_64qza0",
   "date": "2017-04-11 14:04:00",
   "depth": 0,
   "text": "[I do love me some muscle wizardry](https://1d4chan.org/images/thumb/e/e4/Muscle_wizard.jpg/300px-Muscle_wizard.jpg)"
  },
  {
   "score": 1,
   "id": "dga5l6r",
   "pid": "t1_dg4x6oc",
   "date": "2017-04-14 19:29:41",
   "depth": 1,
   "text": "Colonel Armstrong?"
  },
  {
   "score": 51,
   "id": "dg4dany",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:00:13",
   "depth": 0,
   "text": "Now this episode was way better. Like how he cancels magic out and brings back the gold ole fisticuffs, ridding the world of NTR one punch at a time. \n\nJust gotta stress whoever thought up the uniform design for the girl's is a saint. Celica still best girl but Rumia just might prove me wrong. "
  },
  {
   "score": 17,
   "id": "dg5chaj",
   "pid": "t1_dg4dany",
   "date": "2017-04-11 19:35:23",
   "depth": 1,
   "text": "Rape ≠ NTR"
  },
  {
   "score": 3,
   "id": "dg5cs22",
   "pid": "t1_dg5chaj",
   "date": "2017-04-11 19:42:23",
   "depth": 2,
   "text": "Come on we all l know he is going to be the main love interest for her. "
  },
  {
   "score": 1,
   "id": "dijxgnp",
   "pid": "t1_dg5cs22",
   "date": "2017-06-06 15:38:22",
   "depth": 3,
   "text": "I know i'm a month late on this one, but judging from previous scenes of netorare like in Sword Art Online, at the end of the second season, when they're being held down by extreme gravity and the main villain gets a bit rapey, I don't think this is netorare.\n\nThis is just rape, as the guy isn't even there until the moment it stops, and he's not pinned down so he has to \"watch\" as the events unfold, it was purely with the intent of \"enjoying\" her, against her will. "
  },
  {
   "score": 1,
   "id": "dg74th8",
   "pid": "t1_dg5cs22",
   "date": "2017-04-12 21:19:38",
   "depth": 3,
   "text": "I'll still root for Celica"
  },
  {
   "score": 11,
   "id": "dg5jd3a",
   "pid": "t1_dg5cs22",
   "date": "2017-04-11 22:46:44",
   "depth": 3,
   "text": "Still doesn't change the fact that rape does not equal NTR. Rape is rape. NTR is a hentai fetish."
  },
  {
   "score": 1,
   "id": "dgbqcpe",
   "pid": "t1_dg5jd3a",
   "date": "2017-04-15 22:24:48",
   "depth": 4,
   "text": "Rape is still a fetish for some."
  },
  {
   "score": 2,
   "id": "dgbsbtp",
   "pid": "t1_dgbqcpe",
   "date": "2017-04-15 23:38:39",
   "depth": 5,
   "text": "You can have an anime that doesn't treat rape as a fetish. NTR is a genre that's pretty much exclusively only found in hentai.\n\nA love triangle is not NTR. Best girl not choosing the guy is not NTR. NTR may have rape but not all rape is NTR.\n\nThe only people who shout NTR outside hentai are either stupid or troll."
  },
  {
   "score": 56,
   "id": "dg4nsre",
   "pid": "t1_dg4dany",
   "date": "2017-04-11 11:12:51",
   "depth": 1,
   "text": "\"How is a mage going to fight if he seals his own magic?\"\n\n*Throws Punches*\n\nOld School, I like it."
  },
  {
   "score": 1,
   "id": "dg8rgzv",
   "pid": "t1_dg4nsre",
   "date": "2017-04-13 21:33:24",
   "depth": 2,
   "text": "Clearly he's the reincarnation of the Touman!\n\nI just hope he just doesn't start punching evil women and making them a part of his harem. We need at least a FEW shows this season that don't go down that route."
  },
  {
   "score": 14,
   "id": "dg5ckwc",
   "pid": "t1_dg4nsre",
   "date": "2017-04-11 19:37:43",
   "depth": 2,
   "text": "I cast fist."
  },
  {
   "score": 60,
   "id": "dg4fv1x",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:48:09",
   "depth": 0,
   "text": "So in other words, Glenn's ability lies not so much in spell-casting but in magic theory? I like the distinction they're going with and it makes him stand out in a way that's believable in this world. Definitely makes this show have an edge over contemporary shows in the more recent years.\n\nThey still hashed in cliches like the 2nd episode rape attempt as an excuse to show fanservice but the execution of the events prior and after this were different and the magical fire \"punch\" was a nice touch on differentiating itself. \n\nI hope this is the end of Glenn acting like a smart-ass dick in class; it's frankly annoying and I can't get behind a teacher acting like this  in stories [even if it happens in the real world].\n\nDecent 2nd episode though; we're starting to see that this isn't your run-of-the-line battle magic show and looks to be something above that."
  },
  {
   "score": 1,
   "id": "dgku606",
   "pid": "t1_dg4fv1x",
   "date": "2017-04-21 14:32:12",
   "depth": 1,
   "text": "I'm glad someone else had a problem with episode's 2 attempted rape scene. It was way too drawn out with such a minor character to be anything other than an excuse for creepy fanservice.\n\n(After reading more comments, I'm glad to see more people have a problem with the attempted rape scene)."
  },
  {
   "score": 3,
   "id": "dg4qeve",
   "pid": "t1_dg4fv1x",
   "date": "2017-04-11 11:59:53",
   "depth": 1,
   "text": "> Glenn's ability lies not so much in spell-casting but in magic theory?\n\nHe did also demonstrate that he has some skill in actual spell-casting as well, what with being able to cast that spell with a half-hearted activation phrase, but definitely his major strength is magic theory..\n\nthough he does still seem to be pretty skilled to have invented that card thing he uses to cancel magic, since the guy was all \"oh shit that's high level!\""
  },
  {
   "score": 23,
   "id": "dg4kd6s",
   "pid": "t1_dg4fv1x",
   "date": "2017-04-11 10:10:12",
   "depth": 1,
   "text": "It's very far from the first show to have a protagonist OP because he's unconventional, though, so for me it really doesn't give this an edge.\n\nThe scenes with the villains were rather well done, both the one in the class and the rape attempt, because it made them look actually dangerous and not just stupid and powerful. Sistine's comment of \"military-grade magic ??\" helped, too, because it makes a very believable context.\n\nTo me it doesn't seem to have anything to make it stand out among other magical battle harem. Still, it's enjoyable and a bit above average so far, let's see how it turns out."
  },
  {
   "score": 51,
   "id": "dg4itpy",
   "pid": "t1_dg4fv1x",
   "date": "2017-04-11 09:42:19",
   "depth": 1,
   "text": "Yeah, the attempted rape was pretty cliche (although, it's a cliche for a reason seeing as unmitigated bastard villains *would* do it), but I like Glenn walking and then just being like \"right, nope, nothing to see here.\""
  },
  {
   "score": 19,
   "id": "dg4mmvd",
   "pid": "t1_dg4itpy",
   "date": "2017-04-11 10:51:27",
   "depth": 2,
   "text": "^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna ^^^^^^^^^asuna "
  },
  {
   "score": 39,
   "id": "dg4na1n",
   "pid": "t3_64qza0",
   "date": "2017-04-11 11:03:15",
   "depth": 0,
   "text": "I keep finding myself comparing this and Konosuba, not because of the plot or setting, but for the art direction. Both [Rokudaneshi](http://i.imgur.com/ANRUlIe.jpg) and [Konosuba's](http://i.imgur.com/8R7UHzx.jpg) LN art is done by Kurone Mishima, and I just can't help but wonder how different Konosuba's anime would've been if they animated it like how they did with Rokudaneshi's, which is a lot closer to Mishima's artstyle than Konosuba's was."
  },
  {
   "score": 1,
   "id": "dg5m7lm",
   "pid": "t1_dg4na1n",
   "date": "2017-04-12 00:47:18",
   "depth": 1,
   "text": "The art style of the Konosuba anime is a part of the charm IMO"
  },
  {
   "score": 2,
   "id": "dg5rhwj",
   "pid": "t1_dg5m7lm",
   "date": "2017-04-12 04:57:17",
   "depth": 2,
   "text": "If only the second season had been as good as the first season in the art department... It was pretty bad at times."
  },
  {
   "score": 1,
   "id": "dg64f8g",
   "pid": "t1_dg5rhwj",
   "date": "2017-04-12 09:34:29",
   "depth": 3,
   "text": "It's that Kikuta touch."
  },
  {
   "score": 1,
   "id": "dg5wdyj",
   "pid": "t1_dg4na1n",
   "date": "2017-04-12 07:04:39",
   "depth": 1,
   "text": "I forget who said it, but someone in the Ep1 discussion thread mentioned that this show is for Magical School anime the way Konosuba was for Isekai anime. I think I agree with that sentiment so far."
  },
  {
   "score": 2,
   "id": "dg5a17z",
   "pid": "t1_dg4na1n",
   "date": "2017-04-11 18:40:11",
   "depth": 1,
   "text": "And not get derpy Aqua faces?? HECK NO"
  },
  {
   "score": 2,
   "id": "dg5aeuv",
   "pid": "t1_dg4na1n",
   "date": "2017-04-11 18:48:40",
   "depth": 1,
   "text": "We already have a smug on thr first episode, so that's something"
  },
  {
   "score": 9,
   "id": "dg5ceoj",
   "pid": "t1_dg4na1n",
   "date": "2017-04-11 19:33:42",
   "depth": 1,
   "text": "Man, to see Darkness animated in her LN art would be a dream."
  },
  {
   "score": 9,
   "id": "dg5krrq",
   "pid": "t1_dg4na1n",
   "date": "2017-04-11 23:42:03",
   "depth": 1,
   "text": "I mean, Aqua would've been too moeblob and not the derpy damegami we all know and love."
  },
  {
   "score": 6,
   "id": "dg5wb11",
   "pid": "t1_dg5krrq",
   "date": "2017-04-12 07:02:56",
   "depth": 2,
   "text": "Agreed. Also, [Kazuma from the Light Novel](http://vignette1.wikia.nocookie.net/konosuba/images/5/5e/Kazuma_ln.png/revision/latest?cb=20160408181149) looks more like [Momotsuki from the Momokuri anime](https://s-media-cache-ak0.pinimg.com/736x/38/58/4a/38584ad7cdba38a86e0d53ad8f7219c5.jpg). I like how he looks in the Anime, it fits him much better."
  },
  {
   "score": 18,
   "id": "dg4f9wb",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:37:18",
   "depth": 0,
   "text": "http://imgur.com/Azmy5G0 dere moments are the best"
  },
  {
   "score": 4,
   "id": "dg4kf17",
   "pid": "t1_dg4f9wb",
   "date": "2017-04-11 10:11:05",
   "depth": 1,
   "text": "Get them watermarks out..."
  },
  {
   "score": 17,
   "id": "dg4e8u5",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:18:15",
   "depth": 0,
   "text": "Wow, no one told me this was actually Index Season 3 in disguise - Kamijou Touma decided to become a school instructor (so he could slack off)."
  },
  {
   "score": 15,
   "id": "dg4du1o",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:10:36",
   "depth": 0,
   "text": "I actually really liked this episode, the humour is a little weird at times, but the entire \"Shock Bolt\" explanation was really cool; both in a magic-system as in a world-building aspect.\n\n\nCurious to see where this'll end up going."
  },
  {
   "score": 14,
   "id": "dg4elqs",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:24:50",
   "depth": 0,
   "text": "lol so that's why he checked Rumia out in episode 1. Also Rumia already knows he's that guy too. Also it's a small."
  },
  {
   "score": 12,
   "id": "dg4dkz2",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:05:46",
   "depth": 0,
   "text": "there it is, good i knew this was going to have to happen, happy they did it episode 2 and didn't drag on the bad teacher part before we saw how strong he really was.\n\nThe comedy side is also great, turning white cat into red-faced cat was hilarious her reaction was perfect and as expected, ah classic tsundere. The story progression is also really good so much happened in so little time it didn't even feel like 20 min. the last scene was uncomfortable though i was scared we were going to be left til next week but him joking that he was interupting was perfect also hell of a right hook with that magic punch."
  },
  {
   "score": 83,
   "id": "dg4ch6d",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:44:41",
   "depth": 0,
   "text": "Was anyone else annoyed that a near rape scene went from super serious to comedic in an instant?"
  },
  {
   "score": -1,
   "id": "dg58er6",
   "pid": "t1_dg4ch6d",
   "date": "2017-04-11 18:05:31",
   "depth": 1,
   "text": "I think they let that scene play out a bit further than what you expect, so the viewer will be in suspense: \"WHERE THE HELL IS GLENN HURRY YOUR ASS\" because that's what I was thinking when this scene played."
  },
  {
   "score": -1,
   "id": "dg4zlmt",
   "pid": "t1_dg4ch6d",
   "date": "2017-04-11 14:52:25",
   "depth": 1,
   "text": "I think this anime will be a fuck you to all other harems\n\n I find it funny how they kept it light, instead of rape scenes like sword art online where I think they really go to far,and it doesn't add to the story, it's just there, and they don't tackle it well, they just throw it for the villain to see like a villain instead of a cartoon"
  },
  {
   "score": 0,
   "id": "dgfbl1t",
   "pid": "t1_dg4ch6d",
   "date": "2017-04-18 09:05:57",
   "depth": 1,
   "text": "Idk I mean I was just happy they were willing to go there \n\n"
  },
  {
   "score": 10,
   "id": "dg4kaic",
   "pid": "t1_dg4ch6d",
   "date": "2017-04-11 10:08:49",
   "depth": 1,
   "text": "I was annoyed with such a serious and close rape scene in the first place. I like my bad guys dead before they go that far"
  },
  {
   "score": 4,
   "id": "dg5l9gy",
   "pid": "t1_dg4kaic",
   "date": "2017-04-12 00:03:22",
   "depth": 2,
   "text": "Really? Because I like that they showed that these bad guys weren't just the goofy herp derp mooks, but flat out pieces of shit. It showed the girl wasn't the badass and when it appeared she was going to be raped, she was terrified. Humor was a touch odd, but pretty damned sure the MC wasn't actually leaving in the first place."
  },
  {
   "score": 3,
   "id": "dg7j2qt",
   "pid": "t1_dg5l9gy",
   "date": "2017-04-13 06:22:18",
   "depth": 3,
   "text": "Actually the scene is meant for something else. This is actually something that's going to come up again and again.\n\n[Manga/LN] (/s \"Sisti puts up a brave front but is really easily shaken and can't do anything\" )\n\nSisti is a sheltered noble lady, She is taught that she should be strong and resist in the face of adversity but she is still young.\n\nHer image of magic, the foundation of her resolve was completely shaken when Glenn dismissed it as mere art for killing. Sure she slapped him, but she couldn't rebuke him. She could not get a single word in.\n\nThis scene she puts up a brave front, but she couldn't do anything about being held down and resorts to begging for the villain's mercy.\n\n[Manga/LN] (/s \" Now this will get better, but there are a still hiccups along the way, but she is a kind of a character that has a trend of freezing up when shit hits the fan \" )"
  },
  {
   "score": 9,
   "id": "dg4jvnq",
   "pid": "t1_dg4ch6d",
   "date": "2017-04-11 10:01:13",
   "depth": 1,
   "text": "Agreed, I liked this episode but the way that scene was handled was a bit weird."
  },
  {
   "score": 20,
   "id": "dg4e2er",
   "pid": "t1_dg4ch6d",
   "date": "2017-04-11 08:14:54",
   "depth": 1,
   "text": "I'm not annoyed, but that was really extreme :/\n\nRape in one scene and sex jokes on another don't work that well -,-''"
  },
  {
   "score": 31,
   "id": "dg4odzr",
   "pid": "t1_dg4ch6d",
   "date": "2017-04-11 11:23:44",
   "depth": 1,
   "text": "Bad transition aside, the near rape scene was handled terribly and something that was completely unnecessary. "
  },
  {
   "score": 8,
   "id": "dg79p7x",
   "pid": "t1_dg4odzr",
   "date": "2017-04-13 00:07:02",
   "depth": 2,
   "text": "LOL little bitch"
  },
  {
   "score": 11,
   "id": "dg7a3mq",
   "pid": "t1_dg79p7x",
   "date": "2017-04-13 00:25:13",
   "depth": 3,
   "text": "If that was your weak attempt at trying to insult me, please try again. "
  },
  {
   "score": 8,
   "id": "dg7mhp8",
   "pid": "t1_dg7a3mq",
   "date": "2017-04-13 07:34:18",
   "depth": 4,
   "text": "I see your triggered attempt successful."
  },
  {
   "score": 10,
   "id": "dg7mqj7",
   "pid": "t1_dg7mhp8",
   "date": "2017-04-13 07:39:02",
   "depth": 5,
   "text": "Not really, because I couldn't really give two shits about you. "
  },
  {
   "score": 5,
   "id": "dg74y9v",
   "pid": "t1_dg4odzr",
   "date": "2017-04-12 21:23:10",
   "depth": 2,
   "text": "It was faithful to the source material"
  },
  {
   "score": 12,
   "id": "dg755h1",
   "pid": "t1_dg74y9v",
   "date": "2017-04-12 21:28:30",
   "depth": 3,
   "text": "And sometimes that is not a good thing. "
  },
  {
   "score": 1,
   "id": "dgfhgqs",
   "pid": "t1_dg755h1",
   "date": "2017-04-18 10:49:40",
   "depth": 4,
   "text": "I liked it. I took a lot of courage to show this on tv. It's kind of rare. I know it makes some people uncomfortable but that is the point. "
  },
  {
   "score": 8,
   "id": "dg7j6az",
   "pid": "t1_dg755h1",
   "date": "2017-04-13 06:24:35",
   "depth": 4,
   "text": "Be as it may however the scene is presented. This is scene is a plotting point for a graph on something that's going to come up again and again.\n\n[Manga/LN] (/s \"Sisti puts up a brave front but is really easily shaken and can't do anything\" )\n\nSisti is a sheltered noble lady, She is taught that she should be strong and resist in the face of adversity but she is still young.\n\nHer image of magic, the foundation of her resolve was completely shaken when Glenn dismissed it as mere art for killing. Sure she slapped him, but she couldn't rebuke him. She could not get a single word in.\n\nThis scene she puts up a brave front, but she couldn't do anything about being held down and resorts to begging for the villain's mercy.\n\n[Manga/LN] (/s \" Now this will get better, but there are a still few major hiccups along the way, but she is a kind of a character that has a trend of freezing up when shit hits the fan \" )"
  },
  {
   "score": 9,
   "id": "dg7k1wp",
   "pid": "t1_dg7j6az",
   "date": "2017-04-13 06:44:08",
   "depth": 5,
   "text": "Sorry, but there are much better ways of showcasing that character weakness than resorting to using cheap methods like an attempted rape scene that was completely out of place. "
  },
  {
   "score": 2,
   "id": "dg7ln8s",
   "pid": "t1_dg7k1wp",
   "date": "2017-04-13 07:17:42",
   "depth": 6,
   "text": "Perhaps but such is the choice of the author"
  },
  {
   "score": 9,
   "id": "dg7yt2a",
   "pid": "t1_dg7k1wp",
   "date": "2017-04-13 11:15:02",
   "depth": 6,
   "text": "> there are much better ways of showcasing that character weakness than resorting to using cheap methods like an attempted rape scene  \n\nI wasn't sure how to articulate my feelings about that scene, but this nails it. Cheap. That whole situation just seemed really forced and left a pretty bad taste in my mouth.  \n\nHearing that it's true to the author's work makes me a bit apprehensive about the rest of the show. Guess we'll have to see. "
  },
  {
   "score": 32,
   "id": "dg4v890",
   "pid": "t1_dg4ch6d",
   "date": "2017-04-11 13:27:05",
   "depth": 1,
   "text": "Really? I thought it was hilarious! It was a great transition to the comedic fight. It fits the MC's personality to a T (based on what the anime has shown us), at least as an anime-only viewer. This episode boosted Rokuden into my top 3 of the season so far. "
  },
  {
   "score": 50,
   "id": "dg4dc4z",
   "pid": "t1_dg4ch6d",
   "date": "2017-04-11 08:01:00",
   "depth": 1,
   "text": "Yeah, this show has a serious problem with the timing of its comedy."
  },
  {
   "score": 1,
   "id": "dg5o82u",
   "pid": "t1_dg4dc4z",
   "date": "2017-04-12 02:31:36",
   "depth": 2,
   "text": "At least its not Drifters"
  },
  {
   "score": 19,
   "id": "dg4g7e4",
   "pid": "t1_dg4dc4z",
   "date": "2017-04-11 08:54:24",
   "depth": 2,
   "text": "Blame the source material then because that's how it goes there."
  },
  {
   "score": 12,
   "id": "dg4kge6",
   "pid": "t1_dg4g7e4",
   "date": "2017-04-11 10:11:47",
   "depth": 3,
   "text": "Well, then blame both because that's how it went in the source and they kept it in the anime."
  },
  {
   "score": 66,
   "id": "dg4hhe6",
   "pid": "t1_dg4g7e4",
   "date": "2017-04-11 09:17:46",
   "depth": 3,
   "text": "I'd say this is at least partly down to the director. They rushed through material for most of the episode, but dwelt on the near-rape scene for as long as possible."
  },
  {
   "score": 1,
   "id": "dg4ow2r",
   "pid": "t1_dg4hhe6",
   "date": "2017-04-11 11:32:53",
   "depth": 4,
   "text": "> They rushed through material for most of the episode\n\n\nDo they dwell more on the magic system in the LN?"
  },
  {
   "score": 19,
   "id": "dg4udj5",
   "pid": "t1_dg4ow2r",
   "date": "2017-04-11 13:11:11",
   "depth": 5,
   "text": "No. What they skipped were the stuff you saw in the still frames. They also skipped him mentioning that Celica is his human alarm clock as he was running, which is why he's late."
  },
  {
   "score": 16,
   "id": "dg5l2bv",
   "pid": "t1_dg4hhe6",
   "date": "2017-04-11 23:54:39",
   "depth": 4,
   "text": "At least that rape scene was very uncomfortable to watch. This is very risky scene to do in an otherwise lighthearted show, they had to convey gravity of the situation, making it sleazy but not sexy. We as a viewer wanted to see MC as fast as possible and instant comedic switch while also risky did serve a purpose. It was in character and it did change atmosphere to the one which show is more comfortable with. \n\nI can’t see good way to do that scene. So only other choice was to not have it all which most likely was not an option.\n"
  },
  {
   "score": 1,
   "id": "dijxy96",
   "pid": "t1_dg5l2bv",
   "date": "2017-06-06 15:48:23",
   "depth": 5,
   "text": "I think it was because they did a really good job of conveying the emotion of the person being abused and the malice in the abuser. She almost immediately gives up her pride and begs for him to stop, crying but not \"Ahhh! oh no!!! no please dont!!\" It was more like \"Q.Q no... pleas... stop.. somebody.... help me....\" and then the scream. And he went into detail about how he doesn't like girls like the blondie, because she's resilient, and this girl isnt. It makes  you feel as though she's cornered, and he's really going to do this. It's happening. It's very hard to watch. In fact, I myself am somewhat into this fetish that is similar to rape, but without the ill intent, and with consent. Its hard to explain, but basically, I would never act on it, and i am in fact disgusted with those who do, and this scene in particular i had 0% attraction towards. This is rape. It's not fanservice, and it's not some perverted old man who no one's worried about. He's got the malicious intent to break her, and i'm really glad they didn't linger on it more than they did. I really wish they left out the comedy in it, they can put it more light hearted than when she was being touched, but to taunt us, the audience, and say \"here's your savior to stop the situation, and he's going to leave comedically because whoops he's too dumb not to realize that it's not consensual sex, oh well, i guess she's screwed now!\"\n\nAll in all, impressive, repulsive, please dont do it again."
  },
  {
   "score": 9,
   "id": "dg4cevk",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:43:27",
   "depth": 0,
   "text": "That was rather good, I really enjoy fantasy/magic-school based anime and I'd been wanting something similarish to Trinity seven but haven't been actively looking for anything so I'm glad this popped up.\n\nI might even like this style of MC a little bit more, not overpowered just different or a little odd even haha."
  },
  {
   "score": 9,
   "id": "dg4nha8",
   "pid": "t1_dg4cevk",
   "date": "2017-04-11 11:06:56",
   "depth": 1,
   "text": "I actually binged the novels volume 1 and, no specific spoilers, I have really high hopes for this anime because the mc isn't outright op. He is actually very unique in that his intellect is what makes him stand out. It's like watching the sherlock holmes of magic high anime.\n\nBut dang they are really blowing through volume 1 right now at a breakneck pace. That means they'll be hitting volume 2 if this is 12 episodes and I don't know if the full translation of that is even up yet."
  },
  {
   "score": 1,
   "id": "dg5noid",
   "pid": "t1_dg4nha8",
   "date": "2017-04-12 02:02:42",
   "depth": 2,
   "text": "Is there a translated manga of this? Or just a light novel? "
  },
  {
   "score": 1,
   "id": "dg5v9lw",
   "pid": "t1_dg5noid",
   "date": "2017-04-12 06:40:09",
   "depth": 3,
   "text": "Acutally yes, just found it right now http://mangabom.com/manga/roku_de_nashi_majutsu_koushi_to_kinki_kyouten"
  },
  {
   "score": 1,
   "id": "dg5qdm3",
   "pid": "t1_dg5noid",
   "date": "2017-04-12 04:15:56",
   "depth": 3,
   "text": "There's a manga too, it already has 2 and 1/2 arcs translated."
  },
  {
   "score": 70,
   "id": "dg4kf9n",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:11:13",
   "depth": 0,
   "text": "I feel like the attempted rape scene was a blight on what was otherwise a pretty strong episode."
  },
  {
   "score": 2,
   "id": "dgffkfk",
   "pid": "t1_dg4kf9n",
   "date": "2017-04-18 10:16:13",
   "depth": 1,
   "text": "Yeah, they really could've picked another way to show the MC is OP. \n\nGeneric criminal duo --> rape scene --> saved at the last second \n\nis an atrocious trope.\n\nAlso, fuck do I hope this show isn't going in the direction I think it's going because that *mountain* of cliches has me worried.\n\n>girl has to unravel ancient mystery where grandfather failed\n\n>evil secret back alley meeting, \"proceed as planned\"\n\n>oh, and it turns out one of the main cast is secretly royalty/nobility\n\nPlease please please don't go down the generic route. This episode, while still an improvement over the last, is still formulaic as *hell*. \n"
  },
  {
   "score": 63,
   "id": "dg4udct",
   "pid": "t1_dg4kf9n",
   "date": "2017-04-11 13:11:05",
   "depth": 1,
   "text": "If Glenn had showed up 30 seconds earlier it would have been nice. Plus then he wouldn't have come off as a deranged for making fun jokes with about a girl crying as she's about to get raped. But nope, decided to play it both ways. Fun lighthearted banter, and rape fan service."
  },
  {
   "score": 10,
   "id": "dg4bo2j",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:28:43",
   "depth": 0,
   "text": "Not disappointing.\n\nMakes me wonder though, he seems to boast his ability in CQC, what if some bad guy comes in and is actually better than him?"
  },
  {
   "score": 1,
   "id": "dg4xkqf",
   "pid": "t1_dg4bo2j",
   "date": "2017-04-11 14:11:46",
   "depth": 1,
   "text": " [guess based off mal ln character page](/s \"His page on mal has him holding a gun so I guess he might be good with them also\")\n\n\n"
  },
  {
   "score": 2,
   "id": "dg74wy0",
   "pid": "t1_dg4xkqf",
   "date": "2017-04-12 21:22:11",
   "depth": 2,
   "text": "[LN](/s \"That gun is a bit special \")\n"
  },
  {
   "score": 7,
   "id": "dg4ct0o",
   "pid": "t1_dg4bo2j",
   "date": "2017-04-11 07:51:00",
   "depth": 1,
   "text": "well he can still deactivate it so he could use magic instead. \n\nIf a bad guy is actually better in both those things, well you know you already lost."
  },
  {
   "score": 10,
   "id": "dg4gl9e",
   "pid": "t1_dg4ct0o",
   "date": "2017-04-11 09:01:27",
   "depth": 2,
   "text": "Spoiler[.](/s \"No, he can't, he has to wait for timeout\")"
  },
  {
   "score": 9,
   "id": "dg4klmp",
   "pid": "t1_dg4bo2j",
   "date": "2017-04-11 10:14:26",
   "depth": 1,
   "text": "He can choose his ground between magic and physical, and I guess he's above most people in at least one of the two fields. Especially as mages seem to be rather reluctant to go away from the theory, and the barrier of entry to learning magic is high.\n\nBy the way, [that guy was pretty stupid.](https://i.imgur.com/rbOAahW.jpg) Yeah, I wonder what a mage capable of shutting down magic around him is gonna do..."
  },
  {
   "score": 12,
   "id": "dg4e03t",
   "pid": "t1_dg4bo2j",
   "date": "2017-04-11 08:13:45",
   "depth": 1,
   "text": "Same deal as with Touma from Index.\n\nLook how can deal with physical gods like Accelerator who are completely reliant on their ability yet gets wrecked by a physical specialist like Kaori Kanzaki."
  },
  {
   "score": 2,
   "id": "dg552n3",
   "pid": "t1_dg4e03t",
   "date": "2017-04-11 16:52:02",
   "depth": 2,
   "text": "Even against abilities there's a soft cap on what he can cancel, if the \"force\" of the ability exceeds what he can cancel it can push him back, be deflected, or even knock his hand away."
  },
  {
   "score": 19,
   "id": "dg4atpk",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:11:26",
   "depth": 0,
   "text": "Woo it fit the magical punch in was worried that would be next week."
  },
  {
   "score": 7,
   "id": "dg4sq37",
   "pid": "t3_64qza0",
   "date": "2017-04-11 12:41:09",
   "depth": 0,
   "text": "Told ya guys, he is a modern version of ryner lute"
  },
  {
   "score": 0,
   "id": "dg56ris",
   "pid": "t1_dg4sq37",
   "date": "2017-04-11 17:29:32",
   "depth": 1,
   "text": "Nah,ryner is just a boring character who doesn't give a fuck about anything beside feeling gay for his best friend.Glenn is much much better"
  },
  {
   "score": 4,
   "id": "dg5n0z3",
   "pid": "t1_dg4sq37",
   "date": "2017-04-12 01:28:21",
   "depth": 1,
   "text": "Its great to hear people mention Ryner's name as hes one of my all time fav characters.  I would say that Glenn and Ryner are a bit different (with what little i know about Glenn so far).  Both seem to have a disdain with magic and carry a grudge, but Glenn is way more motivated than Ryner in that, It takes Ryner way longer to open up to people.  Ryner lived a very very very traumatic and shitty life and it really messed him up mentally, he avoids people and doesnt want to be around them, he just wants a place to take a nap and forget the world is there.  Glenn seems to at least still have some fight left in him as Juggs-sensei was able to get him to work fairly easy (just 1 bolt next to his head and he was motivated).  [Ryner would have just taken to bolt to the face and done back to sleep haha.](https://68.media.tumblr.com/0c676451fb7b913e9dcffe3aee5307dc/tumblr_naethjNDtb1sq3jmoo3_500.gif)  \n\nBoth are great shows though with unique word based magic so i look foward to this one for sure.  [I doubt Glenn will ever top Ryner for my fav mage](http://25.media.tumblr.com/tumblr_lhna7mZv6l1qhyxxoo1_400.gif) (because Ryner's past is one of the best charcter developments ive seen), but he will still be fun to watch for sure.  \n\n[](#meguminthumbsup)"
  },
  {
   "score": 1,
   "id": "dg5xm0p",
   "pid": "t1_dg5n0z3",
   "date": "2017-04-12 07:29:31",
   "depth": 2,
   "text": "Ryner is actually a well-developed character and robust in his identity whereas this MC ... shrug, it's a generic show they're just rapidly exposing him over 2 episodes.  This MC is more gary-stu-ish and more tropey just to deliver a quick premise and setup.\n\nRyner's character was delivered to viewers with a lot more \"show\".  This MC is a lot more \"tell\".  So to speak."
  },
  {
   "score": 3,
   "id": "dg5zuqd",
   "pid": "t1_dg5xm0p",
   "date": "2017-04-12 08:12:08",
   "depth": 3,
   "text": "We have been shown snippets of his past here. The flashback to that white hair lady is the most suspect. Something made him become a hikki for an entire year, and I suspected that it's something traumatic with that lady. Couple with his rant about magic is only good at killing, the pieces are falling together. Not to mention his apparently military grade training, that flashback from Lumia, the favoritism from an insane Mage, and their complete lack of interest at a romantic relationship with each other, we've got a lot of pieces regarding to his past. We just need them to lay it all out next.\n\nIn some way I too can see him being similar to Ryner"
  },
  {
   "score": 1,
   "id": "dg61m5z",
   "pid": "t1_dg5zuqd",
   "date": "2017-04-12 08:44:28",
   "depth": 4,
   "text": "Piecing info together over a handful of episodes works for what appears to be a 1-cour show where the MC's personality is merely the premise.  The result is an MC that works but is simply not as robust.  We are essentially *told* about his character very rapidly.  It is not being *developed*.  Adding multiple factoids and bits of info about a character is not development.  It's being told a list of characteristics and events.\n\nIt's a simple constraint of not enough time to feed the character's development.  However, that is not the main point of this show, which seems to be more about the upcoming plot and such.  This is why at a broad level, yes he's \"generally similar to Ryner\" from a character archetype perspective, but is significantly different from an execution perspective.  In that regard Ryner is more \"3d\" whereas Glenn is a fanfic bio.  Unless the remainder of this show demonstrates otherwise of course, which it could, so we'll see."
  },
  {
   "score": 1,
   "id": "dg642s0",
   "pid": "t1_dg61m5z",
   "date": "2017-04-12 09:28:28",
   "depth": 5,
   "text": "Which is why I said they need to lay it all out, because even Ryner's characterisation came from the long flashback. Here we just need similar sequence   "
  },
  {
   "score": 1,
   "id": "dg64rcv",
   "pid": "t1_dg642s0",
   "date": "2017-04-12 09:40:19",
   "depth": 6,
   "text": "Possibly in theory, but in practice this show is too short for that to be effective.  The pace of the first 2 episodes also indicates that that will not be fully developed.  Ryner had an entire arc dedicated to that."
  },
  {
   "score": 8,
   "id": "dg4e5q2",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:16:40",
   "depth": 0,
   "text": "This episode animated half of chapter 2 up to a bit of chapter 4 but it skipped a lot so here's a link if you want to read it: https://crimsonmagic.me/2016/10/13/akashic-1-2/\n\nGoes in a bit more about lumia's ideals and motivation (which I recommend since it further shows how great she it, though I may be biased haha)\n\nAnd also goes on a bit more about the magic system of this world if your interested in it :) "
  },
  {
   "score": 2,
   "id": "dg5vgxn",
   "pid": "t1_dg4e5q2",
   "date": "2017-04-12 06:44:45",
   "depth": 1,
   "text": "Thanks for posting this. Chapter 2 really fleshed out Lumia's character better than the anime did."
  },
  {
   "score": 7,
   "id": "dg4skrm",
   "pid": "t3_64qza0",
   "date": "2017-04-11 12:38:29",
   "depth": 0,
   "text": "I guess we have our TOTS.\n\nTouma of the season."
  },
  {
   "score": 7,
   "id": "dg51044",
   "pid": "t3_64qza0",
   "date": "2017-04-11 15:21:59",
   "depth": 0,
   "text": "A much improved episode. Hitting all the battle school harem tropes I like. That said... I'd rather that rape scene get cut short much earlier. The comedic timing was poor, but I think that's been said a few times in this thread.\n\nIf he can negate magic, why was he afraid of his mentor's kill spell? I'm assuming then he must have some limitations to its use, or that she can overcome it. I wonder if this we lead to a later vulnerability."
  },
  {
   "score": 6,
   "id": "dg5lq35",
   "pid": "t1_dg51044",
   "date": "2017-04-12 00:24:15",
   "depth": 1,
   "text": "If you activate the magic fast enough before he can put up the negation field it'll still activate.\n\nRemember how fast his mentor chanted the spell?\n\nShe knows."
  },
  {
   "score": 7,
   "id": "dg51yp5",
   "pid": "t3_64qza0",
   "date": "2017-04-11 15:42:23",
   "depth": 0,
   "text": "I CAST FIST, MOTHERFUCKER. \n\nYou know, Glenn reminds me of a TA I had for an OChem lab once - a right prick,  but knew his theory inside and out and was capable of fixing otherwise fruitless student set-ups on the fly. \n\nNear-rape encounter was too long for my liking, though, and *wow, Glenn going full dickhead by pretending to close the door on them*, but at least Magical Punch helped make up for it. \n\nThis show is going places. Maybe not my top 3 for this season, but places nonetheless. "
  },
  {
   "score": 2,
   "id": "dg55z8x",
   "pid": "t1_dg51yp5",
   "date": "2017-04-11 17:12:05",
   "depth": 1,
   "text": "It's what all of us chem TAs hope to strive to become :)"
  },
  {
   "score": 6,
   "id": "dg54bng",
   "pid": "t3_64qza0",
   "date": "2017-04-11 16:34:58",
   "depth": 0,
   "text": "\"That's a kick... \"\n\nThat reminds me of \"Is this a Zombie\" doing something similar. "
  },
  {
   "score": 26,
   "id": "dg4fle4",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:43:14",
   "depth": 0,
   "text": "[They call him...](https://hydra-media.cursecdn.com/dota2.gamepedia.com/5/50/Anti_spawn_01.mp3)"
  },
  {
   "score": 1,
   "id": "dg4gz30",
   "pid": "t1_dg4fle4",
   "date": "2017-04-11 09:08:32",
   "depth": 1,
   "text": "Wrong[^.](/s \"They call him 'the fool'\")"
  },
  {
   "score": 1,
   "id": "dg5pvx5",
   "pid": "t1_dg4fle4",
   "date": "2017-04-12 03:54:37",
   "depth": 1,
   "text": "Less of Anti-Mage more of Silencer"
  },
  {
   "score": 2,
   "id": "dg5o0u7",
   "pid": "t1_dg4fle4",
   "date": "2017-04-12 02:21:06",
   "depth": 1,
   "text": "More like a nerfed Silencer tbh. Even has a spell called Last Word in Dota 2."
  },
  {
   "score": 3,
   "id": "dg594h7",
   "pid": "t1_dg4fle4",
   "date": "2017-04-11 18:20:46",
   "depth": 1,
   "text": "He sundered their cabal."
  },
  {
   "score": 7,
   "id": "dg4e509",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:16:17",
   "depth": 0,
   "text": "The Magical Punch at the end caught me by surprise :D"
  },
  {
   "score": 5,
   "id": "dg4eow4",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:26:24",
   "depth": 0,
   "text": "that rape guy looks like Shinjiro from persona 3 :/"
  },
  {
   "score": 3,
   "id": "dg5imi5",
   "pid": "t1_dg4eow4",
   "date": "2017-04-11 22:21:40",
   "depth": 1,
   "text": "And the MC used his Fool arcana."
  },
  {
   "score": 4,
   "id": "dg4jgh2",
   "pid": "t3_64qza0",
   "date": "2017-04-11 09:53:37",
   "depth": 0,
   "text": "I liked how they dwelled into the origins and history of magic. Sort of like Fullmetal Alchemist where they dived into the pros and cons of using Alchemy"
  },
  {
   "score": 3,
   "id": "dg4c621",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:38:41",
   "depth": 0,
   "text": "This episode was definitely better than the first. It still lacks that something special that will make it one of my better series this season, though.\n\nIf the next episode is like this or improves on it further, I guess this might be worth a watch."
  },
  {
   "score": 3,
   "id": "dg4lu1v",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:36:55",
   "depth": 0,
   "text": "basically, this bastard teacher is a shit mage, but he knows his theory extremely well?"
  },
  {
   "score": 3,
   "id": "dg5auxm",
   "pid": "t1_dg4lu1v",
   "date": "2017-04-11 18:58:33",
   "depth": 1,
   "text": "no, the villain said just before they fought.\n\n\"how are you at the level where you can create original magic\"\n\nI'm gonna go on a guess and claim that creating magic sequences is probably not easily done even by people with great mana manipluation."
  },
  {
   "score": 1,
   "id": "dg8jdcf",
   "pid": "t1_dg5auxm",
   "date": "2017-04-13 18:11:55",
   "depth": 2,
   "text": "Like Glenn said Origin Magic isn't exactly a big deal it's considered sacred and a big deal because it's not easy to do.\n\nGeneral magics is like I tell you to write your name you grab some pen and paper and write it.\n\nOrigin magic is like \"What am I suppose to write with?\" \"idk figure it out yourself\"\n\ni.e. Shockbolt is general magic because it's an institutional spell crafted asnd refined for use by everyone. I imagine at some point shock bolt was some revolutionary origin magic..\n\nTLDR: General magic takes the form of using existing formulas, Origin is magics from scratch.\n\nTLDDR: Origin magic takes great magic theorism, something Glenn seems to excel at. \n\nI feel like the ability it craft Origin magics have little to do with Great Mana manipulation and more with understanding basics of magic as a system which again is something Glenn shows excellence at"
  },
  {
   "score": 2,
   "id": "dg6wsq2",
   "pid": "t1_dg5auxm",
   "date": "2017-04-12 18:21:06",
   "depth": 2,
   "text": "id like to think that on base stats, he isnt that powerful, meaning that he wont be able to cause a nuke if uses magic\n\nbut he knows enough magic theory, or understands magic enough to a point of being able to craft original magic.\n\n"
  },
  {
   "score": 6,
   "id": "dg5ikvw",
   "pid": "t1_dg4lu1v",
   "date": "2017-04-11 22:20:14",
   "depth": 1,
   "text": "Low magic aptitude but has hax skills in other areas.   \n\nJust like sasuga [onii-sama](http://www.entravity.com/wp-content/uploads/2014/04/Mahouka-Koukou-no-Rettousei-Miyuki.jpg)."
  },
  {
   "score": 1,
   "id": "dg8jmvm",
   "pid": "t1_dg5ikvw",
   "date": "2017-04-13 18:18:09",
   "depth": 2,
   "text": "[Manga/LN] (/s \"He's one of the Badass LN MC that gets his ass handed to him the most imo, which is why I like him there are enough times that he gets shit on just enough to keep my attention on the page.  \" )"
  },
  {
   "score": 4,
   "id": "dg4xnqj",
   "pid": "t3_64qza0",
   "date": "2017-04-11 14:13:28",
   "depth": 0,
   "text": "I was kinda hoping the girl would play with her words to launch a non-standard shock bolt, rather than the MC slouching to the rescue. But otherwise that was a fun episode with a nice magic system.\n\n[Blondie Sensei](http://i.imgur.com/6FOpeZ4.png) is top notch though."
  },
  {
   "score": 1,
   "id": "dg5wp25",
   "pid": "t1_dg4xnqj",
   "date": "2017-04-12 07:11:10",
   "depth": 1,
   "text": "I was really hoping that'd be the case as well. What we got definitely wasn't bad though, pretty hilarious. It would be nice if later on down the line we do get a scene of her being in a similar position and using a non-standard spell. There's a literary term for that, but I can't think of what it is."
  },
  {
   "score": 1,
   "id": "dg5xh7v",
   "pid": "t1_dg5wp25",
   "date": "2017-04-12 07:26:50",
   "depth": 2,
   "text": "Are you looking for [Chekhov's Gun](https://en.wikipedia.org/wiki/Chekhov%27s_gun)?"
  },
  {
   "score": 1,
   "id": "dg5y24s",
   "pid": "t1_dg5xh7v",
   "date": "2017-04-12 07:38:14",
   "depth": 3,
   "text": "No, though I can see how that might fit too. It was [Callbacks](http://tvtropes.org/pmwiki/pmwiki.php/Main/CallBack) or [Bookends](http://tvtropes.org/pmwiki/pmwiki.php/Main/bookends) (TV Tropes warning)."
  },
  {
   "score": 5,
   "id": "dg585l1",
   "pid": "t3_64qza0",
   "date": "2017-04-11 18:00:15",
   "depth": 0,
   "text": "Man I love this anime so far but these fucking uniforms man. You can see these chicks' pelvis bone. "
  },
  {
   "score": 4,
   "id": "dg5k3ng",
   "pid": "t3_64qza0",
   "date": "2017-04-11 23:14:47",
   "depth": 0,
   "text": "This show went from meh to pretty good fast."
  },
  {
   "score": 14,
   "id": "dg4d41f",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:56:47",
   "depth": 0,
   "text": "Compared to last week, it looks like this show is falling hard into the \"magical school\" trap that so many other shows also have. Like so far we've got:  \n✔️MC is secretly OP GOAT  \n✔️Female character has a hidden past involved with MC  \n✔️secret evil organization trying to invade the school  \n✔️someone gets almost-raped   \nThe show's enjoyable enough, and I'll reserve super critical judgment until after like the 5th episode, but this episode atleast was very basic.   \nEdit: formatting"
  },
  {
   "score": 12,
   "id": "dg4o75m",
   "pid": "t1_dg4d41f",
   "date": "2017-04-11 11:20:13",
   "depth": 1,
   "text": "> MC is secretly OP GOAT\n\nHe actually isn't that op, he just happens to be a trump card against mages who usually neglect physical abilities\n\n> Female character has a hidden past involved with MC\n\nThe flashback with the stupid gloves made it way more obvious than the novel did. I mean they literally kept the FUCKING gloves on him.\n\n> secret evil organization trying to invade the school\n\ngotta have conflict, but the buildup was way higher in the novel since they are burning through volume 1 pretty fast right now.\n\n> someone gets almost-raped\n\nYeah but that's usually the male lead, the last show that did the almost rape bit on a girl that I can remember was High School DxD with the blonde if I recall correctly. And that bit was a lot darker than most other jokes in this genre. "
  },
  {
   "score": 1,
   "id": "dg540jb",
   "pid": "t1_dg4o75m",
   "date": "2017-04-11 16:28:07",
   "depth": 2,
   "text": "Well a lot of the characters in Cross Ange got raped by [Spoilers] (/s \"Fetus-kun\")"
  },
  {
   "score": 8,
   "id": "dg7z298",
   "pid": "t1_dg4o75m",
   "date": "2017-04-13 11:19:36",
   "depth": 2,
   "text": "> he just happens to be a trump card against mages who usually neglect physical abilities  \n\nIsn't that pretty much the cliche though? \"Unremarkable by accepted standards, but actually has unique^(TM) ability to negate/counter 'more powerful/ranked' people.\""
  },
  {
   "score": 3,
   "id": "dg4e878",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:17:55",
   "depth": 0,
   "text": "The second episode was better by far. Hope it keeps up."
  },
  {
   "score": 3,
   "id": "dg4exjk",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:30:51",
   "depth": 0,
   "text": "Expect the unexpected.\nSeriously loving the anime more than LN"
  },
  {
   "score": 3,
   "id": "dg4gbo4",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:56:30",
   "depth": 0,
   "text": "Hey, he's actually strong, just unconventional. Guess we can tick this trope off the list.\n\nI enjoy it every time though."
  },
  {
   "score": 3,
   "id": "dg4k7oh",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:07:22",
   "depth": 0,
   "text": "Welp, that settles it. Glenn is best guy."
  },
  {
   "score": 3,
   "id": "dg5g4it",
   "pid": "t3_64qza0",
   "date": "2017-04-11 21:06:06",
   "depth": 0,
   "text": "The best part was his Magical punch and he kicked the guy I couldn't stop laughing. He Gassed him so hard lmao "
  },
  {
   "score": 5,
   "id": "dg4b4mj",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:17:45",
   "depth": 0,
   "text": "This episode was actually enjoyable, pretty unexpected after the first episode."
  },
  {
   "score": 6,
   "id": "dg4dr3b",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:09:01",
   "depth": 0,
   "text": "Is it bad if I like this anime?\n\nI mean, their 2nd episode have much more impact than the 1st episode (and I honestly didn't expect that). Also, the OST is on point. I'm liking it so far! "
  },
  {
   "score": 0,
   "id": "dg4pes2",
   "pid": "t1_dg4dr3b",
   "date": "2017-04-11 11:42:23",
   "depth": 1,
   "text": ">is it bad\n\nWhat are you talking about? It's one of the better Magic High School shows out there!"
  },
  {
   "score": 3,
   "id": "dg4ko8z",
   "pid": "t1_dg4dr3b",
   "date": "2017-04-11 10:15:49",
   "depth": 1,
   "text": "The OST is so good! That BGM when he was talking to Rumia gave me chills"
  },
  {
   "score": 6,
   "id": "dg4iyqr",
   "pid": "t3_64qza0",
   "date": "2017-04-11 09:44:51",
   "depth": 0,
   "text": "Is anyone really expected to take the story seriously with those uniforms?\n\n\"Just look at the medical field - it saves people from sickness.\"  Just the fact that he completely ignores healing magic, which we saw in action in episode 1, and she doesn't even point that out, shows how badly written this is. \n\nGeez I wonder who the Mage of Justice was >_>\n\nAnd he's OP as NOBODY WATCHING THE SHOW WOULD EVER SUSPECT.\n\nAt least the magic system looks actually interesting."
  },
  {
   "score": 1,
   "id": "dgkorw5",
   "pid": "t1_dg4iyqr",
   "date": "2017-04-21 12:41:02",
   "depth": 1,
   "text": "You're thinking too small in scale. Take a look at [this](https://i.imgur.com/YsGe9x4.png) image. While the only healing magic we've seen so far just heals individual people, advances in the medical/agricultural field save *billions* of lives. \n\nBut I do agree that magic does have *some* benefit to humanity "
  },
  {
   "score": 1,
   "id": "dgkqa9k",
   "pid": "t1_dgkorw5",
   "date": "2017-04-21 13:11:14",
   "depth": 2,
   "text": "Those people in the screenshot invented the medicine, they didn't distribute it to hundreds of millions of people.  So that would be the equivalent of someone inventing the healing spell that thousands of mages will, over the years, use to save hundreds of thousands of people."
  },
  {
   "score": 1,
   "id": "dgkqbyd",
   "pid": "t1_dgkqa9k",
   "date": "2017-04-21 13:12:13",
   "depth": 3,
   "text": "You're right, didn't consider that. \n\nBut consider diseases. The healing magic we know about so far does nothing to combat disease. So while healing magic is useful, the medical field is important as well"
  },
  {
   "score": 1,
   "id": "dgkx3xm",
   "pid": "t1_dgkqbyd",
   "date": "2017-04-21 15:38:30",
   "depth": 4,
   "text": "We also don't know that there is *no* healing magic that would combat diseases.\n\nAnd I never said that healing magic makes the medical sciences obsolete.  I said that the mere existence of healing magic completely disproves his claim that \"magic good only for healing and nothing else.\""
  },
  {
   "score": 2,
   "id": "dgkydco",
   "pid": "t1_dgkx3xm",
   "date": "2017-04-21 16:08:22",
   "depth": 5,
   "text": "Yeah I know, I agree with you. I was just trying to explain his point of view"
  },
  {
   "score": 1,
   "id": "dg4osdz",
   "pid": "t1_dg4iyqr",
   "date": "2017-04-11 11:31:02",
   "depth": 1,
   "text": "My guess is the Healing Magic just heals physical wounds.  \nAnd as many said in this thread, he's not OP, just unconventional."
  },
  {
   "score": 4,
   "id": "dg4px2j",
   "pid": "t1_dg4osdz",
   "date": "2017-04-11 11:51:18",
   "depth": 2,
   "text": "Instantly healing physical wounds is still something that only Star Trek level medical science can accomplish.  Hardly \"of no benefit to humanity\". \n\nHe's \"OP\" in the same manner that Asterisk War and Rakudai MCs are.    The strength overcompensates for the weakness.  They seem super weak at first glance, but are able to defeat far stronger opponents than they should be able to if you just look at their stats.  Obviously he's no Jesus-nii-sama, which is an extreme example of that trope."
  },
  {
   "score": 3,
   "id": "dg5lg04",
   "pid": "t1_dg4px2j",
   "date": "2017-04-12 00:11:30",
   "depth": 3,
   "text": "Asterisk MC is OP because he has secret power chained inside him that lets him power up whenever he likes. He is straight up powerful by conventional standards. He is closest to Jesus-ni-sama. He never had perception of being weak.\n\nRakudai MC is OP because he has very clear flaw (low magic) that is offset by unconventional but strong abilities. \n\nRokudenashi MC is more or less the same as the Rakudai, but he actually was never really ostracized because of his flaws. From what I understand he was some kind of spec ops and he fine-tuned his specialty. He was perceived as weak only because he didn’t bother and see no point in showing otherwise.\n \nI just don’t like how you lumped together Asterisk MC and Rakudai. Differences might not seem big, but they are quite significant.\n"
  },
  {
   "score": 1,
   "id": "dg9nebx",
   "pid": "t1_dg5lg04",
   "date": "2017-04-14 12:50:53",
   "depth": 4,
   "text": "A slight correction, Glenn was found weak by his peers even though he worked hard because [ep3 spoilers](/s \"his talent was in an area, stagnation, not useful for magic, which is about bringing change.\")"
  },
  {
   "score": 1,
   "id": "dg5vc5h",
   "pid": "t1_dg5lg04",
   "date": "2017-04-12 06:41:46",
   "depth": 4,
   "text": "Asterisk MC's power up is limited duration after which he becomes useless, and even when powered up, he isn't really OP compared to the other high ranks."
  },
  {
   "score": 6,
   "id": "dg521sf",
   "pid": "t1_dg4iyqr",
   "date": "2017-04-11 15:44:17",
   "depth": 1,
   "text": "I think his argument, and the direction he was going with it, was about the fields as a whole; the purpose of the medical field, agriculture field, and the other similar fields he mentioned are to ultimately help people. Magic is different in that, while it has healing spells and such, it has primarily been used as a weapon to allow people to very easily harm and kill others. So to him that field has less value. That's kinda what he was trying to get at."
  },
  {
   "score": 3,
   "id": "dg55cx6",
   "pid": "t1_dg521sf",
   "date": "2017-04-11 16:58:33",
   "depth": 2,
   "text": "He's not saying that it has less value, he's saying that it has 0 value aside from killing people, and the only reason to study magic is if you want to kill people."
  },
  {
   "score": 4,
   "id": "dg56v4i",
   "pid": "t1_dg55cx6",
   "date": "2017-04-11 17:31:43",
   "depth": 3,
   "text": "I think you're taking his statement a little to literally, of course the teacher knows that healing spells and other such helpful spells exist. When he said \"magic provides no benefits at all\" he immediately started comparing the field to other fields that were built with the purpose of helping humans in mind. When the silver haired chick started arguing back about the value of magic he even told her he was sorry and that he was lying, that magic is incredibly useful to kill people. He was ultimately trying to get to that point and was using hyperbole to build up to it. It's similar to when people say \"all guns are bad and are used to kill people\" when they can be used to help people as well.  "
  },
  {
   "score": 0,
   "id": "dg5ilsh",
   "pid": "t1_dg56v4i",
   "date": "2017-04-11 22:21:00",
   "depth": 4,
   "text": "Guns have other purposes too not just killing."
  },
  {
   "score": 14,
   "id": "dg4nzp6",
   "pid": "t1_dg4iyqr",
   "date": "2017-04-11 11:16:26",
   "depth": 1,
   "text": "> \"Just look at the medical field - it saves people from sickness.\" Just the fact that he completely ignores healing magic, which we saw in action in episode 1, and she doesn't even point that out, shows how badly written this is.\n\nHush, you'll suck out the fun of the show by pointing out terribly written the characters are.\n\n"
  },
  {
   "score": 10,
   "id": "dg54lvg",
   "pid": "t1_dg4nzp6",
   "date": "2017-04-11 16:41:25",
   "depth": 2,
   "text": "The LN did a better job in portraying this issue. [LN scene explanation](/s  \"That scene introduces the internal conflicts the characters are going through concerning their personal perception of magic. Sistina got overwhelmed and flustered by Glenn's response. It was one of those moments for her where all the great counter-arguments only come to mind after the fact. The episode also tried to show that she is studying magic mostly due to her sheltered upbringing and family obligations to follow in her father's footsteps and not to help other people.\")"
  },
  {
   "score": 2,
   "id": "dg8kbfb",
   "pid": "t1_dg54lvg",
   "date": "2017-04-13 18:33:45",
   "depth": 3,
   "text": "[Actually Sistine's reaction/LN](/s \" I feel like this is something that comes back again and again, She freezes up, I mean later in the volumes she curses her uselessness. I so far see 4 places where this happens \" )\n\n[REAL LN SPOILERS] (/s \" First time I see it when Glenn tells her magic is only good for killing people. Second time is the rape scene with the psycho villain, she falters and begs for mercy. Third time I think is when Riel takes away Rumia, She couldn't shoot her and just stood there as Riel takes off even after giving her a chance to shoot. 4th up to where I am is when she is called upon by Albert to heal Glenn. \" )\n\nand you know what? I like it. I absolutely love the fact that she has flaws and she has things she needs to overcome and is something that she has consistent difficulty with.\n\n[One thing I dislike about many LNs] (/s \" is the breakthrough episodes where the character gathers resolves and all of a sudden all past trauma and difficulties become obsolete. \" )\n\nI like Sistine"
  },
  {
   "score": 2,
   "id": "dg4fxxx",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:49:38",
   "depth": 0,
   "text": "I actually really enjoy this second episode more so than the first. \n\nIt was pretty obvious that he was hiding something from the first episode, but the way it was portrayed in this episode was pretty well done. Hm kinda considering whether I should buy LN or not, but I am definitely hooked!"
  },
  {
   "score": 2,
   "id": "dg4k7lf",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:07:19",
   "depth": 0,
   "text": "That magic punch at the end tho"
  },
  {
   "score": 2,
   "id": "dg4l2my",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:23:08",
   "depth": 0,
   "text": "This is a bit fast paced compared to the LN and the manga but I'm liking it. Sure the school is filled with Hogwarts Strippers but gotta love the comedy.\n\nIf anything, I hope this gets popular enough so the LN can be localized.\n\n And white fox always delivers with those longer episodes, love it."
  },
  {
   "score": 2,
   "id": "dg4lm0a",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:32:51",
   "depth": 0,
   "text": "I'm liking the explanation of the magic system; it's nice to have a show that cares about its plot points. And Glenn's critique of the way magic is taught can kind of be extended to the way much of education IRL is conducted..."
  },
  {
   "score": 2,
   "id": "dg4lzlj",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:39:41",
   "depth": 0,
   "text": "after the first episode i wasn't going to keep this anime, but i tried the second and was really enjoyable."
  },
  {
   "score": 2,
   "id": "dg4neoi",
   "pid": "t3_64qza0",
   "date": "2017-04-11 11:05:35",
   "depth": 0,
   "text": "I knew he was going to excuse himself after walking in on Sisti and that military guy. I like this guy. I think it's going to be what Kuusen Madoushi wanted to be."
  },
  {
   "score": 2,
   "id": "dg4nuyj",
   "pid": "t3_64qza0",
   "date": "2017-04-11 11:13:59",
   "depth": 0,
   "text": "He nails the book to the board.\n\nWhat's this guy planning, bad mouthing magic like this?\n\nAfter some shenanigans it looks like Glenn is down for teaching now.\n\nOh wow evil plot from evil organization already? That didn't take long. Sensei coming to save the day!\n\n\"It's a small!\"\n\n\"Magical Punch! (Kick)\""
  },
  {
   "score": 2,
   "id": "dg4o4pu",
   "pid": "t3_64qza0",
   "date": "2017-04-11 11:18:58",
   "depth": 0,
   "text": "Ahh I'm so glad he doesn't suck. He probably isn't the most OP mage out there, but at least he uses strategy, and I love MCs like that."
  },
  {
   "score": 2,
   "id": "dg4oobp",
   "pid": "t3_64qza0",
   "date": "2017-04-11 11:29:01",
   "depth": 0,
   "text": "This was great ! It would have been so obvious that he is actually  \ngood with magic but the first EP had me so convinced that he sucks,  \nmaking this a real suprise.  \nEnjoyed the action, the astonished students and all the funny stuff."
  },
  {
   "score": 2,
   "id": "dg4opa6",
   "pid": "t3_64qza0",
   "date": "2017-04-11 11:29:30",
   "depth": 0,
   "text": "Enjoyable, but I hope he won't be using that negating spell of his often. "
  },
  {
   "score": 1,
   "id": "dg5w9g3",
   "pid": "t1_dg4opa6",
   "date": "2017-04-12 07:02:00",
   "depth": 1,
   "text": "Maybe a spoiler, his ability doesn't negate magic exactly. Will likely be clarified next episode."
  },
  {
   "score": 1,
   "id": "dg6au38",
   "pid": "t1_dg5w9g3",
   "date": "2017-04-12 11:23:26",
   "depth": 2,
   "text": "I've been already told that [if it really counts as a spoiler](/s \"it stops the magic from activating\"), but the guy deleted his comment as I see now."
  },
  {
   "score": 1,
   "id": "dg4txsi",
   "pid": "t1_dg4opa6",
   "date": "2017-04-11 13:03:01",
   "depth": 1,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dg4whj5",
   "pid": "t1_dg4txsi",
   "date": "2017-04-11 13:50:34",
   "depth": 2,
   "text": "I would still prefer if he fought using offensive/strengthening spells so I'm hoping he will show some of that.  \n  \nYou know, stopping magic from happening when you come for some magic fights isn't really all that enjoyable, at least for me."
  },
  {
   "score": 2,
   "id": "dg4rajx",
   "pid": "t3_64qza0",
   "date": "2017-04-11 12:15:20",
   "depth": 0,
   "text": "This carefree OP mage reminds me of Ryner Lute from [The Legend of the Legendary Heroes](https://myanimelist.net/anime/8086/Densetsu_no_Yuusha_no_Densetsu) "
  },
  {
   "score": 1,
   "id": "dg5n5dv",
   "pid": "t1_dg4rajx",
   "date": "2017-04-12 01:34:40",
   "depth": 1,
   "text": "[They even both took a book to the face](http://pa1.narvii.com/6002/2a5eec8ee21da3dfeddbf889f83402a24364f8b1_hq.gif)"
  },
  {
   "score": 2,
   "id": "dg4s0ix",
   "pid": "t3_64qza0",
   "date": "2017-04-11 12:28:20",
   "depth": 0,
   "text": "Very strong episode that shows Glenn in a whole new light. He pretty much turned it around for himself. \n\nHe can cancel all magic and prohibit it from being used with his original spell and then has the edge in a physical fight. What a way to be ''OP''."
  },
  {
   "score": 2,
   "id": "dg4xnhc",
   "pid": "t3_64qza0",
   "date": "2017-04-11 14:13:19",
   "depth": 0,
   "text": "It was a better episode than the first episode in my opinion - barely, if I include the rape attempt scene - by far better, if I exclude it. Because honestly, it wasn't bad only because it was there to begin with, but the reaction and timing of things afterwards was really awkward and made the scene more horrid. The Magical Punch and his mannerisms would've worked better if the situation wasn't that serious to begin with. But the first episode also had very gratitious fanservice so I can be confident with episode 2 > episode 1.  \nTo the rest of the episode, while I haven't understood half of the explanations he made, the magic system in this world sounds intricate but in a really good way. Glenn isn't a loser anymore and at last it feels like his arrogance is partially justfied and thus far more enjoyable.  \nWe can also expect a good share of story now and if the magic is as craftily made as the plot, it'll be a good surprise after all."
  },
  {
   "score": 2,
   "id": "dg50x58",
   "pid": "t3_64qza0",
   "date": "2017-04-11 15:20:12",
   "depth": 0,
   "text": "I think we're gonna need a slap counter for this series. "
  },
  {
   "score": 2,
   "id": "dg51owd",
   "pid": "t3_64qza0",
   "date": "2017-04-11 15:36:32",
   "depth": 0,
   "text": "The Fool's World, just saying ^(don't downvote me ^please)\nI was expecting Sisti's response to \"Magic is just for killing\" to be a bit more... mature... But I guess the way she reacted and her book-like answers are just a mirror of her personality. I like it."
  },
  {
   "score": 2,
   "id": "dg5ihr7",
   "pid": "t1_dg51owd",
   "date": "2017-04-11 22:17:26",
   "depth": 1,
   "text": "TOKI NO TOMARE!!!"
  },
  {
   "score": 2,
   "id": "dg56dfa",
   "pid": "t3_64qza0",
   "date": "2017-04-11 17:20:48",
   "depth": 0,
   "text": "I was super stoked after this episode ended. I am a big sucker for magic theory and the inner workings of such. Such a wonderful world building done with the magic by the author and the teacher did a fantastic job of bringing it across. I can't wait for more!"
  },
  {
   "score": 2,
   "id": "dg5a36w",
   "pid": "t3_64qza0",
   "date": "2017-04-11 18:41:26",
   "depth": 0,
   "text": "where is my fantasy harem?, i wasn't expecting an actually good(hopefully it stays that way) show you know, i'm almost (key word being almost) dissapointed, the killer midrifs, and the cute girls seem like a burden now, and souce readers please tell me there is no more rapey sequences, that was the odd ball in this episode"
  },
  {
   "score": 1,
   "id": "dg75lea",
   "pid": "t1_dg5a36w",
   "date": "2017-04-12 21:40:39",
   "depth": 1,
   "text": "\n[LN](/s \" None that are nearly impactful , the one I'm thinking of is not for a long while \")\n"
  },
  {
   "score": 2,
   "id": "dg5ft0z",
   "pid": "t3_64qza0",
   "date": "2017-04-11 20:57:30",
   "depth": 0,
   "text": "honestly I'm never seen so many underrated anime's in one season, this was great."
  },
  {
   "score": 2,
   "id": "dg5g2dy",
   "pid": "t3_64qza0",
   "date": "2017-04-11 21:04:29",
   "depth": 0,
   "text": "This episode has more serious vibe. Really dig all the story and maybe we will getting some flashback story in future episode.\n\nMy complain maybe .... Glenn is no longer lazy bastard teacher, and somehow begin to show he is capable teacher too fast (Just 2 episode)."
  },
  {
   "score": 2,
   "id": "dg5ia20",
   "pid": "t3_64qza0",
   "date": "2017-04-11 22:10:38",
   "depth": 0,
   "text": "So we can tell that Rumia was saved by Glenn based from her story and hint from first episode (Glenn recogned Rumia from past)"
  },
  {
   "score": 1,
   "id": "dg5yzbd",
   "pid": "t1_dg5ia20",
   "date": "2017-04-12 07:55:42",
   "depth": 1,
   "text": "Pretty much. I think this is another TV Trope that happens in most animes with this setting."
  },
  {
   "score": 2,
   "id": "dg6itnq",
   "pid": "t3_64qza0",
   "date": "2017-04-12 13:40:20",
   "depth": 0,
   "text": "Glenn activates the trap card \"Magic Jammer\"; unknownst to him a recent nerf to the card also disables his own magical abilities! No worries, our hero plays his ultimate trump card, \"Fist of Fate\"! \n\nNow this is how you do a high school battle harem show right! "
  },
  {
   "score": 2,
   "id": "dg70530",
   "pid": "t3_64qza0",
   "date": "2017-04-12 19:30:17",
   "depth": 0,
   "text": "Wait, so the reason why he was using longer  chants last episode, when he had a duel with Shiro neko-chan, was because he was actually manipulating it (perhaps to the right  as he demonstrated in this episode?) to ensure that she would not be harmed? "
  },
  {
   "score": 4,
   "id": "dg7eltr",
   "pid": "t1_dg70530",
   "date": "2017-04-13 04:06:25",
   "depth": 1,
   "text": "I think he just was screwing around because he didnt want to teach in the first place and just wants to be kicked out."
  },
  {
   "score": 2,
   "id": "dg7dtze",
   "pid": "t3_64qza0",
   "date": "2017-04-13 03:31:01",
   "depth": 0,
   "text": "Welp, I'm  sold. That was a great episode. Also, who needs OPs or EDs anyway, when you have a badass MC to save the day. "
  },
  {
   "score": 2,
   "id": "dg8r7ra",
   "pid": "t3_64qza0",
   "date": "2017-04-13 21:25:58",
   "depth": 0,
   "text": "I actually love this. Super self aware, so far pretty interesting/well developed magic system. MC is great and girls are cute, what's not to love?"
  },
  {
   "score": 2,
   "id": "dgcjzm7",
   "pid": "t3_64qza0",
   "date": "2017-04-16 13:49:42",
   "depth": 0,
   "text": "I don't like how quick some shows are to pull the rape card. It's unpleasant for everyone and doesn't fit the generally fun tone of the anime.\n\nI ship him with the prof though. Adult women ftw."
  },
  {
   "score": 4,
   "id": "dg4hfkg",
   "pid": "t3_64qza0",
   "date": "2017-04-11 09:16:54",
   "depth": 0,
   "text": "wow, this episode was leagues better than that horrendous first episode.  Really glad I gave this show the 3 episode rule.  While this episode still had some low points to me (episode 2, and already hitting us with generic rape villain),  I really enjoyed a lot of things in this episode. \n\n The whole magic system in this show really intrigued me, where the real juice of the magic is based on the personal association with language rather than specific combination  of words.  Well at least that's I what I think  they meant, if I'm misunderstood something please correct me.\n\nAlso, I loved the whole special move feint,  first time an anime enacted a fantasy of mine that developed while watching shows like One Piece or Hunter x Hunter.  Put a real stupid smile on my face."
  },
  {
   "score": 3,
   "id": "dg4kd2p",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:10:08",
   "depth": 0,
   "text": "To the people who dropped it.\n\nYou're missing out, this is hilarious.\n\nEdit: Oh and was that bell chime taken from Big Ben? It sounds so familiar."
  },
  {
   "score": 3,
   "id": "dg4uwgk",
   "pid": "t3_64qza0",
   "date": "2017-04-11 13:20:58",
   "depth": 0,
   "text": "My face fell flat when we jumped straight to attempted rape, but it was kinda worth it for, \"sorry to interrupt.\""
  },
  {
   "score": 4,
   "id": "dg8rj0j",
   "pid": "t3_64qza0",
   "date": "2017-04-13 21:35:02",
   "depth": 0,
   "text": "Not to be that guy, obviously, but was anyone else slightly unnerved by the rape scene? Particularly with how out of place it was with the rest of the episode?"
  },
  {
   "score": 2,
   "id": "dg5o9j2",
   "pid": "t3_64qza0",
   "date": "2017-04-12 02:33:43",
   "depth": 0,
   "text": "Am I the only one that is really annoyed with how painfully generic Rumia and Sisti are?"
  },
  {
   "score": 1,
   "id": "dg4rpds",
   "pid": "t3_64qza0",
   "date": "2017-04-11 12:22:45",
   "depth": 0,
   "text": "And there it is folks. The part that I have a totally guilty pleasure with. The moment the lazy but badass protag shows their true skills and colors.\n\nWhile others try to overpower their enemy with pure magical strength, Glenn nullifies them all and beats them to pulp, literally with his hands (and feet) and man does it look cool.\n\nBTW I'M REALLY LOVING SISTINE'S VA SO MUCH AHHHHHH ALSO AS SAGIRI AND HER ANOTHER MAIN ROLE IN SIN:NANATSU AHHHH I LOVE HER VOICE SO MUCH!!!"
  },
  {
   "score": 1,
   "id": "dg4xeti",
   "pid": "t3_64qza0",
   "date": "2017-04-11 14:08:27",
   "depth": 0,
   "text": "This episode sure tops the last one. The serious parts actually worked really well. I was pretty invested."
  },
  {
   "score": 1,
   "id": "dg4xn8q",
   "pid": "t3_64qza0",
   "date": "2017-04-11 14:13:12",
   "depth": 0,
   "text": "that rape scene to gag back to serious fight gave me whip lash. kind of funny due to novelty but I hope it doesn't try it again."
  },
  {
   "score": 1,
   "id": "dg4xonb",
   "pid": "t3_64qza0",
   "date": "2017-04-11 14:13:59",
   "depth": 0,
   "text": "Nice episode. Seems to be interesting. Can a source reader spoil me about the upcoming story a bit?"
  },
  {
   "score": 1,
   "id": "dg4ygro",
   "pid": "t3_64qza0",
   "date": "2017-04-11 14:29:41",
   "depth": 0,
   "text": "Alright r/anime, someone help me out here. Give me those glorious stitches of Sisti in that scene toward the end."
  },
  {
   "score": 1,
   "id": "dg50mw4",
   "pid": "t3_64qza0",
   "date": "2017-04-11 15:14:13",
   "depth": 0,
   "text": "I dug this episode. Very heavy Harry Potter vibes ... but that's not exactly a bad thing, in my opinion."
  },
  {
   "score": 1,
   "id": "dg50vfx",
   "pid": "t3_64qza0",
   "date": "2017-04-11 15:19:12",
   "depth": 0,
   "text": "The Arcana is the means by which all is revealed... \n\nTo find the one true path, one must acknowledge that a punch might look like a kick..."
  },
  {
   "score": 1,
   "id": "dg50z8z",
   "pid": "t3_64qza0",
   "date": "2017-04-11 15:21:28",
   "depth": 0,
   "text": "Was not sold after the first episode but now i am. I like the way the MC is OP but not in a regular way."
  },
  {
   "score": 1,
   "id": "dg53zoq",
   "pid": "t3_64qza0",
   "date": "2017-04-11 16:27:35",
   "depth": 0,
   "text": "Wow, it's still a bit generic and fanservice-ey but that was a vast improvement over the first episode. I was all but certain I was going to drop the show after giving episode 2 a try, but I'm definitely going to continue watching.\n\nThe magic system seems quite interesting, and that explanation seems surprisingly well-translated. ...though I think I might have just watched enough dodgy fansubs over the years that I've grown used to Japanese technobabble about imaginary subjects ending up as word salad..."
  },
  {
   "score": 1,
   "id": "dg54451",
   "pid": "t3_64qza0",
   "date": "2017-04-11 16:30:21",
   "depth": 0,
   "text": "Loving the magical punch!"
  },
  {
   "score": 1,
   "id": "dg54vyb",
   "pid": "t3_64qza0",
   "date": "2017-04-11 16:47:49",
   "depth": 0,
   "text": "[best girl](http://imgur.com/FSvkwIa)"
  },
  {
   "score": 1,
   "id": "dg557a8",
   "pid": "t3_64qza0",
   "date": "2017-04-11 16:54:54",
   "depth": 0,
   "text": "Damn this episode is even better then first one and no op or ed full dedication!"
  },
  {
   "score": 1,
   "id": "dg559da",
   "pid": "t3_64qza0",
   "date": "2017-04-11 16:56:18",
   "depth": 0,
   "text": "Man I love going into anime 100% blind. Only reason I picked this up is because \"Akashic Records\" sounded cool. I think this will at least be a top 3 of the season for me. "
  },
  {
   "score": 1,
   "id": "dg55phn",
   "pid": "t3_64qza0",
   "date": "2017-04-11 17:06:15",
   "depth": 0,
   "text": "You know I was pretty sure I was going to drop this after ep 1. I'm so glad I kept watching"
  },
  {
   "score": 1,
   "id": "dg58xht",
   "pid": "t3_64qza0",
   "date": "2017-04-11 18:16:39",
   "depth": 0,
   "text": "Let's take a look back at episode 1 where Rumia uses a healing spell. \"The angels' blessings be with you.\" I'm going to assume that this is a normal ability that doesn't rely on her having a magic bloodline or some other special ability. We also saw \"Pay heed, great wind!\" And the last one that wasn't covered in this episode \"*Return thyself to the cycle of providence, the five elements to elements, and sever the links woven between images and truth.* The first two are likely shortened chants.           \n\nMaybe this question belongs on one of those self-insert subreddits or /r/magicbuilding, but I'm curious what y'all would come up with for alternative effects of the above spells. I don't think discussing the military-grade magic would be useful with such limited info. "
  },
  {
   "score": 1,
   "id": "dg5983m",
   "pid": "t3_64qza0",
   "date": "2017-04-11 18:22:49",
   "depth": 0,
   "text": "The Crunchyroll link doesn't work and I can't find this anime on it by name search.  Help?"
  },
  {
   "score": 1,
   "id": "dg9o22x",
   "pid": "t1_dg5983m",
   "date": "2017-04-14 13:04:03",
   "depth": 1,
   "text": "[Try this](http://www.crunchyroll.com/akashic-records-of-bastard-magical-instructor)"
  },
  {
   "score": 1,
   "id": "dg9seby",
   "pid": "t1_dg9o22x",
   "date": "2017-04-14 14:33:02",
   "depth": 2,
   "text": "Lol?  \"of bastard magical instructor\".  I guess that was my problem.  Thanks!"
  },
  {
   "score": 1,
   "id": "dgafxsx",
   "pid": "t1_dg9seby",
   "date": "2017-04-15 01:01:50",
   "depth": 3,
   "text": "Glad to help"
  },
  {
   "score": 1,
   "id": "dg59i4t",
   "pid": "t3_64qza0",
   "date": "2017-04-11 18:28:46",
   "depth": 0,
   "text": "Way better than the previous episode. Honestly fuck that first episode "
  },
  {
   "score": 1,
   "id": "dg59mlh",
   "pid": "t3_64qza0",
   "date": "2017-04-11 18:31:23",
   "depth": 0,
   "text": "This make this series much better. That first episode did it's job really well, setting up for this episode. Now I'm interested. "
  },
  {
   "score": 1,
   "id": "dg5a1l9",
   "pid": "t3_64qza0",
   "date": "2017-04-11 18:40:25",
   "depth": 0,
   "text": "For some reason this reminds me of  Ultimate otaku teacher and I really liked that series hope this series continues to kick ass \n\n\n"
  },
  {
   "score": 1,
   "id": "dg5bqbq",
   "pid": "t3_64qza0",
   "date": "2017-04-11 19:18:13",
   "depth": 0,
   "text": "Wow, that episode really was tons better than the first. Pretty excited for the next episode now."
  },
  {
   "score": 1,
   "id": "dg5e0rc",
   "pid": "t3_64qza0",
   "date": "2017-04-11 20:11:42",
   "depth": 0,
   "text": "Imagine breaker!\n\nWait wrong anime. Really enjoy his ability that matches his personality though. The fool."
  },
  {
   "score": 1,
   "id": "dg5f5yz",
   "pid": "t3_64qza0",
   "date": "2017-04-11 20:40:28",
   "depth": 0,
   "text": "this episode 10x better than the first episode! here comes the useless mage that fights with his fists lmao"
  },
  {
   "score": 1,
   "id": "dg5gu1n",
   "pid": "t3_64qza0",
   "date": "2017-04-11 21:26:22",
   "depth": 0,
   "text": "> That anti-magic rant\n\nWhere will you be when the PTSD hits?"
  },
  {
   "score": 1,
   "id": "dg5jbqk",
   "pid": "t3_64qza0",
   "date": "2017-04-11 22:45:25",
   "depth": 0,
   "text": "While I was tabbing over to watch this, I remembered how annoyed I was by the first episode and prepared for shitty comedy about an incompetent teacher, but this subverted my expectations entirely. Thank goodness for teacher with MC syndrome /s(?)"
  },
  {
   "score": 1,
   "id": "dg5jm4n",
   "pid": "t3_64qza0",
   "date": "2017-04-11 22:55:47",
   "depth": 0,
   "text": "I suppose a few people actually thought that he won't change from being the weak \"bastard\", as he was in the 1st episode. I mean, I am one of those people, and now I feel like an idiot. Not once have I seen an anime like 'Akashic Records', where the protagonist doesn't have some superior knowledge/skill to other characters.\n\nIf there is one, then please do tell me, since I've been starving to watch one of those. Why? When the MC shows himself to be unskillful and dumb, but then the next episode shows him doing insane moves, or teaching people tricks they didn't know, it doesn't fit with me. "
  },
  {
   "score": 1,
   "id": "dg5nvor",
   "pid": "t1_dg5jm4n",
   "date": "2017-04-12 02:13:29",
   "depth": 1,
   "text": "Zero Kara Hajimeru?"
  },
  {
   "score": 1,
   "id": "dg7ptvx",
   "pid": "t1_dg5nvor",
   "date": "2017-04-13 08:35:54",
   "depth": 2,
   "text": "Will check it out, thanks!"
  },
  {
   "score": 1,
   "id": "dg5m3yo",
   "pid": "t3_64qza0",
   "date": "2017-04-12 00:42:27",
   "depth": 0,
   "text": "I hope this continues to be great."
  },
  {
   "score": 1,
   "id": "dg5mpnz",
   "pid": "t3_64qza0",
   "date": "2017-04-12 01:12:08",
   "depth": 0,
   "text": "Can anyone tell me what song was playing during 21:44?(The fools card explanation)"
  },
  {
   "score": 1,
   "id": "dg5nj5b",
   "pid": "t3_64qza0",
   "date": "2017-04-12 01:54:45",
   "depth": 0,
   "text": "This has got to be the best magical school anime I've seen so far. "
  },
  {
   "score": 1,
   "id": "dg7aklq",
   "pid": "t3_64qza0",
   "date": "2017-04-13 00:47:16",
   "depth": 0,
   "text": "Okay. I didn't expect Glenn to go badass in second episode. So he seems to be really powerful... And also seems to have been trained on the Imperial Military and it seems that he also knows powerful magic. I like it.\n\nI loved the way he just rekt the students with the chant explanation. And so it seems Glenn saved Rumia in the part and he remembers her. Looks really interesting.\n\n"
  },
  {
   "score": 1,
   "id": "dg8z00o",
   "pid": "t3_64qza0",
   "date": "2017-04-14 02:53:25",
   "depth": 0,
   "text": "I like this show.\n\nIts so rare to find a MC who's cool because he's **smart** not because he has some mega bullshit ultimate skill/gift, a shouty voice and flashy special effects. "
  },
  {
   "score": 1,
   "id": "dga309o",
   "pid": "t3_64qza0",
   "date": "2017-04-14 18:28:45",
   "depth": 0,
   "text": "I kinda just want to imagine with the whole female uniform deal, especially the ZR+midriff thing, how does it work when you imagine a more.....plus size woman wearing them? "
  },
  {
   "score": 1,
   "id": "dga9s0m",
   "pid": "t3_64qza0",
   "date": "2017-04-14 21:17:57",
   "depth": 0,
   "text": "This show is so bad but Glenn is so funny. Honestly, I could see this being a higher quality show, the concept of his no magic tactic is a cool spin on the \"untalented MC\" trope. Unfortunately,the show has terrible direction which makes its storytelling laughable."
  },
  {
   "score": 1,
   "id": "dgac8hs",
   "pid": "t3_64qza0",
   "date": "2017-04-14 22:32:46",
   "depth": 0,
   "text": "I feel like [this dude](https://gyazo.com/e81564b2221cc52053422580fae0a9ab) should be the protagonist of a different type of anime for *some* reason..."
  },
  {
   "score": 1,
   "id": "dgbtv6s",
   "pid": "t3_64qza0",
   "date": "2017-04-16 00:47:28",
   "depth": 0,
   "text": "I just discovered this series today. I NEED EPISODE 3 NOW!"
  },
  {
   "score": 1,
   "id": "dgd4620",
   "pid": "t3_64qza0",
   "date": "2017-04-16 21:36:06",
   "depth": 0,
   "text": "Rumia is pretty :)"
  },
  {
   "score": 1,
   "id": "dggliue",
   "pid": "t3_64qza0",
   "date": "2017-04-19 02:07:10",
   "depth": 0,
   "text": "[Shiro neko?](https://hrvojemostarac.files.wordpress.com/2013/08/monogatari-second-season-01-large-101.jpg)"
  },
  {
   "score": 1,
   "id": "dmfx6t5",
   "pid": "t3_64qza0",
   "date": "2017-09-01 14:03:06",
   "depth": 0,
   "text": "Practically checking the boxes of every trashy magical high school trope at this point. But to put the cheap obligatory near rape scene in the 2nd episode? Bravo, bravo."
  },
  {
   "score": 1,
   "id": "dg4nbvi",
   "pid": "t3_64qza0",
   "date": "2017-04-11 11:04:11",
   "depth": 0,
   "text": "\"Uh, hello? Oh Tatsuya Onii-Sama! It's been long time. Yes. I'm very well, thanks. See, there's this guy who's coping your technique. Yes, the magic sealing technique. It's kind of uncanny, though everything else he does is an insult to your name.\""
  },
  {
   "score": -4,
   "id": "dg4lys4",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:39:18",
   "depth": 0,
   "text": "That attempted rape scene was one of the most disgusting I've seen in anime. Not only is it used for fanservice, but then when the supposed hero arrives he makes a joke out of the situation, saying \"he's sorry to interrupt\" her being raped. Meanwhile she's crying and begging for the mage to stop.\n\nFuck this show. That's unacceptable. There's nothing funny or sexy about any of it. Dropped. "
  },
  {
   "score": 5,
   "id": "dg5clyo",
   "pid": "t1_dg4lys4",
   "date": "2017-04-11 19:38:25",
   "depth": 1,
   "text": "So, you see attempted rape, you think fanservice?\n\nDoesn't that make *you* the sick one?\n\n>Dropped. \n\nThank fuck"
  },
  {
   "score": 2,
   "id": "dg5crzt",
   "pid": "t1_dg5clyo",
   "date": "2017-04-11 19:42:20",
   "depth": 2,
   "text": "Glenn Radars is the one who looks at the scene and decides, hey my student is being raped, I'll make a snide quip about it and pretend to leave.\n\nYet you have an issue with me having eyes and noticing camera movements. Okay then."
  },
  {
   "score": 2,
   "id": "dg5esgh",
   "pid": "t1_dg5crzt",
   "date": "2017-04-11 20:30:47",
   "depth": 3,
   "text": "He stopped the rape, didn't he?  Too bad he didn't do it in a way you prescribe to be morally superior, though, because then you won't get the chance to self-insert and be the hero in your imagination.\n\nWow, there are camera movements?  In a moving visual medium?  What horrors will they foist upon us next?  If only they'd stuck to radio shows, we wouldn't be in this mess"
  },
  {
   "score": 2,
   "id": "dg5fhce",
   "pid": "t1_dg5esgh",
   "date": "2017-04-11 20:48:51",
   "depth": 4,
   "text": "Is it seriously some kind of moral crusade to dislike a scene where a teacher jokes about the rape of his student before she yells at him to stop being an asshole and help her? \n\nAt no point did I ever want to self-insert into this character...I don't know where that's coming from.\n\nWhat I was getting at with the camera movements and framing is that Sisti's body is shot and framed in a very specific way, as are the actions of the guy assaulting her. There are other rape scenes in anime that have the decency to at least not linger on the girl's body for no apparent reason. \n\nWhat was the goal of this scene? Seriously. Why does this scene even exist?"
  },
  {
   "score": 3,
   "id": "dg5vr8q",
   "pid": "t1_dg5clyo",
   "date": "2017-04-12 06:51:06",
   "depth": 2,
   "text": "To be fair the anime did choose to show off her lacey bra which made it seem like fanservice. They could've gotten the point across without showing her underwear."
  },
  {
   "score": 10,
   "id": "dg4ox5g",
   "pid": "t1_dg4lys4",
   "date": "2017-04-11 11:33:25",
   "depth": 1,
   "text": "\"Dropping a show because of a rape scene\"\n\n[I only need to use this] (http://i0.kym-cdn.com/photos/images/original/001/239/576/def.jpg)\n\nStay salty."
  },
  {
   "score": 4,
   "id": "dg4pzri",
   "pid": "t1_dg4ox5g",
   "date": "2017-04-11 11:52:37",
   "depth": 2,
   "text": "There's a difference between dropping a show for a well-handled rape scene that adds to the story or plot in some way, and dropping a show for a rape scene which leers at the girl's body for fanservice, and is made into a joke, in extremely poor taste.\n\n\"Sorry to interrupt\" is one of the stupidest lines of dialogue I have ever seen in an anime. \n\nBut congratulations I guess on being such a big fan of rape scenes. Good for you?"
  },
  {
   "score": 0,
   "id": "dg4qmxn",
   "pid": "t1_dg4pzri",
   "date": "2017-04-11 12:03:56",
   "depth": 3,
   "text": "Wouldn't it be better to drop a show if all the characters are just bland and not develop at all than just a poorly-written rape scene?\n\nBad taste rape scenes exist everywhere. You would be dropping a lot of shows just because of \"Poor taste\". \n\n[It's a trope BTW] (http://tvtropes.org/pmwiki/pmwiki.php/Main/BlackComedyRape)"
  },
  {
   "score": 6,
   "id": "dg4r7te",
   "pid": "t1_dg4qmxn",
   "date": "2017-04-11 12:13:59",
   "depth": 4,
   "text": "Yeah, with rare exceptions I pretty much have no tolerance for this kind of scene in anime anymore.\n\nAn established dark comedy like *Konosuba* might be able to pull it off, but not a straight comedy/fanservice show like this one.\n\nAnd sure, I was already disliking most of the characters, though Glenn was starting to grow on me just a bit, until the \"sorry for interrupting\" line, which buried his character for me, and made him completely irredeemable."
  },
  {
   "score": 1,
   "id": "dg9ogom",
   "pid": "t1_dg4r7te",
   "date": "2017-04-14 13:12:14",
   "depth": 5,
   "text": "[Mildly spoilery](/s \"If you think this anime is going to be purely comedy/fanservice\")[](/s \"you would have had a bad time.\")\n\n[hint:](/s \"see Glenn's past\")\n\nBut yeah, this would establish that the members of the Wisdoms of the Heavens Council are bastards that aren't afraid to stray away from any morals to achieve their goals. Hence I guess why such bastards as this one also gathers there."
  },
  {
   "score": 11,
   "id": "dg4qm3m",
   "pid": "t1_dg4pzri",
   "date": "2017-04-11 12:03:30",
   "depth": 3,
   "text": "How does one handle a rape scene well exactly?\n\nI'm pretty sure it's unnecessary to show the audience one of the most barbaric human acts to show someone is a bad person no matter the situation\n\n"
  },
  {
   "score": 5,
   "id": "dg4qywt",
   "pid": "t1_dg4qm3m",
   "date": "2017-04-11 12:09:40",
   "depth": 4,
   "text": "In general, I agree. There's almost never a good reason to use this type of scene in film. I think scenes like these can be justified in a serious work, but it is clearly an overly used trope in anime.\n\nHowever, it's especially egregious when it's shot in a way where it's clearly meant to titillate the viewer, and then joked about."
  },
  {
   "score": 4,
   "id": "dg4r6d9",
   "pid": "t1_dg4qywt",
   "date": "2017-04-11 12:13:16",
   "depth": 5,
   "text": "I don't think it was meant to titillate\n\nI was more getting \"He is gonna show up right?\" feeling, It just took a bit longer than needed"
  },
  {
   "score": 7,
   "id": "dg4rd0v",
   "pid": "t1_dg4r6d9",
   "date": "2017-04-11 12:16:32",
   "depth": 6,
   "text": "The way the camera panned up her body after he ripped her blouse open, and followed his finger as it lifted her undershirt over her bra, were framing decisions that to me, were clearly meant to excite the viewer. There's literally no reason to show anything but her face in this scene otherwise."
  },
  {
   "score": -1,
   "id": "dg4rmvt",
   "pid": "t1_dg4rd0v",
   "date": "2017-04-11 12:21:31",
   "depth": 7,
   "text": "You got problems if that titillates you (Yes I do understand it's a fetish  but I don't accept it as healthy)"
  },
  {
   "score": 3,
   "id": "dg4rqel",
   "pid": "t1_dg4rmvt",
   "date": "2017-04-11 12:23:16",
   "depth": 8,
   "text": "It doesn't titillate me. I'm saying I feel it's meant to do so, though."
  },
  {
   "score": 0,
   "id": "dg4mp93",
   "pid": "t3_64qza0",
   "date": "2017-04-11 10:52:39",
   "depth": 0,
   "text": "top 10 anime rape scenes.\n\nEp was rather meh, will watch an episode or two more before deciding wether or not to drop it."
  },
  {
   "score": 0,
   "id": "dg56exx",
   "pid": "t3_64qza0",
   "date": "2017-04-11 17:21:43",
   "depth": 0,
   "text": "can someone spoil everything for me? Like who Glenn really is, what he did in the past, what his skills are and who all these princess and royal people are"
  },
  {
   "score": 1,
   "id": "dg9p2d6",
   "pid": "t1_dg56exx",
   "date": "2017-04-14 13:24:19",
   "depth": 1,
   "text": "Spoilers:\n\n[Glenn](/s \"was raised by Serica, who found him collapsed on the streets after an incident that killed his parents. She taught him magic and then later he was recruited and became an imperial mage assassin after graduating, codenamed [The Fool]. Long story short, 1 year ago he quit and since lived as a hikki-NEET in Serica's care.\")\n\n[Skills](/s \"His original magic, superior magic theory knowledge, and close combat skills, making him a fairly dangerous assassin despite his lack of aptitude for magic.\")\n\n[Princess](/s \"Lumia is an emotion amplifier, aka a living magical circuit. She should have died in sickbed according to public knowledge, which was the cover the queen used in order to preserve her life instead of having to kill her in order to preserve the dignity of the empire.\")\n\n[Royal people?](/s \"those guys that invaded were the banned magic society Wisdom of the Heaven's society, who are ready to do anything to get hold of their goal, the Akashic Records.\")\n\nAll of this is going to be featured next few episodes in the anime, but is of course better explained in the first volume of the light novel, found [here](https://crimsonmagic.me/akashic-records/)"
  },
  {
   "score": 1,
   "id": "dg75vlr",
   "pid": "t1_dg56exx",
   "date": "2017-04-12 21:48:34",
   "depth": 1,
   "text": "[ok] (/s \" He's ex imperial elite, he killed lots of mages, he did it by sealing their magic, the only Royal that matters is Rumia, her mom the Queen threw her away, she's got EMOTION AMPLIFIER or something that gives ungodly mana, making her a target for everyone to get their hands all over her, Queen threw her out because of a cursed amulet she has that she would kill Rumia if she told anyone and a bunch of other conditions that I can't bother to remember, either way she tossed Rumia to protect her. \")"
  },
  {
   "score": 0,
   "id": "dg4uthu",
   "pid": "t3_64qza0",
   "date": "2017-04-11 13:19:25",
   "depth": 0,
   "text": "Okay, I'm in. I was skeptical, but it's funny, subverting expectations a bit with the magic duel in ep 1, and generally a cool show. We'll see if it can keep it up. The rape ecchi bit felt like I was watching a hentai though. "
  },
  {
   "score": 0,
   "id": "dg53uzt",
   "pid": "t3_64qza0",
   "date": "2017-04-11 16:24:39",
   "depth": 0,
   "text": "I fucking lost it at the reference to Zombie Desu Ka after he Glenn kicked the guy in the face. Along with him calling it a punch when he was really just kicking. This episode in general was just really good and I am really looking forward to next week's episode now."
  },
  {
   "score": 0,
   "id": "dg5gyo5",
   "pid": "t3_64qza0",
   "date": "2017-04-11 21:30:10",
   "depth": 0,
   "text": "I think both the students in that magical school and us viewers are being fooled by MC annoying attitude at 1st eps, and we both are angry like sisti was, hell I even almost dropped it if not because the girls design that's sexy as hell, \n\nand lucky I am that I stick for ep 2 and having blast, I really feel like sisti , from being annoyed to being dominated, ep 2 is really a turning point, and sold me to watch the entire eps !!!! fuck yeah"
  },
  {
   "score": 0,
   "id": "dg5iggc",
   "pid": "t1_dg5gyo5",
   "date": "2017-04-11 22:16:17",
   "depth": 1,
   "text": "mindbreak the best."
  },
  {
   "score": -13,
   "id": "dg4ag1b",
   "pid": "t3_64qza0",
   "date": "2017-04-11 07:03:14",
   "depth": 0,
   "text": "GEE GUYS, I WONDER WHO'S THE MYSTERIOUS MAGE WHO SAVED RUMIA?"
  },
  {
   "score": 1,
   "id": "dg4ocw0",
   "pid": "t1_dg4ag1b",
   "date": "2017-04-11 11:23:12",
   "depth": 1,
   "text": "Idk why this was downvoted since they LITERALLY KEPT THE FUCKING GLOVES ON HIM IN THE FLASHBACK."
  },
  {
   "score": 25,
   "id": "dg4ap8a",
   "pid": "t1_dg4ag1b",
   "date": "2017-04-11 07:08:46",
   "depth": 1,
   "text": "[SPOILER](#s \"Rumia already knew Glenn was the person who saved her\")"
  },
  {
   "score": 9,
   "id": "dg4b2h1",
   "pid": "t1_dg4ap8a",
   "date": "2017-04-11 07:16:31",
   "depth": 2,
   "text": "[Yeah](/s \"I figured that out when she said Glenn would save them.\")"
  },
  {
   "score": 6,
   "id": "dg4chmq",
   "pid": "t1_dg4ap8a",
   "date": "2017-04-11 07:44:57",
   "depth": 2,
   "text": "To me it definitely seemed that way but I hope there's more development on this, I'm really enjoying be backstory way more that I should."
  },
  {
   "score": 18,
   "id": "dg4awb1",
   "pid": "t1_dg4ap8a",
   "date": "2017-04-11 07:12:57",
   "depth": 2,
   "text": "Well, that's embarrassing. "
  },
  {
   "score": -17,
   "id": "dg4fgu4",
   "pid": "t3_64qza0",
   "date": "2017-04-11 08:40:54",
   "depth": 0,
   "text": "I didn't think I could be more dissapointed than last week's episode, but this proved me wrong. I can be even more dissapointed with such a load of bullshit.\n\nWhat's the point of teaching your students the way to manipulate magic when 2 thugs can subjugate a whole class of more than 30 students that seem pretty advanced in magic. Don't give me the \"they can use military grade magic\" BS, it's all about the numbers not the magic grade.\n\nI recall someone saying in the last episode that we would watch this series because of how awesome the MC was, but so far he has proven to be quite contradictory. I'm guessing his backstory will go among the lines of a traumatizing experience hence why he became a shut in. He did it for a year. But if he was truly a shut in, then he wouldn't have been practicing his magic abilities nor training his body when he's obviously in top shape both physical and magic wise. If he trained his body & mind for a year then why be a shut in?\n\nOn the rooftop when he's speaking to Celica. What's the point of hitting her with a line like \"besides after getting used to seeing a woman like you, how could I interest in average women?\" then immediately playing the virgin card and telling her to stop shoving her breasts on his back. That really makes no sense.\n\nSisty is changing so quickly, we saw the Yuri scene at the locker room last week, but she's already all blushy on almost every scene she's with Glenn and she denies she's thinking about him when she's getting her hair brushed by Rumia whom she has openly showed affection. And yeah I know it's the BS harem rule that the girls will fall for the MC for stupid reasons, but it's just so soon and so forced and it's not even fun rushed like in Renai Boukun.\n\nThis series is going down the gutter as quickly as one sentence spells.\n\n\n"
  },
  {
   "score": 2,
   "id": "dg5afzo",
   "pid": "t1_dg4fgu4",
   "date": "2017-04-11 18:49:24",
   "depth": 1,
   "text": "> What's the point of teaching your students the way to manipulate magic when 2 thugs can subjugate a whole class of more than 30 students that seem pretty advanced in magic. Don't give me the \"they can use military grade magic\" BS, it's all about the numbers not the magic grade.\n\nIf they fight, yes, the students will win. But many will die in the process, most likely including the student that tries to attack first. Whereas if they just obey the thugs, only the one person they came for is taken away, the rest of the students get to keep their lives, no harm done. Or better yet, some other student attacks first and gets killed while you escape/kill the distracted thugs. Is it really so hard to believe that students don't want to die? \n\nBeing confused by this is like being confused by why dictatorships exist. A country full of citizens could easily beat up their tyrant king if you only consider their combat powers. But that doesn't happen because they know the first to stand up is the first to get a bullet in his head, so in the end no one stands up. Simple.\n\n> I recall someone saying in the last episode that we would watch this series because of how awesome the MC was, but so far he has proven to be quite contradictory. I'm guessing his backstory will go among the lines of a traumatizing experience hence why he became a shut in. He did it for a year. But if he was truly a shut in, then he wouldn't have been practicing his magic abilities nor training his body when he's obviously in top shape both physical and magic wise. If he trained his body & mind for a year then why be a shut in?\n\n> On the rooftop when he's speaking to Celica. What's the point of hitting her with a line like \"besides after getting used to seeing a woman like you, how could I interest in average women?\" then immediately playing the virgin card and telling her to stop shoving her breasts on his back. That really makes no sense.\n\nIt only looks contradictory because you are jumping to conclusions and assuming stuff. [Spoiler](/s \"Pretty much everything you guessed is totally wrong.\") Let the story explain before deciding whether the explanation makes sense."
  },
  {
   "score": 1,
   "id": "dg5cz4w",
   "pid": "t1_dg5afzo",
   "date": "2017-04-11 19:46:56",
   "depth": 2,
   "text": "> Whereas if they just obey the thugs, only the one person they came for is taken away, the rest of the students get to keep their lives, **no harm done**.\n\nHow can you be 100% sure? They are terrorists. There's no garantee from the students point of view that they will leave them unharmed if they surrender the girl they are after. They already bragged about killing Glenn and they threatened the students to kill one a time until they find Rumia. \n\nThe guy that took Sisty away for some private time is already proof enough that their word ain't worth shit, your asumption is already flawed as this show is.\n\n>But that doesn't happen because they know the first to stand up is the first to get a bullet in his head, so in the end no one stands up.\n\nSo you're saying coup d'état don't exist? aww must be so nice being so naive. Do a quick research on countries like Venezuela and how many coup d'état they've had so far in the last decades."
  },
  {
   "score": 1,
   "id": "dg5hto6",
   "pid": "t1_dg5cz4w",
   "date": "2017-04-11 21:56:12",
   "depth": 3,
   "text": "I'm well aware of coup d'etats. But treating coup d'etats as the norm is the real naivety. We live in the real world, not superhero land. Bad people exist. Cowards exist. My point was that the cases where everyone trembles in fear doing nothing far outnumber the cases where a coup d'etat happens. Yes, if some people are feeling particularly heroic, they can light the spark and start the revolution. But those people are the outliers. If they were common, dictatorships wouldn't be a problem. \n\nThe guy taking Sisty away is even more reason for the rest of the students to shut up and obey. Because the thug didn't just pick whichever girl he felt was pretty, he picked the one person that kept talking back. So in the student's minds, the logic is \"Sisty resisted, so they punished her. If I don't resist, maybe I wouldn't be punished.\" There's no guarantee that they won't be next, but starting an attack almost certainly guarantees danger. And in the end, they were right: one thug took Sisty, the other thug took Rumia, there are no other thugs and Sisty certainly doesn't look like she just saw her classmates get massacred, so they who did nothing suffered nothing. And of course they were right, because bad guys understand this logic too. Targeting those that resist first is practically Thug 101. If the thugs had started shooting at random students that weren't resisting, THEN the whole class would fight, since there would no longer be any reason to obey.\n\n(I'm not saying that their inaction is right, I'm saying that this is a fairly common occurrence, so it shouldn't be puzzling.)"
  },
  {
   "score": 2,
   "id": "dg52uif",
   "pid": "t1_dg4fgu4",
   "date": "2017-04-11 16:01:39",
   "depth": 1,
   "text": "I dunno dude, I think alot of your complaints are easy to answer. \n\n>What's the point of teaching your students the way to manipulate magic when 2 thugs can subjugate a whole class of more than 30 students that seem pretty advanced in magic.\n\nI think the class is the freshmen class and they are still studying magic, they aren't masters yet. Aren't they all supposed to be from pampered elite backgrounds? I doubt any of them have been in a situation where they attacked someone with the intent to kill. They're all human after all and not logical robots. Of course if all 30 attacked at one time they MIGHT win but from that guys chanting speed and supposed level of magic some people would die. And whoever attacked first would surely die. Who would willingly throw away their life in that situation?\n\n>But if he was truly a shut in, then he wouldn't have been practicing his magic abilities nor training his body when he's obviously in top shape both physical and magic wise. If he trained his body & mind for a year then why be a shut in?\n\nCouldn't the MC have been practicing magic his whole life? Who says that he learned everything from the sole year he was a \"shut-in\"? By the way he phrased his sentence and how these stories usually go I'm going to guess that his \"shut-in\" life was the year he spent under some strict training regimen of that blonde woman. We don't know enough about his past yet to make assertions though. \n\n>On the rooftop when he's speaking to Celica. What's the point of hitting her with a line like \"besides after getting used to seeing a woman like you, how could I interest in average women?\" then immediately playing the virgin card and telling her to stop shoving her breasts on his back. That really makes no sense.\n\nThat's like standard \"all talk no bite\" of someone who can talk a big game but get flustered when hit with the real deal. Nothing out of the ordinary. "
  },
  {
   "score": 4,
   "id": "dg4mdsj",
   "pid": "t1_dg4fgu4",
   "date": "2017-04-11 10:46:53",
   "depth": 1,
   "text": "Besides being scared the guy cast with only one word that put a hole in stone so it will probably go thou more then one person also look at how fast female lead cast last ep how many \"bangs\" do you think he could do. \n\n\n[not really a spoiler but sourcing the manga](/s \"in the manga he mentions being dull after tossing him into the wall\")\n\n"
  },
  {
   "score": 6,
   "id": "dg4jysc",
   "pid": "t1_dg4fgu4",
   "date": "2017-04-11 10:02:48",
   "depth": 1,
   "text": "> What's the point of teaching your students the way to manipulate magic when 2 thugs can subjugate a whole class of more than 30 students that seem pretty advanced in magic. Don't give me the \"they can use military grade magic\" BS, it's all about the numbers not the magic grade.\n\nSo, you would try to attack the terrorists, even if they can kill some of your friends ? Also you can't now if there are more than 2 intruders, please don't speak, as you would be the super badass guy saving the whole room.\n\n> I recall someone saying in the last episode that we would watch this series because of how awesome the MC was, but so far he has proven to be quite contradictory. \n\nWhy isn't he awesome ? The rest are only speculations so I don't feel like answering that.\n\n> then immediately playing the virgin card\n\nWhy ? He only doesn't want her to rub her breasts, not everyone needs that so much.\n\n> Yuri scene \n\nLOL\n\n> BS harem rule\n\nLOL, there are reasons, aren't they ? I can't really see any harem right now. \n\nYour comment points are disappearing faster than ... ah ... why should I .."
  },
  {
   "score": -6,
   "id": "dg4m2pj",
   "pid": "t1_dg4jysc",
   "date": "2017-04-11 10:41:13",
   "depth": 2,
   "text": ">So, you would try to attack the terrorists, even if they can kill some of your friends ? Also you can't now if there are more than 2 intruders, please don't speak, as you would be the super badass guy saving the whole room.\n\nNot just me, there are more than 30 students in that hall. In my country we get news once or twice a week of some thief being lynched almost to death by angry mobs, and were talking about thieves armed with either guns or knives. It doesn't make sense all these students armed with knowledge and power to just sit there and take it by two simple goons. They all bragged about being knowledgeable on lightning strike skill. That's more than enough to take down 2 guys. \n\n>Hurr durr, why won't you jump into the hype train Glenn is so fuckzor awesome hurr durr\n\nSorry, for not being the common base gullible watcher this show asks for.\n\n>Why ? He only doesn't want her to rub her breasts, not everyone needs that so much.\n\nWhy entice her with the previous line? why not just keep shut and say nothing about it and let the story continue. That's just bad character writting.\n\n>hurr durr I got no way to defend an obvious Harem title so I'll pull the defense out of my ass that it hasn't\nproven yet to be a Harem title, even though it's pretty obvious going that way\n\nNice way to back up your argument."
  },
  {
   "score": 3,
   "id": "dg4om2u",
   "pid": "t1_dg4m2pj",
   "date": "2017-04-11 11:27:53",
   "depth": 3,
   "text": "Then, let me try another explanation:\n\nHow could you know how strong your opponent is ? Can you even know if you can stop him ? They use some military grade magic, which seems to be very strong, also they use a very short incarnation. Even if someone tries to stop them, you can know if you can really stop them and you don't know if you are even faster. Second point is, how can you communicate with your classmates, that you will start a counter attack ? If only one would start it, he would loose after the information we got in the episode. Knowledgeable about one spell isn't enought to know if you can really stop some intruders, who shouldn't even be there because there were also guards around the building.\n\n> Sorry, for not being the common base gullible watcher this show asks for.\n\nThen you are wrong here\n\n> Why entice her with the previous line?\n\nWhy not ? He is arrogant and plays every card he has. Why not saying some line which doesn't imply anything, and at the same time everything.\n\n> LOL, there are reasons, aren't they ? I can't really see any harem right now.\n\nI said for now. But ok. your problem was why she would fall for him, right ? First of all, it wasn't shown that she fell for him, it was shown, that she thinks that he is some oddball. That word has some positive and some negative meaning in this context. He goes against the typical way of thinking for example, something that is not her way to do things, but after he showed that he can more than the typical teacher would show, she shows interest in him. That she blushes every time is not a sign that she felt for him, it is more a sign, that she sees him as a man, who irritates her a lot. I wouldn't argue against, that she will fall for him, but I can't see that this was shown up to now.\n\n(I used the word \"show\" to often, sorry for that)"
  },
  {
   "score": -2,
   "id": "dg4qxfv",
   "pid": "t1_dg4om2u",
   "date": "2017-04-11 12:08:59",
   "depth": 4,
   "text": ">Your comment points are disappearing faster than ... ah ... why should I ..\n\nDidn't you just bolt and said I wasn't worth it? I love it when hypocrites turn around to bark at me some more.\n\n>How could you know how strong your opponent is ? Can you even know if you can stop him ?\n\nThey already have a walking encyclopedia on Sisty alone, but of course writters are as dumb as.. to actually stick to her character and make her explain how \"bang\" is a worthless flashy spell. It's stupid how Sisty can tell the spell is military grade but she doesn't know what the spell does in fact. Bang casting is a one word spell, but I'm sure than more than one of the students aside Sisty can cast Shock bolt with 2 words, and like I said it's more than 30 students in that hall that can jump in at the same time.\n\nThe whole point of Glenn teaching them how to manipulate magic thru the use of words is just pointless. He taught them how to use paralize a short range one word spell that could be easily used by all the people in the front line. It's like 2 goons armed with a couple of bats jumping into a karate dojo, even if the students are just low lvl belts they would jump on top of the goons without hesitation because they have trained to make use of their techinques.\n\n>Second point is, how can you communicate with your classmates, that you will start a counter attack ?\n\nThis isn't swordart online where you ask someone else to switch. Mob responses do not rely on communication, rely on instinct as a mass.\n\n>Then you are wrong here\n\nI think I'm right, I see you're pretty triggered so I guess I'm in the right place.\n\n>Why not ? He is arrogant and plays every card he has. Why not saying some line which doesn't imply anything, and at the same time everything.\n\nHe's arrogant but he doesn't entice her with a smug smile on his face. He didn't even [expect](http://imgur.com/p1O06fn) her to jump in his back in that cut. That pretty much proves how badly written he is, playing a line and not expecting the correct response.\n\n>I said for now.\n\nSee, pure hypocrisy. You know where the show is heading AND EVERYONE in the thread knows it, but you just like to play dumb.\n\n>First of all, it wasn't shown that she fell for him\n\nIt's not shown, it's implied. She's a full on Tsundere that will deny her feelings. She got shot with a quick \"I Love you\" and got a full on blush, despite her hating his gutts for being an irresponsible teacher throught episode 1 and the beggining of this episode. If this action would had happened in any other genre, the girl hating the teacher would have blown him off right in the act.\n\n>I wouldn't argue against, that she will fall for him\n\nThen why are you barking at me with all the stupid admiration BS? the whole point is that she will go down to harem town because the MC **already** rised a couple of flags on her.\n\nThis is all just bullshit from you, the same way you tried to hide the **FACT** that this is a harem title."
  },
  {
   "score": 3,
   "id": "dg4rl0o",
   "pid": "t1_dg4qxfv",
   "date": "2017-04-11 12:20:35",
   "depth": 5,
   "text": "> I see you're pretty triggered\n\nI only want to say that I am not triggered, I had to wait for my DL to finish both times, so I could write you some love letters. Please, don't understand me as a tsundere, I don't want to write anymore. I hope for you, that you can find your 1 anime in this season which is a 1 mil from 100 points. If not, write it yourself."
  },
  {
   "score": 9,
   "id": "dg4jkuj",
   "pid": "t1_dg4fgu4",
   "date": "2017-04-11 09:55:49",
   "depth": 1,
   "text": "> Don't give me the \"they can use military grade magic\" BS, it's all about the numbers not the magic grade.\n\nBecause most people are much more concerned over their own personal safety than in protecting others. It's what lets all sorts of terrible situations occur in both real life and stories - people think \"Well as long as *I'm* safe, it'd be silly to try to oppose them. I could get killed!\" Unfortunate, but what can you do?\n\n> But if he was truly a shut in, then he wouldn't have been practicing his magic abilities nor training his body when he's obviously in top shape both physical and magic wise. If he trained his body & mind for a year then why be a shut in?\n\nI don't think shut-ins work like that. While I'll grant that it can result in someone becoming extremely out of shape and whatnot, you also end up with a lot of free time in which to be bored and as it happens, working out takes up time while reducing boredom. You don't have to leave the house for it either. \n\n> And yeah I know it's the BS harem rule that the girls will fall for the MC for stupid reasons, but it's just so soon and so forced and it's not even fun rushed like in Renai Boukun.\n\nI admit, this is annoying, but... well... it's unfortunately pretty realistic. He's reasonably attractive, cocky, and invades her personal space like probably no other guy ever has. The super hormonal things known as high school girls are practically designed to fall for that. No worries though - I'm sure she'll be intensely embarrassed by this crush in another decade.\n\n... Damn it, now that I think about, a decent percentage of things that bother people in anime are the things that are realistic. Oh well."
  },
  {
   "score": -1,
   "id": "dg4mqir",
   "pid": "t1_dg4jkuj",
   "date": "2017-04-11 10:53:19",
   "depth": 2,
   "text": ">Because most people are much more concerned over their own personal safety than in protecting others. It's what lets all sorts of terrible situations occur in both real life and stories - people think \"Well as long as I'm safe, it'd be silly to try to oppose them. I could get killed!\" Unfortunate, but what can you do?\n\nI already said how mobs and real groups of people react to low lvl goons. I don't think I need to repeat that.\n\n>I don't think shut-ins work like that. While I'll grant that it can result in someone becoming extremely out of shape and whatnot, you also end up with a lot of free time in which to be bored and as it happens, working out takes up time while reducing boredom. You don't have to leave the house for it either. \n\nBut that's how shut ins work.\n\nHaven't you seen [Yuusha ni Narenakatta Ore wa Shibushibu Shuushoku wo Ketsui Shimashita](https://myanimelist.net/anime/18677/Yuusha_ni_Narenakatta_Ore_wa_Shibushibu_Shuushoku_wo_Ketsui_Shimashita?q=yuusha). The main hero can't get a job as a hero so he becomes a shut in for 6 months due to depression. He does nothing inside his living until he finally gets a job as retail salesman. He even states in the first episodes he's washed up due to the lack of training when things get dicy."
  },
  {
   "score": 8,
   "id": "dg4o6vw",
   "pid": "t1_dg4mqir",
   "date": "2017-04-11 11:20:05",
   "depth": 3,
   "text": "You can't treat shut ins as though every single one is exactly the same. True, probably a large percentage of them either are shut ins because of depression or are depressed because they're shut ins, and in either case, that depression would make it difficult (but not impossible) to find the motivation to do anything. \n\nHowever, a person might become a shut in because they have crippling social anxiety or something instead. Now, I know you might have bought into this farce that people need regular face-to-face interaction with other humans in order to be happy, but that's completely untrue (although possibly a requirement for being mentally stable, but Glenn certainly isn't making any claims in that department).\n\nNow, in this instance of course, Glenn pretty obviously *is* (or at least was until quite recently) depressed, but while depression makes it difficult to muster up motivation, as I noted before, it doesn't make it impossible. Especially if exercising and such was a habit long before he became depressed - it's much easier to maintain a good habit than to start a new one.\n\nAdditionally, as far as I can tell, their world doesn't have internet. Or TV. Or video games. So while you or I might spend our days doing something like that to stave off boredom, Glenn's main options are to read, write, draw, clean, exercise.... Mostly productive things. Sleeping all the time gets really boring after all. So it'd actually be more unrealistic to expect him not to keep up the work. \n\nAlthough, he does seem surprised when he performs a spell and it's weaker than he expected, so he might have been slacking a little bit."
  },
  {
   "score": 2,
   "id": "dg4ozfd",
   "pid": "t1_dg4o6vw",
   "date": "2017-04-11 11:34:36",
   "depth": 4,
   "text": "But this episode hinted us he's got military training. Most likely he's shuting himself in from a military trauma. It would be stupid for him to train in the field he's trying to get a breath of fresh air.\n\nLook at soldiers suffering from PTSD, they don't jump into their personal gyms when they reach home, they seek help from their beloved ones.\n\nYou say that we can't treat shut ins the same way, And I say we can. For instace Raul from Yuusha ni Narenakatta Ore wa Shibushibu Shuushoku wo Ketsui Shimashita didn't have any kind of luxuries in his appartment even after he got a job. Do you think he spendt his money on a TV or videogames? NO he didn't, he passed his time walloing in pity for himself.\n\n"
  },
  {
   "score": 5,
   "id": "dg4s1xm",
   "pid": "t1_dg4ozfd",
   "date": "2017-04-11 12:29:05",
   "depth": 5,
   "text": "> Look at soldiers suffering from PTSD, they don't jump into their personal gyms when they reach home, they seek help from their beloved ones.\n\nActually, given that my husband's best friend is a soldier who suffered from PTSD and now works helping other soldiers with PTSD recover through physical exercise, I think it's pretty safe to say that at least some do. I mean, it's not like exercise itself caused any problems, so there's no real reason to avoid it. But I really don't know enough about PTSD to make any definite conclusions as to whether suffering from it would continue keeping up their skills or not outside of just exercise. Any further speculation on that is iffy anyway, since we don't know for certain that he even has PTSD in the first place.\n\n> You say that we can't treat shut ins the same way, And I say we can.\n\nYou didn't give any reason at all for this - you just brought up what one person in one story did. You can't treat any case of anything as being the same as any other case of that same thing. Cases might present similarly, or they might not, but they aren't the same. As much as this is an overused phrase, everyone is different. It's all well and good for Raul to do whatever wallowing he wants, but that doesn't mean every other shut in ever has to do the same thing. \n\n> You're already shoting yourself on the foot pointing out Glenn expected a bigger outburst on his first encounter with Sisty.\n\nHuh? His first encounter? ... What are you even talking about? In any event, I was talking about today's episode where he did one of his \"alternate\" versions and was like \"oh, not as strong as I expected\" or something. It was only a possibility to begin with, and I don't see how acknowledging that he might not still be training as hard as he did when he was some super princess-saving guy means he can't still be training at all. "
  },
  {
   "score": 1,
   "id": "dg5dilu",
   "pid": "t1_dg4s1xm",
   "date": "2017-04-11 19:59:30",
   "depth": 6,
   "text": ">You didn't give any reason at all for this - you just brought up what one person in one story did. You can't treat any case of anything as being the same as any other case of that same thing.\n\nThe apple doesn't fall far from the tree. Do I really need to give a reason? it would be incredibly stupid and naive to think the writers would go all the way to change the archtype of the shut in just to prove they can do better. Look at all the shut in examples, the kid from Ano hana, and Rozen maiden, they are shut ins because of humiliation at school. \n\nGlenn resembles to Raul in a lot of ways, both are young adults that stopped doing what they liked and became shut ins for a period of time. It's not so farfetch to expect they do it in the same way since writters don't try very hard to change tropes at all.\n\n> Any further speculation on that is iffy anyway, since we don't know for certain that he even has PTSD in the first place.\n\nYour speculation is as good as mine, you even admit some of the PTSD soldiers don't go thru physical excercise routines.\n\nMaking asumptions and crafting theories is fun. I remember some guy pulling out some whacky theory about Showa Genroku Rakugo back in season 1, some guy shot down his theory and he got tons of upvotes. The whacky theory ended up being reality at the end of season 2."
  },
  {
   "score": 2,
   "id": "dg636u4",
   "pid": "t1_dg5dilu",
   "date": "2017-04-12 09:12:55",
   "depth": 7,
   "text": "> The apple doesn't fall far from the tree.\n\nUgh, that's about as bad as my \"everyone is different\" lulz. \n\n> It's not so farfetch to expect they do it in the same way since writters don't try very hard to change tropes at all.\n\nNo, it's not farfetched in the slightest to be willing to believe that a writer will be lazy given a fair number of them are. But the entire reason we started this was, if I'm remembering correctly, because Glenn's skill level made it obvious he must have been training and not sitting on his butt for the past year, and you believed that that directly conflicted with his previous statement that he was a shut in while I thought the two were perfectly reasonable together. Since the writer has clearly stated that Glenn was a shut in and then shown him doing things that he clearly could not do if he hadn't kept up at least some degree of training, it's not a matter of whether the writer was keeping to a stereotype or not but whether.... I guess whether Glenn was lying about being a shut in for the past year? \n\nHm. Now that I go there, what exactly is being argued here anyway (besides apparently the definition of a shut in, and if we're going to move on to that, we really should define if we're talking about a hikkikomori or a NEET, since both often get translated into shut in in English, but mean different things).\n\n> Glenn resembles to Raul in a lot of ways, both are young adults that stopped doing what they liked and became shut ins for a period of time.\n\nDo we have any reason to believe that Glenn was doing something he liked? I mean, the facts we know right now are a) as a child he thought magic was amazing and wonderful, b) as an adult he killed some evil mages at least once and likely had something to do with the military, and c) now he thinks magic is good for nothing but causing more death. For all we know, he hated everything about his job but felt it was necessary for some reason, and we know absolutely nothing about whatever event prompted him to become a shut in. \n\n> you even admit some of the PTSD soldiers don't go thru physical excercise routines.\n\n...Yes? \n\n> I remember some guy pulling out some whacky theory about Showa Genroku Rakugo back in season 1, some guy shot down his theory and he got tons of upvotes. The whacky theory ended up being reality at the end of season 2.\n\nHeheh, I remember seeing them being so excited in the season 2 discussion thread. Making up theories *is* fun. But my general rule is that if I'm going to try to argue a point, I have to try to a) be logical and reasonable and b) do my best to avoid using my own situation to prove a point, although I don't always manage."
  },
  {
   "score": 10,
   "id": "dg4lqzl",
   "pid": "t1_dg4jkuj",
   "date": "2017-04-11 10:35:21",
   "depth": 2,
   "text": "> ... Damn it, now that I think about, a decent percentage of things that bother people in anime are the things that are realistic. Oh well.\n\n\n\"Oh my god why don't they just talk to each other and make up! Like, that's totally what I'd do if I was in their situation! This is so unrealistic!\"\n\n\nYeah pretty much."
  },
  {
   "score": 2,
   "id": "dg58l7y",
   "pid": "t1_dg4lqzl",
   "date": "2017-04-11 18:09:29",
   "depth": 3,
   "text": "Yup people are shitty communicators in general. Especially if they feel offended or feel they are in the right or feel they should not need to explain etc....\n\nAnd even if someone does try to explain and communicate the other side has their own feelings that get in the way of seeing eye to eye."
  }
 ]
}