{
 "score": 915,
 "id": "6h01o4",
 "num_comments": 338,
 "date": "2017-06-13 07:01:45",
 "comments": [
  {
   "score": 203,
   "id": "diuera0",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:26:36",
   "depth": 0,
   "text": "That feeling when there only one episode left"
  },
  {
   "score": 17,
   "id": "divkguy",
   "pid": "t1_diuera0",
   "date": "2017-06-13 20:29:01",
   "depth": 1,
   "text": "What?! Damn thought we were getting 13 at least. My Celica barely got any screen time."
  },
  {
   "score": 61,
   "id": "diuii16",
   "pid": "t1_diuera0",
   "date": "2017-06-13 08:35:25",
   "depth": 1,
   "text": "truly got some feels in the final episode preview - gonna miss those chibis\n\n"
  },
  {
   "score": 200,
   "id": "diudtnl",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:08:06",
   "depth": 0,
   "text": "Looks like Sisti x Glenn might actually happen in the future? She seems to be the only love interest and she reminds him of his old crush.\n\nGlenn actually lost pretty hard to Leo, even in hand to hand combat. Not what I expected. At least the whole battle between the classes at the start of the episode was hilarious. Glenn just fucking around as always.\n\nNext episode is the last episode. Not going to lie, I'm going to miss this show and hope that there is a possibility for s2\n\n"
  },
  {
   "score": 3,
   "id": "div7qlq",
   "pid": "t1_diudtnl",
   "date": "2017-06-13 15:51:37",
   "depth": 1,
   "text": "I got a feeling hes gonna take a gun to a magic fight."
  },
  {
   "score": 6,
   "id": "div4wcv",
   "pid": "t1_diudtnl",
   "date": "2017-06-13 14:53:46",
   "depth": 1,
   "text": "I feel like Glenn went missing to come back with huge bakuhatsu. I expect something really huge. He wouldn't leave Sisti for this bastard for no reason."
  },
  {
   "score": 44,
   "id": "diuenhg",
   "pid": "t1_diudtnl",
   "date": "2017-06-13 07:24:35",
   "depth": 1,
   "text": "You would think Glenn would be like the best close quarter fighter in his weightclass, considering his orginal magic"
  },
  {
   "score": 3,
   "id": "diva0ck",
   "pid": "t1_diuenhg",
   "date": "2017-06-13 16:40:09",
   "depth": 2,
   "text": "He seems to have a gun he used to use though. \n\nAlso I pictured him more of an assassin type. Get the drop when the magic fails and a quick stab or so. He was also shown to be proficient at guerilla tactics, so that leads me to believe even more that he isn't the up in your face swinging guy - rather, that's probably RieL."
  },
  {
   "score": 111,
   "id": "diueuxu",
   "pid": "t1_diuenhg",
   "date": "2017-06-13 07:28:35",
   "depth": 2,
   "text": "As someone who is portrayed as a deadly mage killer, he sure is getting beat up a lot because of plot."
  },
  {
   "score": 2,
   "id": "divn172",
   "pid": "t1_diueuxu",
   "date": "2017-06-13 21:35:26",
   "depth": 3,
   "text": "I think he uses a gun normally, as Albert hands him his old gun."
  },
  {
   "score": 16,
   "id": "diuihb7",
   "pid": "t1_diueuxu",
   "date": "2017-06-13 08:35:03",
   "depth": 3,
   "text": "He uses a gun, so he is more like a rogue class. Fights dirty and fights smart, but actually pretty bad in face to face combat. "
  },
  {
   "score": 20,
   "id": "diuhyk7",
   "pid": "t1_diueuxu",
   "date": "2017-06-13 08:25:40",
   "depth": 3,
   "text": "I think he was more of an assassin. Using his fool magic to catch mages off guard and then shoot them with his gun."
  },
  {
   "score": 69,
   "id": "diufc8n",
   "pid": "t1_diueuxu",
   "date": "2017-06-13 07:37:47",
   "depth": 3,
   "text": "I think of it like he's not in his prime anymore after shutting himself in for over an year. "
  },
  {
   "score": 36,
   "id": "diugb75",
   "pid": "t1_diufc8n",
   "date": "2017-06-13 07:55:51",
   "depth": 4,
   "text": "Well, if you think military mage training is anything like modern military training, they probably dont get that many close combat training sessions, if any.\n\nAnd if you consider Glenns fools magic which is completly based on being better at close combat than the opponent, you would think he would be far far better than 99% of mages. \n\nBeing unemployed for a year doesnt make somebody incredibly weak or make them forget all their training."
  },
  {
   "score": 1,
   "id": "div64ds",
   "pid": "t1_diugb75",
   "date": "2017-06-13 15:18:03",
   "depth": 5,
   "text": "maybe is simply to him make a great comeback after."
  },
  {
   "score": 3,
   "id": "divm2ec",
   "pid": "t1_diugb75",
   "date": "2017-06-13 21:09:23",
   "depth": 5,
   "text": ">you would think he would be far far better than 99% of mages.\n\nYou aren't wrong. Glenn would beat almost anyone in a direct fight.\n\nPerhaps in this episode he fought someone in that 1%. Perhaps [spoiler](/s \"he wasn't in a fight against the person he thought.\")"
  },
  {
   "score": 5,
   "id": "diurzbr",
   "pid": "t1_diugb75",
   "date": "2017-06-13 11:16:01",
   "depth": 5,
   "text": "If you don't train for a year your muscles certainly wont be as strong and neither will his technique. Leos knew exactly who Glenn was so he was prepared to fight hand to hand. Part of Glenn's strength was fighting mages hand to hand who don't have a clue how to fight without magic. "
  },
  {
   "score": 23,
   "id": "diuk0ma",
   "pid": "t1_diugb75",
   "date": "2017-06-13 09:01:59",
   "depth": 5,
   "text": "> Being unemployed for a year doesnt make somebody incredibly weak or make them forget all their training.\n\nHave you ever trained martial arts? Because if you did and you have a 1 year break you will definitely feel it."
  },
  {
   "score": 17,
   "id": "diukj12",
   "pid": "t1_diuk0ma",
   "date": "2017-06-13 09:10:58",
   "depth": 6,
   "text": "Yes i have, and ofcourse you would feel a 1 year break. But still, if your whole orginal magic (which as i understand is extremly difficult to devolop) is based on being strong in close combat, i would imagine you would be legendary in close combat. \n\nNot somebody a magic researcher could beat easily.\n\nYou dont revert into a novice in a year."
  },
  {
   "score": 21,
   "id": "diukoqy",
   "pid": "t1_diukj12",
   "date": "2017-06-13 09:13:32",
   "depth": 7,
   "text": "Let's not forget a few episodes ago he was given back his gun. He clearly isn't a melee fighter.\n\nI agree with you though, he shouldn't have been kicked down by a researcher but there's probably more to that than what the anime is telling us as LN adaptations are known to rush through things just to show the action."
  },
  {
   "score": 25,
   "id": "div6483",
   "pid": "t1_diukoqy",
   "date": "2017-06-13 15:17:58",
   "depth": 8,
   "text": "dude was probably hopped up on drugs and had the anime equivalent of \"bath salts strength\""
  },
  {
   "score": 12,
   "id": "divlf7b",
   "pid": "t1_div6483",
   "date": "2017-06-13 20:52:40",
   "depth": 9,
   "text": "ANGELS DUST?! WHY HAS NO ONE MENTIONED THAT"
  },
  {
   "score": 1,
   "id": "diw58ok",
   "pid": "t1_divlf7b",
   "date": "2017-06-14 07:32:34",
   "depth": 1,
   "text": "Whilst I suspect he is the person providing Angels Dust, he most certainly isn't controlled by it. He's just innately an asshole, I think."
  },
  {
   "score": 36,
   "id": "diugycf",
   "pid": "t1_diugb75",
   "date": "2017-06-13 08:07:40",
   "depth": 5,
   "text": "Not practicing his hand to hand combat skills for a year may have deteriorated it somewhat."
  },
  {
   "score": 2,
   "id": "divmdqc",
   "pid": "t1_diugycf",
   "date": "2017-06-13 21:17:52",
   "depth": 6,
   "text": "But we've seen evidence of him practicing hand to hand combat on the dummy in a previous episode, and it's implied that's his routine in the morning."
  },
  {
   "score": 72,
   "id": "diunur8",
   "pid": "t1_diugycf",
   "date": "2017-06-13 10:05:59",
   "depth": 6,
   "text": "I would still be pretty fucking embarrased if i were a top special forces soldier, and got easily beat up by a fucking mathematician.\n\n"
  },
  {
   "score": 10,
   "id": "dixdpe5",
   "pid": "t1_diunur8",
   "date": "2017-06-14 22:22:44",
   "depth": 7,
   "text": "mathemagician*"
  },
  {
   "score": 72,
   "id": "diugacd",
   "pid": "t1_diufc8n",
   "date": "2017-06-13 07:55:26",
   "depth": 4,
   "text": "[Even Magus Killer have their off days.](http://i.imgur.com/LdXcq77.jpg)"
  },
  {
   "score": 106,
   "id": "diufdiv",
   "pid": "t1_diudtnl",
   "date": "2017-06-13 07:38:28",
   "depth": 1,
   "text": "Seems the LN is selling well and its popular. I would be excited for a season 2 but nonetheless I wouldn't get my hopes high. "
  },
  {
   "score": 30,
   "id": "diunivg",
   "pid": "t1_diufdiv",
   "date": "2017-06-13 10:00:28",
   "depth": 2,
   "text": "> Seems the LN is selling well and its popular. I would be excited for a season 2 but nonetheless I wouldn't get my hopes high.\n\n**Chivalry of a Failed Knight flashbacks**"
  },
  {
   "score": 1,
   "id": "divu0ei",
   "pid": "t1_diunivg",
   "date": "2017-06-14 01:53:56",
   "depth": 3,
   "text": "Tfw tournament arc will never come...."
  },
  {
   "score": 1,
   "id": "diw0c06",
   "pid": "t1_divu0ei",
   "date": "2017-06-14 05:48:36",
   "depth": 4,
   "text": "> tfw second tournament arc will never come \n\nFtfy"
  },
  {
   "score": 4,
   "id": "div75ym",
   "pid": "t1_diunivg",
   "date": "2017-06-13 15:39:30",
   "depth": 3,
   "text": ">Chivalry of a Failed Knight flashbacks\n\nStill not giving up hope.....hey at least the blu-ray is out now :/"
  },
  {
   "score": 143,
   "id": "diuggqq",
   "pid": "t1_diufdiv",
   "date": "2017-06-13 07:58:38",
   "depth": 2,
   "text": "It is popular and all but the anime skipped too much and burned through about 5 volumes in 12 episodes. There are only 8 volumes (+1 side story)out so I am pretty sure they have no plans of a new season. Those 5 volumes could have been made into a great 2 cour anime with a great pacing but it didn't. They could have also adapted much less material into this 1 cour anime but that didn't happen either. Meaning this adaptation was never supposed to be completed. It is only for advertisement."
  },
  {
   "score": 1,
   "id": "diuooc4",
   "pid": "t1_diuggqq",
   "date": "2017-06-13 10:19:28",
   "depth": 3,
   "text": "is the manga following the LN faithfully? i found it quite similar to the detail in anime with some extra bit here and there. "
  },
  {
   "score": 2,
   "id": "diuovbe",
   "pid": "t1_diuooc4",
   "date": "2017-06-13 10:22:43",
   "depth": 4,
   "text": "It is following the LN quite well. There are also some extras in the manga, like that parent day scene."
  },
  {
   "score": 1,
   "id": "div6p1f",
   "pid": "t1_diuggqq",
   "date": "2017-06-13 15:29:40",
   "depth": 3,
   "text": "I won't have internet for another month after tomorrow. Can you PM me a TL;DR of the final for the next episode. Not knowing is going to kill me."
  },
  {
   "score": 1,
   "id": "div7rkl",
   "pid": "t1_div6p1f",
   "date": "2017-06-13 15:52:10",
   "depth": 4,
   "text": "I have no idea how much  the final episode will adapt. If you want to be spoiled though, I have linked the summary for the light novel volumes down below. Check the summary for volumes 4 and 5."
  },
  {
   "score": 5,
   "id": "diuhq64",
   "pid": "t1_diuggqq",
   "date": "2017-06-13 08:21:35",
   "depth": 3,
   "text": "I am really sad when they do all this only for an adv. :( \nripperoni in pepperoni"
  },
  {
   "score": 9,
   "id": "diul3vd",
   "pid": "t1_diuggqq",
   "date": "2017-06-13 09:20:49",
   "depth": 3,
   "text": "Is there a translated LN? And which Volume are we in or which volume will the last episode end?"
  },
  {
   "score": 16,
   "id": "diuld7c",
   "pid": "t1_diul3vd",
   "date": "2017-06-13 09:25:22",
   "depth": 4,
   "text": "[There is an ongoing fan-translation, but it is not even close to where the anime is right now.](http://www.novelupdates.com/series/akashic-records-of-the-bastard-magical-instructor/) I am hoping Yen Press (they are the only ones that can) picks it after the anime is finished."
  },
  {
   "score": 1,
   "id": "diur7er",
   "pid": "t1_diuld7c",
   "date": "2017-06-13 11:02:40",
   "depth": 5,
   "text": "Can you read Japanese then??"
  },
  {
   "score": 1,
   "id": "diurkue",
   "pid": "t1_diur7er",
   "date": "2017-06-13 11:09:04",
   "depth": 6,
   "text": "I have read the fan-translated parts(volume 1) and summaries for the other volumes. I have also read the manga adaptation. But I do read some Japanese as well."
  },
  {
   "score": 1,
   "id": "diuvnbd",
   "pid": "t1_diurkue",
   "date": "2017-06-13 12:17:02",
   "depth": 7,
   "text": "May I ask, where did you read the summaries? "
  },
  {
   "score": 2,
   "id": "diuwc86",
   "pid": "t1_diuvnbd",
   "date": "2017-06-13 12:28:27",
   "depth": 8,
   "text": "[Here] (https://m.facebook.com/notes/huỳnh-hoàng-phát/rokudenashi-majutsu-koushi-to-akashic-records-de-spoiler/1855345594789156) and I also remember reading on /a/."
  },
  {
   "score": 1,
   "id": "diuyq5j",
   "pid": "t1_diuwc86",
   "date": "2017-06-13 13:06:26",
   "depth": 9,
   "text": "Than you very much good sir. "
  },
  {
   "score": 11,
   "id": "diun77e",
   "pid": "t1_diuld7c",
   "date": "2017-06-13 09:55:13",
   "depth": 5,
   "text": "If Yen Press doesn't, J-Novel Club might. They seem to be branching out, since they picked up Clockwork Planet recently. "
  },
  {
   "score": 12,
   "id": "diuo1s4",
   "pid": "t1_diun77e",
   "date": "2017-06-13 10:09:12",
   "depth": 6,
   "text": "Rokudenashi is a Kadokawa product, and as you may know Kadokawa owns 51% of Yen Press' shares. They would never let another company (and a mostly digital one at that) take a popular title like it. And as far as I know /u/Quarkboy (CEO of J-Novel Club) doesn't have any plans of taking a shot at Kadokawa titles yet. Or does he? :S"
  },
  {
   "score": 1,
   "id": "diuuay0",
   "pid": "t1_diuo1s4",
   "date": "2017-06-13 11:55:13",
   "depth": 7,
   "text": "manga preordered! BTW do you know how many vols of the manga are there currently? "
  },
  {
   "score": 2,
   "id": "diuuqot",
   "pid": "t1_diuuay0",
   "date": "2017-06-13 12:02:10",
   "depth": 8,
   "text": "5 volumes in Japan. Seven Seas will catch up to them in a year or so. They are quite fast."
  },
  {
   "score": 1,
   "id": "dius5xt",
   "pid": "t1_diuo1s4",
   "date": "2017-06-13 11:19:11",
   "depth": 7,
   "text": "August 29 publication date by Seven Seas. found on amazon."
  },
  {
   "score": 5,
   "id": "dius7s5",
   "pid": "t1_dius5xt",
   "date": "2017-06-13 11:20:05",
   "depth": 8,
   "text": "That is the manga adaptation my man. Seven Seas has no chance of licensing the light novel."
  },
  {
   "score": 2,
   "id": "diusfw0",
   "pid": "t1_dius7s5",
   "date": "2017-06-13 11:23:55",
   "depth": 9,
   "text": "thanks for the correction!"
  },
  {
   "score": 13,
   "id": "diuh9ki",
   "pid": "t1_diuggqq",
   "date": "2017-06-13 08:13:19",
   "depth": 3,
   "text": "At least it's still good. Unlike a certain dungeon crawling series..."
  },
  {
   "score": 1,
   "id": "divodoi",
   "pid": "t1_diuh9ki",
   "date": "2017-06-13 22:14:16",
   "depth": 4,
   "text": "I suppose you mean DanMachi but I'm reading like 14 others in the same category.\n\nI'm not a fan of the spin off anime, I want them to go back to Bell and his powers but hey if the spin off does well hopefully they'll get the funding to do so."
  },
  {
   "score": 16,
   "id": "diuhiie",
   "pid": "t1_diuh9ki",
   "date": "2017-06-13 08:17:47",
   "depth": 4,
   "text": "I am guessing you mean Danmachi. I just skipped the anime because of all the criticism. "
  },
  {
   "score": 6,
   "id": "div0do4",
   "pid": "t1_diuhiie",
   "date": "2017-06-13 13:33:24",
   "depth": 5,
   "text": "after the anime i went to read the manga, and yea it was much better.\n\nim talking about the danmachi spinoff manga, the main series manga was nothing special tho"
  },
  {
   "score": 2,
   "id": "divvhqp",
   "pid": "t1_div0do4",
   "date": "2017-06-14 03:03:45",
   "depth": 6,
   "text": "Er... they're both originally LN's. You're just comparing two adaptations, mate."
  },
  {
   "score": 1,
   "id": "diw0h7f",
   "pid": "t1_divvhqp",
   "date": "2017-06-14 05:52:02",
   "depth": 7,
   "text": "yes"
  },
  {
   "score": 6,
   "id": "div0swo",
   "pid": "t1_div0do4",
   "date": "2017-06-13 13:40:13",
   "depth": 6,
   "text": "Danmachi Oratoria manga is one of the best light novel to manga adaptions I know of. "
  },
  {
   "score": 111,
   "id": "diuh127",
   "pid": "t1_diuggqq",
   "date": "2017-06-13 08:09:02",
   "depth": 3,
   "text": "thanks for the info. \n\nSigh* I fucking hate how the majority of anime is only for advertisement. "
  },
  {
   "score": 1,
   "id": "div5zzh",
   "pid": "t1_diuh127",
   "date": "2017-06-13 15:15:35",
   "depth": 4,
   "text": "well they arent getting shit from the west at the very least, only the SUPER popular stuff gets officially translated. the rest gets fan translations and no money goes back to them. \n\n"
  },
  {
   "score": 14,
   "id": "diuj2oz",
   "pid": "t1_diuh127",
   "date": "2017-06-13 08:45:38",
   "depth": 4,
   "text": "Because anime is bloody expensive compared to a single guy/girl who can pump out volumes of text.\n\n"
  },
  {
   "score": 56,
   "id": "diuhgjj",
   "pid": "t1_diuh127",
   "date": "2017-06-13 08:16:47",
   "depth": 4,
   "text": "Honestly, it is even worse when you have already read a source material and hear it will get an adaptation to only to get your hopes crushed by either it not being a complete adaptation or it being a shitty paced adaptation that skips everything... This is the case for 9 out of 10 light novel adaptations. Why can't we get a great adaptation like those manga adaptations..."
  },
  {
   "score": 2,
   "id": "div0bw5",
   "pid": "t1_diuhgjj",
   "date": "2017-06-13 13:32:41",
   "depth": 5,
   "text": "u seem to have read the source material can u spoil me if gleen ends up with a girl afterwards"
  },
  {
   "score": 8,
   "id": "div12xt",
   "pid": "t1_div0bw5",
   "date": "2017-06-13 13:44:35",
   "depth": 6,
   "text": "[Some spoilers](/s \"The Story is still ongoing so he hasn't ended up with anyone yet. But Sistine route looks most probable as she reminds him of his deceased girlfriend - Sera\")"
  },
  {
   "score": 3,
   "id": "diw55du",
   "pid": "t1_div12xt",
   "date": "2017-06-14 07:30:48",
   "depth": 7,
   "text": "Can you lend me some light into the situation? Why didn't Glenn show up for the duel? I'm sure there's a timeskip when she says he never returned to the academy afterwards, what happens and why? And what's with the bastard Leo's? Is he working with the evil organisation? What's with Glenn's past and Sara? Which volumes are dedicated to his past, and is there a translated version of it? Thanks so much!"
  },
  {
   "score": 1,
   "id": "diw5lt7",
   "pid": "t1_diw55du",
   "date": "2017-06-14 07:39:25",
   "depth": 8,
   "text": "No translations of those volumes. Everything I know comes from these summaries [ in here] (https://m.facebook.com/notes/huỳnh-hoàng-phát/rokudenashi-majutsu-koushi-to-akashic-records-de-spoiler/1855345594789156) and reading stuff on /a/. I think reading those will answer your questions. Especially the summary of volume 5. "
  },
  {
   "score": 5,
   "id": "diulki5",
   "pid": "t1_diuhgjj",
   "date": "2017-06-13 09:28:37",
   "depth": 5,
   "text": "[deleted]"
  },
  {
   "score": 8,
   "id": "diuluqx",
   "pid": "t1_diulki5",
   "date": "2017-06-13 09:33:15",
   "depth": 6,
   "text": "I know the pain, but I specifically meant the two most popular anime this season. I tried to imply it at least. They are not only on par with the source material when it comes to quality but they also far exceed their source material in some ways. \n\nOtherwise the word \"Berserk\" is enough to show how bad manga adaptations can be. Poor Berserk fans. I don't know if Guts suffers more or the fans."
  },
  {
   "score": 3,
   "id": "dium3ag",
   "pid": "t1_diuluqx",
   "date": "2017-06-13 09:37:11",
   "depth": 7,
   "text": "[deleted]"
  },
  {
   "score": 2,
   "id": "diumog0",
   "pid": "t1_dium3ag",
   "date": "2017-06-13 09:46:47",
   "depth": 8,
   "text": "You have the manga ones right, and those were actually the only ones I implied. I meant the light novels in general although the one under spoiler tag fits the bill quite well. Another one from this season would be [Meta](/s \"Clockwork Planet\").\n\n\nI would love for [meta](/s \"Suka Suka\") to get a full adaptation but I know the anime was probably only an advertisement for the sequel. But the first part of the anime was quite rushed. I don't understand why they would rush it and then later even add original content when they didn't plan it to be completed anyway...."
  },
  {
   "score": 6,
   "id": "div6rk9",
   "pid": "t1_diuhgjj",
   "date": "2017-06-13 15:31:07",
   "depth": 5,
   "text": "Honestly, if it were possible I'd just read the LNs themselves 95% of the time instead of watching an adaption. The only problem is that a lot of them are either completely untranslated, or there's only a tiny amount translated from a year+ ago and no one else has picked it up since."
  },
  {
   "score": 3,
   "id": "div7ol3",
   "pid": "t1_div6rk9",
   "date": "2017-06-13 15:50:29",
   "depth": 6,
   "text": "Well J-Novel Club is making it possible. 20 titles after 1 year and they are caught up with a few of the Japanese releases as well. The future of light novels looks bright thanks to J-Novel Club."
  },
  {
   "score": 2,
   "id": "div8gxp",
   "pid": "t1_div7ol3",
   "date": "2017-06-13 16:07:12",
   "depth": 7,
   "text": "Already a sub there! I look forwards to them getting a lot more titles."
  },
  {
   "score": 10,
   "id": "diunhwd",
   "pid": "t1_diuhgjj",
   "date": "2017-06-13 10:00:01",
   "depth": 5,
   "text": "Yeah this is me with sukasuka "
  },
  {
   "score": 13,
   "id": "diui4h9",
   "pid": "t1_diuhgjj",
   "date": "2017-06-13 08:28:34",
   "depth": 5,
   "text": "Asking for good and complete adaptations is impossible. \n\n~RIP~"
  },
  {
   "score": 72,
   "id": "diuizgp",
   "pid": "t1_diui4h9",
   "date": "2017-06-13 08:44:00",
   "depth": 6,
   "text": "There a few examples of light novels getting a good adaptation. I will probably get a lot of hate for this but **SAO** is one of the best, if not the best adaptation of a LN I have ever seen. 4 cours (50 episodes) adapted 8 volumes and the pacing was great when you compare it to the actual source material. Although the source material itself was shit at times thus some parts of the anime was bad as well. But **SAO** will get a complete anime adaptation. Soon the Alicization arc of the light novels, best arc to date IMO will get an adaptation as well.\n\nAnother example would be **Re:Zero** which will probably also get a full adaptation and White Fox did their best (skipping opening and endings) to no rush it. Although some parts were rushed, it was a pretty good adaptation still. If we go by volume count it adapted 8 volumes into 25 episodes(but the episodes were extra long).\n\n\nThere is also **Monogatari series** which will also probably get a full adaption but I haven't read the source material yet so I can't tell how good of an adaptation it was.\n\nAlso this season's **Zero kara Hajimeru Mahou no Sho** adapts 1 LN volume (I think) into 12 episodes. But I have neither read the LN nor seen the anime so there is not much I can tell."
  },
  {
   "score": 0,
   "id": "div08c6",
   "pid": "t1_diuizgp",
   "date": "2017-06-13 13:31:09",
   "depth": 7,
   "text": "i thoght monogatari series was an anime original "
  },
  {
   "score": 7,
   "id": "div0y7f",
   "pid": "t1_div08c6",
   "date": "2017-06-13 13:42:31",
   "depth": 8,
   "text": "No, it is not. It is based on Nisio Isin's (light) novel series. He has many other famous works as well. You may have heard of Katanagatari. "
  },
  {
   "score": 1,
   "id": "diwfrw2",
   "pid": "t1_diuizgp",
   "date": "2017-06-14 10:33:40",
   "depth": 7,
   "text": "Zero kara Hajimeru Mahou no Sho hasn't really been a great adaptation from what I've gathered. Unnecessary filler scenes or changes in events from the LN that messes with the pacing."
  },
  {
   "score": 1,
   "id": "diwfwnd",
   "pid": "t1_diwfrw2",
   "date": "2017-06-14 10:35:51",
   "depth": 8,
   "text": "Thanks for educating me on that."
  },
  {
   "score": 2,
   "id": "diw0bq3",
   "pid": "t1_diuizgp",
   "date": "2017-06-14 05:48:24",
   "depth": 7,
   "text": "Read the first three Monogatari LN's...the anime seems to be a pretty faithful adaptation.\n\nAlso agree with the Re:Zero comment..."
  },
  {
   "score": 2,
   "id": "diw0dqz",
   "pid": "t1_diw0bq3",
   "date": "2017-06-14 05:49:47",
   "depth": 8,
   "text": "I am happy to hear that. I have been holding it off myself as I have more important light novel/manga purchases to make.\n\nAnd I am 99.9% certain Re:Zero will get at least one more season."
  },
  {
   "score": 1,
   "id": "diwbfgr",
   "pid": "t1_diw0dqz",
   "date": "2017-06-14 09:20:38",
   "depth": 9,
   "text": "> 99.9% certain Re:Zero will get at least one more season.\n\n Are you basing this off of only the success of the show? "
  },
  {
   "score": 1,
   "id": "diwbm0p",
   "pid": "t1_diwbfgr",
   "date": "2017-06-14 09:23:41",
   "depth": 1,
   "text": "Look at the sales for the LN from past year. It is crazy. The show was very successful as well. The publisher loves the source material and the author wants it animated. "
  },
  {
   "score": 1,
   "id": "diw0p79",
   "pid": "t1_diw0dqz",
   "date": "2017-06-14 05:57:26",
   "depth": 9,
   "text": "Yup...the next arc is pretty fun too...fills in some of those pesky blanks I had been wondering about after watching the anime."
  },
  {
   "score": 2,
   "id": "diw0ue5",
   "pid": "t1_diw0p79",
   "date": "2017-06-14 06:00:49",
   "depth": 1,
   "text": "Are we talking about Monogatari here?  Cause the next arc of Re:Zero is nothing but suffer porn."
  },
  {
   "score": 1,
   "id": "diwe4hm",
   "pid": "t1_diw0ue5",
   "date": "2017-06-14 10:05:34",
   "depth": 2,
   "text": "uhh..the entirety of Re:Zero is suffer porn so...haha"
  },
  {
   "score": 1,
   "id": "diwedtf",
   "pid": "t1_diwe4hm",
   "date": "2017-06-14 10:09:56",
   "depth": 3,
   "text": "It does get worse, believe me."
  },
  {
   "score": 14,
   "id": "diulesb",
   "pid": "t1_diuizgp",
   "date": "2017-06-13 09:26:05",
   "depth": 7,
   "text": "SAO Progressive adaptation pls ty"
  },
  {
   "score": 6,
   "id": "diulk4s",
   "pid": "t1_diulesb",
   "date": "2017-06-13 09:28:28",
   "depth": 8,
   "text": "I don't think it is gonna happen when there is another adaptation of the same arc. At least not before the author gets back to writing it, which is probably when the next and final arc of SAO is finished."
  },
  {
   "score": 1,
   "id": "dj22r65",
   "pid": "t1_diulk4s",
   "date": "2017-06-17 23:43:58",
   "depth": 9,
   "text": "Alicization Arc hype."
  },
  {
   "score": 246,
   "id": "diudv9i",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:08:59",
   "depth": 0,
   "text": "That went dark fairly quickly. \n\n[](#rerorero)\n\n^^^^ThatEndCardTho^"
  },
  {
   "score": 152,
   "id": "diungfm",
   "pid": "t1_diudv9i",
   "date": "2017-06-13 09:59:23",
   "depth": 1,
   "text": "> ^^^ThatEndCardTho\n\nit felt wrong to see such a cute picture after such a tense moment"
  },
  {
   "score": 59,
   "id": "div2cjt",
   "pid": "t1_diungfm",
   "date": "2017-06-13 14:06:07",
   "depth": 2,
   "text": "Lmao I was like 0 to 100 then 100 to 0 real quick."
  },
  {
   "score": 31,
   "id": "div8zmn",
   "pid": "t1_div2cjt",
   "date": "2017-06-13 16:18:19",
   "depth": 3,
   "text": "0 to 100 to \n\n[](#lolipolice)"
  },
  {
   "score": 103,
   "id": "diued26",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:18:57",
   "depth": 0,
   "text": "Again, this show [end card](http://imgur.com/Cni7tNM.png) doesn't disappoint! We also got some [great](http://imgur.com/Q8tJ1nM.png) [stitches](http://imgur.com/i9HFyy5.png) of Sisti :D This is also the last preview D:"
  },
  {
   "score": 1,
   "id": "divf0m2",
   "pid": "t1_diued26",
   "date": "2017-06-13 18:27:30",
   "depth": 1,
   "text": "Best end card of the year"
  },
  {
   "score": 12,
   "id": "diuhqig",
   "pid": "t1_diued26",
   "date": "2017-06-13 08:21:45",
   "depth": 1,
   "text": "That end card is gold."
  },
  {
   "score": 39,
   "id": "diufhmg",
   "pid": "t1_diued26",
   "date": "2017-06-13 07:40:38",
   "depth": 1,
   "text": "[that end card](#mangaka)"
  },
  {
   "score": 40,
   "id": "diuhs30",
   "pid": "t1_diufhmg",
   "date": "2017-06-13 08:22:31",
   "depth": 2,
   "text": "We already got the [same pose](http://imgur.com/LkIDAuK) from the first episode with some [close up](http://imgur.com/a/LWsoY) but again in bikini is welcome too."
  },
  {
   "score": 30,
   "id": "div3rv6",
   "pid": "t1_diuhs30",
   "date": "2017-06-13 14:32:11",
   "depth": 3,
   "text": "This scene always seemed a little out of place to me, but looking back on it now, it just seems wrong, it's just so out of character for Sistine."
  },
  {
   "score": 4,
   "id": "div7x69",
   "pid": "t1_div3rv6",
   "date": "2017-06-13 15:55:27",
   "depth": 4,
   "text": "Yeah, these scenes and the show as a whole is just to sell the LN anyway which is a shame. But it's not that out of place for Sisti since they are all high school girls."
  },
  {
   "score": 19,
   "id": "divlhd6",
   "pid": "t1_div7x69",
   "date": "2017-06-13 20:54:10",
   "depth": 5,
   "text": "Most high school girls don't do what anime girls do in the changing room. I can guarantee it"
  },
  {
   "score": 12,
   "id": "divnwzd",
   "pid": "t1_divlhd6",
   "date": "2017-06-13 22:00:18",
   "depth": 6,
   "text": "I'd image it's just like the men's. Just awkward shuffling around while looking at the floor. With the occasional bit of small talk. "
  },
  {
   "score": 5,
   "id": "divro5d",
   "pid": "t1_divnwzd",
   "date": "2017-06-14 00:10:32",
   "depth": 7,
   "text": "Man your imagination is boringggggg"
  },
  {
   "score": 3,
   "id": "divrxkg",
   "pid": "t1_divro5d",
   "date": "2017-06-14 00:21:27",
   "depth": 8,
   "text": "My imagination is a little more vivid ;) Just taking a guess cause I've never been in one. "
  },
  {
   "score": 99,
   "id": "diuju2b",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 08:58:57",
   "depth": 0,
   "text": "Here's to hoping Celica takes this personally... haven't seen enough of her AT ALL"
  },
  {
   "score": 1,
   "id": "divkito",
   "pid": "t1_diuju2b",
   "date": "2017-06-13 20:30:21",
   "depth": 1,
   "text": "The feels you don't get enough best girl Celica....but I'll take that end card as consolation ( ͡° ͜ʖ ͡°)"
  },
  {
   "score": 11,
   "id": "div5vet",
   "pid": "t1_diuju2b",
   "date": "2017-06-13 15:13:01",
   "depth": 1,
   "text": "She probably too busy soloing dungeons to care right now"
  },
  {
   "score": 22,
   "id": "diun8mf",
   "pid": "t1_diuju2b",
   "date": "2017-06-13 09:55:52",
   "depth": 1,
   "text": "Seeing as she's probably the top of all the mages with an arcana class, being ZA WARUDO, i do hope so."
  },
  {
   "score": 15,
   "id": "div0ngn",
   "pid": "t1_diuju2b",
   "date": "2017-06-13 13:37:41",
   "depth": 1,
   "text": "she had the appearance to be best girl but no screen time "
  },
  {
   "score": 30,
   "id": "diuksce",
   "pid": "t1_diuju2b",
   "date": "2017-06-13 09:15:14",
   "depth": 1,
   "text": "Hope she would appear next episode to help Glenn kick some blonde ass"
  },
  {
   "score": 176,
   "id": "diul9lz",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:23:36",
   "depth": 0,
   "text": "[This is too much.](http://i.imgur.com/640IwSl.jpg)"
  },
  {
   "score": 3,
   "id": "dj2ap20",
   "pid": "t1_diul9lz",
   "date": "2017-06-18 05:48:21",
   "depth": 1,
   "text": "Re:L WHY!!!???"
  },
  {
   "score": 210,
   "id": "diugai2",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:55:30",
   "depth": 0,
   "text": "[WRYYYYYYY!!](https://cdn.discordapp.com/attachments/176422078969282560/324196058861404162/unknown.png)"
  },
  {
   "score": 54,
   "id": "diuibpk",
   "pid": "t1_diugai2",
   "date": "2017-06-13 08:32:10",
   "depth": 1,
   "text": "ZA FUURUDO"
  },
  {
   "score": 1,
   "id": "div9qrh",
   "pid": "t1_diuibpk",
   "date": "2017-06-13 16:34:28",
   "depth": 2,
   "text": "You know, this entire time, I'm surprised no one has called him Iggy yet."
  },
  {
   "score": 30,
   "id": "diukojb",
   "pid": "t1_diuibpk",
   "date": "2017-06-13 09:13:26",
   "depth": 2,
   "text": "MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA"
  },
  {
   "score": 11,
   "id": "diusum0",
   "pid": "t1_diukojb",
   "date": "2017-06-13 11:31:01",
   "depth": 3,
   "text": "Fyi, in Croatian, muda is a slang for balls."
  },
  {
   "score": 0,
   "id": "dixbnb1",
   "pid": "t1_diusum0",
   "date": "2017-06-14 21:21:20",
   "depth": 4,
   "text": "FYI, in English, balls is a slang for testicles"
  },
  {
   "score": 18,
   "id": "diuvn2m",
   "pid": "t1_diukojb",
   "date": "2017-06-13 12:16:55",
   "depth": 3,
   "text": "ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA "
  },
  {
   "score": 261,
   "id": "diudqdj",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:06:15",
   "depth": 0,
   "text": "#Fuck that other teacher guy.  \n\n[](#peasants)  \n\nThis was a great ep.  We got a nice look into other school stuff and the mock battle was neat.  Its interesting how differnet glenn is to other mages and stuff.  Doesnt rely on magic, also not an asshole.  \n\nWe got more peeks at Glenn's past which is nice and seeing him open up to Sistine about everythign was nice.  Hopefully next week we get more about the past and Sara.  \n\nThe other teacher guy is such an ass.  Standard high born cares more about his status kinda guy.  Seeing him get destroyed will be very satisfying.  \n\nI hope they do more of this show because its been very enjoyable.  Last ep of the season is next week, but i want more...  "
  },
  {
   "score": 5,
   "id": "diurkhe",
   "pid": "t1_diudqdj",
   "date": "2017-06-13 11:08:54",
   "depth": 1,
   "text": "I want more, too. But luckily, I get reminded to not epect a conclusion each time I see that little \"KADOKAWA\" in the OP lol"
  },
  {
   "score": 35,
   "id": "diuogvb",
   "pid": "t1_diudqdj",
   "date": "2017-06-13 10:16:05",
   "depth": 1,
   "text": "Fuck KD"
  },
  {
   "score": 12,
   "id": "div5g25",
   "pid": "t1_diuogvb",
   "date": "2017-06-13 15:04:26",
   "depth": 2,
   "text": "/r/nba is leaking everywhere"
  },
  {
   "score": 15,
   "id": "diuku9d",
   "pid": "t1_diudqdj",
   "date": "2017-06-13 09:16:10",
   "depth": 1,
   "text": "> I hope they do more of this show because its been very enjoyable. Last ep of the season is next week, but i want more...\n\nCan confirm I binge watched it two days ago and im somehow more hyped than I should be"
  },
  {
   "score": 59,
   "id": "diujvrp",
   "pid": "t1_diudqdj",
   "date": "2017-06-13 08:59:45",
   "depth": 1,
   "text": "Just no NTR plz. Sisti x Glenn is love Sisti x Glenn is life"
  },
  {
   "score": 1,
   "id": "divrw70",
   "pid": "t1_diujvrp",
   "date": "2017-06-14 00:19:49",
   "depth": 2,
   "text": "Sisti x rumia please"
  },
  {
   "score": 1,
   "id": "diveq6y",
   "pid": "t1_diujvrp",
   "date": "2017-06-13 18:21:21",
   "depth": 2,
   "text": "Should we give it one of those celebrity couple names? Glisti maybe?"
  },
  {
   "score": 43,
   "id": "diumbin",
   "pid": "t1_diujvrp",
   "date": "2017-06-13 09:40:53",
   "depth": 2,
   "text": "But what about Rumia and Re=L?  The only possible outcome here is if Glenn marries them all."
  },
  {
   "score": 1,
   "id": "divu5uz",
   "pid": "t1_diumbin",
   "date": "2017-06-14 02:00:56",
   "depth": 3,
   "text": "So we harem-ing now?"
  },
  {
   "score": 18,
   "id": "diuo66m",
   "pid": "t1_diumbin",
   "date": "2017-06-13 10:11:09",
   "depth": 3,
   "text": "Glenn works as an advisor to Rumia while married to Sisti with the adopted daughter of Re=L"
  },
  {
   "score": 43,
   "id": "diuq6o6",
   "pid": "t1_diumbin",
   "date": "2017-06-13 10:45:09",
   "depth": 3,
   "text": "I don't think Rumia has any romantic interest in Glenn.. She seems to be fully onboard the \"SistixGlenn\" ship."
  },
  {
   "score": 3,
   "id": "dive8ba",
   "pid": "t1_diuq6o6",
   "date": "2017-06-13 18:10:48",
   "depth": 4,
   "text": "i dunno about that, he did save her life on multiple occasions.  that kinda stuff tends to make the girls swoon."
  },
  {
   "score": 8,
   "id": "divzjno",
   "pid": "t1_dive8ba",
   "date": "2017-06-14 05:28:48",
   "depth": 5,
   "text": "Pretty doubtful regardless. I'm of the opinion Rumia at best respects Glenn as a teacher, nothing less, nothing more. She supports Sisti if anything."
  },
  {
   "score": 15,
   "id": "divm7sj",
   "pid": "t1_dive8ba",
   "date": "2017-06-13 21:13:23",
   "depth": 5,
   "text": "Yeah, but I could also see her stepping aside and supporting Sisti instead, while keeping her own feelings bottled up- or at least, attempting to. "
  },
  {
   "score": 61,
   "id": "diuo02r",
   "pid": "t1_diumbin",
   "date": "2017-06-13 10:08:26",
   "depth": 3,
   "text": "This show would achieve perfection if the group marriage occurs in the chibi section of the final ep. Curtain."
  },
  {
   "score": 130,
   "id": "diuju6a",
   "pid": "t1_diudqdj",
   "date": "2017-06-13 08:58:59",
   "depth": 1,
   "text": "> Standard high born cares more about his status kinda guy.\n\nIt's pretty clear that he wasn't like that and that he's probably on the Angel Dust drug and that's twisting him not to mention he's probably aligned himself with that evil organization."
  },
  {
   "score": 9,
   "id": "diunsno",
   "pid": "t1_diuju6a",
   "date": "2017-06-13 10:05:01",
   "depth": 2,
   "text": "Good call – it also provides a plausible explanation for that evil smirk on the evil carriage driver's evil face."
  },
  {
   "score": 66,
   "id": "diumevz",
   "pid": "t1_diuju6a",
   "date": "2017-06-13 09:42:25",
   "depth": 2,
   "text": "I mean he specifically said he was marrying Sistine to better his position in his family.  If hes known her since they were kids, thats a long time to be schemeing that.  Its not drugs fault, its just hes a two faces asshole.  \n\n[](#yousaidsomethingdumb)"
  },
  {
   "score": 10,
   "id": "divv95v",
   "pid": "t1_diumevz",
   "date": "2017-06-14 02:52:29",
   "depth": 3,
   "text": "tbf we don't know how long he was planning on marrying her for power so it could be a good childhood friend turned corrupt asshole"
  },
  {
   "score": 57,
   "id": "diuqwi5",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 10:57:25",
   "depth": 0,
   "text": "[Kiritsugu and Irisviel](http://i.imgur.com/Lkzy2JO.png)"
  },
  {
   "score": 160,
   "id": "diuejoj",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:22:32",
   "depth": 0,
   "text": "Just when I thought it was impossible to hate Leos more he steps it up this episode by basically threatening the main cast just to get to Sistine. Although it's gonna be delicious when he gets his ass kicked in the finale. \n\nThe episode overall was great though! [I love Glenn's insane laugh](http://i.imgur.com/ORuNyY0.png) and how he used ~~gorilla~~ guerilla tactics on those poor students. And we even got some more info about Glenn's past from the man himself.\n\nAnd the previews is still great! I wouldn't mind them making an OVA with the Chibi characters just doing silly things. [Just look at how cute Chibi Sistine is!](http://i.imgur.com/iItxSMX.png)\n\n[End Card by Ryohka](http://i.imgur.com/QVp38tz.png) (I'm still waiting for his Re:Zero doujin to be translated ( ͡° ͜ʖ ͡°) )\n \n\nTo those asking about the doujin I'm talking about just look up \"Re:Zero kara Hajimeru Shiro Suku Seikatsu\"\n\n"
  },
  {
   "score": 1,
   "id": "divwy90",
   "pid": "t1_diuejoj",
   "date": "2017-06-14 04:05:54",
   "depth": 1,
   "text": "You mean the Rem doujin? It's just plain old sex after the Rem IF story where they run away together and have children.\n\nEdit: For those asking, the title is Re:Zero kara Hajimeru Shiro Suku Seikatsu"
  },
  {
   "score": 1,
   "id": "divu8ad",
   "pid": "t1_diuejoj",
   "date": "2017-06-14 02:04:06",
   "depth": 1,
   "text": "What doujin? Don't leave me hanging like that"
  },
  {
   "score": 1,
   "id": "divg9o3",
   "pid": "t1_diuejoj",
   "date": "2017-06-13 18:54:24",
   "depth": 1,
   "text": "doujin? What doujin? Tell me more please."
  },
  {
   "score": 10,
   "id": "div6px9",
   "pid": "t1_diuejoj",
   "date": "2017-06-13 15:30:10",
   "depth": 1,
   "text": "what doujin ( ͡° ͜ʖ ͡°) "
  },
  {
   "score": 3,
   "id": "divvejz",
   "pid": "t1_div6px9",
   "date": "2017-06-14 02:59:37",
   "depth": 2,
   "text": "Look up \"Re:Zero kara Hajimeru Shiro Suku Seikatsu\" ( ͡~ ͜ʖ ͡°)"
  },
  {
   "score": 37,
   "id": "diujjp2",
   "pid": "t1_diuejoj",
   "date": "2017-06-13 08:53:57",
   "depth": 1,
   "text": "that endcard \n[](#nosebleed)"
  },
  {
   "score": 1,
   "id": "divgsfc",
   "pid": "t1_diujjp2",
   "date": "2017-06-13 19:05:41",
   "depth": 2,
   "text": "The only thing I didn't like it about it is that both hands were up there. One should have been cupping a breast, the other should have been stuck down the bottom portion of her bikini."
  },
  {
   "score": 2,
   "id": "divhwbz",
   "pid": "t1_diujjp2",
   "date": "2017-06-13 19:30:07",
   "depth": 2,
   "text": "Looks like her power amplifies more than just magic."
  },
  {
   "score": 27,
   "id": "diuox6c",
   "pid": "t1_diujjp2",
   "date": "2017-06-13 10:23:36",
   "depth": 2,
   "text": "[](#towel)"
  },
  {
   "score": 13,
   "id": "div9tkr",
   "pid": "t1_diuox6c",
   "date": "2017-06-13 16:36:08",
   "depth": 3,
   "text": "[](#sweating)"
  },
  {
   "score": 191,
   "id": "diuh67q",
   "pid": "t1_diuejoj",
   "date": "2017-06-13 08:11:38",
   "depth": 1,
   "text": ">gorilla tactics\n\n\nWhat the fuck did you just fucking say about me, you little bitch? I’ll have you know I graduated ~~top~~bottom of my class in the Alzano Imperial Magic Academy, and I’ve been involved in numerous secret raids on The Researchers of Divine Wisdom, and I have over 28 confirmed kills. I am trained in gorilla warfare and I’m friends with the top sniper in the entire Alzano Imperial Court Magicians. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Empire, mark my fucking words. You think you can get away with saying that shit to me in front of Sistine? Think again, fucker. As we speak I am contacting my secret network of Magicians across the Empire and your bases are being tracked right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the Alzano Imperial Court Magicians and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little “clever” challenge was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You’re fucking dead, Leos."
  },
  {
   "score": 1,
   "id": "divjaig",
   "pid": "t1_diuh67q",
   "date": "2017-06-13 20:01:22",
   "depth": 2,
   "text": ">all your bases are belong to us"
  },
  {
   "score": 1,
   "id": "diuh860",
   "pid": "t1_diuh67q",
   "date": "2017-06-13 08:12:38",
   "depth": 2,
   "text": "Hahaha dammit auto correct XD "
  },
  {
   "score": 24,
   "id": "diuirby",
   "pid": "t1_diuh67q",
   "date": "2017-06-13 08:40:03",
   "depth": 2,
   "text": "Well well well......Looks like I found myself a new pasta"
  },
  {
   "score": 53,
   "id": "diugbtw",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:56:09",
   "depth": 0,
   "text": "Shipping Glenn sensei and Shiro Neko so hard right now. \n\nI have no doubt Glenn sensei will have a spectacular comeback next week."
  },
  {
   "score": 14,
   "id": "diurheu",
   "pid": "t1_diugbtw",
   "date": "2017-06-13 11:07:28",
   "depth": 1,
   "text": "*cumback?"
  },
  {
   "score": 22,
   "id": "div1dy9",
   "pid": "t1_diurheu",
   "date": "2017-06-13 13:49:44",
   "depth": 2,
   "text": "That might be Shiro's back, not Glenns. :P"
  },
  {
   "score": 41,
   "id": "div9o70",
   "pid": "t1_div1dy9",
   "date": "2017-06-13 16:32:54",
   "depth": 3,
   "text": "Shironeko [is ready](http://imgur.com/a/82kPa)."
  },
  {
   "score": 52,
   "id": "diumdv5",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:41:57",
   "depth": 0,
   "text": "Am I the only one who tought Leos use Angel's Dust (that drug) on Glenn?"
  },
  {
   "score": 0,
   "id": "diumh36",
   "pid": "t1_diumdv5",
   "date": "2017-06-13 09:43:26",
   "depth": 1,
   "text": "really? how so?"
  },
  {
   "score": 22,
   "id": "diungq2",
   "pid": "t1_diumh36",
   "date": "2017-06-13 09:59:30",
   "depth": 2,
   "text": "maybe it was all those sparkling particles of golden dust"
  },
  {
   "score": 4,
   "id": "divhhz2",
   "pid": "t1_diungq2",
   "date": "2017-06-13 19:21:05",
   "depth": 3,
   "text": "You might be onto something."
  },
  {
   "score": 4,
   "id": "div1pgf",
   "pid": "t1_diumdv5",
   "date": "2017-06-13 13:55:13",
   "depth": 1,
   "text": "[removed]"
  },
  {
   "score": 1,
   "id": "dizhtj4",
   "pid": "t1_div1pgf",
   "date": "2017-06-16 07:40:01",
   "depth": 2,
   "text": "This comment has been removed. Please review for any tags you may have missed and reply to this message to have your post re-approved.\n\nUntagged or improperly tagged spoilers are not allowed.\n\nRepeated violations of this rule will result in a ban.\n\n\n\n---\n^(Have a question or think this removal was an error?) [^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)\n^(Don't know the rules? Read them )[^(here)](/r/anime/wiki/rules)^."
  },
  {
   "score": 1,
   "id": "diwi03x",
   "pid": "t1_div1pgf",
   "date": "2017-06-14 11:11:43",
   "depth": 2,
   "text": "wait so glen died at vol 8?"
  },
  {
   "score": 1,
   "id": "diwqm1x",
   "pid": "t1_diwi03x",
   "date": "2017-06-14 13:44:44",
   "depth": 3,
   "text": "idk"
  },
  {
   "score": 16,
   "id": "divdzwo",
   "pid": "t1_diumdv5",
   "date": "2017-06-13 18:05:48",
   "depth": 1,
   "text": "That's what I thought at first."
  },
  {
   "score": 1,
   "id": "diw8xoh",
   "pid": "t1_divdzwo",
   "date": "2017-06-14 08:38:31",
   "depth": 2,
   "text": "Same :D until Glenn said Tulpas."
  },
  {
   "score": 98,
   "id": "diue4og",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:14:17",
   "depth": 0,
   "text": "[club cant even handle me right now](https://gyazo.com/3bea980cfdf467ce87ca251496abae13)\n\n[best worst influence 2017](https://gyazo.com/5207dd1fd10363b8457249adc88d69e4)"
  },
  {
   "score": 1,
   "id": "diyfkon",
   "pid": "t1_diue4og",
   "date": "2017-06-15 13:56:46",
   "depth": 1,
   "text": "The fact that Re=L didn't even touch them. She just juked the hell out of them and waited for them to dip."
  },
  {
   "score": 3,
   "id": "diurpa5",
   "pid": "t1_diue4og",
   "date": "2017-06-13 11:11:11",
   "depth": 1,
   "text": "I feel like Glenn could have just sent Re=L in to solo a bunch of students."
  },
  {
   "score": 1,
   "id": "dj06i1a",
   "pid": "t1_diurpa5",
   "date": "2017-06-16 15:27:53",
   "depth": 2,
   "text": "But then the rest of his class wouldn't have been given a valuable learning experience.  \n[](#nicoisdone)"
  },
  {
   "score": 4,
   "id": "divgvc3",
   "pid": "t1_diue4og",
   "date": "2017-06-13 19:07:27",
   "depth": 1,
   "text": "Man this gif just shows that re=l has such a nice slim waist."
  },
  {
   "score": 6,
   "id": "diupqla",
   "pid": "t1_diue4og",
   "date": "2017-06-13 10:37:29",
   "depth": 1,
   "text": "Just when Glenn was saying there're no heroes on the battlefield, he's got his best Hero Unit on the field."
  },
  {
   "score": 1,
   "id": "dj06gla",
   "pid": "t1_diupqla",
   "date": "2017-06-16 15:27:01",
   "depth": 2,
   "text": "Well he wasn't exactly acting heroically.  \n[](#nicoisdone)"
  },
  {
   "score": 14,
   "id": "divj68t",
   "pid": "t1_diue4og",
   "date": "2017-06-13 19:58:39",
   "depth": 1,
   "text": "Why do people use these piece of shit websites?"
  },
  {
   "score": -2,
   "id": "diwz5w6",
   "pid": "t1_divj68t",
   "date": "2017-06-14 16:31:03",
   "depth": 2,
   "text": "who the hell cares, just enjoy the gif smh"
  },
  {
   "score": 5,
   "id": "dix13j0",
   "pid": "t1_diwz5w6",
   "date": "2017-06-14 17:12:50",
   "depth": 3,
   "text": "Dude I have 1000/1000 fiber, still takes two minutes to load."
  },
  {
   "score": -3,
   "id": "dix3m6b",
   "pid": "t1_dix13j0",
   "date": "2017-06-14 18:09:35",
   "depth": 4,
   "text": "sounds like a personal problem my dude, loaded instantly for me :shrug:"
  },
  {
   "score": 3,
   "id": "diwbu8n",
   "pid": "t1_divj68t",
   "date": "2017-06-14 09:27:31",
   "depth": 2,
   "text": "probably same reason people use something other than myanimelist."
  },
  {
   "score": 36,
   "id": "diugsi9",
   "pid": "t1_diue4og",
   "date": "2017-06-13 08:04:40",
   "depth": 1,
   "text": "Obligatory [Gifsound](https://gifsound.com/?mp4=https://i.gyazo.com/3bea980cfdf467ce87ca251496abae13&v=GoCOg8ZzUfg&s=19)"
  },
  {
   "score": 3,
   "id": "diwzapv",
   "pid": "t1_diugsi9",
   "date": "2017-06-14 16:33:53",
   "depth": 2,
   "text": "Legen wait for it DARY"
  },
  {
   "score": 48,
   "id": "diudqse",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:06:29",
   "depth": 0,
   "text": "DANG IT. I was really looking forward to seeing more of Glenns flashback with Sera during this episode but because of pacing issues it was just summarized instead :/"
  },
  {
   "score": 54,
   "id": "diug422",
   "pid": "t1_diudqse",
   "date": "2017-06-13 07:52:12",
   "depth": 1,
   "text": ">  but because of pacing issues\n\nThese 5 volumes could have been adapted into a great 2-cour anime..."
  },
  {
   "score": 11,
   "id": "diuk38a",
   "pid": "t1_diug422",
   "date": "2017-06-13 09:03:17",
   "depth": 2,
   "text": "They could have but that would mean investing more money in the adaptation and everyone knows that's not a good idea... God I hate these committees."
  },
  {
   "score": 34,
   "id": "diukpa9",
   "pid": "t1_diuk38a",
   "date": "2017-06-13 09:13:48",
   "depth": 3,
   "text": "That is not just it though. Let's say, instead of making a rushed adaptation, you make a good-paced 1 cour anime instead. Same amount of money is invested. A 1:1 adaptation is made. This wouldn't bring in as much profit as making a rushed adaption. That is because when the adaptation is somewhat rushed and skips a lot of content, people will start reading the novels from the beginning. While if you had made a 1:1 adaptation, consumers would start reading where the anime left off. As a LN reader myself this is something that I can relate too. When I watched the second season of SAO, and found out it was an accurate adaptation, I just continued reading where the anime left off(volume 9). But that wasn't the case for let's say \"High School DxD\" which was a pretty shitty adaptation so I started reading from volume 1. \n\n Making a 1:1 adaptation is only great idea if you are planing to make a complete adaptation. "
  },
  {
   "score": 1,
   "id": "diuzvqo",
   "pid": "t1_diukpa9",
   "date": "2017-06-13 13:25:27",
   "depth": 4,
   "text": "> \"High School DxD\" which was a pretty shitty adaptation so I started reading from volume 1.\n\nI started High School DxD at the weekend (now at episode 5), and I already read that somewhere else (what you wrote). Should I stop at some point watching the anime and start with the LN from the beginning, because the differences are too big or does it only rush throw it - if it changes plot points later on, it could lead to some confused moments, I guess.\n\nsome tips ?\n\nEDIT: I would so or so start from the beginning, like I read 13 volumes of Index before jumping in the new part"
  },
  {
   "score": 0,
   "id": "div0iwp",
   "pid": "t1_diuzvqo",
   "date": "2017-06-13 13:35:40",
   "depth": 5,
   "text": "There are some minor changes early on but it goes totally original in season 3. So pretty much one of the worst adaptations I have seen. Also it is never a good idea to jump from anime anime to the light novel.\n\nMy tips would be to read the LN up to volume 2 and then watch season 1. Then read from volume 3-7(I think) and watch the seasons 2 and 3. By that point you will be addicted and read the rest as well. "
  },
  {
   "score": 1,
   "id": "div1d9l",
   "pid": "t1_div0iwp",
   "date": "2017-06-13 13:49:25",
   "depth": 6,
   "text": "First of all, thanks for the tips, good to know that the third season is original, important when I want to go into the books\n\n> Also it is never a good idea to jump from anime anime to the light novel.\n\nI tried both, this season I read many things beforehand (akashic, SukaSuka, Clockwork, Eromanga, Zero) and I also jumped from anime to LN (Danmachi, Oregairu, Index, Monogatari, Hyouka, and more) and I can't deny nor confirm that. It is nice to have more knowledge about character and world beforehand (LN -> anime), but it is also nice to have some overview and design before going into the slower version (anime -> LN).\n\nI don't want to have an argument here, except you want to explain your viewpoint to me, I would like to read it.\n\nBecause I read right now Index and I have to read 25 volumes ( around 2 months), I have not the time to read DxD, but only to watch it, so I can't follow your tip, but of course, I thank you very much for your information."
  },
  {
   "score": 1,
   "id": "div1yom",
   "pid": "t1_div1d9l",
   "date": "2017-06-13 13:59:26",
   "depth": 7,
   "text": "> I don't want to have an argument here, except you want to explain your viewpoint to me, I would like to read it.\n\nWell, I always look for the best version of a story. Be it a VN, LN, manga or anime. And 99% of the time the best version is the source material. The manga adaptation of Code Geass original anime wasn't as great as the anime. The anime adaptation of Steins;Gate VN isn't as great as the VN. I try to find the best version of the story and consume it that way. Then go ahead and watch/read the other, less-canon versions.\n\nMost light novel adaptations are quite rushed and skip a lot so it is 9 of 10 times not a good idea to jump from one to the other if you really want to enjoy the story. But if you don't have time to read, then you can go with the fastest way of consuming a story although there is no guarantee it is the best version. It also depends how much time it takes you to finish a volume. Finishing 6 episodes of High School DXD takes about 2 hours while finishing 1 volume of the LN which corresponds to those 6 episodes takes double that time."
  },
  {
   "score": 1,
   "id": "diwgbzh",
   "pid": "t1_div1d9l",
   "date": "2017-06-14 10:43:03",
   "depth": 7,
   "text": "Just to clarify, S3 of DxD is not entirely original. First 2/3s of the show scrambles the source material and moves events around. The last third is anime original with some pieces of source material thrown in. Either way S3 was a disappointment so I'd recommend the light novels instead. If you have any more questions you should visit /r/HighschoolDxD.  "
  },
  {
   "score": 49,
   "id": "diupkjh",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 10:34:39",
   "depth": 0,
   "text": "I guess r/FuckLeos is the new /r/fuckslaine. In fact, they even share the same VA.\n\nPoor Sistine, the last few minutes feels like the bad ending of an NTR plot.\n\nRumia is truly an angel, as she saw through Glenn's jackass-facade and made Sistine realize Glenn was really protecting her."
  },
  {
   "score": 1,
   "id": "divnozh",
   "pid": "t1_diupkjh",
   "date": "2017-06-13 21:53:55",
   "depth": 1,
   "text": "Funny enough, last year we had /r/FuckJuzoSakakura, and it goes from \"Fuck you you piece of shit\" to \"Beautiful Cinnamon Roll Too Good For This World, Too Pure\" in 11 episodes."
  },
  {
   "score": 1,
   "id": "divmheo",
   "pid": "t1_diupkjh",
   "date": "2017-06-13 21:20:34",
   "depth": 1,
   "text": "I don't believe this anime is nearly as popular as A.Z was."
  },
  {
   "score": 6,
   "id": "divdyo1",
   "pid": "t1_diupkjh",
   "date": "2017-06-13 18:05:02",
   "depth": 1,
   "text": "Rumia is truly best girl. I'm going to miss her Rumia faces."
  },
  {
   "score": 13,
   "id": "div68aa",
   "pid": "t1_diupkjh",
   "date": "2017-06-13 15:20:12",
   "depth": 1,
   "text": "yep /r/fuckleos\n\nRumia is best girl."
  },
  {
   "score": 86,
   "id": "diul5dt",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:21:33",
   "depth": 0,
   "text": "#**NEXT WEEK GLENN WILL BEAT UP LEOS WITH AN AKASHIC RECORD!**\n\nSeriously, I need an Akashic Record at least in the last episode. We still don't know what is one of those things."
  },
  {
   "score": 1,
   "id": "diyzr21",
   "pid": "t1_diul5dt",
   "date": "2017-06-15 21:40:26",
   "depth": 1,
   "text": "> Seriously, I need an Akashic Record at least in the last episode. We still don't know what is one of those things.\n\n? https://en.wikipedia.org/wiki/Akashic_records"
  },
  {
   "score": 4,
   "id": "divlw9m",
   "pid": "t1_diul5dt",
   "date": "2017-06-13 21:04:57",
   "depth": 1,
   "text": "Well... [minor spoiler](/s \"you will definitely find out what one is next episode.\")"
  },
  {
   "score": 14,
   "id": "divf7s7",
   "pid": "t1_diul5dt",
   "date": "2017-06-13 18:31:53",
   "depth": 1,
   "text": "I hope Glenn 0-100 that guy.  He doesn't use that much magic because he ended up hating it, so here's hoping he'll pull some ancient magic shit out of his ass."
  },
  {
   "score": 6,
   "id": "divgpp9",
   "pid": "t1_divf7s7",
   "date": "2017-06-13 19:04:00",
   "depth": 2,
   "text": "I don't think I'd like to see Glenn pull an ancient magic shit out of his ass"
  },
  {
   "score": 150,
   "id": "diumj0z",
   "pid": "t1_diul5dt",
   "date": "2017-06-13 09:44:19",
   "depth": 1,
   "text": "It's simple, they're [a](/s \"hahahahaha\")."
  },
  {
   "score": 3,
   "id": "divkf8l",
   "pid": "t1_diumj0z",
   "date": "2017-06-13 20:27:58",
   "depth": 2,
   "text": "Bastard, take my upvote."
  },
  {
   "score": 3,
   "id": "divkgrz",
   "pid": "t1_divkf8l",
   "date": "2017-06-13 20:28:58",
   "depth": 3,
   "text": "Now I just need to be a magical instructor and I'm practically Glenn Radars."
  },
  {
   "score": 7,
   "id": "diwapzu",
   "pid": "t1_diumj0z",
   "date": "2017-06-14 09:08:42",
   "depth": 2,
   "text": "what's this meme origin ?"
  },
  {
   "score": 14,
   "id": "diwbjun",
   "pid": "t1_diwapzu",
   "date": "2017-06-14 09:22:39",
   "depth": 3,
   "text": "Episode 3 preview."
  },
  {
   "score": 23,
   "id": "diup1gv",
   "pid": "t1_diumj0z",
   "date": "2017-06-13 10:25:37",
   "depth": 2,
   "text": "Here, take this fictional gold."
  },
  {
   "score": 2,
   "id": "diwdqhg",
   "pid": "t1_diup1gv",
   "date": "2017-06-14 09:58:52",
   "depth": 3,
   "text": "thanks"
  },
  {
   "score": 39,
   "id": "diuji0g",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 08:53:08",
   "depth": 0,
   "text": "Since it sounds like we won't get a season 2 or at least not for a long time, i hope the final episode manages to be 10/10 satisfying as i've really enjoyed this show. "
  },
  {
   "score": 16,
   "id": "diuk7ah",
   "pid": "t1_diuji0g",
   "date": "2017-06-13 09:05:17",
   "depth": 1,
   "text": "> i've really enjoyed this show.\n\nDo yourself a favor, go read the LN. This adaptation is very rushed. Fan translations have only done 2 volumes, iirc, though."
  },
  {
   "score": 29,
   "id": "diul0qo",
   "pid": "t1_diuk7ah",
   "date": "2017-06-13 09:19:22",
   "depth": 2,
   "text": "Sadly i can't get too into reading LNs online. They seem to be never finished and i don't want to get too into it and then have to wait years for the rest. I usually search for LN summaries instead of each volume (did it most recently with How to raise a boring girlfriend) but i can't find any on this one. "
  },
  {
   "score": 1,
   "id": "divjhly",
   "pid": "t1_diul0qo",
   "date": "2017-06-13 20:05:56",
   "depth": 3,
   "text": "[I'd recommend reading the translated manga!](http://mangabom.com/manga/roku_de_nashi_majutsu_koushi_to_kinki_kyouten), as that is being actively done and is a lot less work to translate for them. It's also fine to read some of it now, because the anime is ahead of it in terms of the main plot. \n\nIt has some great chapters which weren't adapted in the anime at all and does into a lot more detail about explaining how magic works, and how Glenn is actually a really smart fighter.\n\nI'm with you on LNs though, the translate pace is way too slow in general."
  },
  {
   "score": 14,
   "id": "divjcla",
   "pid": "t1_diul0qo",
   "date": "2017-06-13 20:02:40",
   "depth": 3,
   "text": "Lol, try reading manga.\n\nTwenty pages a month for seven years.\n\nAnd the series climaxes in the last three chapters."
  },
  {
   "score": 68,
   "id": "diufoir",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:44:12",
   "depth": 0,
   "text": "[Glenn needs to protect this smile](http://imgur.com/a/gQqJd)"
  },
  {
   "score": 8,
   "id": "divgwzp",
   "pid": "t1_diufoir",
   "date": "2017-06-13 19:08:26",
   "depth": 1,
   "text": "Needs more jpeg."
  },
  {
   "score": 23,
   "id": "div6uwq",
   "pid": "t1_diufoir",
   "date": "2017-06-13 15:33:02",
   "depth": 1,
   "text": "holy jpeg"
  },
  {
   "score": 113,
   "id": "diuxvjn",
   "pid": "t1_diufoir",
   "date": "2017-06-13 12:53:04",
   "depth": 1,
   "text": "Well, [it sure as hell didn't work out last time](http://i.imgur.com/2INvnDi.png)"
  },
  {
   "score": 7,
   "id": "diwt7ua",
   "pid": "t1_diuxvjn",
   "date": "2017-06-14 14:32:09",
   "depth": 2,
   "text": "damn"
  },
  {
   "score": 14,
   "id": "diwdsg5",
   "pid": "t1_diuxvjn",
   "date": "2017-06-14 09:59:46",
   "depth": 2,
   "text": "[](#sadholo)"
  },
  {
   "score": 35,
   "id": "diuf9ua",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:36:32",
   "depth": 0,
   "text": "For one second I thought this was the last episode.\nThat would have been a weird ending..."
  },
  {
   "score": 33,
   "id": "diw2393",
   "pid": "t1_diuf9ua",
   "date": "2017-06-14 06:28:59",
   "depth": 1,
   "text": "Leos beat the shit out of Glenn and Glenn was never seen again\n\nthe end"
  },
  {
   "score": 29,
   "id": "div6qvv",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 15:30:43",
   "depth": 0,
   "text": "Theory: The blondie fuckboy teacher is sniffing hardcore on that Angel's Dust and Glenn realized that after seeing that Tulpas thingie."
  },
  {
   "score": 1,
   "id": "divljep",
   "pid": "t1_div6qvv",
   "date": "2017-06-13 20:55:37",
   "depth": 1,
   "text": "If you think back to earlier episodes, you might be able to work out what is happening."
  },
  {
   "score": 5,
   "id": "divej5q",
   "pid": "t1_div6qvv",
   "date": "2017-06-13 18:17:13",
   "depth": 1,
   "text": "Alternatively, that Tulpas thingie was sprinkled with the stuff and Glenn was ordered to let himself be beaten, walk away and never come back / have fun with top hat guy. Not sure which one makes more sense."
  },
  {
   "score": 12,
   "id": "divdi4c",
   "pid": "t1_div6qvv",
   "date": "2017-06-13 17:55:17",
   "depth": 1,
   "text": "That makes a lot of sense actually. I noticed the bags under his eyes and thought that was weird, but didn't really think much more of it after that."
  },
  {
   "score": 17,
   "id": "divn92y",
   "pid": "t1_divdi4c",
   "date": "2017-06-13 21:41:25",
   "depth": 2,
   "text": "And the blondie said those thingies he has \"summoned\" aren't affected by Glenn's Fool's World because it uses some sort of intense *imagination* instead of magic. "
  },
  {
   "score": 6,
   "id": "dj0rssl",
   "pid": "t1_divn92y",
   "date": "2017-06-17 01:56:32",
   "depth": 3,
   "text": "aka he's just really really high on that angels shit"
  },
  {
   "score": 25,
   "id": "divbqrs",
   "pid": "t1_div6qvv",
   "date": "2017-06-13 17:17:11",
   "depth": 1,
   "text": "Also the heavy eyebags in the carriage scene."
  },
  {
   "score": 26,
   "id": "diuglog",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 08:01:10",
   "depth": 0,
   "text": "Leos is the kind of guy whose illusions you want to see destroyed. With a punch. To the face. And a kickass speech to boot. "
  },
  {
   "score": 1,
   "id": "diw73ou",
   "pid": "t1_diuglog",
   "date": "2017-06-14 08:06:36",
   "depth": 1,
   "text": "I'm so glad Touman isn't in this series "
  },
  {
   "score": 4,
   "id": "diw0169",
   "pid": "t1_diuglog",
   "date": "2017-06-14 05:41:13",
   "depth": 1,
   "text": "Was just saying to a friend... I wouldn't even be mad if they just threw out the planned last episode and had Celica dropping mage bombs on him for the full runtime.\n\nFuck that guy."
  },
  {
   "score": 22,
   "id": "diukxv9",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:17:57",
   "depth": 0,
   "text": "Do you guys think Sistine legitly loves Glen? i can see all those scene about Sistine thinking about glen sensei and blushing etc even the kiss scene. Please let me know ur thoughts guys"
  },
  {
   "score": 3,
   "id": "div4ibo",
   "pid": "t1_diukxv9",
   "date": "2017-06-13 14:46:17",
   "depth": 1,
   "text": "My weab senses are weak but I'm pretty sure she loves glen. "
  },
  {
   "score": 9,
   "id": "divkl8f",
   "pid": "t1_diukxv9",
   "date": "2017-06-13 20:31:59",
   "depth": 1,
   "text": "I don't know man we might need more signs to be really sure."
  },
  {
   "score": 20,
   "id": "divpsq1",
   "pid": "t1_divkl8f",
   "date": "2017-06-13 23:00:33",
   "depth": 2,
   "text": "Yeah you can never really tell with these things. Maybe she's just being nice, maybe she's Canadian. You can't really tell. We should keep looking for more signs."
  },
  {
   "score": 1,
   "id": "dj0sh9w",
   "pid": "t1_divpsq1",
   "date": "2017-06-17 02:31:13",
   "depth": 3,
   "text": "[I understood that reference](http://i.imgur.com/XS5LK.gif)"
  },
  {
   "score": 1,
   "id": "diwi41v",
   "pid": "t1_divpsq1",
   "date": "2017-06-14 11:13:38",
   "depth": 3,
   "text": "yeah true that's because sistine keeps on doubting glen etc . The one i  think truly has feelings for glen atm will be Rumia though she does not show it alot. Just how many times was Rumia rescued by Glen and the promise they made years ago."
  },
  {
   "score": 3,
   "id": "diz2u9d",
   "pid": "t1_divpsq1",
   "date": "2017-06-15 23:21:33",
   "depth": 3,
   "text": "I always appreciate a Casually Explained reference"
  },
  {
   "score": 27,
   "id": "div54lm",
   "pid": "t1_diukxv9",
   "date": "2017-06-13 14:58:10",
   "depth": 1,
   "text": "ofc she has a crush on him but she is the tsundere of the show so she is not going to be honest with it"
  },
  {
   "score": 45,
   "id": "div47qf",
   "pid": "t1_diukxv9",
   "date": "2017-06-13 14:40:37",
   "depth": 1,
   "text": "Obviously"
  },
  {
   "score": 21,
   "id": "diutsbn",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 11:46:41",
   "depth": 0,
   "text": "[THIS SHIP NEEDS TO SET SAIL ALREADY!](http://i.imgur.com/hssJjKy.jpg)"
  },
  {
   "score": 18,
   "id": "diuneg8",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:58:29",
   "depth": 0,
   "text": "wh-where did my happy glen-sensei go\n\nis celica gonna have to kill a bitch?"
  },
  {
   "score": 2,
   "id": "dizfpgu",
   "pid": "t1_diuneg8",
   "date": "2017-06-16 06:58:04",
   "depth": 1,
   "text": "She's gonna have to kill a bitch alright."
  },
  {
   "score": 18,
   "id": "diufmog",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:43:15",
   "depth": 0,
   "text": "I sooo wanted GLenn to kick Leo's ass... This is bad. And I never thought Glenn might just disappear... I hope he's investigating or something and not just running away... That end card.. waga kokoro..."
  },
  {
   "score": 1,
   "id": "divnc1w",
   "pid": "t1_diufmog",
   "date": "2017-06-13 21:43:46",
   "depth": 1,
   "text": "Yea that ending was strangely ominous. I hope \"Glenn never returned to the Academy\" just means he didn't show up that day at all and not that we're going to get a mini-time skip."
  },
  {
   "score": 14,
   "id": "diudr1g",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:06:37",
   "depth": 0,
   "text": "Tense episode. I was kinda having sad feelings after the duel, but then that endcard popped up and made my day"
  },
  {
   "score": 12,
   "id": "diun56t",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:54:20",
   "depth": 0,
   "text": "I get the feeling Glenn's coming back next episode as part of the mage corps again. Probably temporary, but still. Seeing as he's wearing his uniform in the op fighting the top hat dude."
  },
  {
   "score": 15,
   "id": "div17lz",
   "pid": "t1_diun56t",
   "date": "2017-06-13 13:46:45",
   "depth": 1,
   "text": "The OP hinted it.  Extinction ray him to oblivion"
  },
  {
   "score": 11,
   "id": "diuzbdi",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 13:16:10",
   "depth": 0,
   "text": "Feel like Glenn had a plausible reason to leave, but I can't quite exactly pin WHY he'd leave. But from the way the gray-hair dude talk, perhaps they know each other? Maybe he's going after him instead? Rumia said she feels a \"foul\" aura around Leos, so perhaps Glenn recongizes the gray-hair dude power/some form of aura?\n\nI unno, but overall, episode was really good at building everything up, especially the ending. Next episode is gonna be a good and explosive finale, although most likely leave us on some form of cliffhanger."
  },
  {
   "score": 1,
   "id": "divdons",
   "pid": "t1_diuzbdi",
   "date": "2017-06-13 17:59:14",
   "depth": 1,
   "text": "/u/alxusan suggested it could be that Leos is under the effect of the Angel Dust, which makes a lot of sense to me. "
  },
  {
   "score": 20,
   "id": "divbn55",
   "pid": "t1_diuzbdi",
   "date": "2017-06-13 17:15:02",
   "depth": 1,
   "text": "Glenn realized he is losing his touch and went to the mountains to train."
  },
  {
   "score": 1,
   "id": "divo14e",
   "pid": "t1_divbn55",
   "date": "2017-06-13 22:03:39",
   "depth": 2,
   "text": "after that hes gonna get revenged on sissy for calling him fat pig! "
  },
  {
   "score": 11,
   "id": "divc6ac",
   "pid": "t1_divbn55",
   "date": "2017-06-13 17:26:22",
   "depth": 2,
   "text": "Oh...that makes...more sense. A lot more actually."
  },
  {
   "score": 10,
   "id": "divcdwv",
   "pid": "t1_divc6ac",
   "date": "2017-06-13 17:30:56",
   "depth": 3,
   "text": "I may have forgotten the /s"
  },
  {
   "score": 12,
   "id": "divcg0j",
   "pid": "t1_divcdwv",
   "date": "2017-06-13 17:32:10",
   "depth": 4,
   "text": "Oh...that makes a lot more sense too."
  },
  {
   "score": 10,
   "id": "diuh214",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 08:09:31",
   "depth": 0,
   "text": "How does sistine know glenn wore a black trench coat? He's never shown up in one in front of her. "
  },
  {
   "score": 1,
   "id": "dj145fn",
   "pid": "t1_diuh214",
   "date": "2017-06-17 09:07:25",
   "depth": 1,
   "text": "[***IMAGINATION***](http://i.imgur.com/WTpYuL6.png)"
  },
  {
   "score": 10,
   "id": "diuhrq2",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 08:22:20",
   "depth": 0,
   "text": "I need that blonde asshole to be beaten up bad.\n\nGlenn, hurry back and save the day already!"
  },
  {
   "score": 18,
   "id": "diue3vw",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:13:49",
   "depth": 0,
   "text": "I am sad we probably won't see anything of that Sara girl, apparently the source material readers really like her..."
  },
  {
   "score": 9,
   "id": "diuk42t",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:03:41",
   "depth": 0,
   "text": "I want to kick the other teacher in the face for being a dick to Sistine, and this episode was really great! The end-card tho haha, Such a shame next episode is the last one, I really enjoyed watching this series afterwall. Sistine was a really big cutie this episode as well."
  },
  {
   "score": 7,
   "id": "diudvzv",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 07:09:23",
   "depth": 0,
   "text": "The nighttime scene was really melancholic"
  },
  {
   "score": 7,
   "id": "diuupjq",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 12:01:39",
   "depth": 0,
   "text": "Damned!!! When sensei was beaten by leos and he didn't show up for the duel. I was really caught off guard with that.\n\nI hope the last ep will give us a satisfying ending. Maybe he will show us why he is #0 and he is not only depending on the fools card.\n\nI want him to be onii-sama level of OP an beat leos to a pulp...\n"
  },
  {
   "score": 7,
   "id": "divh6zg",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 19:14:26",
   "depth": 0,
   "text": "*record scratch* *freeze frame*\n\n\nAnd that was the last we ever saw of Glenn Radars"
  },
  {
   "score": 7,
   "id": "divsx3x",
   "pid": "t3_6h01o4",
   "date": "2017-06-14 01:03:35",
   "depth": 0,
   "text": "I'm worried how they'll be able to wrap this up with one episode. We have:\n\n-The Mystery of the Angel Dust\n\n-How did Sara die\n\n-What kind of loot is Celica getting by soloing all those dungeons\n\n-Who is Top Hat man\n\n-Leos' asskicking\n\n-What is Eleanor planning to do with the Re=L data\n\nI might have missed a few things, but I'm really not seeing how they can answer *all these questions* in one episode."
  },
  {
   "score": 2,
   "id": "dixn1z8",
   "pid": "t1_divsx3x",
   "date": "2017-06-15 04:40:33",
   "depth": 1,
   "text": "Heh... We'll get Leos' asskicking for sure otherwise it would be too disappointing, and maybe something abut Angel's Dust. I don't expect anything else, which is weird because the OP shows Glenn fighting Top Hat man."
  },
  {
   "score": 7,
   "id": "dixdl1p",
   "pid": "t1_divsx3x",
   "date": "2017-06-14 22:18:50",
   "depth": 1,
   "text": "Answer is they won't."
  },
  {
   "score": 7,
   "id": "diuj75b",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 08:47:50",
   "depth": 0,
   "text": "Is there any hope for season 2 in next few years?"
  },
  {
   "score": 13,
   "id": "diuk5kq",
   "pid": "t1_diuj75b",
   "date": "2017-06-13 09:04:26",
   "depth": 1,
   "text": "There's always hope but this is a pretty bad adaptation, 5 volumes in 12 episodes, and there's only 7 volumes out atm so I doubt it."
  },
  {
   "score": 3,
   "id": "diull1c",
   "pid": "t1_diuk5kq",
   "date": "2017-06-13 09:28:50",
   "depth": 2,
   "text": "So in meybe 3 years we're getting season 2. Hooray, am pumped on it."
  },
  {
   "score": 14,
   "id": "diur66f",
   "pid": "t1_diuk5kq",
   "date": "2017-06-13 11:02:03",
   "depth": 2,
   "text": "Well that's sad. Considering the Anime's pacing honestly felt pretty solid. \n\nWhat was cut can you tell me?"
  },
  {
   "score": 6,
   "id": "diuwouz",
   "pid": "t1_diur66f",
   "date": "2017-06-13 12:34:03",
   "depth": 3,
   "text": "Yeah, that statement struck me as odd. Been having a great time with it. It might not be comprehensive adaptation but maybe it doesn't need to be. The anime works great as a standalone series and it's not as if the manga doesn't exist anymore.   Also the fact we've apparently already covered 5 volumes makes me think that the manga can't have been all that dense to begin with, even if the anime is cutting things out."
  },
  {
   "score": 8,
   "id": "diusw45",
   "pid": "t1_diur66f",
   "date": "2017-06-13 11:31:43",
   "depth": 3,
   "text": "I've only read summaries so I'm not the best to explain this.\n\nBackstory and world building was cut. For example this episode there was \"supposed\" to be a bigger flashback about Sara."
  },
  {
   "score": 1,
   "id": "divmuyn",
   "pid": "t1_diusw45",
   "date": "2017-06-13 21:30:42",
   "depth": 4,
   "text": "Saving for the OVA perhaps."
  },
  {
   "score": 1,
   "id": "div18rx",
   "pid": "t1_diusw45",
   "date": "2017-06-13 13:47:18",
   "depth": 4,
   "text": "where can I read summaries?"
  },
  {
   "score": 1,
   "id": "div4yck",
   "pid": "t1_div18rx",
   "date": "2017-06-13 14:54:49",
   "depth": 5,
   "text": "The ones I've read are from people in /a/ summarizing the volumes. In threads."
  },
  {
   "score": 1,
   "id": "div68dw",
   "pid": "t1_div4yck",
   "date": "2017-06-13 15:20:16",
   "depth": 6,
   "text": "sorry, I'm new to reddit.  what does /a/ mean?  could u tell me where I could find these threads?"
  },
  {
   "score": 3,
   "id": "div7efo",
   "pid": "t1_div68dw",
   "date": "2017-06-13 15:44:27",
   "depth": 7,
   "text": "/a/ is the anime board of 4chan."
  },
  {
   "score": 1,
   "id": "divgg22",
   "pid": "t1_div7efo",
   "date": "2017-06-13 18:58:09",
   "depth": 8,
   "text": "ah thanks.  could u summarize what happens in the next volumes for me?"
  },
  {
   "score": 7,
   "id": "divimvg",
   "pid": "t1_div18rx",
   "date": "2017-06-13 19:46:28",
   "depth": 5,
   "text": "Found it. Spoiler warning for the last episode obviously.\n\n[Part 1.](http://i.4cdn.org/a/1496744238337.jpg)\n\n[Part 2.](http://i.4cdn.org/a/1496744302239.jpg)"
  },
  {
   "score": 1,
   "id": "divjyk2",
   "pid": "t1_divimvg",
   "date": "2017-06-13 20:16:56",
   "depth": 6,
   "text": "Are there any more stuff like this for the later Light Novels?"
  },
  {
   "score": 1,
   "id": "divj4ri",
   "pid": "t1_divimvg",
   "date": "2017-06-13 19:57:42",
   "depth": 6,
   "text": "Thank you so so so so so much!"
  },
  {
   "score": 4,
   "id": "divjlze",
   "pid": "t1_divimvg",
   "date": "2017-06-13 20:08:41",
   "depth": 6,
   "text": "I just ruined the next episode for myself.\n\nWell I was going g to team the LNs anyway."
  },
  {
   "score": 14,
   "id": "diusrke",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 11:29:34",
   "depth": 0,
   "text": " [Re=L continues to hold best girl title](https://media.giphy.com/media/kKsy4J9uFCs0M/giphy.gif)"
  },
  {
   "score": 1,
   "id": "diwgjsi",
   "pid": "t1_diusrke",
   "date": "2017-06-14 10:46:49",
   "depth": 1,
   "text": "She lost it after literally backstabbing Glenn and kidnapping Rumia to be tortured."
  },
  {
   "score": 19,
   "id": "divdwab",
   "pid": "t1_diusrke",
   "date": "2017-06-13 18:03:37",
   "depth": 1,
   "text": "I'm sorry sir, but that title belongs to Best Girl Rumia for being an A+ Wing Woman, and also the cutest to boot."
  },
  {
   "score": 5,
   "id": "diuk3x9",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:03:37",
   "depth": 0,
   "text": "I swear I thought this was a 2 cour\n"
  },
  {
   "score": 4,
   "id": "div0qtx",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 13:39:14",
   "depth": 0,
   "text": "Wait what !? What was this ?  \nThe next episode is the last one and this felt so rushed..  \nLIke what ? He doesn't go to the duel and they don't see him after that ?  \nMan what is going on.. I don't feel like I am ready for this to end :/  \nThat ending will have to be 10/10 or this will be painfull..."
  },
  {
   "score": 3,
   "id": "divdkp9",
   "pid": "t1_div0qtx",
   "date": "2017-06-13 17:56:52",
   "depth": 1,
   "text": "I'll bet he knew at that point that he wouldn't be able to win anyways, so he's doing something else. Probably related to the Angel Dust."
  },
  {
   "score": 11,
   "id": "diuv334",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 12:07:53",
   "depth": 0,
   "text": "I think the Damsel in Distress for every conflict in this show is getting really old"
  },
  {
   "score": 1,
   "id": "divdu3l",
   "pid": "t1_diuv334",
   "date": "2017-06-13 18:02:22",
   "depth": 1,
   "text": "I kind of have to agree, but at the same time it does make a bit of sense. Glenn's a teacher, not an adventurer, police or military guy (well not anymore), so his only focus is going to be the safety of his kids.\n\nGranted, they could have done it without​ the girls literally getting kidnapped. Like maybe the his students could be in a general state of danger or distress caused by the bad guys."
  },
  {
   "score": 1,
   "id": "dj359wm",
   "pid": "t1_divdu3l",
   "date": "2017-06-18 17:56:30",
   "depth": 2,
   "text": "That scene in E2 still haunts me for the way it was executed."
  },
  {
   "score": 5,
   "id": "dixdhp7",
   "pid": "t3_6h01o4",
   "date": "2017-06-14 22:15:54",
   "depth": 0,
   "text": "> anime finishes in 1 more episode\n\n> tons of things need to be explained in the next episode and that probably won't happen\n\n> light novel translations only go up to LN 2\n\n:( sad times"
  },
  {
   "score": 3,
   "id": "divhy1q",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 19:31:09",
   "depth": 0,
   "text": "Everyone's all \"Sisti's best girl!, but this episode just continues to remind me why I dislike her so much. "
  },
  {
   "score": 3,
   "id": "divke01",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 20:27:09",
   "depth": 0,
   "text": "I thought this episode was pretty lame, which is unfortunate because I have enjoyed the last several. The while mage corps battle felt cliche to me and while I'm glad that Leos ended up having a more serious and forbodding motivation than Sistine being kawaii, I have trouble taking him seriously (maybe its the monocle?) I also think the introduction of tulpas or whatever this new kind of summoning is pretty stupid because it feels like it was pulled from no where specifically to negate Glenn's OP abiity. I hope the season finale ends on a good note.\n"
  },
  {
   "score": -1,
   "id": "divrr29",
   "pid": "t1_divke01",
   "date": "2017-06-14 00:13:55",
   "depth": 1,
   "text": "Just like every other part of this series... it felt rushed. I assumed the entire episode would be dedicated to the duel."
  },
  {
   "score": 2,
   "id": "div3d46",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 14:24:30",
   "depth": 0,
   "text": "Can't wait for Glenn to kick Leos' ass into next week. Seriously fuck that guy"
  },
  {
   "score": 5,
   "id": "diunk0v",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 10:00:59",
   "depth": 0,
   "text": "Did I just watch a brutal parody of Irregular at Magic High? "
  },
  {
   "score": 1,
   "id": "diukxir",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:17:46",
   "depth": 0,
   "text": "Damn when Leos strted saying \"Fools Glenn Radars\" it got pretty intense, I cant wait for that last episode but at the same time I'm sad that it will be the last :c"
  },
  {
   "score": 1,
   "id": "diulo5y",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 09:30:15",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 2,
   "id": "diuosyg",
   "pid": "t1_diulo5y",
   "date": "2017-06-13 10:21:38",
   "depth": 1,
   "text": "currently Glenn is facing Re-L in manga. They just found out that Riel is Re-Life."
  },
  {
   "score": 1,
   "id": "diuvvwb",
   "pid": "t1_diuosyg",
   "date": "2017-06-13 12:21:00",
   "depth": 2,
   "text": "is it the ln that is far ahead then? like 8th volume or something, re-l thing is in the 5th right"
  },
  {
   "score": 5,
   "id": "diumhna",
   "pid": "t1_diulo5y",
   "date": "2017-06-13 09:43:41",
   "depth": 1,
   "text": "the anime exceeds the manga pace atm\n"
  },
  {
   "score": 1,
   "id": "diupzc8",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 10:41:38",
   "depth": 0,
   "text": "Never shows up?! I still don't like the pacing but I hope this has an epic ending"
  },
  {
   "score": 1,
   "id": "div0i0c",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 13:35:16",
   "depth": 0,
   "text": "The way sistine waked and was zoomed in, made me think of that berserk post "
  },
  {
   "score": 1,
   "id": "divbjj7",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 17:12:48",
   "depth": 0,
   "text": "Live the show, but one problem I have, and this is with many other shows of this nature. \n\nWhy go through all this interesting and detailed world and character building, only to flood the episodes with information we don't need, and only to release 12 episodes. \n\nI love the show, and I'm not saying that there is stuff that should be taken out, but it happens with all harem like shows, and I've jus realised now and it's irritating "
  },
  {
   "score": 3,
   "id": "diw65e0",
   "pid": "t1_divbjj7",
   "date": "2017-06-14 07:49:32",
   "depth": 1,
   "text": "> only to release 12 episodes.\n\nfor the most part, anime are made to promote the original source material, be it a manga, a light novel, etc. In fact, the original source material author usually does not get any profits from the anime at all- they only get increased attention to their original source work. So this is why we have so many anime that don't get an S2, end at weird points, etc. "
  },
  {
   "score": 1,
   "id": "diw7u2p",
   "pid": "t1_diw65e0",
   "date": "2017-06-14 08:19:40",
   "depth": 2,
   "text": "Honestly it sucks to read that"
  },
  {
   "score": 3,
   "id": "divcd48",
   "pid": "t1_divbjj7",
   "date": "2017-06-13 17:30:27",
   "depth": 1,
   "text": "That's simply because most anime shows are basically promotion for the source material."
  },
  {
   "score": 2,
   "id": "divd8ar",
   "pid": "t1_divcd48",
   "date": "2017-06-13 17:49:25",
   "depth": 2,
   "text": "Well there's a massive TIL"
  },
  {
   "score": 5,
   "id": "divdn0t",
   "pid": "t1_divd8ar",
   "date": "2017-06-13 17:58:15",
   "depth": 3,
   "text": "These days most anime aren't based on manga anymore.\nIt's quite sad. I can't speak japanese at all and am therefore unable to continue with the series in many cases since novels barely get translated and if they do with massive delays."
  },
  {
   "score": 1,
   "id": "divg0h8",
   "pid": "t1_divdn0t",
   "date": "2017-06-13 18:48:56",
   "depth": 4,
   "text": "I haven't even read a manga page yet"
  },
  {
   "score": 5,
   "id": "divgc31",
   "pid": "t1_divbjj7",
   "date": "2017-06-13 18:55:50",
   "depth": 1,
   "text": "> interesting and detailed world\n\nI like the world as much as you probably do, but I wouldn't say it's detailed at all. Everything specific to this show (as opposed to generic stuff like enchants, magic circles, alchemy, the concept of a magic academy and battle mages, etc) is mostly a name with no explanation. We don't know anything about original magic, we don't know anything about the castle in the sky, we don't know anything about Rumia's condition, we don't know anything about the organizations and their history...\n\nFeels more like a tease, which might be why you feel like they focus on the wrong things (I do as well). Otherwise, what would you say is good world building in this show?"
  },
  {
   "score": 2,
   "id": "divgy3s",
   "pid": "t1_divgc31",
   "date": "2017-06-13 19:09:06",
   "depth": 2,
   "text": "I always though good world building was the set up or tease like things you mentioned. Am I wrong? "
  },
  {
   "score": 1,
   "id": "diw23pt",
   "pid": "t1_divgy3s",
   "date": "2017-06-14 06:29:14",
   "depth": 3,
   "text": "World building means actually building the world.  Not merely referencing that the world exists and \"read the LN to find out more!\""
  },
  {
   "score": 2,
   "id": "divhs3n",
   "pid": "t1_divgy3s",
   "date": "2017-06-13 19:27:26",
   "depth": 3,
   "text": "Teasing stuff is fine, but if it's never expanded upon you get a bare bones generic world with a lot of hooks that lead nowhere."
  },
  {
   "score": 1,
   "id": "divcmpz",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 17:36:13",
   "depth": 0,
   "text": "You know, I was really hoping to see Glenn's past this episode. With him doing some good ol' killing with all the hints of how infamous he was as a mage killer. I think that would've been badass. Not even gon' lie, I wouldn't mind having OVA's or a short series on Glenn's past as the mage assassin, Glenn the Fool."
  },
  {
   "score": 1,
   "id": "dive8o5",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 18:11:02",
   "depth": 0,
   "text": "It's pretty refreshing to see an arc where Rumia doesn't get kidnapped or taken hostage."
  },
  {
   "score": 1,
   "id": "dj6edx2",
   "pid": "t1_dive8o5",
   "date": "2017-06-20 17:01:27",
   "depth": 1,
   "text": "I mean...sure...but it is also an arc where Sisti is being forced into marriage against her will."
  },
  {
   "score": 1,
   "id": "divkp2e",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 20:34:37",
   "depth": 0,
   "text": "Well Leos rose through my hit list REAL quick. Damn wonder why Glenn didn't show up. Does he feel embarrassed Sistine will know about his past or he genuinely believes he can't win? Either way I hope Leos gets his shit fucked up.\n\nWell these end cards never disappoint ( ͡° ͜ʖ ͡°) Sistine the real MVP."
  },
  {
   "score": 1,
   "id": "divlpgg",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 21:00:01",
   "depth": 0,
   "text": "Well the end is nigh. I'm going to miss this series purely only for the main cast. I realized the author is great at making characters that aren't villains. Every villain we've faced so far have been pretty... bad, like cliche/stereo typically evil. None of them so far have had an interesting personality or a real interesting motive. It's all been \"Haha, I'm killing everyone because I want more power to kill people haha\"\n\nGreat protags, boring villains. But the protags are awesome and that's why I watch this show"
  },
  {
   "score": 1,
   "id": "divmgxd",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 21:20:13",
   "depth": 0,
   "text": "Giving up being a hero of justice for waifu, the Emiya we need but not the Emiya we deserve."
  },
  {
   "score": 1,
   "id": "divmu2o",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 21:30:01",
   "depth": 0,
   "text": "Wouldn't it be cool if he came up with a spell which puts the angel dust in the opponent's body into overdrive, making him explode that much quicker?"
  },
  {
   "score": 1,
   "id": "divv80l",
   "pid": "t3_6h01o4",
   "date": "2017-06-14 02:51:00",
   "depth": 0,
   "text": "has anyone else noticed that the art got better this episode?"
  },
  {
   "score": 1,
   "id": "divxg8v",
   "pid": "t3_6h01o4",
   "date": "2017-06-14 04:24:27",
   "depth": 0,
   "text": "Shippers might be shipping Shironeko X Glenn but between Re=L stabbing Glenn through the back and Shironeko constantly misunderstanding Glenn's intentions, I'd say Rumia is best girl (despite being the Mary Jane Watson of the anime)"
  },
  {
   "score": 1,
   "id": "diw48b8",
   "pid": "t3_6h01o4",
   "date": "2017-06-14 07:13:06",
   "depth": 0,
   "text": "Honestly it looks like the next episode will end on a good note. Not sure why Glenn didn't show up to battle Leos, but I hate to wait to see what happens next. I also wonder why Celica doesn't step in to stop some of the things happening. Most if the time it looks like she really isn't doing anything. "
  },
  {
   "score": 1,
   "id": "diw918j",
   "pid": "t3_6h01o4",
   "date": "2017-06-14 08:40:11",
   "depth": 0,
   "text": "Obviously Glen is gonna troll all of them "
  },
  {
   "score": 1,
   "id": "diwvx2p",
   "pid": "t3_6h01o4",
   "date": "2017-06-14 15:24:18",
   "depth": 0,
   "text": "Damn good episode all the way around. 9/10. "
  },
  {
   "score": 1,
   "id": "diz5sse",
   "pid": "t3_6h01o4",
   "date": "2017-06-16 01:24:03",
   "depth": 0,
   "text": "So maybe someone can help me out a little bit, I know I'm late to the party for this weeks episode.\n\nMost of the baddies in the series so far have at least recognized Glenn and some have even openly feared him as soon as they realized who he was. So why isn't he way more badass than he is in the show? I feel like an assassin would be way more skilled than Glenn is, and most of the situations where he is in trouble were easily avoidable and seems to be just an excuse for a fanservice style rescue from Sisti. \n\nHe just seems so incapable for someone who is constantly hinted as being a badass. I feel like the show would be loads better if he had a two forms kind of badassery and baffoon in the way Vash from Trigun did. The way he is in the show comes off as annoying more often than amazing. This episode just sort of reinforces that for me even more.\n\nIs his portrayal different in the Manga?\n\nWhat are you guys thoughts?"
  },
  {
   "score": 1,
   "id": "dj6h9mx",
   "pid": "t3_6h01o4",
   "date": "2017-06-20 17:58:59",
   "depth": 0,
   "text": "[This show in a nutshell](http://imgur.com/a/W3FPd)."
  },
  {
   "score": 1,
   "id": "divibd2",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 19:39:21",
   "depth": 0,
   "text": "Bless Rumia savior of shitty harem battle animes.\n\nThis angel needs to be in every shitty harem battle anime to save them from being cast into the Hell of Mediocrity"
  },
  {
   "score": 0,
   "id": "diuptlz",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 10:38:55",
   "depth": 0,
   "text": "[removed]"
  },
  {
   "score": 0,
   "id": "div14wb",
   "pid": "t1_diuptlz",
   "date": "2017-06-13 13:45:28",
   "depth": 1,
   "text": "WHAT HAPPENS!??!"
  },
  {
   "score": 1,
   "id": "div8qf1",
   "pid": "t1_diuptlz",
   "date": "2017-06-13 16:12:48",
   "depth": 1,
   "text": "This comment has been removed.\n\n- This comment has been reported as containing untagged spoilers. Please review for any tags you may have missed and reply to this message to have your post re-approved.\n\n  Self and link posts should be properly spoiler-tagged and should include the name(s) of the show(s) referenced in the title. Self posts may opt to tag spoilers in the self post instead. (Using the same format as comment spoilers below)\n\n  Comments should use `[spoiler source](/s \"spoiler-chan died\")` to protect spoilers. Spoiler source should, at a minimum, contain the relevant source of the spoiler (e.g. One Piece episode 200, or if it's from a different medium, LN/Manga/VN). Spoiler source is only required in the first of any set of spoilers for the same source and is not required in a discussion thread while discussing that thread's series.\n\n\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^."
  },
  {
   "score": 1,
   "id": "div6lfv",
   "pid": "t1_diuptlz",
   "date": "2017-06-13 15:27:40",
   "depth": 1,
   "text": "Oh no, sealed power cliche, I gotta read this now, NEED TRANSLATIONS.\n\n"
  },
  {
   "score": -3,
   "id": "divh2em",
   "pid": "t3_6h01o4",
   "date": "2017-06-13 19:11:41",
   "depth": 0,
   "text": "\"I'm not an object!\" *Proceeds to not have any personality* I can't stand Sistine.\n\nBut you can't blame her, that bastard teacher (lol) actually was way different than the one she met years ago, it could be some kind of mind control? Or is he just sick of power? I'm curious.\n\nBack to the beginning, even Megane-kun has more personality than her! Now that I think about it, it's like most harem female protagonists... \n\nAnyway, I'm so far in this ride I won't be getting out now. It still gives me some laughs about how obvious everything seems... Waiting for next episode!"
  },
  {
   "score": 2,
   "id": "dj6eg8m",
   "pid": "t1_divh2em",
   "date": "2017-06-20 17:02:41",
   "depth": 1,
   "text": "> \"I'm not an object!\" Proceeds to not have any personality I can't stand Sistine.\n\nMore like, immediately proceeds to have Glenn shove her face out of the way to stop her from talking. Like, god damn show. I know you have zero respect for your female characters, but having your main protagonist be the one who tells them to stfu and be objects is kinda shitty."
  }
 ]
}