{
 "score": 396,
 "id": "63t3vo",
 "num_comments": 217,
 "date": "2017-04-06 07:04:13",
 "comments": [
  {
   "score": 106,
   "id": "dfwsn8z",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 07:53:42",
   "depth": 0,
   "text": "I'm impressed. Just over two minutes into the show and it throws us straight into the action, and the story held my attention all the way to the end. There's still a lot of questions to be answered but it's a good start. The animation wasn't bad either, it reminded me of Bubuki Buranki."
  },
  {
   "score": 21,
   "id": "dfxiacp",
   "pid": "t1_dfwsn8z",
   "date": "2017-04-06 15:40:17",
   "depth": 1,
   "text": "After disaster premieres like Clockwork Planet and Sakurada Reset I am so happy this happened."
  },
  {
   "score": 4,
   "id": "dfy9znm",
   "pid": "t1_dfxiacp",
   "date": "2017-04-07 05:23:48",
   "depth": 2,
   "text": "What's wrong with Clockwork Planet? Haven't watched that. Sakurada Reset was just damn boring. Damnit David Productions."
  },
  {
   "score": 4,
   "id": "dfz9ao5",
   "pid": "t1_dfy9znm",
   "date": "2017-04-07 17:12:38",
   "depth": 3,
   "text": "I actually really liked the Reset episode."
  },
  {
   "score": 1,
   "id": "dfzm1o7",
   "pid": "t1_dfz9ao5",
   "date": "2017-04-07 23:24:31",
   "depth": 4,
   "text": "I actually agree with both you and Cybersteel here."
  },
  {
   "score": 8,
   "id": "dfz7xwo",
   "pid": "t1_dfy9znm",
   "date": "2017-04-07 16:39:42",
   "depth": 3,
   "text": "This is all my opinion, but Clockwork Planet was all that I dislike about shounen. Ecchi whory females, retarded MC, cliché side characters, Peasant MC is \"chosen\", no real world building or character development besides viewer catering is done. Am i soon done? I could go on all day man. Qualidea Code was the exact same. I cringed all the way through first episode man."
  },
  {
   "score": 5,
   "id": "dg385ha",
   "pid": "t1_dfz7xwo",
   "date": "2017-04-10 13:32:15",
   "depth": 4,
   "text": "Damn... thanks for saving me 24 minutes of my life!"
  },
  {
   "score": 8,
   "id": "dfzp5pi",
   "pid": "t1_dfz7xwo",
   "date": "2017-04-08 01:58:30",
   "depth": 4,
   "text": "Qualidea Code was salvaged halfway at least. Though the quality dropped a lot from that point."
  },
  {
   "score": 29,
   "id": "dfxifd2",
   "pid": "t1_dfwsn8z",
   "date": "2017-04-06 15:43:21",
   "depth": 1,
   "text": "I wish more people would embrace 3D hybrid animation like BBK/BRNK"
  },
  {
   "score": 18,
   "id": "dfyfglf",
   "pid": "t1_dfxifd2",
   "date": "2017-04-07 07:29:29",
   "depth": 2,
   "text": "Honestly episode 0 of this show was 2D and felt soooo much better to watch for me. 3D felt right for somethings but for the whole ep it felt off."
  },
  {
   "score": 36,
   "id": "dfy09du",
   "pid": "t1_dfxifd2",
   "date": "2017-04-06 22:31:28",
   "depth": 2,
   "text": "I loved Ajin, and Seikaisuru Kado visually felt SOOOO much better in this first episode. The blend was very satisfying because I noticed the CGI, but it still felt like anime."
  },
  {
   "score": 7,
   "id": "dfzaq2z",
   "pid": "t1_dfy09du",
   "date": "2017-04-07 17:47:28",
   "depth": 3,
   "text": "This was me. At some points I was questioning myself as to if it was CGI or not. Finally looked after the episode and was pleasantly surprised. "
  },
  {
   "score": 12,
   "id": "dfy15rw",
   "pid": "t1_dfy09du",
   "date": "2017-04-06 23:03:15",
   "depth": 3,
   "text": "Agreed, Toei Animation did a better job (or perhaps, improved upon) what Polygon's been doing with Sidonia and Ajin. I liked both of those shows, but this one takes everything to the next level with the character design and animation."
  },
  {
   "score": 126,
   "id": "dfwv32y",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:37:45",
   "depth": 0,
   "text": "Holy hell, that was great! It felt like a big-budget Hollywood SciFi movie with the orchestral soundtrack, military involvement and scientific aspect, but was actually more interesting than most of those I've seen! I was on the edge of my seat for the entirety of the episode as they were slowly researching the cube. I loved how they used actual realistic methods that totally felt scientifically accurate and logical course of action. Stuff like checking for Doppler or IR and targeting the wall's corner were interesting and felt realistic. The CG didn't even look that bad and the directing of the series felt very spielberg-ish and kept me interested throughout. This was one of the most interesting pilots I've seen over the past few series and I was thrilled throughout. I absolutely can't wait to see how this continues, but so far I'm absolutely amazed and intrigued."
  },
  {
   "score": 5,
   "id": "dfxhyfz",
   "pid": "t1_dfwv32y",
   "date": "2017-04-06 15:33:00",
   "depth": 1,
   "text": "It reminds me of some of the sense of spectacle of sci-fi and war that Evangelion and Knights of Sidonia brought to the table. Especially with the disaster level catastrophe that's already happening this episode."
  },
  {
   "score": 35,
   "id": "dfxl2lh",
   "pid": "t1_dfwv32y",
   "date": "2017-04-06 16:41:05",
   "depth": 1,
   "text": "It reminded me a lot of Arrival, with the premise of a huge otherworldly thing showing up and all these government organisations running around trying to figure out what the hell to do about it."
  },
  {
   "score": 4,
   "id": "dfzm5v3",
   "pid": "t1_dfxl2lh",
   "date": "2017-04-07 23:29:24",
   "depth": 2,
   "text": "Yes! Exactly! That's all I can think about when watching."
  },
  {
   "score": 17,
   "id": "dfxy3tb",
   "pid": "t1_dfxl2lh",
   "date": "2017-04-06 21:26:35",
   "depth": 2,
   "text": "Kind of a trope for scifi, really, but executed quite well here."
  },
  {
   "score": 8,
   "id": "dg8l9vp",
   "pid": "t1_dfxy3tb",
   "date": "2017-04-13 18:55:46",
   "depth": 3,
   "text": "If you haven't seen Arrival and you're liking Kado, I'd recommend it. Arrival is a lot more about linguistics but has some really cool sci-fi elements I don't want to spoil."
  },
  {
   "score": 7,
   "id": "dfydf86",
   "pid": "t1_dfxy3tb",
   "date": "2017-04-07 06:49:22",
   "depth": 3,
   "text": "still better than genocided aliens of misunderstanding eachothers until extinsion."
  },
  {
   "score": 47,
   "id": "dfx42pf",
   "pid": "t1_dfwv32y",
   "date": "2017-04-06 11:12:06",
   "depth": 1,
   "text": "Toei originally planned for this to be a movie. So no surprise there."
  },
  {
   "score": 40,
   "id": "dfwwomt",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:05:46",
   "depth": 0,
   "text": "cgi look pretty good look like they use 3d for main/side character and 2d for background character ,i must say it blend in quite well \n\ncgi also look better than polygon (ajin) i think.. \n\nfor story it pretty interesthing definitely continue watching."
  },
  {
   "score": 68,
   "id": "dfwtvjl",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:16:18",
   "depth": 0,
   "text": "This seems extremely promising. Very interesting first episode, extremely good soundtrack and voice acting and very fluid CGI.\n\nNow I just got to hope it delivers."
  },
  {
   "score": 18,
   "id": "dfx75ba",
   "pid": "t1_dfwtvjl",
   "date": "2017-04-06 12:06:24",
   "depth": 1,
   "text": "oooohhh it's CGI? now I know why it looks like it's missing some inter frames when the characters are moving... but for CGI looks really really good"
  },
  {
   "score": 8,
   "id": "dfxhzrg",
   "pid": "t1_dfx75ba",
   "date": "2017-04-06 15:33:49",
   "depth": 2,
   "text": "Yeah, it's a pretty impressive imitation of 2D visuals. Reminds me a little of Exiled From Paradise"
  },
  {
   "score": 8,
   "id": "dfxxdmv",
   "pid": "t1_dfx75ba",
   "date": "2017-04-06 21:07:23",
   "depth": 2,
   "text": "Yeah, I'm not really sure why they don't just up it to 60 frames or something. I mean it obviously doesn't look like 2D motions at 30 frames like they're trying to do so why stick to it?"
  },
  {
   "score": 3,
   "id": "dfyjqtt",
   "pid": "t1_dfxxdmv",
   "date": "2017-04-07 08:47:03",
   "depth": 3,
   "text": "tv broadcasting does not support 60fps does it? As far as I remember it's up to 30"
  },
  {
   "score": 6,
   "id": "dfy17s9",
   "pid": "t1_dfxxdmv",
   "date": "2017-04-06 23:05:23",
   "depth": 3,
   "text": "Who knows, but I really hope more Anime studios experiment more with CGI. It could end up being a great thing if used properly."
  },
  {
   "score": 29,
   "id": "dfwrv1y",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 07:39:11",
   "depth": 0,
   "text": "Welp. This was unexpected. At least I wasn't thinking a multidimensional cube would appear somewhere and inglobe our MC(s). Still, Assistant's screams gave me... some weird feelings. Like, how he screamed \"Shindoo-san\" and clinging to him gave me an impression of Yaoi somehow.\n\nWell, nice to see how everyone in the airport didn't panic and was filming/taking pictures of what was happening. Though a woman was worried for her ice-scream.\n\nMC seems important. All these (side) characters calling his name.\n\nI like your spirit curious young-glassed-twin-tails researcher. I also like their approach to this situation and how they react to it. It reminds me of Gate: thus the JSDF fought there. Oh, talking of the Devil, maybe Itami's there too cursing for not being able to go to Comitek?\n\nGod is here! Damn you Sonzai X! You messing with us in another anime?\n\nOh! Shindo-kun! And ... God?!^SONZAI ^X!! Yaka-san, you remind me of Merlin from Fate/GO.\n\nSeems interesting for now.\n\nOh, yeah. The CGI isn't that bad."
  },
  {
   "score": 1,
   "id": "dfyv3l1",
   "pid": "t1_dfwrv1y",
   "date": "2017-04-07 12:09:48",
   "depth": 1,
   "text": "> ice-scream  \n\nI know it's a typo but it was hilarious to me. \"I'm just ice and I cannot scream!\"  \nI loved the detail though, it gives a rather slow episode some character."
  },
  {
   "score": 3,
   "id": "dfz3pjy",
   "pid": "t1_dfyv3l1",
   "date": "2017-04-07 15:00:31",
   "depth": 2,
   "text": "Hou, I didn't even notice I had just quoted a favourite anime of mine. Watched Hyouka yet? (this isn't spoiler right?) Well, you better do soon."
  },
  {
   "score": 3,
   "id": "dfxytvl",
   "pid": "t1_dfwrv1y",
   "date": "2017-04-06 21:46:44",
   "depth": 1,
   "text": "> Yaka-san, you remind me of Merlin from Fate/GO\n\nthe reason I picked this anime up but holy hell I never expected this"
  },
  {
   "score": 1,
   "id": "dfya3un",
   "pid": "t1_dfxytvl",
   "date": "2017-04-07 05:27:18",
   "depth": 2,
   "text": "[Garden of Avalon!](https://youtu.be/8c84YSFbVqQ?t=17s)  \n\nLooks like he stopped being a NEET."
  },
  {
   "score": 3,
   "id": "dfwrwrz",
   "pid": "t1_dfwrv1y",
   "date": "2017-04-06 07:40:07",
   "depth": 1,
   "text": "Btw, nice ED song."
  },
  {
   "score": 30,
   "id": "dfx61cd",
   "pid": "t1_dfwrv1y",
   "date": "2017-04-06 11:46:37",
   "depth": 1,
   "text": "I also felt the yaoi feels. Mostly from Episode 0 though where it looks like they live together."
  },
  {
   "score": 29,
   "id": "dfxpbg9",
   "pid": "t1_dfx61cd",
   "date": "2017-04-06 18:14:57",
   "depth": 2,
   "text": "and how he takes off his pal's pants ( ͡° ͜ʖ ͡°)"
  },
  {
   "score": 16,
   "id": "dfzmd3d",
   "pid": "t1_dfxpbg9",
   "date": "2017-04-07 23:37:57",
   "depth": 3,
   "text": "Don't forget the piggyback ride home."
  },
  {
   "score": 34,
   "id": "dfxammg",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 13:08:40",
   "depth": 0,
   "text": "Holy fuck. That was amazing. Serious ''Arrival'' vibes. \n\nThat was on some epic scale.\n\nPeople might miss out hard if they don't watch cause of CGI. "
  },
  {
   "score": 12,
   "id": "dfxha68",
   "pid": "t1_dfxammg",
   "date": "2017-04-06 15:18:33",
   "depth": 1,
   "text": "Ohhhhh that's what it reminded me of! I kept thinking it was really familiar, but didn't connect it to Arrival. Hope this will be just as good, or better"
  },
  {
   "score": 87,
   "id": "dfwvbq0",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:41:59",
   "depth": 0,
   "text": "The episode itself was pretty interesting, even if that girl \"doctor\" was annoying as fuck.\n\nToei: *This anime is to show up our great CGI expertise!* Immediately procedes to create an anime with above average 2D designs and animation and totally average CG. Good job, Toei! "
  },
  {
   "score": 11,
   "id": "dfwz8qn",
   "pid": "t1_dfwvbq0",
   "date": "2017-04-06 09:49:37",
   "depth": 1,
   "text": "[Toei's CG team is probably the best in the industry.](https://www.youtube.com/watch?v=3i-sUSQoRjs) Too bad this show doesn't have Gatyapen as CG Director."
  },
  {
   "score": 6,
   "id": "dfxhuma",
   "pid": "t1_dfwz8qn",
   "date": "2017-04-06 15:30:45",
   "depth": 2,
   "text": "Precure gets all the CGI budgets!"
  },
  {
   "score": 6,
   "id": "dfx05r8",
   "pid": "t1_dfwz8qn",
   "date": "2017-04-06 10:05:05",
   "depth": 2,
   "text": "I know! They, Orange, and Yamato Works are the only ones capable of doing *not shit looking* CG animation. \n\nThe one on this show is not really bad, but is average at best. \n\nEdit: adding Yamato Works that I somehow forgot."
  },
  {
   "score": 2,
   "id": "dfx7a5l",
   "pid": "t1_dfx05r8",
   "date": "2017-04-06 12:08:47",
   "depth": 3,
   "text": "Digital Frontier has also done amazing CG work. Mostly in movies, but the upcoming Infini-T Force looks great."
  },
  {
   "score": 62,
   "id": "dfxh6oi",
   "pid": "t1_dfwvbq0",
   "date": "2017-04-06 15:16:26",
   "depth": 1,
   "text": "Really? The over exited professor girl was my favourite"
  },
  {
   "score": 7,
   "id": "dg08b39",
   "pid": "t1_dfxh6oi",
   "date": "2017-04-08 12:11:06",
   "depth": 2,
   "text": "She annoys me too, but I also *usually* would be all over her.\n\nThe problem is they establish all those serious, normal, and realistic characters (especially if you watch episode 0 like I did). Then I have to agree she stick out like sore thumb and is just annoying.\n\nCrazy Scientist work best in a bit surreal environment like Bleach, or Lelouch Rebellion. Everything besides the Cube so far has been hyper-realistic so she stands out that much more and is annoying through it."
  },
  {
   "score": 3,
   "id": "dg8le41",
   "pid": "t1_dg08b39",
   "date": "2017-04-13 18:58:30",
   "depth": 3,
   "text": "I didn't realize episode 0 was episode 0 and was really taken aback by the amount of time they were spending on just like, real world politics for an episode one."
  },
  {
   "score": 108,
   "id": "dfxhce7",
   "pid": "t1_dfxh6oi",
   "date": "2017-04-06 15:19:54",
   "depth": 2,
   "text": "I hated her because she sticks up like a sore thumb. She clashes wildly with the rest of the setting.  "
  },
  {
   "score": 2,
   "id": "dfy60pz",
   "pid": "t1_dfxhce7",
   "date": "2017-04-07 02:43:26",
   "depth": 3,
   "text": "That is the thing that annoyed me, she really does not fit the setting at all.  Besides that, the show is excellent."
  },
  {
   "score": 3,
   "id": "dg7l4lj",
   "pid": "t1_dfxhce7",
   "date": "2017-04-13 07:07:05",
   "depth": 3,
   "text": "She's an anime character in the real world. Everything is going exactly how you expect it would in real life except for her. "
  },
  {
   "score": 5,
   "id": "dfydkd9",
   "pid": "t1_dfxhce7",
   "date": "2017-04-07 06:52:22",
   "depth": 3,
   "text": "Yeah, it give the vibe that she wasn't on the original story but the producers put her because it wasn't \"anime\" enought.\n\nShe even have a quirk object, a fucking magnetic Slate."
  },
  {
   "score": 9,
   "id": "dfydxu5",
   "pid": "t1_dfydkd9",
   "date": "2017-04-07 06:59:50",
   "depth": 4,
   "text": "She does seem like the kind of character a producer would shoehorn to *push sales* or whatever other thing will help them to earn more profit."
  },
  {
   "score": 7,
   "id": "dfy9acx",
   "pid": "t1_dfxhce7",
   "date": "2017-04-07 05:01:44",
   "depth": 3,
   "text": "She sticks out, but it also gives some life in the characters. Besides Shindo and Hanamori (absent for most of the episode), the rest of the cast is a bit boring."
  },
  {
   "score": 3,
   "id": "dg7l81m",
   "pid": "t1_dfy9acx",
   "date": "2017-04-13 07:09:04",
   "depth": 4,
   "text": "The premise is the star though. Real people don't have wacky personalities that allow you to categorize them within minutes of meeting them. The premise can really shine when people just act like people. \n\nA lot of the joy of Star Trek was just watching smart people be smart. "
  },
  {
   "score": 13,
   "id": "dfycnlj",
   "pid": "t1_dfy9acx",
   "date": "2017-04-07 06:32:41",
   "depth": 4,
   "text": "I'd take a somber and *boring* character any day over a walking cliché one regardless of how much *life* they could bring with them.\n\nMy problems lie in how cliché she was, and how her presentation made her totally incompatible with the rest of the cast."
  },
  {
   "score": 5,
   "id": "dfzmbwy",
   "pid": "t1_dfycnlj",
   "date": "2017-04-07 23:36:32",
   "depth": 5,
   "text": "My concerns were similar to yours but honestly she grew on me over time. I actually enjoyed the way when she was talking it was closer to mumbling to herself than out to the politicians. (At first I thought it was bad VA). As for sticking out, I think considering the nature of this series that *will* come up as a point of conflict. Old overly-cautious politicians vs young and curious scientist. Hopefully that makes her character worth it.\n"
  },
  {
   "score": 61,
   "id": "dfxjo5k",
   "pid": "t1_dfxhce7",
   "date": "2017-04-06 16:10:42",
   "depth": 3,
   "text": "I agree, there's no way that a group of seemingly very important people would take anyone seriously who behaves like that. And for starters why the hell would they need a theoretical physicist to examine that cube and the girl didn't even do theoretical physics! The army should have had a team of highly accomplished engineers and experimental physicists for these situations so it is just bad writing to use this annoying girl out of nowhere and it really breaks the suspension of disbelief for me every time she opens her mouth. "
  },
  {
   "score": 17,
   "id": "dfyg0vr",
   "pid": "t1_dfxjo5k",
   "date": "2017-04-07 07:40:05",
   "depth": 4,
   "text": "She's the assistant to a guy who in episode 0 is set up to be one of the top physicists in the country whom was called in largely because he was helping Shindo create a supermetal worth billions. \n\n>there's no way that a group of seemingly very important people would take anyone seriously who behaves like that\n\nYou're seriously underestimating the mystique that both science and geniuses hold. A lot of high-level physicists are odd ducks and everyone puts up with them because they assume you have to be weird to be so smart (plus a lot of people see science as damn near next to magic). If she was the official head of the team it's completely different but for all intents and purposes she acts as a consultant so it makes sense they would put up with her for the time being."
  },
  {
   "score": 44,
   "id": "dfxku9u",
   "pid": "t1_dfxjo5k",
   "date": "2017-04-06 16:36:04",
   "depth": 4,
   "text": "Yeah, it's just forcing a stupid cliché into the series the *hot and eccentric genius female scientist*.\n\nNo one but the *weird* girl not noticing the fact that the plane wasn't crushed by the cube was stupid too. I mean, the event was filmed by who knows how many people. It should have been common knowledge by the time the meeting actually took place."
  },
  {
   "score": 10,
   "id": "dfxy7jp",
   "pid": "t1_dfxku9u",
   "date": "2017-04-06 21:29:26",
   "depth": 5,
   "text": "She was a little over the top to start, but I think she has potential. This seems like a show that'll pay attention to character development (since they bothered with episode 0)."
  },
  {
   "score": 11,
   "id": "dfxn9kk",
   "pid": "t1_dfxku9u",
   "date": "2017-04-06 17:29:13",
   "depth": 5,
   "text": "Well I mean if I saw a huge cube coming down on a plane in an airport, I would assume it's crushed, like who has the time to think \"Maybe it's not crushed.\", bitch the whole plane is covered up by the fucking cube. If they're not dead yet, they'll die by whatever is in it. Remember that everyone in that room that has authority on decisions probably doesn't a degree in theoretical physics. They probably have a theoretical degree in physics."
  },
  {
   "score": 1,
   "id": "dfyfk04",
   "pid": "t1_dfxn9kk",
   "date": "2017-04-07 07:31:17",
   "depth": 6,
   "text": "But it's a magic cube, no one knows what's in it."
  },
  {
   "score": 21,
   "id": "dfxnpqq",
   "pid": "t1_dfxn9kk",
   "date": "2017-04-06 17:39:22",
   "depth": 6,
   "text": "Again, people were filming the thing. It's beyond silly to show us that only that chick decided to zoom the video and check if the plane was crushed or that someone else pointing it out never uploaded a video to Internet. You also have countless of eyewitnesses who would tell you about not hearing any explosion. \n\nYou will probably need a degree on physics to explain *why* the plane wasn't crushed but that doesn't mean that anyone with access to a video of the event couldn't notice the plane not exploding or receiving any damage."
  },
  {
   "score": 11,
   "id": "dfxr1w3",
   "pid": "t1_dfxnpqq",
   "date": "2017-04-06 18:50:46",
   "depth": 7,
   "text": "Lore established: The show's politicians are not physicists."
  },
  {
   "score": 20,
   "id": "dfy0fll",
   "pid": "t1_dfxnpqq",
   "date": "2017-04-06 22:37:21",
   "depth": 7,
   "text": "Even if it weren't crushed, though, it's a reasonable assumption that the plane was destroyed. It looks like it gets straight up deleted from the top down."
  },
  {
   "score": 20,
   "id": "dfxa2ae",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 12:58:25",
   "depth": 0,
   "text": "[Some shots of all the red eye sides on all the main characters](http://imgur.com/a/SPpKl). I'm interested in hearing the reason they did that, especially since none of the tertiary people (like the prime minister??) have it."
  },
  {
   "score": 4,
   "id": "dgovpwg",
   "pid": "t1_dfxa2ae",
   "date": "2017-04-24 10:18:31",
   "depth": 1,
   "text": "Well [Saekano did this](http://i.imgur.com/UWxazlZ.jpg) with female characters. I guess it's one way of prettifying the characters. I'm guessing guys are the main focus of this show, who are designed prettier."
  },
  {
   "score": 4,
   "id": "dg08nmj",
   "pid": "t1_dfxa2ae",
   "date": "2017-04-08 12:19:34",
   "depth": 1,
   "text": "That's an odd detail I noticed too. The first scene was the funniest.\n\nWait... why is a guy in a serious governmental job wearing red eyeliner?\n\nWhy is that other guy wearing red eyeliner too?\n\nOh god, it's one of those weird stylistic choices without any real reason, isn't it? It's disappearing glasses and fences from Your Lie In April all over again, or the \"drunks nose\" from March Comes In Like A Lion."
  },
  {
   "score": 12,
   "id": "dfxifg1",
   "pid": "t1_dfxa2ae",
   "date": "2017-04-06 15:43:24",
   "depth": 1,
   "text": "I didnt notice the minor characters didn't have it. Good catch, though maybe it's just to add more \"detail\" to the main cast, similar to how main cast usually have better cloth or more detailed iris"
  },
  {
   "score": 19,
   "id": "dfwuekc",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:25:38",
   "depth": 0,
   "text": "Went into this blind and it was a pretty good first episode. The story seems interesting and the CGI was well done. It'll be interesting to see where this goes."
  },
  {
   "score": 17,
   "id": "dfwxf5f",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:18:28",
   "depth": 0,
   "text": "Well, I really liked this! This was (inexplicably) the show I was most looking forward to this season, so I'm glad that the pilot at least seems to be meeting my unreasonably high expectations. It was downright fascinating.\n\nI *loved* the score. Absolutely beautiful orchestral music that sounded a bit out-of-place in an anime, but that's appropriate given the tone of the entire episode. It felt more like a Hollywood film or a prestige scifi miniseries than an anime.\n\nLooking forward to seeing where this goes."
  },
  {
   "score": 6,
   "id": "dfyb264",
   "pid": "t1_dfwxf5f",
   "date": "2017-04-07 05:53:46",
   "depth": 1,
   "text": "I agree. I picked this up only after reading the description on MAL (after watching the weirdness that was Clockwork Planet). No regrets so far, story got me hooked from the first minute.\n\nReally love the orchestral music too, it's was mildly surprising to hear that rather than your typical anime op/ed styles. It gives it a very ... 'big' feeling. Not quite sure how to describe it."
  },
  {
   "score": 16,
   "id": "dfwwk4d",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:03:34",
   "depth": 0,
   "text": "CGI is good but it just annoys me how random it is. Sometimes it's there, sometimes it's not and episode 0 had CGI only from when they arrived at the airport. Like, the fuck?\n\nStory is very interesting however. Will definitely keep up with this for a while.\n\nAlso, Hanamori? Anybody? He was also there."
  },
  {
   "score": 5,
   "id": "dfzpenp",
   "pid": "t1_dfwwk4d",
   "date": "2017-04-08 02:12:53",
   "depth": 1,
   "text": "I was also really confused at the inconsistency of it, the cgi is basically a carbon copy of ajiin style (which was acceptable) but showing us all of episode 0 in cgi/anime hybrid glory and then pushing pure cgi in main series seems cruel :("
  },
  {
   "score": 6,
   "id": "dfzpm0c",
   "pid": "t1_dfzpenp",
   "date": "2017-04-08 02:24:35",
   "depth": 2,
   "text": "Episode 1 still had a lot of 2D. Combining both at random ass times is just weird."
  },
  {
   "score": 13,
   "id": "dfwv9pl",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:41:00",
   "depth": 0,
   "text": "I'm really liking that sci-fi mystery feel so far. It reminds me of Independance Day, in a good way. The CGI is also pretty good, although the fact that it is only used sometimes is a little weird. I also like the ED, it fits really well.\n\nNo one could have predicted the appearance of loli-sensei, though. Give me a spook, I'll tell you"
  },
  {
   "score": 18,
   "id": "dfwshlq",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 07:50:52",
   "depth": 0,
   "text": "So, I'm seeing episode 0 and episode 1 of this series. What's episode 0?"
  },
  {
   "score": 44,
   "id": "dfwsvhc",
   "pid": "t1_dfwshlq",
   "date": "2017-04-06 07:57:52",
   "depth": 1,
   "text": "The first 20 minutes or so of episode 0 introduce the main character (what's his day job and how he's the best negotiator out there). The last 3 minutes of episode 0 is the same as the start of episode 1. Basically, episode 0 is background info on the main character."
  },
  {
   "score": 2,
   "id": "dfwtcog",
   "pid": "t1_dfwsvhc",
   "date": "2017-04-06 08:06:44",
   "depth": 2,
   "text": "I see, so it's okay to skim through it a bit? Nothing vital to miss?"
  },
  {
   "score": 3,
   "id": "dfwxa1q",
   "pid": "t1_dfwtcog",
   "date": "2017-04-06 09:16:04",
   "depth": 3,
   "text": "You'll also get the OP, which I don't think were in episode 1. "
  },
  {
   "score": 5,
   "id": "dfwtfs0",
   "pid": "t1_dfwtcog",
   "date": "2017-04-06 08:08:20",
   "depth": 3,
   "text": "Skimming through episode 0 should be fine."
  },
  {
   "score": 12,
   "id": "dfxjcda",
   "pid": "t1_dfwtcog",
   "date": "2017-04-06 16:03:40",
   "depth": 3,
   "text": "I thought episode 0 was the better of the two episodes tbh."
  },
  {
   "score": 14,
   "id": "dfxbgch",
   "pid": "t1_dfwtcog",
   "date": "2017-04-06 13:23:41",
   "depth": 3,
   "text": "I found it entertaining to watch and it introduced the main character pretty well. "
  },
  {
   "score": 19,
   "id": "dfwvb7w",
   "pid": "t1_dfwtcog",
   "date": "2017-04-06 08:41:44",
   "depth": 3,
   "text": "It introduces a few of the characters that appear in episode 1 including the MC, though, so I'd recommend watching it. Should be fine to watch after episode 1 though"
  },
  {
   "score": 29,
   "id": "dfxi8e5",
   "pid": "t1_dfwsvhc",
   "date": "2017-04-06 15:39:02",
   "depth": 2,
   "text": "I just watched episode 0 without knowing what I was getting into.\n\nI did not expect the last 3 minutes."
  },
  {
   "score": 11,
   "id": "dfya0k3",
   "pid": "t1_dfxi8e5",
   "date": "2017-04-07 05:24:32",
   "depth": 3,
   "text": "Man I wanted a slice of life anime of your typical government negotiator."
  },
  {
   "score": 3,
   "id": "dfyefd3",
   "pid": "t1_dfya0k3",
   "date": "2017-04-07 07:09:36",
   "depth": 4,
   "text": "Yeah, is it weird that I enjoyed that part more than the CGI ridden episode that came after it?"
  },
  {
   "score": 12,
   "id": "dfyfiwq",
   "pid": "t1_dfyefd3",
   "date": "2017-04-07 07:30:42",
   "depth": 5,
   "text": "We just want a salaryman anime where the salaryman does salaryman thing without magic or him being a psychopath."
  },
  {
   "score": 2,
   "id": "dgz8kie",
   "pid": "t1_dfyfiwq",
   "date": "2017-05-01 01:38:18",
   "depth": 6,
   "text": "Late, but try https://myanimelist.net/anime/1592/Hataraki_Man"
  },
  {
   "score": 26,
   "id": "dfxmsjt",
   "pid": "t1_dfxi8e5",
   "date": "2017-04-06 17:18:57",
   "depth": 3,
   "text": "I did the same thing.\n\n\nWatched episode 0 without reading the anime description.  \nI thought it was going to be a relaxed show about business and negotiations."
  },
  {
   "score": 23,
   "id": "dfxrfhi",
   "pid": "t1_dfxmsjt",
   "date": "2017-04-06 18:58:16",
   "depth": 4,
   "text": "Same -- thought it was going to be about a super genius negotiator doing various jobs, and I was actually fine with that.  Then bam, here's some sci-fi/fantasy thrown into the mix.\n\nI should watch more shows without reading the synopsis."
  },
  {
   "score": 6,
   "id": "dfya10x",
   "pid": "t1_dfxrfhi",
   "date": "2017-04-07 05:24:55",
   "depth": 5,
   "text": "Gakkou Gurashi was one of them."
  },
  {
   "score": 9,
   "id": "dfwt3qu",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:02:08",
   "depth": 0,
   "text": "For 20 minutes I thought this was 2017's Fune wo Amu, but that caught me off guard. "
  },
  {
   "score": 10,
   "id": "dfwwmbp",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:04:38",
   "depth": 0,
   "text": "The CGI style reminds me of Bubuki Buranki and the 3DS Fire Emblem games, which I like."
  },
  {
   "score": 7,
   "id": "dfxfivs",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 14:42:06",
   "depth": 0,
   "text": "Okay I really like this show, sure the 3d is a little weird sometimes but overall it seems like something I am really going to enjoy. Finally a smart character who isn't an asshole, also more shows with adults wooo! \n\nThat song in the ED is awesome. "
  },
  {
   "score": 16,
   "id": "dfxad78",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 13:03:52",
   "depth": 0,
   "text": "why everyone hates the doctor girl? she reminds me that girl who loves titans in AoT(forgot her name) imo she is decent character anime would be boring without her\n\n"
  },
  {
   "score": 1,
   "id": "dfy9env",
   "pid": "t1_dfxad78",
   "date": "2017-04-07 05:05:40",
   "depth": 1,
   "text": "I understand the reasons people hate her, she looks way more cliché and unnatural than the other characters. Though personally I don't think it's a bad thing, as you said she's putting some life in the show.\n\n[Loved the part where she's playing with the drones.](https://i.imgur.com/M9hjEvx.jpg)"
  },
  {
   "score": 30,
   "id": "dfxgz0b",
   "pid": "t1_dfxad78",
   "date": "2017-04-06 15:11:53",
   "depth": 1,
   "text": "She is like a bright pink spot in the corner off a freshly white painted wall. It just doesn't fit and really stands out. "
  },
  {
   "score": 8,
   "id": "dfxh8ur",
   "pid": "t1_dfxgz0b",
   "date": "2017-04-06 15:17:45",
   "depth": 2,
   "text": "so she makes bland wall colorful? whats not to love"
  },
  {
   "score": 8,
   "id": "dfyfq2f",
   "pid": "t1_dfxh8ur",
   "date": "2017-04-07 07:34:31",
   "depth": 3,
   "text": "I like my walls to be clean."
  },
  {
   "score": 17,
   "id": "dfxhi33",
   "pid": "t1_dfxh8ur",
   "date": "2017-04-06 15:23:15",
   "depth": 3,
   "text": "The standing out part. It's like Mickey and Donald in Game of Thrones. Not that I wouldn't watch that, but only if that is the focus of the show."
  },
  {
   "score": 12,
   "id": "dfy0wn3",
   "pid": "t1_dfxh8ur",
   "date": "2017-04-06 22:53:54",
   "depth": 3,
   "text": "That's an odd way of thinking about it.\n\nI'm pretty sure most people would find that r/mildyinfuriating\n\nLike you got this nice clean room and someone spills a tad on it. Annoying as fuck"
  },
  {
   "score": 24,
   "id": "dfx1cvp",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 10:25:36",
   "depth": 0,
   "text": "I'm glad there are plenty of people defending the CGI. In my eyes, they did a very good job with it. 3D animation for anime style is something Japanese had to do all by themselves with very little time on their hands in general. Just remember they don't make millions of dollars like US movies so even their equipment could be somewhat inferior.\n\nBut even then, I can't really imagine anime in 3D to look better than this."
  },
  {
   "score": 1,
   "id": "dfzpdyf",
   "pid": "t1_dfx1cvp",
   "date": "2017-04-08 02:11:43",
   "depth": 1,
   "text": "I agree. This is one of the better CGI anime along with Knights of Sidonia & others in my opinion."
  },
  {
   "score": 9,
   "id": "dfxh5zd",
   "pid": "t1_dfx1cvp",
   "date": "2017-04-06 15:16:01",
   "depth": 1,
   "text": "This is the first time I've actively enjoyed 3D CGI in anime. The style is appealing, the animation is smooth, and all of the effects regarding the cube were just gorgeous.\n\n(Good job, Toei!)"
  },
  {
   "score": 6,
   "id": "dfxcwk4",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 13:50:21",
   "depth": 0,
   "text": "Welp. 120mm APFSDS < Magic Space Cube. I like how their response is just \"SHOOT IT WITH A TANK\" when drones and construction equipment don't work. \n\nSo far, this is reminding me of GATE, but with less Nippon-Banzai-flag-wank. Which is a good thing. "
  },
  {
   "score": 6,
   "id": "dfy6q2p",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 03:18:33",
   "depth": 0,
   "text": "I'm going to be honest, the scientist girl felt like a bit of a slap in the face. But I think that's what they were going for. A bunch of serious politicians just had a depressing moment where they took in the deaths of so many people. It felt heavy, and you could feel their grief. Everyone's wearing darker colours and have darker hair, adding to the dreary atmosphere. But then-BAM! Bright science girl comes in, with bright hair, lighter clothing, and a bright pink tablet-like device, and dissipates the dark atmosphere with some hope that they're alive. It brings some light and hope to a seemingly dark and hopeless moment, so naturally her being bright and colourful and energetic compared to the dreary colours and attitudes of the politicians makes perfect sense to me. \nSo saying she doesn't fit, I don't think is entirely right. She fits, just in her own way."
  },
  {
   "score": 1,
   "id": "dfy9rrg",
   "pid": "t1_dfy6q2p",
   "date": "2017-04-07 05:17:10",
   "depth": 1,
   "text": "No one died yet."
  },
  {
   "score": 3,
   "id": "dgowb29",
   "pid": "t1_dfy6q2p",
   "date": "2017-04-24 10:28:54",
   "depth": 1,
   "text": "I Think they were trying too hard with her. \"Quirky scientist\" must be some kind of trope. I mean she even entered in SLIPPERS. I'd say she's way more quirky than she needs to be, and way more than believable."
  },
  {
   "score": 4,
   "id": "dfzmmcq",
   "pid": "t1_dfy6q2p",
   "date": "2017-04-07 23:49:15",
   "depth": 1,
   "text": "This is how I saw it in the end. She's an active contrasting figure to the typical stuff. She might be an imperfect character but she needs to be there."
  },
  {
   "score": 8,
   "id": "dfyhc5k",
   "pid": "t1_dfy6q2p",
   "date": "2017-04-07 08:04:04",
   "depth": 1,
   "text": "I honestly thought she was kind of annoying. This is just ep 1, though. Let's see how it goes."
  },
  {
   "score": 6,
   "id": "dfydsw5",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 06:57:09",
   "depth": 0,
   "text": "CGI was strange, I preferred the original animation in ep0"
  },
  {
   "score": 6,
   "id": "dfww07q",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:53:57",
   "depth": 0,
   "text": "This was quite interesting and not just because I'm curious about that huge cube...and Takkun's alien character...even though I am curious about both >.<\n\nCGI didn't seem distracting, if anything I'd say it was fitting considering the show and the huge cube stuff happening. Music was quite nice, too, so curious to listen to more of the OST.\n\n[Kugimiya Rie's scientist](http://i.imgur.com/Ns6EVNP.jpg) reminded me a bit of her role in Punch Line. She seems like a fun character though I think [someone else ended up catching my interest](http://i.imgur.com/ANWAX7a.jpg). There isn't much info on most of the characters yet so I'm still just curious about everyone but I like Yahakui's design at least. Him and Shindou-kun seem to have made some arrangement probably, so looking forward to the next episode!\n\n"
  },
  {
   "score": 6,
   "id": "dfx0rwl",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 10:15:45",
   "depth": 0,
   "text": "Who knew Toei and Pierrot would have some of the more engaging first episodes this season?"
  },
  {
   "score": 4,
   "id": "dfwyoku",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:40:05",
   "depth": 0,
   "text": "The CGI was quite good. Don't know if it's because I've lowered the bar after Berserk or what but it felt pretty fluid and the models were pretty good. There were some parts where it had some fps issues but well, can't have everything.\n\nThe entire episode looked pretty good overall and the story was very interesting. Now this could go to shit very quickly or be one of my top anime of the season. I'm hyped for more!"
  },
  {
   "score": 3,
   "id": "dfybqyi",
   "pid": "t1_dfwyoku",
   "date": "2017-04-07 06:11:25",
   "depth": 1,
   "text": "Haven't watched Beserk (and have been told to stay away from it, lol), but I feel the CGI in this is one of the better ones in recent memory."
  },
  {
   "score": 1,
   "id": "dfycfmw",
   "pid": "t1_dfybqyi",
   "date": "2017-04-07 06:27:38",
   "depth": 2,
   "text": "Stay away from the 2016 anime. But you can watch the films and the 97 anime.  And you should definitely read the manga :D\n\n"
  },
  {
   "score": 5,
   "id": "dfx74x9",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 12:06:13",
   "depth": 0,
   "text": "This is going to be a good one. First episode explained what it needed to about the Mc, then got right into the action in the second episode. It's caught my attention, hopefully it keeps it."
  },
  {
   "score": 2,
   "id": "dg7lfvx",
   "pid": "t1_dfx74x9",
   "date": "2017-04-13 07:13:35",
   "depth": 1,
   "text": "Episode 0 really grounds the show and makes you buy into the world. It makes you believe that a realistic story about Shindo just being a negotiator could be interesting."
  },
  {
   "score": 4,
   "id": "dfx9znn",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 12:57:08",
   "depth": 0,
   "text": "Well, I came into this expecting nothing and it ended up leaving a really good first impression. I'm intrigued to see what direction this series will go in. "
  },
  {
   "score": 3,
   "id": "dfxbrlf",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 13:29:17",
   "depth": 0,
   "text": "wow, the cgi was nice."
  },
  {
   "score": 4,
   "id": "dfxjy4b",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 16:16:38",
   "depth": 0,
   "text": "So this was a weird one for me. Episode 1 was alright, the genki scientist girl was fun to watch but there wasn't really all that much to it. Episode 0 on the other hand had some great character interactions, a good plot and introduced the world really well. I would of preferred a show continuing episode 0 rather than the switch to the supernatural in all fairness.\n\nAnd that includes the CGI, 0 was hand drawn until we reach the crossover between 0 and 1, now I will say this show is hands down the best implementation of CGI to characters in anime, yet by showing the same characters in CGI and 2D it becomes a showcase of the pitfalls of CGI.\n\nAnimation and movement is disjointed, expressions lack fluidity and emotion and the overall look creates a strange feeling where characters I took an interest in when hand drawn I found myself not as invested when they were CGI. There's a placebo affect of 2d characters that this style will always lose for me, I just can't get as invested in the world with it. (The opposite is also true where if you present me with fluid movements I find myself getting more easily invested in the world, even if the shows narrative hasn't completely grabbed me).\n\nWas it good? I'd say so, probably my least favourite show so far but I haven't managed to catch much so far so that isn't really all that damning of a statement."
  },
  {
   "score": 3,
   "id": "dfwv6u7",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:39:35",
   "depth": 0,
   "text": "So this is anime \"The Day the Earth Stood Still\"?"
  },
  {
   "score": 1,
   "id": "dfydv63",
   "pid": "t1_dfwv6u7",
   "date": "2017-04-07 06:58:22",
   "depth": 1,
   "text": "I hope not.\n\nThat films plot is shit.\n\n"
  },
  {
   "score": 1,
   "id": "dfxafvc",
   "pid": "t1_dfwv6u7",
   "date": "2017-04-06 13:05:14",
   "depth": 1,
   "text": "Klaatu barada nikto!"
  },
  {
   "score": 8,
   "id": "dfwwudq",
   "pid": "t1_dfwv6u7",
   "date": "2017-04-06 09:08:33",
   "depth": 1,
   "text": "Based on the plot summary, it sounds closer to a reimagining of *Childhood's End*."
  },
  {
   "score": 1,
   "id": "dfzmgj0",
   "pid": "t1_dfwwudq",
   "date": "2017-04-07 23:42:09",
   "depth": 2,
   "text": "Watched the SyFy Mini-Series of that recently. I was also thinking \"Arrival\"."
  },
  {
   "score": 6,
   "id": "dfxyecc",
   "pid": "t1_dfwwudq",
   "date": "2017-04-06 21:34:32",
   "depth": 2,
   "text": "\"mysterious thing appears, what do we do\" is a pretty standard scifi scenario. I like this take on it so far."
  },
  {
   "score": 3,
   "id": "dfwwa57",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:58:48",
   "depth": 0,
   "text": "hey Toei Animation with original work, i hope this becomes start of the return Toei's Glorius days "
  },
  {
   "score": 3,
   "id": "dfxcadm",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 13:38:55",
   "depth": 0,
   "text": "I'm actually love seeing all the political organisations coordinate and make decisions. That's why I really liked episode 0 as well. It was also great seeing Mifune-sensei from that episode make another reappearance here, though his assistant largely outshone him.\n\nThe animation was really well done. I'm starting to believe in CG now that I have seen this. I especially like the animation of Kanata, who came off as a very bright and expressive character as a result.\n\nNext episode, we may well have far more of the sci-fi parts, but I'm fine with that as well, as the writers have shown quite sufficiently that they have put thought into the background science, so the sci-fi does not come off as basically magic."
  },
  {
   "score": 3,
   "id": "dfxddgb",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 13:59:11",
   "depth": 0,
   "text": "After watching episode 0 and 1, it give me a lot of jdorama feel. Super interesting at that. Very similar feel to Shin Godzilla."
  },
  {
   "score": 3,
   "id": "dfxw6g4",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 20:37:55",
   "depth": 0,
   "text": "I got some serious Shin Godzilla vibes watching this. Government dealing with something totally unknown and more powerful than they could ever be. \n\nI personally thought the CGI was really nice and expressive too! Not to mention blended pretty well with the 2D animated parts. Can't wait to see where this goes. Also please save Hanamori"
  },
  {
   "score": 2,
   "id": "dfydcqi",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 06:47:55",
   "depth": 0,
   "text": "Let's see if the rest of the world play a mayor role in the plot.\n\nSeeing that it following a reallistic representation of a First Contact having the aliens interact with only one country will breack the immersion (althouth, we're talking about Japan, the country that don't give a shit about the rest of th world, and, after GATE, I'm allways waiting for the worst).\n\nWell, so far, we could be seeing the anime of the season, let's hope that doesn't go to shit."
  },
  {
   "score": 5,
   "id": "dfwxrxm",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:24:34",
   "depth": 0,
   "text": "If you like the cube thing, you might like mandelboxes\n\nthey're like mandelbrot fractals jammed into a box or something\n\nsee: http://hwi.ath.cx/javascript/fractals/mandelbox.html\nfor a javascript explorer.\n\nor https://www.youtube.com/watch?v=L1joOtob9rc\nfor a youtube video."
  },
  {
   "score": 1,
   "id": "dh24795",
   "pid": "t1_dfwxrxm",
   "date": "2017-05-02 19:26:49",
   "depth": 1,
   "text": "just watched episode 1 late and I'm glad someone else likes mandelboxes. literally what got me to watch the show. I hope the fractal nature plays into the story somehow"
  },
  {
   "score": 1,
   "id": "dh2wbnb",
   "pid": "t1_dh24795",
   "date": "2017-05-03 09:14:39",
   "depth": 2,
   "text": "I'm enjoying it thusfar. It's interesting the dynamic between the humanity and (I'm not sure how far in you are) the other beings. "
  },
  {
   "score": 2,
   "id": "dfwtaev",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:05:35",
   "depth": 0,
   "text": "This is looking to be really good! The CGI is great, really looking forward to next episode."
  },
  {
   "score": 1,
   "id": "dfx0tws",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 10:16:42",
   "depth": 0,
   "text": "That was really good. the CGI people were iffy in a few parts, but I loved the design of the cube. The whole thing was pretty intense, and I loved that it seemed like a semi-realistic response from the government and scientists. This could be a great series."
  },
  {
   "score": 2,
   "id": "dfx8ujl",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 12:36:52",
   "depth": 0,
   "text": "The red outlines to their eyes kind of bother me.\n\nOtherwise, this is an intriguing show.  "
  },
  {
   "score": 2,
   "id": "dfxc7lf",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 13:37:27",
   "depth": 0,
   "text": "Oh, hey there Merlin, finally got out of that damn tower? Oh wait..."
  },
  {
   "score": 1,
   "id": "dfy9v2b",
   "pid": "t1_dfxc7lf",
   "date": "2017-04-07 05:20:00",
   "depth": 1,
   "text": "He brought his Garden of Avalon along. Lets hope that he didn't bring Cath Palug too :P"
  },
  {
   "score": 2,
   "id": "dfxj2ev",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 15:57:28",
   "depth": 0,
   "text": "Very strong episode. Great directing and use of CGI that doesn't look too out of place. The sound design was fantastic and heightened the show's tension perfectly.\n\nProbably the strongest first episode of this season."
  },
  {
   "score": 2,
   "id": "dfxkwyj",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 16:37:42",
   "depth": 0,
   "text": "i hope this momentum goes through, and actually builds a sophisticated story showing the intricacies of the negotiations vs cut scenes"
  },
  {
   "score": 2,
   "id": "dfy2x83",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 00:13:43",
   "depth": 0,
   "text": "I went in totally blind, I've just been checking out everything new and this was really good. 00 and 01 both. I loved the little character introduction in 00 and the way the reacted and responded to the object felt very believable. Hopefully he hasn't traveled to earth because of bad pop music or something. "
  },
  {
   "score": 2,
   "id": "dfyhftb",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 08:05:52",
   "depth": 0,
   "text": "Ok, color me intrigued. I'll keep watching for now."
  },
  {
   "score": 2,
   "id": "dfz9ei3",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 17:15:13",
   "depth": 0,
   "text": "intriguing but this show is butt ugly\n"
  },
  {
   "score": 2,
   "id": "dfzm4zj",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 23:28:20",
   "depth": 0,
   "text": "I am really glad on how they handled the scientist because when I saw her \"loli harem bs\" alarm bells started ringing in my head but she's perfect. She's an assistant and looks young, so I'd place her in late college/uni. Her fast-talking could come off to some as wooden reading from the VA but really it is her mumbling more to herself than her audience while being intensely interested. To be honest, she could have been written as a high-functioning autistic character and be really respectful of it. It would also help explain her choice of notepad too."
  },
  {
   "score": 1,
   "id": "dfzol26",
   "pid": "t1_dfzm4zj",
   "date": "2017-04-08 01:26:27",
   "depth": 1,
   "text": "The CGI is way better than a lot of other anime shows using it, the only time I really noticed was the frozen split second stop, then sudden movement of characters which stuck out a bit.  However outside that, I thought it was pretty good."
  },
  {
   "score": 1,
   "id": "dfzp5n9",
   "pid": "t1_dfzol26",
   "date": "2017-04-08 01:58:24",
   "depth": 2,
   "text": "I agree but seems like such a random comment in reply to my specific comment lol. I didn't even really notice CGI outside of the block/interactions with."
  },
  {
   "score": 2,
   "id": "dg9sf18",
   "pid": "t3_63t3vo",
   "date": "2017-04-14 14:33:28",
   "depth": 0,
   "text": "Tank drifting!"
  },
  {
   "score": 4,
   "id": "dfwtfkp",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:08:13",
   "depth": 0,
   "text": "The CGI is annoying, especially on the characters. The story however is really interesting, this show is better then what I expected it to be."
  },
  {
   "score": 3,
   "id": "dfx04pd",
   "pid": "t1_dfwtfkp",
   "date": "2017-04-06 10:04:35",
   "depth": 1,
   "text": "The CGI here is far more impressive than it was on shows just a few years ago. A few years from now and we will probably barely even notice."
  },
  {
   "score": 1,
   "id": "dfx08xt",
   "pid": "t1_dfx04pd",
   "date": "2017-04-06 10:06:38",
   "depth": 2,
   "text": "I just watched episode 0, it didn't annoy me this time. I think that I wasn't used to CGI anime yet."
  },
  {
   "score": 33,
   "id": "dfwwi9v",
   "pid": "t1_dfwtfkp",
   "date": "2017-04-06 09:02:41",
   "depth": 1,
   "text": "The CGI here is expressive and functional, it more than does its job. It doesn't really detract from the show."
  },
  {
   "score": 2,
   "id": "dfwxagk",
   "pid": "t1_dfwwi9v",
   "date": "2017-04-06 09:16:15",
   "depth": 2,
   "text": "I really did not like the characters, but it might be because I'm used to 2d instead of the 3d movements."
  },
  {
   "score": 11,
   "id": "dfwypbb",
   "pid": "t1_dfwwi9v",
   "date": "2017-04-06 09:40:27",
   "depth": 2,
   "text": "It took me few minutes to realize it is CGI. If it stays at the same level as it is now Im more than good. Ajin was like 12fps and I still enjoyed it a lot and this one seems to be 24fps"
  },
  {
   "score": 5,
   "id": "dfwtyka",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:17:48",
   "depth": 0,
   "text": "I hate that kind of CGI, those characters look like dolls and their facial expressions are creepy as all hell... And that Shinawa doctor is annoying... That aside, this intro was quite good. I liked how the government operated, they set their priorities straight and kept their cool. I'm curious what is it going to be about."
  },
  {
   "score": 10,
   "id": "dfwu528",
   "pid": "t1_dfwtyka",
   "date": "2017-04-06 08:20:59",
   "depth": 1,
   "text": "yeah, the girl really didn't fit in. Everyone else was really serious and she was basicly just there as comedic relief, being completely unproffessional."
  },
  {
   "score": 4,
   "id": "dfx22ub",
   "pid": "t1_dfwu528",
   "date": "2017-04-06 10:37:54",
   "depth": 2,
   "text": "I liked the fact that she stopped things from getting too stuffy and political by lightening the mood. I think she was still a bit much, but not too bad. "
  },
  {
   "score": 10,
   "id": "dfwyvv0",
   "pid": "t1_dfwu528",
   "date": "2017-04-06 09:43:34",
   "depth": 2,
   "text": "With her first scene I agree but with each another scene I see her as woman who like her job and is very interested in what she cant understand. After all she is civilian not from military so she doesnt have to be all stiff and might be a little out going"
  },
  {
   "score": 6,
   "id": "dfx11th",
   "pid": "t1_dfwyvv0",
   "date": "2017-04-06 10:20:24",
   "depth": 3,
   "text": "There is being enthusiastic about something and then theres being completely childish. The girl was certainly the second, interrupting others constantly among other things.\n\n"
  },
  {
   "score": 5,
   "id": "dfxiw59",
   "pid": "t1_dfwu528",
   "date": "2017-04-06 15:53:36",
   "depth": 2,
   "text": "I actually like her very much. Without her, I think the atmosphere would be much too serious. And her excitement is understandable. If I were a physicist examining a strange alien structure, I'd be literally jumping around with excitement."
  },
  {
   "score": 3,
   "id": "dfwx9dz",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:15:45",
   "depth": 0,
   "text": "**Episode 0:**\n\nAlright so this is about Shindou-san, a Bureaucrat and also known as the toughest negotiator in Japan. Buuut apparently not, as seen by that ending. I went in blind so I had no idea this was a sci-fi anime. Nice to see that we have older/mature characters this season but I didn't expect that end. I guess this episode is to showcase Shindou's skills in negotiating?\n\nAlso seriously Toei, what's up with the CGI? I understand doing CGI on the Cube and on the Plane but why did you have to CGI Shindou and Hanamori? It's seriously distracting.\n\n_______________________________________________\n\n**Episode 1:**\n\nToo bad that thing really a Cube and not an Octahedron. [I was ready with my Ramiel memes.](http://i.imgur.com/FTNH9I0.jpg) Anyway looks like the CGI is really here to stay. I mean it looked good on the vehicles and the robot drone but on the characters? Not so much. This is Toei! They should have enough manpower to fully animate the people and not switch between CG and hand drawn. \n\nThis show definitely caught my interest! I guess next week we'll see what happened inside the Cube and how Shindou negotiated his way out of it."
  },
  {
   "score": 1,
   "id": "dfxgo6d",
   "pid": "t1_dfwx9dz",
   "date": "2017-04-06 15:05:27",
   "depth": 1,
   "text": "if it was a cube, we wouldnt be seeing the bottom left facet (given how much of the bottom right side we see), i think the art team just royally fucked up with the \"behind-the-object\" lines"
  },
  {
   "score": 5,
   "id": "dfx717j",
   "pid": "t1_dfwx9dz",
   "date": "2017-04-06 12:04:22",
   "depth": 1,
   "text": "It is a CG show like Ajin for example, nothing wrong with that, as long as the characters doesn't look bad and the CG here is quite impressive."
  },
  {
   "score": 10,
   "id": "dfxh235",
   "pid": "t1_dfx717j",
   "date": "2017-04-06 15:13:46",
   "depth": 2,
   "text": "But they aren't cgi in episode 0 until the plane, that's really fucking jarring. And after seeing 2d movements of a character then switching to 3d you see how janky 3d character movement is. It just doesn't seem to flow as it should properly. \n\nThis is one of the better attempts at cgi anime but the difference in movement between 2d and 3d is definitely noticeable. "
  },
  {
   "score": 2,
   "id": "dfwqftb",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 07:11:37",
   "depth": 0,
   "text": "This was one of the shows that looked really interesting to me. I like CGI shows done well, and the PV for this looked gorgeous. Have to wait till after work to watch though. :(\n\nAt least it's on CrunchyRoll."
  },
  {
   "score": 1,
   "id": "dfwxx6e",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:27:04",
   "depth": 0,
   "text": "Was entertained enough to keep my interest, so I'll be watching the next few episodes for sure.  Story has enough of a hook so far with the exception of the female doctor.  She just got on my nerves.  Don't love the CGI either.  It doesn't look bad, I just don't care for CGI characters like this.  Overall though, more things I like about it than dislike right now, so might as well keep it going and see."
  },
  {
   "score": 1,
   "id": "dfwys8m",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:41:49",
   "depth": 0,
   "text": "Not gonna lie, I'm gonna watch this because Yahakui looks like Merlin. That's some good character design right there."
  },
  {
   "score": 1,
   "id": "dfwzj22",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:54:28",
   "depth": 0,
   "text": "Really not a fan of the CGI, but I'm optimistic about the story. Hopefully it goes somewhere and they will be able to develop all these characters."
  },
  {
   "score": 1,
   "id": "dfx1gss",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 10:27:26",
   "depth": 0,
   "text": "he neotiated with an alien, that mad lad.  \nlooking forward to this show, shows promise for sure.  \ni just hope that we won't see much of that annoying scientist girl who somehow got charged with the whole operation.  \ni dont even mind the cgi, it doesnt look half bad"
  },
  {
   "score": 1,
   "id": "dfx25c0",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 10:39:08",
   "depth": 0,
   "text": "This was way better than I was expecting. Which is great--I really l like how CG shows keep getting better."
  },
  {
   "score": 1,
   "id": "dfx39mh",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 10:58:16",
   "depth": 0,
   "text": "Very promising first episode! (Well, second episode if you count episode 0).  It had good CG, great music, genuine suspense, and smart characters.  This is probably my most anticipated show of the season, so I'm happy."
  },
  {
   "score": 1,
   "id": "dfx5982",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 11:32:46",
   "depth": 0,
   "text": "Episode 0 started off with normal animation then turned into cgi half way through. Weird. At least its good cgi."
  },
  {
   "score": 1,
   "id": "dfx83hm",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 12:23:25",
   "depth": 0,
   "text": "That was actually...pretty good?\n\nThe animation was nice though I've never bene one to immediately dismiss CG. The premise seems interesting, and it seems to have some interesting characters (i'm surprised Scientist girl didn't annoy me).\n\nDefinitely gonna keep watching this one for now to see where it goes. "
  },
  {
   "score": 1,
   "id": "dfxc3en",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 13:35:17",
   "depth": 0,
   "text": "Berserk 2016 take notes how to do CG well. "
  },
  {
   "score": 1,
   "id": "dfxgrwb",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 15:07:38",
   "depth": 0,
   "text": "Definitely interesting. Also probably the best \"let's do science and engineering\" in recent fiction I've seen. I could do without the theoretical physicist girl, we are goofy, but not that goofy. 3d people looked weird in some places, the 3d object looked really nice though."
  },
  {
   "score": 1,
   "id": "dfxhdaa",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 15:20:26",
   "depth": 0,
   "text": "I love the Studen professor character, really reminds me of Hanji from AoT"
  },
  {
   "score": 1,
   "id": "dfxi6tu",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 15:38:05",
   "depth": 0,
   "text": "Well, what a start, it's too early to say if this anime will be good or bad since everything is still really mysterious, but at least looks promising. Loving the CG animation of this anime."
  },
  {
   "score": 1,
   "id": "dfxljhf",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 16:51:23",
   "depth": 0,
   "text": "Well that was pretty unexpected. I wasn't planning on watching this originally, but now I'm intrigued. \n\nThis is easily one of the best (well, the least jarring) uses of CGI I've ever seen in anime. Nothing felt majorly out of place, and it only really felt distracting then they put a CG character and a hand-drawn character on screen at the same time. (Seriously Toei, please don't do that.)\n\nThe premise was neat, and I like how they showed everyone approaching it in a logical manner. I'm not too sure what this show is actually going to be *about,* but I'm confident that it will be told in a mature and sophisticated way. We could do with less of the moe eccentric scientist girl though."
  },
  {
   "score": 1,
   "id": "dfxpy6s",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 18:28:22",
   "depth": 0,
   "text": "What genre's is this show? Is it action? Is it good?"
  },
  {
   "score": 5,
   "id": "dfzmkh9",
   "pid": "t1_dfxpy6s",
   "date": "2017-04-07 23:47:00",
   "depth": 1,
   "text": "Sci-Fi Political Thriller (Not in the action sense) is how I'd describe it."
  },
  {
   "score": 1,
   "id": "dfzy4so",
   "pid": "t1_dfzmkh9",
   "date": "2017-04-08 08:08:20",
   "depth": 2,
   "text": "Ah, okay."
  },
  {
   "score": 1,
   "id": "dfxr7ol",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 18:53:57",
   "depth": 0,
   "text": "One little thing I like about this show is how they just show the names and jobs of the characters without needing someone to give exposition on what they do. That was my problem with Alderamin's first episode, where they spent 5 entire minutes just giving exposition on the MC's team.\n\nPhysicist girl looks like a bad character choice so far. Genki & socially oblivious are horrible combinations for recurring characters in serious shows."
  },
  {
   "score": 1,
   "id": "dfxtdsc",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 19:37:56",
   "depth": 0,
   "text": "Wow, this may be one of the first times where heavy use of CG visuals do not put me off a series. It was more noticeable at some points than others (primarily with closeups of characters talking), but I'm quite excited to see where this goes! \n\nAlso, this had some excellent use of music and sound."
  },
  {
   "score": 2,
   "id": "dfy9tl2",
   "pid": "t1_dfxtdsc",
   "date": "2017-04-07 05:18:42",
   "depth": 1,
   "text": "Kinda weird cause episode 0 wasn't CG."
  },
  {
   "score": 1,
   "id": "dfxvvkw",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 20:30:53",
   "depth": 0,
   "text": "Ok cool episode and all realy liked how they did the CGI and all that and the build up was nice but...\nFOR THE LOVE OF GOD what was going on inside of that cube.\nI need to know i just...I need to. I hope it get's explained soon "
  },
  {
   "score": 1,
   "id": "dfy9t3h",
   "pid": "t1_dfxvvkw",
   "date": "2017-04-07 05:18:18",
   "depth": 1,
   "text": "preview looks like its gonna show that next episode."
  },
  {
   "score": 1,
   "id": "dfy8wev",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 04:48:34",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 1,
   "id": "dfy9qhw",
   "pid": "t1_dfy8wev",
   "date": "2017-04-07 05:16:05",
   "depth": 1,
   "text": "I think more [the day the earth stood still](https://en.wikipedia.org/wiki/The_Day_the_Earth_Stood_Still)."
  },
  {
   "score": 1,
   "id": "dfydivx",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 06:51:30",
   "depth": 0,
   "text": "Wow, haven't heard from Toei for ages already. They're like Musashi Animation in Shirobako, who used to make many titles before the 1990s before vanishing just when the late night anime boom began a decade ago, and then they decide to make their grand return with such an interesting sci-fi premise."
  },
  {
   "score": 1,
   "id": "dfz1xuu",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 14:22:44",
   "depth": 0,
   "text": "So far so good. Will definitely watch it next week."
  },
  {
   "score": 1,
   "id": "dfzd2pk",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 18:46:27",
   "depth": 0,
   "text": "I really wish they'd just decide on CG or traditional 2D animation and stick with one than mixing them, it's pretty jarring, and also serves as a nice game of \"spot the important character\""
  },
  {
   "score": 1,
   "id": "dg7jpuf",
   "pid": "t3_63t3vo",
   "date": "2017-04-13 06:36:46",
   "depth": 0,
   "text": "I've never seen a show go to 11 as much as this one did in Episode 0. The ending is haunting since there was no indication that it wasn't a slice of life show about a skilled government negotiator.\n\nWatching the characters have a small, unrelated personal success really lets you know them as people and makes the scifi stuff more compelling since the MCs feel like real, normal people. \n\n*Edit: After watching episode 1 I can definitely say this show is very captivating. How grounded the story is makes it very compelling. For that reason I find the \"scientist girl\" character very distracting. She's an anime character in the real world. \n\nFirst contact is always a really compelling story idea and I very much enjoyed the two Star Trek:TNG episodes on the subject. Watching a story about a struggle to communicate and understand one another is very captivating to me and stands apart from all the childish attempts at similar stories where things go the way they do because the plot demands it. \n\nGreat show, I highly highly recommend it. "
  },
  {
   "score": 1,
   "id": "dge78ic",
   "pid": "t3_63t3vo",
   "date": "2017-04-17 15:03:01",
   "depth": 0,
   "text": "FYI, at the start of the episode someone begins typing in a laptop \"Heisei 2\" and then corrects it to the date. If you're confused, that's just [how years work in Japanese](http://www.japanesewithanime.com/2017/03/years-in-japanese.html). The year \"Heisei 29\" 平成29 is equivalent to 2017 AD."
  },
  {
   "score": 1,
   "id": "dh8j2yi",
   "pid": "t3_63t3vo",
   "date": "2017-05-07 00:38:11",
   "depth": 0,
   "text": "I feel bad for not picking this up earlier. Intriguing hard sci-fi premise, excellent execution, and what seems like a badass and highly intelligent MC. Can't ask for more - I hope it stays this way! "
  },
  {
   "score": 0,
   "id": "dfww8rx",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 08:58:07",
   "depth": 0,
   "text": "CGI isn't as bad as any other show I've seen. It's watchable at least. Might stick around for a bit but I'm not engrossed in it yet. "
  },
  {
   "score": 1,
   "id": "dfzmqn0",
   "pid": "t1_dfww8rx",
   "date": "2017-04-07 23:54:20",
   "depth": 1,
   "text": "Wow! Downvotes are pretty random there."
  },
  {
   "score": 3,
   "id": "dfzp0u2",
   "pid": "t1_dfzmqn0",
   "date": "2017-04-08 01:50:54",
   "depth": 2,
   "text": "I didn't say anything that bad did I."
  },
  {
   "score": 1,
   "id": "dfx5xgr",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 11:44:40",
   "depth": 0,
   "text": "First time a foreign minister has been an MC of an anime, AFAIK. \n\nAlien-kun reminds me of Merlin from [Fate/GO](https://s-media-cache-ak0.pinimg.com/564x/1d/ed/65/1ded65e347cbb8dcac071aee081ee12b.jpg). \n\nAll in all, an interesting premise with a non-typical MC and probably the cleanest all-CGI animation I've seen. "
  },
  {
   "score": 1,
   "id": "dfzmolm",
   "pid": "t1_dfx5xgr",
   "date": "2017-04-07 23:51:50",
   "depth": 1,
   "text": "Probably the first time a Foreign Minister has been an MC of many things to be honest. "
  },
  {
   "score": 1,
   "id": "dfxhcni",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 15:20:03",
   "depth": 0,
   "text": "A series with all adult cast and the most stand out character is a genki lab assistant that actually exposits basic physics?  \nIt has my interest. Will watch Episode 0 as well.  \n\nIt can go shitty, but for now at least it didn't really do anything bad or good to turn me off. I'll give it a chance to continue on, even if it comes out empty, I don't mind the CG or the presentation."
  },
  {
   "score": 1,
   "id": "dfxwd7c",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 20:42:18",
   "depth": 0,
   "text": "Was anyone else very disappointed when the \"alien\" turned out to be human? I guess it could be salvaged if this turns out to be a time travel story, but no \"other dimensions\" or just plain aliens who look indistinguishable from humans please."
  },
  {
   "score": 1,
   "id": "dfzmpr0",
   "pid": "t1_dfxwd7c",
   "date": "2017-04-07 23:53:14",
   "depth": 1,
   "text": "That annoyed me when V did it but not here because I feel that largely only matters in a series with a high level of focus on action. Also being humanoid might create discussions etc about being \"a god\"."
  },
  {
   "score": 2,
   "id": "dfxzzuj",
   "pid": "t1_dfxwd7c",
   "date": "2017-04-06 22:22:45",
   "depth": 1,
   "text": "Alien-san could belong to a race of being similar to the Time Lords? The Doctor did say we(humans) resemble them(Time Lords) and not the other way around."
  },
  {
   "score": 3,
   "id": "dfxz2ys",
   "pid": "t1_dfxwd7c",
   "date": "2017-04-06 21:54:08",
   "depth": 1,
   "text": "Maybe alien-san adopted a human-like outer husk to interact with us?"
  },
  {
   "score": -1,
   "id": "dfxzdkc",
   "pid": "t1_dfxz2ys",
   "date": "2017-04-06 22:03:11",
   "depth": 2,
   "text": "And put on that outfit because...?"
  },
  {
   "score": 4,
   "id": "dfxznyv",
   "pid": "t1_dfxzdkc",
   "date": "2017-04-06 22:12:15",
   "depth": 3,
   "text": "One the plane was a rising star fashion designer who saw this once-in-a-dimension chance to clothe mankind's first non-human interaction into a aesthetically pleasing persona? I mean the best negotiator outside of Roger Smith just happened to be conveniently there on the plane."
  },
  {
   "score": 5,
   "id": "dfydrgx",
   "pid": "t1_dfxzdkc",
   "date": "2017-04-07 06:56:21",
   "depth": 3,
   "text": "Jeebus, is it really that hard to understand that you have to ask a question like that? \n\nThis is really just a common sci-fi trope, from hard sci-fi like Jodie Foster's Contact to your standard Star Trek episode, beings from a higher plane of existence usually have to bring themselves down to our primitive levels just to \"talk\" to us, and even then, their tongue would sound like gibberish riddles.\n\nEven the preview shows his initial attempt to speak his own language (?) to be beyond Shindo's brain to process."
  },
  {
   "score": 1,
   "id": "dfylfyd",
   "pid": "t1_dfydrgx",
   "date": "2017-04-07 09:17:22",
   "depth": 4,
   "text": "You didn't answer my question about the cheesy sci-fi royalty outfit."
  },
  {
   "score": 4,
   "id": "dfymkkc",
   "pid": "t1_dfylfyd",
   "date": "2017-04-07 09:36:56",
   "depth": 5,
   "text": "Dumbing down his level means scanning our memories and picking the most \"stereotypical\" image of what we humans would collectively perceive as \"grandiose\", thus that outfit."
  },
  {
   "score": 1,
   "id": "dfy9sow",
   "pid": "t1_dfxz2ys",
   "date": "2017-04-07 05:17:59",
   "depth": 2,
   "text": "[Its just Merlin trolling humans again.](http://vignette4.wikia.nocookie.net/fategrandorder/images/f/fd/Merlin01.png)"
  },
  {
   "score": 1,
   "id": "dik4uct",
   "pid": "t1_dfy9sow",
   "date": "2017-06-06 18:15:16",
   "depth": 3,
   "text": "Merlin's always trolling the humans. Should've seen that coming."
  },
  {
   "score": 6,
   "id": "dfydmt9",
   "pid": "t1_dfxwd7c",
   "date": "2017-04-07 06:53:44",
   "depth": 1,
   "text": "Why so? \n\nFor all we know, the cube could be the alien's true form, and he's merely adopting a familiar form that our insignificantly primitive minds could interface and communicate with."
  },
  {
   "score": 1,
   "id": "dfy5db5",
   "pid": "t3_63t3vo",
   "date": "2017-04-07 02:10:33",
   "depth": 0,
   "text": "oh no, 3D anime, it has to be suck"
  },
  {
   "score": 1,
   "id": "dg0ypmv",
   "pid": "t1_dfy5db5",
   "date": "2017-04-09 00:14:21",
   "depth": 1,
   "text": "Any recent Polygon Pictures, Sanzigen,and Yamatoworks stuff will say hi to you."
  },
  {
   "score": 0,
   "id": "dfwxigf",
   "pid": "t3_63t3vo",
   "date": "2017-04-06 09:20:03",
   "depth": 0,
   "text": "~~Sweet Jesus, this one too? Why are so few shows being licensed?. The number of shows I've had to sail for this season is too damn high!~~\n\n~~Did Crunchyroll spend there entire licensing budget for this season on Attack on Titan or something?~~\n\nI'm blind."
  },
  {
   "score": 2,
   "id": "dfwxtek",
   "pid": "t1_dfwxigf",
   "date": "2017-04-06 09:25:15",
   "depth": 1,
   "text": "[It's on Crunchyroll.](http://www.crunchyroll.com/kado-the-right-answer)"
  }
 ]
}