{
 "score": 103,
 "id": "6dbpj1",
 "num_comments": 60,
 "date": "2017-05-25 12:00:58",
 "comments": [
  {
   "score": 31,
   "id": "di1l0h0",
   "pid": "t3_6dbpj1",
   "date": "2017-05-25 14:21:27",
   "depth": 0,
   "text": "[Dad of the year](http://i.imgur.com/vk47l3h.png)\n\nThis episode was brought to you by \"Magnets, how do they work?\""
  },
  {
   "score": 2,
   "id": "di1r1ok",
   "pid": "t1_di1l0h0",
   "date": "2017-05-25 16:27:36",
   "depth": 1,
   "text": "Just seeing how burnt his palms were while carrying RyuZU was painful."
  },
  {
   "score": 3,
   "id": "di2jd13",
   "pid": "t1_di1r1ok",
   "date": "2017-05-26 06:45:14",
   "depth": 2,
   "text": "Wondering how will RyuZU react when she sees the burns, given how much she prioritizes naoto's health."
  },
  {
   "score": 2,
   "id": "di4vk4i",
   "pid": "t1_di2jd13",
   "date": "2017-05-27 20:15:54",
   "depth": 3,
   "text": "I'm sure she will find some way to blame Marie!"
  },
  {
   "score": 1,
   "id": "di30zbx",
   "pid": "t1_di1l0h0",
   "date": "2017-05-26 12:22:33",
   "depth": 1,
   "text": "answer: the just do!"
  },
  {
   "score": 14,
   "id": "di1ovxi",
   "pid": "t1_di1l0h0",
   "date": "2017-05-25 15:40:39",
   "depth": 1,
   "text": "Naoto is fucking legend. "
  },
  {
   "score": 8,
   "id": "di1tv4u",
   "pid": "t1_di1ovxi",
   "date": "2017-05-25 17:31:28",
   "depth": 2,
   "text": "This show is full of great characters. I don't know what other people's problems are."
  },
  {
   "score": 2,
   "id": "di565k9",
   "pid": "t1_di1tv4u",
   "date": "2017-05-28 03:39:46",
   "depth": 3,
   "text": "people really tend to hate loli bait i think"
  },
  {
   "score": 22,
   "id": "di1eva8",
   "pid": "t3_6dbpj1",
   "date": "2017-05-25 12:26:56",
   "depth": 0,
   "text": "Interesting episode for sure.  \n\nI always wondered by electric stuff was banned but i didnt think about stuff getting magnitized.  Thats pretty cool of them to think up.  \n\nI like how sincerely Naoto calls RyuZU and AchoR his wife and daughter.  Hes a great character.  \n\nSo the big bot magnitized all the gears now they gotta go elsewhere to deal with it.  Interesting, and it looks like the underground old man was responsable too, wonder what will come of this stuff...  \n\nGreat ep again.  \n\n[](#juice1)"
  },
  {
   "score": 7,
   "id": "di1is1z",
   "pid": "t1_di1eva8",
   "date": "2017-05-25 13:38:25",
   "depth": 1,
   "text": "> I like how sincerely Naoto calls RyuZU and AchoR his wife and daughter. Hes a great character.\n\nBut AnchoR is right, Marie is the mom and she and RyuZU the daughters!"
  },
  {
   "score": 3,
   "id": "di1tu6n",
   "pid": "t1_di1is1z",
   "date": "2017-05-25 17:30:52",
   "depth": 2,
   "text": "I like that AnchoR still calls him dad and RyuZU her sister.\n\nAnd then Marie's just sitting there like, \"I don't believe it\"."
  },
  {
   "score": 12,
   "id": "di1vgbc",
   "pid": "t1_di1tu6n",
   "date": "2017-05-25 18:06:57",
   "depth": 3,
   "text": "This is a really messed up family, straight out of /r/crusaderkings."
  },
  {
   "score": 17,
   "id": "di1ur8b",
   "pid": "t3_6dbpj1",
   "date": "2017-05-25 17:51:28",
   "depth": 0,
   "text": "\"It just appeared and they have a code name for it?\" lol\n\n\"We're flying at Mach 5!\" in a propeller aircraft. Coupled with the \"7 picometer\" gear that was tuned with a screwdriver, I think this proves the show has a very different understanding of units of measurement.\n\nSomehow I was surprised that the weapon was being piloted. I'd assumed it was an automaton.\n\nI'm also surprised they didn't have any gears which aren't made from iron alloys. I mean if that's the reason they were so scared of electromagnetism, prepare!\n\nWhy didn't the moron wrap his hands in something before moving Ryuzu? How are his hands not already infected?"
  },
  {
   "score": 3,
   "id": "di23n7l",
   "pid": "t1_di1ur8b",
   "date": "2017-05-25 21:10:24",
   "depth": 1,
   "text": " https://imgur.com/gallery/tK0RE\n\nSeriously i facepalmed when i saw that scene. Were supposed to belive that prop planes with designs akin to ww2 technology go mach 5???? "
  },
  {
   "score": 2,
   "id": "di2x167",
   "pid": "t1_di23n7l",
   "date": "2017-05-26 11:07:51",
   "depth": 2,
   "text": "To be fair, they have antigravity in this world, and the cockpits are pressurized. They may look like something from WW2, but it's entirely possible they do actually go mach 5."
  },
  {
   "score": 2,
   "id": "di2ydfe",
   "pid": "t1_di2x167",
   "date": "2017-05-26 11:32:50",
   "depth": 3,
   "text": "Yes lets ignore aerodynamic drag and physics. A plane with that design would blow apart at the speed of sound. Not to mention the fact that prop planes cant break the sound barrier under their own power"
  },
  {
   "score": 3,
   "id": "di2zg4q",
   "pid": "t1_di2ydfe",
   "date": "2017-05-26 11:53:03",
   "depth": 4,
   "text": "Um... By what model? I've done simulations with X-Plane 10 and got a cessna 172SP with rockets to get to mach 7 before breaking, and that's a wayyy shittier design lol.  (that was a fun class btw)\n\nSure, by the *propeller's* power, but this is a world with antigravity. The propeller could be for low speed flight, increased maneuverability, or just for the aesthetic. They could very well use a completely different powerplant that's not visible from the outside."
  },
  {
   "score": 1,
   "id": "di31mvh",
   "pid": "t1_di2zg4q",
   "date": "2017-05-26 12:35:29",
   "depth": 5,
   "text": "By real life models. A cessna would fail long before hitting those speeds. The wing design would mean almost 100% of the surface would be outside of the sound barrier shock wave.\n\nX plane lets you get away with so much bullshit that theres no way you could logically believe that a cessna could break the sound barrier without crashing."
  },
  {
   "score": 1,
   "id": "di33jlu",
   "pid": "t1_di31mvh",
   "date": "2017-05-26 13:14:17",
   "depth": 6,
   "text": "Yeah, that's true. I did have to change the airfoils, decrease the wingspan, size of the fuselage, the size of the cockpit, had to move the tail wings, and fuck with the aspect ratio, but it still was a lot shittier of a design as the fighters shown.\n\nDepends on if you're using the realism options or not (we were, the course we were using demanded it). X-Plane is currently the most realistic aircraft simulator because it's designed as an engineering tool. Hell, Gulfstream uses it.\n\nThe cessna in question didn't perform well at that kind of speed and broke if you tried to turn in it (it was really funny how it broke too lol) but the fact is it did *work*, and the math we did to show it was actually possible satisfied the engineer we were trying to impress. I think it's fair to suspend your disbelief for these fighters, especially considering the world it takes place in. It's not nearly as ridiculous as a purely mechanical device stopping/slowing time. OR a purely mechanical device that can make complex decisions and at least the illusion of emotion, like the automatons in general."
  },
  {
   "score": 2,
   "id": "di3ulsf",
   "pid": "t1_di31mvh",
   "date": "2017-05-27 02:57:12",
   "depth": 6,
   "text": "But those models have very short wings. And in general it uses a very compact design. The round nose would create a terrible drag and the propeller themselves, whether they are used or not, would probably tear apart but it doesn't like like a big stretch to assume that it could work if they included some engineering properties we didn't know about or think of."
  },
  {
   "score": 2,
   "id": "di3w3zg",
   "pid": "t1_di3ulsf",
   "date": "2017-05-27 04:17:22",
   "depth": 7,
   "text": "Its a plane. At this point we know what it takes to make a plane survive flight at more than twice the speed of sound. The design of the planes in this show would be sub sonic and might just hit the edge of the sound barrier. They might be able to be flyable above the speed of sound if somehow they werent using the prop (but if then the prop would explode from the forces most likely) but 5 times the speed of sound? Hell no.\n\nI could believe it if they said they were going mach 1. But mach 5? Fuck that. "
  },
  {
   "score": 2,
   "id": "di3wpji",
   "pid": "t1_di3w3zg",
   "date": "2017-05-27 04:46:05",
   "depth": 8,
   "text": "They do need a completely different technology. They can't use magnetic acceleration, visibly don't use jet propulsion (not that they could have much oil in a clockwork planet), and propeller technology couldn't bring them over the speed of sound. Additionally, given their focus on clockwork research, they probably have a greater knowledge of alloys than we do.\n\nWhat I mean is that it's not a simple reskin of our own technology to replace electricity with gears. They don't necessarily need to have the profile of our own supersonic planes to be able to work.\n\nAlso, people mentioned that the air density on that planet might be different from ours, which might have very interesting implications for supersonic technologies. Though not necessarily making anything easier."
  },
  {
   "score": 3,
   "id": "di3zsgq",
   "pid": "t1_di3wpji",
   "date": "2017-05-27 06:40:10",
   "depth": 9,
   "text": "Their clockwork city was stopped by electromagnetism. That means most of their gears and shit are made out of ferromagnetic metals. Steel, iron, that sort of stuff. You would think that they would have advanced alloy knowledge but they make everything out of ferromagnetic metals."
  },
  {
   "score": 6,
   "id": "di2f07g",
   "pid": "t1_di23n7l",
   "date": "2017-05-26 04:48:37",
   "depth": 2,
   "text": "[Mach Five](http://i.imgur.com/YqYVCk8.jpg)"
  },
  {
   "score": 14,
   "id": "di2zzlt",
   "pid": "t1_di2f07g",
   "date": "2017-05-26 12:03:14",
   "depth": 3,
   "text": "[I *might* have overdone it.](http://i.imgur.com/cvOUt6H.png)"
  },
  {
   "score": 13,
   "id": "di1jcdv",
   "pid": "t3_6dbpj1",
   "date": "2017-05-25 13:49:11",
   "depth": 0,
   "text": "[Naoto](http://i.imgur.com/1h88p5a.jpg) is a kid who knows what he wants and [takes it](http://i.imgur.com/pq39345.jpg).\n\nThe burns on his hands tho. That is so hard to think about. \n\nI guess we can assume electromagnetism would be the nukes of that world."
  },
  {
   "score": 1,
   "id": "di4vmar",
   "pid": "t1_di1jcdv",
   "date": "2017-05-27 20:17:42",
   "depth": 1,
   "text": "The whole, \"every country must be working on this\" line by the civilian meister brought my thoughts immediately to nuclear weapons. "
  },
  {
   "score": 9,
   "id": "di1vrao",
   "pid": "t3_6dbpj1",
   "date": "2017-05-25 18:13:56",
   "depth": 0,
   "text": "> The Curie temperature of Iron is about 1043 K or about 1416 F or 769 C\n\n> > Gears are made out of many things including Iron, Steel, Plastic, Bronze\n\n> > Bright red lava flows in Hawaii can get as hot as 1,165 F, with the glowing orange flows getting hotter than 1,600 F, according to USGS. And when rock is seriously melting, such as the magma within the Hawaiian volcano of Kilauea , it can reach 2,120 F\n\nAssuming RyuZU is made up mostly with Iron/Steel Gears, she was as hot a Lava when she went on to demagnetization mode. Impressive how the most Naoto received were 3rd degree burns when he touched and carried RyuZU for at least 10-15 seconds"
  },
  {
   "score": 3,
   "id": "di3un1m",
   "pid": "t1_di1vrao",
   "date": "2017-05-27 02:59:06",
   "depth": 1,
   "text": "> Assuming RyuZU is made up mostly with Iron/Steel Gears\n\nIf she was, we'd have a lot more problems already, I think. For such an important model, it seems obvious they would use advanced specialized alloys. Various properties to look for : non-corrosion, high temperature resistance, self-repair, resistance to shocks."
  },
  {
   "score": 3,
   "id": "di2fta3",
   "pid": "t1_di1vrao",
   "date": "2017-05-26 05:14:55",
   "depth": 1,
   "text": "Another interesting question is how long would it actually take for her to cool of on her own? At this point it would be easier waiting a few days rather than trying to throw her into a river.\n\nPS , It would also mean her clothes would go up in a puff of smoke. Fanservice no jitsu.\n\nPPS , Wouldn't heat expansion and contraction kill her anyway ?"
  },
  {
   "score": 7,
   "id": "di2q1ay",
   "pid": "t1_di2fta3",
   "date": "2017-05-26 08:57:16",
   "depth": 2,
   "text": "It is a great mistake indeed to think physics has any place in this anime."
  },
  {
   "score": 1,
   "id": "di7kcix",
   "pid": "t1_di2q1ay",
   "date": "2017-05-29 19:10:02",
   "depth": 3,
   "text": ">It is a great mistake indeed to think physics has any place in any anime.\n\nFTFY"
  },
  {
   "score": 8,
   "id": "di1ldwt",
   "pid": "t3_6dbpj1",
   "date": "2017-05-25 14:28:54",
   "depth": 0,
   "text": "I feel so stupid. So THAT'S WHY there's a ban on electromagnetic technology. Of course mechanical gears won't work properly if they're all magnetized. I feel like I just disappointed my physics prof for not realizing that sooner.\n\nAlso Naoto just so casual about calling RyuZU his wife and AnchoR his daughter. Love it!\n\n\n"
  },
  {
   "score": 7,
   "id": "di1oxx5",
   "pid": "t1_di1ldwt",
   "date": "2017-05-25 15:41:49",
   "depth": 1,
   "text": "The strength of the electromagnetic field you would need for something like that to happen is just insane though. I'm talking nuclear. "
  },
  {
   "score": 1,
   "id": "di3uoo3",
   "pid": "t1_di1oxx5",
   "date": "2017-05-27 03:01:38",
   "depth": 2,
   "text": "At least that strength provides a credible excuse to not having every important device EMP-shielded."
  },
  {
   "score": 1,
   "id": "di223qi",
   "pid": "t1_di1oxx5",
   "date": "2017-05-25 20:33:48",
   "depth": 2,
   "text": "Yup, you would need an EMP similar to the one generated by an atomic bomb, but that would just magnetize a smaller area than an entire city (assuming their air density is the same as on Earth)"
  },
  {
   "score": 1,
   "id": "di25apn",
   "pid": "t1_di223qi",
   "date": "2017-05-25 21:56:24",
   "depth": 3,
   "text": "the air density has to be different though in one of the previous episodes they said the core of the planet is basically the same vacuum as space, the atmosphere just extends above and below the habitable zone a certain amount."
  },
  {
   "score": 1,
   "id": "di25y7c",
   "pid": "t1_di25apn",
   "date": "2017-05-25 22:16:36",
   "depth": 4,
   "text": "Then an atomic bomb-sized EMP would be more than enough to magnetize every gear in a city (grid), only if air density is lower than Earth's at said place..."
  },
  {
   "score": 7,
   "id": "di1u4ge",
   "pid": "t3_6dbpj1",
   "date": "2017-05-25 17:37:20",
   "depth": 0,
   "text": "from the looks of the next ep preview halters gettin some titties"
  },
  {
   "score": 4,
   "id": "di2hq12",
   "pid": "t3_6dbpj1",
   "date": "2017-05-26 06:07:04",
   "depth": 0,
   "text": "Next episode Halter get transgene to become hot mama! Now the harem is complete."
  },
  {
   "score": 3,
   "id": "di2jcdk",
   "pid": "t1_di2hq12",
   "date": "2017-05-26 06:44:48",
   "depth": 1,
   "text": "Thanks. Now i dont have to worry about that in the preview being RyuZU"
  },
  {
   "score": 4,
   "id": "di1p544",
   "pid": "t3_6dbpj1",
   "date": "2017-05-25 15:46:04",
   "depth": 0,
   "text": "I should complain about the lack of RyuZu snarkiness, but I was entertained nontheless. Say what you will about Naoto, but his dedication to his waifu and daughterfu is quite a thing to behold.\n\nOn a side note, I hope Halter gets his body back (with improvements if possible). He's too badass to live his life as a disembodied head."
  },
  {
   "score": 4,
   "id": "di2cbkw",
   "pid": "t3_6dbpj1",
   "date": "2017-05-26 02:56:42",
   "depth": 0,
   "text": "[living the dream](http://i.imgur.com/pq39345.jpg)"
  },
  {
   "score": 1,
   "id": "di1kg8z",
   "pid": "t3_6dbpj1",
   "date": "2017-05-25 14:10:28",
   "depth": 0,
   "text": "This episode was very surpising, and Halter's NOT A HUMAN?"
  },
  {
   "score": 2,
   "id": "di1me1b",
   "pid": "t1_di1kg8z",
   "date": "2017-05-25 14:49:00",
   "depth": 1,
   "text": "I kinda figured he was a full cyborg or something. The stuff he was fighting gave it away for me. :)\n\nI didnt know if he was born human or was an AI tho."
  },
  {
   "score": 1,
   "id": "di1ts6f",
   "pid": "t1_di1me1b",
   "date": "2017-05-25 17:29:35",
   "depth": 2,
   "text": "Yeah, the way he fought in episode 2 pretty much gave it away, and then the fact that he was able to pick up the radio transmission as well."
  },
  {
   "score": 3,
   "id": "di1mggw",
   "pid": "t1_di1me1b",
   "date": "2017-05-25 14:50:21",
   "depth": 2,
   "text": "Marie stated he was built."
  },
  {
   "score": 7,
   "id": "di1m6jz",
   "pid": "t1_di1kg8z",
   "date": "2017-05-25 14:44:51",
   "depth": 1,
   "text": "We knew he was a cyborg, but what surprised me was the extent to which he is one.\n\nHe is probably just the brain. I would have thought he was more of an android 17/18 than android 20."
  },
  {
   "score": 1,
   "id": "di1mf7q",
   "pid": "t1_di1m6jz",
   "date": "2017-05-25 14:49:38",
   "depth": 2,
   "text": "I thought his whole body would be comprised of cyborg parts."
  },
  {
   "score": 4,
   "id": "di1mqgq",
   "pid": "t1_di1mf7q",
   "date": "2017-05-25 14:55:57",
   "depth": 3,
   "text": "Well, it seems like that's the deal as of now.\n\nThe \"blood\" on the floor could indicate that he had a human heart, and the skin is probably real too."
  },
  {
   "score": 2,
   "id": "di1pszw",
   "pid": "t1_di1mqgq",
   "date": "2017-05-25 16:00:23",
   "depth": 4,
   "text": "That's a possibalitly."
  },
  {
   "score": 8,
   "id": "di1usrv",
   "pid": "t1_di1m6jz",
   "date": "2017-05-25 17:52:24",
   "depth": 2,
   "text": "Even his brain probably isn't human, otherwise it would now be dead without the gear-provided life support."
  },
  {
   "score": 1,
   "id": "di1vcpe",
   "pid": "t1_di1usrv",
   "date": "2017-05-25 18:04:39",
   "depth": 3,
   "text": "Huh, actually you are probably right, I hadn't thought about that."
  },
  {
   "score": 14,
   "id": "di1lwrv",
   "pid": "t1_di1kg8z",
   "date": "2017-05-25 14:39:24",
   "depth": 1,
   "text": "They covered it earlier he's a mechanized human. Like a cyborg."
  },
  {
   "score": 1,
   "id": "di1lxom",
   "pid": "t1_di1lwrv",
   "date": "2017-05-25 14:39:52",
   "depth": 2,
   "text": "I didn't notice that ironically "
  },
  {
   "score": 1,
   "id": "di2nh5k",
   "pid": "t3_6dbpj1",
   "date": "2017-05-26 08:09:29",
   "depth": 0,
   "text": "The old dude in the big emp weapon, have we seen him before? Cause there was a flashback scene of him talking to Naoto and RyuZU."
  },
  {
   "score": 1,
   "id": "di3egls",
   "pid": "t1_di2nh5k",
   "date": "2017-05-26 17:24:58",
   "depth": 1,
   "text": "> have we seen him before?\n\nHe is from when Naoto fell underground and Marie thought he died. They met him there."
  },
  {
   "score": 1,
   "id": "di4szp0",
   "pid": "t1_di3egls",
   "date": "2017-05-27 19:00:55",
   "depth": 2,
   "text": "Ah, thanks!\n"
  },
  {
   "score": 1,
   "id": "di7rbbr",
   "pid": "t3_6dbpj1",
   "date": "2017-05-29 22:14:46",
   "depth": 0,
   "text": "is it just me or is this series starting to go grand order/taboo tatoo?"
  },
  {
   "score": 2,
   "id": "di8ahm6",
   "pid": "t1_di7rbbr",
   "date": "2017-05-30 08:46:45",
   "depth": 1,
   "text": "I can definitely see that. Not looking forward to it. "
  }
 ]
}