{
 "score": 155,
 "id": "67xrkh",
 "num_comments": 73,
 "date": "2017-04-27 12:00:44",
 "comments": [
  {
   "score": 79,
   "id": "dgu3h3m",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 12:43:16",
   "depth": 0,
   "text": "My only reason to watch this anime died for 6 minutes 30 seconds."
  },
  {
   "score": 58,
   "id": "dgu5sbi",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 13:24:14",
   "depth": 0,
   "text": "Even on a planet made entirely of gears they find a way to work in a beach episode. Sasuga Japan."
  },
  {
   "score": 1,
   "id": "dguad5i",
   "pid": "t1_dgu5sbi",
   "date": "2017-04-27 14:48:23",
   "depth": 1,
   "text": "maybe its an oil reservoir "
  },
  {
   "score": 11,
   "id": "dguayl0",
   "pid": "t1_dgu5sbi",
   "date": "2017-04-27 15:00:27",
   "depth": 1,
   "text": "While MAGIC is still an option (Y being a fucking cheat), i think NANOMACHINES, SON is more appropriate response."
  },
  {
   "score": 31,
   "id": "dgu3sbu",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 12:48:46",
   "depth": 0,
   "text": "\"I see, you're telling me to strip...\" \n\nKanbaru? Is that you? \n\nAlso, I have to say, out of the dozen shows I'm watching this season this one still has the best soundtrack by far. "
  },
  {
   "score": 2,
   "id": "dgugqnh",
   "pid": "t1_dgu3sbu",
   "date": "2017-04-27 17:03:17",
   "depth": 1,
   "text": "The soundtrack of the show didn't hit me until this episode where I noticed myself really liking it. May go re-watch some of the others and pay a little better attention."
  },
  {
   "score": 3,
   "id": "dgu7ldl",
   "pid": "t1_dgu3sbu",
   "date": "2017-04-27 13:56:17",
   "depth": 1,
   "text": "I mean, shes basically his love slave..."
  },
  {
   "score": 11,
   "id": "dgua58l",
   "pid": "t1_dgu7ldl",
   "date": "2017-04-27 14:43:57",
   "depth": 2,
   "text": "Her code name is literally \"YourSlave\""
  },
  {
   "score": 14,
   "id": "dguab4g",
   "pid": "t1_dgu3sbu",
   "date": "2017-04-27 14:47:15",
   "depth": 1,
   "text": "[Eat up!](http://pm1.narvii.com/5938/2e1d387d4c4afd6dccd98dc52520d3c5d2ccefe0_hq.jpg)"
  },
  {
   "score": 33,
   "id": "dgu7ow6",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 13:57:56",
   "depth": 0,
   "text": "[Seriously RyuZU is just the best!](http://imgur.com/a/QazbX)\n\nI really love the dynamic between Naoto and RyuZU, Marie and Halter are great as well! I like how they're all badasses in their own right. Kinda sucks that people have really started to drop this show based amount of comments on this thread. \n\n"
  },
  {
   "score": 8,
   "id": "dgu8h0e",
   "pid": "t1_dgu7ow6",
   "date": "2017-04-27 14:12:17",
   "depth": 1,
   "text": "I have no idea how people can dislike this show. It makes no sense.\nI'm loving every minute of it, it's one of my favorites this season.\nAlso, RyuZU is 120% badass-adorable (and the other main characters are pretty epic, too)"
  },
  {
   "score": 3,
   "id": "dguvs08",
   "pid": "t1_dgu8h0e",
   "date": "2017-04-27 22:21:34",
   "depth": 2,
   "text": "I just find it boring. I have no interest in the interactions between the characters and am finding watching the episodes a bore. Too bad as the actual story seems interesting and I would like to learn more, just not enough to keep watching."
  },
  {
   "score": 2,
   "id": "dgvlyw2",
   "pid": "t1_dgu8h0e",
   "date": "2017-04-28 11:41:52",
   "depth": 2,
   "text": "I think a lot of people, myself included, just got disappointed by the whole clockwork aspect of the show in how it was handled. If there was any hope for a show where spring and gear driven devices would be a huge part of it, then surely a show named and about clockwork would be it... and thats where the disappointment, and following that the dislike, comes from. To be more specific, pretty much none of the \"clockwork\" has been show to have any clear purpose, and has only existed for the sake of existing and calling it clockwork. That's not to say every gear needs to be explained, but it would be nice to see them work together in a specific device to accomplish a specific task in a way that, while it can break some laws of physics if need be, is still believable, rather than what currently happens in the show where the overwhelming majority of gears just constantly spin around without any viewable results or explanations, and of those that do get a reason/explanation, its typically some overtaken by some absurdity."
  },
  {
   "score": 2,
   "id": "dgv6k9u",
   "pid": "t1_dgu8h0e",
   "date": "2017-04-28 06:57:42",
   "depth": 2,
   "text": "While I think they could have improved the animation and smoothed the tonal shifts (some are really well done, such as RyuZU's pout, but some aren't - inevitable when there's so many, I guess), it's very entertaining and manages to keep my attention all the way. All the characters are also pretty badass when they are given a chance to shine."
  },
  {
   "score": 15,
   "id": "dgu8842",
   "pid": "t1_dgu7ow6",
   "date": "2017-04-27 14:07:37",
   "depth": 1,
   "text": "That pout was glorious!    \nBut I cant really believe how quick she gets envious"
  },
  {
   "score": 8,
   "id": "dgu89e5",
   "pid": "t1_dgu8842",
   "date": "2017-04-27 14:08:18",
   "depth": 2,
   "text": "I think she was just teasing him. She knows she's the best girl :)"
  },
  {
   "score": 10,
   "id": "dgu8ek2",
   "pid": "t1_dgu89e5",
   "date": "2017-04-27 14:11:00",
   "depth": 3,
   "text": "But have you seen this big ass gears?        \nMaybe he likes his [gears](http://i.imgur.com/mXY9lRn.png) more well endorsed ( ͡° ͜ʖ ͡°)"
  },
  {
   "score": 13,
   "id": "dguaydz",
   "pid": "t1_dgu8ek2",
   "date": "2017-04-27 15:00:20",
   "depth": 4,
   "text": "Holy shit NSFW that up, I almost got in trouble for opening that link"
  },
  {
   "score": 28,
   "id": "dgu2fns",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 12:24:51",
   "depth": 0,
   "text": "#Another ep down, still massively entertaining.  \n\nI like how everyone has thier part in things.  Naoto isnt some OP guy, he just has his couple skills, just like Marie.  And the 4 of them help fill in what the others lack.  Its nice.  \n\nNow that the day is saved, its time to find the imouto! After... a beach episode...?  \n\n[](#meguminthumbsup)"
  },
  {
   "score": 7,
   "id": "dgu859a",
   "pid": "t1_dgu2fns",
   "date": "2017-04-27 14:06:08",
   "depth": 1,
   "text": "Yup. One to identify the problem, one to fix it, One to defend them and one to carry the luggage."
  },
  {
   "score": 8,
   "id": "dgua7fi",
   "pid": "t1_dgu859a",
   "date": "2017-04-27 14:45:11",
   "depth": 2,
   "text": "You mean Materials."
  },
  {
   "score": 17,
   "id": "dguaiel",
   "pid": "t1_dgu2fns",
   "date": "2017-04-27 14:51:19",
   "depth": 1,
   "text": "Naoto = The one that finds the problem.\n\nMarie = The one that fixes the problem.\n\nHalter = The experience and voice of reason. \n\nRyuZU = The one that protects.\n\nThe group is OP."
  },
  {
   "score": 1,
   "id": "dgw7h30",
   "pid": "t1_dguaiel",
   "date": "2017-04-28 19:28:42",
   "depth": 2,
   "text": "\"The one that follows\""
  },
  {
   "score": 1,
   "id": "dgv6m9z",
   "pid": "t1_dguaiel",
   "date": "2017-04-28 06:58:50",
   "depth": 2,
   "text": "Naoto is giving some credit to the guys from debugging and the QA department."
  },
  {
   "score": 9,
   "id": "dguypb5",
   "pid": "t1_dguaiel",
   "date": "2017-04-28 02:50:42",
   "depth": 2,
   "text": "> RyuZU = The one that **pouts**\n\nfixed that for you"
  },
  {
   "score": 11,
   "id": "dguiuno",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 17:42:41",
   "depth": 0,
   "text": "IDK why, but when RyuZU mentioned how many gears she had, I immediately went for some math. Most estimates put the number of cells in average adult human at somewhere around 40 trillion. She has about 4 trillion gears comprising her body, meaning each gear is on average 10 times larger than a human cell. Cells can vary quite a bit but I went with an average diameter of about 20 micrometers (a red blood cell is about 10 micrometers). Meaning the average gear in her body is probably somewhere around 0.2 mm in diameter. I couldn't find any concrete info about the smallest gear ever made but it looks like nanotechnology research has made some as small as 8 micrometers in diameter.\n\n\nSo basically, the number wasn't necessarily totally random, but Y is still basically a magician. Not to mention Naoto and Marie for being able to fix her after she punched a hole through herself (or she was just super precise when doing so). Still an entertaining show even if the best pat of it was dead for half the episode. "
  },
  {
   "score": 1,
   "id": "dgupz2t",
   "pid": "t1_dguiuno",
   "date": "2017-04-27 19:49:54",
   "depth": 1,
   "text": "That's what I thought first, was it really necessary to stab herself to get the heart out?\n\n\n\n"
  },
  {
   "score": 4,
   "id": "dgut1nz",
   "pid": "t1_dgupz2t",
   "date": "2017-04-27 20:53:44",
   "depth": 2,
   "text": "I think she did it more because it needed done and Naoto would not have allowed it."
  },
  {
   "score": 3,
   "id": "dguv1ay",
   "pid": "t1_dguiuno",
   "date": "2017-04-27 21:43:30",
   "depth": 1,
   "text": "That one gear that she fixed was said to be 7 picometers in size.  Even though it looked at least a centimeter on the screen.\n\nMy conclusion - the writers don't know numbers."
  },
  {
   "score": 1,
   "id": "dguz4ic",
   "pid": "t1_dguv1ay",
   "date": "2017-04-28 03:11:33",
   "depth": 2,
   "text": "maybe the camera was just super zoomed in on the gear, but does a 7 picometer gear even make sound while spinning? Won't it be emitting waves so high frequency it's no longer sound but instead something in between that and light? :o"
  },
  {
   "score": 6,
   "id": "dgvii96",
   "pid": "t1_dguz4ic",
   "date": "2017-04-28 10:37:58",
   "depth": 3,
   "text": ">Won't it be emitting waves so high frequency it's no longer sound but instead something in between that and light? :o\n\n[What](#justno)\n\nI'm not a physicist, but I'm pretty sure that's impossible. \\*Googles it incase I'm actually wrong\\* Yeah, [it's impossible](https://www.quora.com/Can-sound-frequencies-be-so-high-that-theyre-at-the-same-wavelength-as-visible-light-And-if-so-would-we-be-able-to-actually-see-them-in-color) sound waves are distortions through air/physical matter. Light is (partially) a distortion through electromagnetic fields. They're completely separate and don't just become the other based on their frequency.\n"
  },
  {
   "score": 5,
   "id": "dgumn1p",
   "pid": "t1_dguiuno",
   "date": "2017-04-27 18:49:04",
   "depth": 1,
   "text": "Side note: \"nanogears\" is commonplace in Clockwork Planet universe."
  },
  {
   "score": 7,
   "id": "dgu5klh",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 13:20:22",
   "depth": 0,
   "text": "Ryuzu is best girl material! The MC is badass - puts his priorities right and saves the waifu!  \n  \nI actually liked the way they were fixing gears. Looked pretty cool and sci-fi.  \n\nBeach episode next? Nice! Though I am more interested in the imouto."
  },
  {
   "score": 6,
   "id": "dguknu7",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 18:15:17",
   "depth": 0,
   "text": "Jesus fucking christ this is the third anime attempted suicide this week. Japan do you wanna talk about it? We can get you to see a therapist you know."
  },
  {
   "score": 1,
   "id": "dguqkaa",
   "pid": "t1_dguknu7",
   "date": "2017-04-27 20:01:48",
   "depth": 1,
   "text": "Not for nothing, but Japan is known for having a culturally accepting attitude toward suicide - or at least it used to be. For one thing it's the only place I've been that consistently walls off its train tracks to deter jumpers."
  },
  {
   "score": 5,
   "id": "dgul1o9",
   "pid": "t1_dguknu7",
   "date": "2017-04-27 18:21:43",
   "depth": 1,
   "text": "Which were the others?"
  },
  {
   "score": 1,
   "id": "dgulmcd",
   "pid": "t1_dgul1o9",
   "date": "2017-04-27 18:31:35",
   "depth": 2,
   "text": "Trying not to spoil so I'll PM you\n"
  },
  {
   "score": 3,
   "id": "dgv7coz",
   "pid": "t3_67xrkh",
   "date": "2017-04-28 07:13:39",
   "depth": 0,
   "text": "I'd like to point out something that really struck me with the characterization of Naoto and Marie.\n\nLast week I mentioned how they were splitting roles with Marie getting the responsibilities and Naoto finding a shallow reason to tag along because he knew he was needed (notice how he didn't talk about AnchoR except at the beginning of this episode). They played it again in this episode.\n\nFor Marie it wasn't anything really special because she knew what she was doing, and we saw that she's not only a good commander but also very competent by herself and passionate about her task. This is reflected in the trust people have in her (or fear for that annoying guy with the military), but also how Naoto, someone who's shown he doesn't take being ordered around well, accepts her directives without discussions.\n\nFor Naoto, he wanted to avoid the responsibility of 20 million lives, but he looked both [embarrassed and happy](https://i.imgur.com/vY1k5Qj.jpg) when he was credited for saving them. And I might be imagining things (because he was worrying about RyuZU), but I feel like he was actually [disappointed](https://i.imgur.com/PsDDuIE.jpg) that this credit was taken from him right after.\n\nI really love those details in characterization. And actually that's why I'm not that big of a fan of RyuZU, she seems to lack a bit of it."
  },
  {
   "score": 5,
   "id": "dgu6gi1",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 13:36:18",
   "depth": 0,
   "text": "Yep, this is a show. but as a species i must ask, have we gone to far?\n"
  },
  {
   "score": 5,
   "id": "dgu7ngy",
   "pid": "t1_dgu6gi1",
   "date": "2017-04-27 13:57:17",
   "depth": 1,
   "text": "Not far enough.  We can always go deeper into hell"
  },
  {
   "score": 5,
   "id": "dgv6oam",
   "pid": "t1_dgu7ngy",
   "date": "2017-04-28 07:00:00",
   "depth": 2,
   "text": "Inverting gravity, let's go to heaven instead."
  },
  {
   "score": 2,
   "id": "dgu8a2d",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 14:08:40",
   "depth": 0,
   "text": "Ok I am officially scared of next episode...      \nThat author and the promise of a beach episode?         "
  },
  {
   "score": 1,
   "id": "dgu8xkz",
   "pid": "t1_dgu8a2d",
   "date": "2017-04-27 14:20:53",
   "depth": 1,
   "text": "What about the author? Is beach confirmed next week?"
  },
  {
   "score": 2,
   "id": "dgu976g",
   "pid": "t1_dgu8xkz",
   "date": "2017-04-27 14:25:47",
   "depth": 2,
   "text": "Not confirmed but the preview suggests,          \nand the author is well known for his fanservice (which I dont really like), maybe they keep it short and comedic"
  },
  {
   "score": 5,
   "id": "dguawk4",
   "pid": "t1_dgu976g",
   "date": "2017-04-27 14:59:17",
   "depth": 3,
   "text": "[Not sure if minor spoilers](/s \"The manga didn't really have a beach scene, just several fanservice shots of RyuZU in different outfits until Marie told them there was no time and then they moved along with the story, the preview though, showcased Marie in a swimsuit so this might unfortunately take at least one third of the next episode\")"
  },
  {
   "score": 2,
   "id": "dgufivk",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 16:37:46",
   "depth": 0,
   "text": "So nothing about she just stabbed a big gaping hole through her body? and how is it she only knocks out her heart and does no damage to any other gears?"
  },
  {
   "score": 5,
   "id": "dguv6ec",
   "pid": "t1_dgufivk",
   "date": "2017-04-27 21:47:25",
   "depth": 1,
   "text": "She managed to fix a gear that was 7 picometers in size.  That's 7*10^-9 mm.   \n\nSo what I'm saying is, a mechawizard did it."
  },
  {
   "score": 2,
   "id": "dgugfx4",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 16:57:01",
   "depth": 0,
   "text": "[This is why i love  RyuZu](https://puu.sh/vyoxO/618e5f7c5d.png)"
  },
  {
   "score": 4,
   "id": "dgu90b1",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 14:22:15",
   "depth": 0,
   "text": "This anime has a certain charm about it "
  },
  {
   "score": 1,
   "id": "dgujziw",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 18:03:09",
   "depth": 0,
   "text": "I'm happy that my interest in this has been renewed. After being bored at how slowly I felt the plot was progressing, with the teaser shown for episode 2 turning out to be at the very end of said episode, its good to get one with a lot of fighting and the characters getting shit done. "
  },
  {
   "score": 1,
   "id": "dgurd3x",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 20:17:47",
   "depth": 0,
   "text": "The manga is good but the anime feels lacking compared though maybe I just don't like the voice actors always yelling all the time but since I like the manga I'll wait till end of the season to say my final judgment "
  },
  {
   "score": 1,
   "id": "dgutv2b",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 21:13:14",
   "depth": 0,
   "text": "When RyuZu started speaking about the 4 trillion gears I thought she was going to go on about that many being in the planet, not *her* holy shit.\n\n"
  },
  {
   "score": 1,
   "id": "dguuxld",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 21:40:44",
   "depth": 0,
   "text": "music was pretty sick"
  },
  {
   "score": 1,
   "id": "dguuyk3",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 21:41:28",
   "depth": 0,
   "text": "I wasn't the only one expecting the whole time that the military wouldn't abort the purge just because the problem was solved, right?  This is why shounen & shounen-like heroes are idiots for not killing the villains when they have the chance.\n\nLooks like next week will be at least partially a swimsuit episode."
  },
  {
   "score": 1,
   "id": "dguws3r",
   "pid": "t3_67xrkh",
   "date": "2017-04-28 01:14:56",
   "depth": 0,
   "text": "I still love the OP for this and listen to it every time I watch! It kinda reminds me of the Gundam SEED openings"
  },
  {
   "score": 1,
   "id": "dgv74ag",
   "pid": "t3_67xrkh",
   "date": "2017-04-28 07:08:57",
   "depth": 0,
   "text": "\"have you heard these words before?\"\n\nPLUS ULTRA"
  },
  {
   "score": 1,
   "id": "di7zdc3",
   "pid": "t3_67xrkh",
   "date": "2017-05-30 04:08:51",
   "depth": 0,
   "text": "when the sound cuts out . what does RyuZu say . i dont get why they did it "
  },
  {
   "score": 1,
   "id": "dguqeo1",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 19:58:36",
   "depth": 0,
   "text": "He's the idiot we need but not the one we deserve.\n\nSo far this is like a dumb Hollywood movie, you know it's dumb but somehow you can enjoy it. But I still can't understand how Naoto wasn't even able to repair a clock.\n\nThat Marie throwing screwdrivers like kunais AND with some extent of spin in the right direction, that's some OP shit, but fits her.\n\nI wonder how many apparently meaningless gears are in there if the chief scientist(?) could break a cuople of that corridor and nothing happened. This planet is like Attack on Titan's walls. Nobody knows how the hell it was done, but let's just enjoy our peaceful lives.\n\nANYWAY, with the introductory arc finished, next week we have... A beach episode...? I don't actually know what to wait about it, that's good.\n\n\n"
  },
  {
   "score": 3,
   "id": "dguz6c3",
   "pid": "t1_dguqeo1",
   "date": "2017-04-28 03:14:06",
   "depth": 1,
   "text": "who knows, maybe the gears were only for controlling the next door or a light switch and they didn't really need them. \n\nAnd the screwdrivers were actually motorized, but yeah lol at the OP shit."
  },
  {
   "score": -1,
   "id": "dgv2hrk",
   "pid": "t1_dguz6c3",
   "date": "2017-04-28 05:19:17",
   "depth": 2,
   "text": "Motorized screwdrivers, I think I've seen everything by now."
  },
  {
   "score": 2,
   "id": "dgv8hoq",
   "pid": "t1_dgv2hrk",
   "date": "2017-04-28 07:35:45",
   "depth": 3,
   "text": "You say that like we don't already have handheld electric drills IRL or something"
  },
  {
   "score": 1,
   "id": "dgv8lun",
   "pid": "t1_dgv8hoq",
   "date": "2017-04-28 07:37:54",
   "depth": 4,
   "text": "Makes sense."
  },
  {
   "score": 1,
   "id": "dguqj10",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 20:01:03",
   "depth": 0,
   "text": "Hmm\n\n-Show not abundantly popular nor getting a lot of reddit comments because lack of generic tropes found in more popular anime\n\n-therefore /r/anime thinks its shit and generic\n\n-even though a lot of the existing comments say it's not shit nor generic\n\n^(wtf guys)\n\nThis show is **good**. It's not the ***greatest***. It does have its weird moments, and the characters' faces sometimes look pretty autistic. But I don't think I've noticed *any* generic shit. It's entertaining, even if you watch it ironically. After the first episode, I only kept watching ironically to see \"Oh boy what's going on in Clockwork Planet *this* time\" and starting last episode I actually look forward to the next episode.\n\nMC has priorities straight to protect and save the waifu material.\n\n[I mean look at this face](http://i.imgur.com/lsrbkPn.png)\n\nThis soundtrack is pretty good. Except for the intro the ED. That piano can make ears bleed.\n\n*AND* there's supposed to be a beach episode next. *On a planet made of gears.*"
  },
  {
   "score": 0,
   "id": "dgv4tur",
   "pid": "t1_dguqj10",
   "date": "2017-04-28 06:20:05",
   "depth": 1,
   "text": "Typical guy. *\"Muh anime doesn't get credit for being fun, so I'll say it's not generic\"*\n\n> -Show not abundantly popular nor getting a lot of reddit comments because lack of generic tropes found in more popular anime\n\nYou obviously never watched old school anime like Saber Marionette, Onegai Teacher, Chobits, Sora no Otoshimono and dozens of other titles with the overused formula of loser guy gets a waifu for free. Specially Saber Marionette & Chobits whose waifus are mechanical. \n\n>But I don't think I've noticed any generic shit.\n\nYou don't think an OP main that can slice & dice enemies without even getting a scratch isn't generic? or how about a couple of humans against several squads of robots getting shot at but never being hit nor scratched in a tunnel with no covering. How about the male MC being the underdog, but it's the only one that can save a whole city of 20 million habitants.\n\n> -even though a lot of the existing comments say it's not shit nor generic\n\nYou call around 30 to 40 peeps a lot? compared to a population of at least 2000 users in this sub? lol talk about turning a blind eye.\n\n>MC has priorities straight to protect and save the waifu material.\n\nLike eeeeeevery other waifu anime I mentioned before. Yeah, sure, your title reeks of originality there mate.\n\n\n>it's not shit nor generic\n\n>AND there's supposed to be a beach episode next.\n\nHow does that foot in your mouth tastes huh?"
  },
  {
   "score": 2,
   "id": "dgv9ns8",
   "pid": "t1_dgv4tur",
   "date": "2017-04-28 07:57:35",
   "depth": 2,
   "text": "Oh the elitist is here. I too like to be jaded as fuck and take only half sentences out of context as quotes to support my own argument.\n\n---------------------\n\n> Typical guy. *\"Muh anime doesn't get credit for being fun, so I'll say it's not generic\"*\n\n~~It's my lowest rated show of the season at 6/10~~ 7/10. If you can say it's generic you might as well call everything else generic as in \"has main characters. and plot. and other people. also features breathable air. 10/10\"\n\n> You obviously never watched old school anime like Saber Marionette, Onegai Teacher, Chobits, Sora no Otoshimono and dozens of other titles with the overused formula of loser guy gets a waifu for free. Specially Saber Marionette & Chobits whose waifus are mechanical.\n\nUsing your logic, purely because it uses that overused formula roughly 40% of all anime must also be shit. Also \"old school\"? Dafuq? Those were all made after 2000. And have at least a 7/10 on MAL. Total shit right? \n\nLet's say Clockwork Planet is generic. Then Sword Art Online is generic *out the ass* with \"trapped in a video game, die in-game die in real life, super OP edgy protagonist dressed in all black who is cookie-cutter generic\" but it's still near top of the charts and A-1 rolled in so much dough they couldn't care less if the show is generic, nevertheless it was fucking enjoyable. In Mirai Nikki, loser MC underdog basically gets his waifu handed to him on a silver platter during the beginning of the show. *Definitely* 100% shit amirite. KonoSuba fits your description as well.\n\n> You call around 30 to 40 peeps a lot? compared to a population of at least 2000 users in this sub? lol talk about turning a blind eye.\n\nRead: ***existing*** *comments* \n\nThere are nearly 500,000 subscribers in this subreddit with at least 2500 active at any given time. Apparently any post that doesn't receive at least that number of comments must be shit because it's  not popular.\n\nYou must ride the popular anime bandwagon and get free karma because almost no one will dislike those anime. And that must make you an authority figure on anime quality. Give yourself a pat on the back.\n\n> You don't think an OP main that can slice & dice enemies without even getting a scratch isn't generic? or how about a couple of humans against several squads of robots getting shot at but never being hit nor scratched in a tunnel with no covering. How about the male MC being the underdog, but it's the only one that can save a whole city of 20 million habitants.\n\nYeah the combat is shit, but the story and characters are fine. You think you can build a story where literally anyone, even the janitor of the building can fix the problem? No. You need to put relevance into the MC instead of him being involved purely because of him owning RyuZU. They were literally planning to kill MC because he was worthless when they met. MC is a clock/mechanical enthusiast and has a gift pertaining to that. \n\n> Like eeeeeevery other waifu anime I mentioned before. Yeah, sure, your title reeks of originality there mate.\n\nI'm not saying it's original. Try again. This show has its own flavor to separate it from other anime. Additionally, MC gave no shits about the 20M people and would've rather run away. RyuZU basically killed herself to convince him to fix it. Any anime that has a similar formula to another anime must clearly be shit. The same applies to any sort of entertainment- movies, TV, music, etc. \n\n> How does that foot in your mouth tastes huh?\n\nPlease try again with the full context.\n\nAs beach episode on *a planet made of fucking gears* is enough to make anyone, even those who haven't see it before, interested as in \"how the hell does that work\"\n\n--------------\n\nYou must have a great time objectively reviewing anime one frame at a time other than judging based on if it's enjoyable or not; the kind of person who prides themselves being the only person to know the absolute best of everything and no one is allowed to like anything else. You must be the life of the party.\n\n\nI'm trying to give readers a chance to watch this series on the chance that *they* like it. (It seems it's a bit late for that with the 3 episode test.) There are other less popular anime that even with its drawbacks I happened to enjoy and even rate higher than the popular ones. Yeah I rate shows based on enjoyability and not every damn component of making an anime, sue me. Less seasoned anime watchers are easily swayed by jaded and cynical asshats that assume authority and dismiss anything that doesn't meet their personal standards."
  },
  {
   "score": 2,
   "id": "dgv6tvj",
   "pid": "t1_dgv4tur",
   "date": "2017-04-28 07:03:07",
   "depth": 2,
   "text": "> You call around 30 to 40 peeps a lot? compared to a population of at least 2000 users in this sub?\n\nYou'd trust the 2000 people who dropped or didn't watch the show over those who are following it ? At least that view won't clash with the hivemind...\n\nThis show is good, if not for everyone."
  },
  {
   "score": 1,
   "id": "dgu9c4w",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 14:28:25",
   "depth": 0,
   "text": "I'm not sure what they think they're doing going to the beach when they've usurped the military's power and ultimate weapon.\n\nThere are big political gears in motion (pun intended) and only Naoto can afford to have that sort of tunnel vision.\n\nClearly, they're gearing up (no pun intended) to set up some sort of big \"fate of the planet\" confrontation between Naoto's harem and the military, but that kind of stupidity wasn't necessary to either advance or delay the plot.\n\n(My plot twist prediction: Marie is one of RyuZu's sisters, but she doesn't know it for herself. Maybe they'll run into an upturned tortoise on the beach so they can find out for sure)."
  },
  {
   "score": 2,
   "id": "dguqhne",
   "pid": "t1_dgu9c4w",
   "date": "2017-04-27 20:00:16",
   "depth": 1,
   "text": "> Naoto's harem\n\nIncluding Halter."
  },
  {
   "score": 3,
   "id": "dgvl58d",
   "pid": "t1_dguqhne",
   "date": "2017-04-28 11:26:36",
   "depth": 2,
   "text": "Especially Halter "
  },
  {
   "score": -2,
   "id": "dgudgye",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 15:53:54",
   "depth": 0,
   "text": "[deleted]"
  },
  {
   "score": 9,
   "id": "dgultii",
   "pid": "t1_dgudgye",
   "date": "2017-04-27 18:34:46",
   "depth": 1,
   "text": "I think that in reddit, when a show has less than 50 comments with the mayority of people saying is a good show, it means is bad, with only the few people who like it watching it. \n\nMAL´s episode forums are more honest about if a show is good or not."
  },
  {
   "score": -1,
   "id": "dgubtm4",
   "pid": "t3_67xrkh",
   "date": "2017-04-27 15:18:29",
   "depth": 0,
   "text": "kek"
  },
  {
   "score": 1,
   "id": "dgugykp",
   "pid": "t1_dgubtm4",
   "date": "2017-04-27 17:07:46",
   "depth": 1,
   "text": "Praise kek."
  },
  {
   "score": 1,
   "id": "dgucy9p",
   "pid": "t1_dgubtm4",
   "date": "2017-04-27 15:42:37",
   "depth": 1,
   "text": "kek of the season\n"
  }
 ]
}