{
 "score": 609,
 "id": "6ivpao",
 "num_comments": 140,
 "date": "2017-06-22 12:07:10",
 "comments": [
  {
   "score": 158,
   "id": "dj9mnhu",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 14:11:15",
   "depth": 0,
   "text": "[This is the best fallen Guri moment.](http://imgur.com/rUmJe9l)"
  },
  {
   "score": 15,
   "id": "djcav6k",
   "pid": "t1_dj9mnhu",
   "date": "2017-06-24 07:22:33",
   "depth": 1,
   "text": "http://i.imgur.com/XD5Fl84.png"
  },
  {
   "score": 2,
   "id": "djcqas4",
   "pid": "t1_djcav6k",
   "date": "2017-06-24 13:24:04",
   "depth": 2,
   "text": "Body pillow case soon^TM"
  },
  {
   "score": 39,
   "id": "dj9w5r6",
   "pid": "t1_dj9mnhu",
   "date": "2017-06-22 17:14:12",
   "depth": 1,
   "text": "Fallen Guri's moodswings made this episode for me. "
  },
  {
   "score": 46,
   "id": "dj9yhhe",
   "pid": "t1_dj9w5r6",
   "date": "2017-06-22 18:00:29",
   "depth": 2,
   "text": "I loved Fallen Guri's design more then normal Guri."
  },
  {
   "score": 10,
   "id": "dja68o4",
   "pid": "t1_dj9yhhe",
   "date": "2017-06-22 20:50:04",
   "depth": 3,
   "text": "Is even better in the manga! :D"
  },
  {
   "score": 54,
   "id": "dj9z2zt",
   "pid": "t1_dj9mnhu",
   "date": "2017-06-22 18:12:38",
   "depth": 1,
   "text": "Makes the heart go doki doki\n\n[](#selfcontrol)"
  },
  {
   "score": 174,
   "id": "dj9i6bk",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:54:55",
   "depth": 0,
   "text": "So Akane killed Cerberus, the guardian of Hell. She got into Hell by imagining Seiji with another wife and children, which caused her to die of shock.\n\nI can't believe this anime was so disliked despite having gems like that. Renai Boukun wasn't a comedy anime where every episode is a shiny golden nugget that's indivudually precious, but instead the episodes felt like a treasure chest, where each episode had all these shiny, beautiful things to behold. It was batshit insane all the way through, and I wouldn't have it any other way. One of the best anime of the year for sure."
  },
  {
   "score": 73,
   "id": "dj9m0ja",
   "pid": "t1_dj9i6bk",
   "date": "2017-06-22 13:59:50",
   "depth": 1,
   "text": "When Akane arrived at Hell I thought...\n\n[She is the only one who knows how to make a good entrance!](https://pbs.twimg.com/media/C_CqTi5UQAAPe8L.jpg:large)\n\nI agree with you, this anime was way more enjoyable than other comedy harems. It's a shame it was so disliked by most people."
  },
  {
   "score": 14,
   "id": "dja606n",
   "pid": "t1_dj9m0ja",
   "date": "2017-06-22 20:44:30",
   "depth": 2,
   "text": "Well to be fair, the show's pacing was really rushed. The manga takes it slow, so the comedic elements are much more obvious."
  },
  {
   "score": 160,
   "id": "dj9h007",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:35:46",
   "depth": 0,
   "text": "Demon king just entered Top 10 anime NTR. I feel really sad for him, haha! Overall it's a very enjoyable and fun series to watch. Great comedy, a lot of kisses, tons of tropes! A bit sad to see it finally ends, and waiting for the manga's update is hell...\n\n[Cute endcard of Guri, too!](http://i.imgur.com/sly4dyM.jpg)"
  },
  {
   "score": 28,
   "id": "dj9x19e",
   "pid": "t1_dj9h007",
   "date": "2017-06-22 17:31:21",
   "depth": 1,
   "text": "/r/cutelittlefangs"
  },
  {
   "score": 7,
   "id": "djax6t2",
   "pid": "t1_dj9x19e",
   "date": "2017-06-23 09:41:43",
   "depth": 2,
   "text": "I might have read that a little wrong o_o"
  },
  {
   "score": 7,
   "id": "djqins8",
   "pid": "t1_djax6t2",
   "date": "2017-07-03 12:54:20",
   "depth": 3,
   "text": "r/cutelittleFAGS"
  },
  {
   "score": 60,
   "id": "dj9h4gb",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:37:45",
   "depth": 0,
   "text": "[This show really loves its pop culture references](http://i.imgur.com/aPCFpvv.png)\n\n[And Shikimi now officially joins the harem!](http://i.imgur.com/FB71X6h.png)\n\nWell that was as bit as crazy as I expected it to be. The entire bit where Akane just broke into Hell was hilarious! I wish we got to see more of [Guri's mom](http://i.imgur.com/9SwGgXw.png) though. Anyway, what a fun a crazy ride. 8/10 would get stabbed by Akane multiple times."
  },
  {
   "score": 3,
   "id": "djafkle",
   "pid": "t1_dj9h4gb",
   "date": "2017-06-23 02:08:45",
   "depth": 1,
   "text": "Can I get a link to the reference please. I am so lost on it. "
  },
  {
   "score": 9,
   "id": "djafl4z",
   "pid": "t1_djafkle",
   "date": "2017-06-23 02:09:29",
   "depth": 2,
   "text": "It's the Warp Pipe from Super Mario."
  },
  {
   "score": 4,
   "id": "djav5jj",
   "pid": "t1_djafl4z",
   "date": "2017-06-23 09:06:08",
   "depth": 3,
   "text": "and it's got a little cardboard lid to keep mario from popping out"
  },
  {
   "score": 23,
   "id": "dj9hx63",
   "pid": "t1_dj9h4gb",
   "date": "2017-06-22 12:50:47",
   "depth": 1,
   "text": "if you want to read the manga, the next arc focuses on her. [slight spoilers](/s \"it also explains what happened to the sisters dad\")"
  },
  {
   "score": 48,
   "id": "dj9ozwx",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 14:54:12",
   "depth": 0,
   "text": "PLEASE KYS\n\n[](#airfist)\n\n\nOthewise you won't be able to go to hell and save Guri.\n\nA really nice wrap up of what was expected to be a harem ending, and one of the very few good ones if I may say. And like a couple of peeps have said, Shikimi's background story feels cheap, but it's nice she finally joined the harem and she can still be a true demon without powers.\n\nI'm amazed how such a small studio like EMT^2 managed to pull out this show. Sure the animation is very limited and the backgrounds are almost unnexistant, but it's quite remarkable they managed to pull out a 12 episode full 24 min show were their previous shows were less than 5 min episodes."
  },
  {
   "score": 24,
   "id": "dja2t20",
   "pid": "t1_dj9ozwx",
   "date": "2017-06-22 19:33:16",
   "depth": 1,
   "text": "I don't really understand what the author is doing with Shikimi. Her backstory just told us that she was always an unsympathetic sociopath, and Guri letting her join the harem is frankly just disgustingly cruel to other members of the harem who either hate her or have been repeatedly *tortured* by her. It's just weird because Shikimi is so maliciously evil and everyone but Akane and Seiji, including the author apparently, just kind of shrug and act like she's never done anything that bad."
  },
  {
   "score": 1,
   "id": "djargh2",
   "pid": "t1_dja2t20",
   "date": "2017-06-23 07:59:20",
   "depth": 2,
   "text": "I'm not sure what you were expecting... this show finds it funny when people radically change their characters in the blink of an eye.\n\nAlternately, Guri is manipulating Shikimi, who had become a problem, to be less annoying in the interest of achieving her own immortality down the road.\n\nBut really, Shikimi is an integral part of their lives/the story, and the fact that Akane can and will murder her given the slightest provocation restrains her character's ability to interact with the others, especially if things go off the rails even more."
  },
  {
   "score": 3,
   "id": "djabx95",
   "pid": "t1_dja2t20",
   "date": "2017-06-22 23:35:05",
   "depth": 2,
   "text": "Which makes this a radical show – I'm still smarting from when Shikimi flipped it from a laff fest to a sick horror tale. And here we are back again."
  },
  {
   "score": 36,
   "id": "dj9xw9r",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 17:48:38",
   "depth": 0,
   "text": "[LITTLE GURI IS SO CUTE](http://imgur.com/SLFDmFE)\n\nI'm going to really miss this show, and now that Shikimi is part of the harem, season 2 confirmed, right? Just think of all the shenanigans! \n\nAnyway, this show was a pretty fun ride. I loved how derailed it got, all while keeping plot towards the end. I hope to see an OVA or two come out of this. Maybe some more backstory on Guri's mom. "
  },
  {
   "score": 5,
   "id": "dja0tcd",
   "pid": "t1_dj9xw9r",
   "date": "2017-06-22 18:50:02",
   "depth": 1,
   "text": "It'll probably be a while.  The manga is around 1/2 a season ahead, at this seasons pace of adaptation.  Maybe 2/3 if I'm being generous.  But I think it will be worth it.  I just hope it did well enough in Japan for a second season to happen."
  },
  {
   "score": 4,
   "id": "dja19k7",
   "pid": "t1_dja0tcd",
   "date": "2017-06-22 18:59:55",
   "depth": 2,
   "text": "One can only hope.\n\nI'll most likely end up picking up the manga in the near future though. "
  },
  {
   "score": 37,
   "id": "dja66t3",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 20:48:50",
   "depth": 0,
   "text": "Hell = corporate world?  Sounds legit.\n\nIf anyone wanted to rile up some Christians, tell them about that show where god marries a demon and has a kid with her, then cheats on her and she leaves him"
  },
  {
   "score": 8,
   "id": "djblwpe",
   "pid": "t1_dja66t3",
   "date": "2017-06-23 17:43:21",
   "depth": 1,
   "text": "Latter-day Saint here: This show is freakin hilarious. "
  },
  {
   "score": 13,
   "id": "djai2jf",
   "pid": "t1_dja66t3",
   "date": "2017-06-23 04:02:04",
   "depth": 1,
   "text": "Greek theists: Sounds about right."
  },
  {
   "score": 94,
   "id": "dj9fwal",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:17:29",
   "depth": 0,
   "text": "I WANT A SECOND SEASON.I WANT THEM TO KISS MORE:)"
  },
  {
   "score": 31,
   "id": "dj9x07y",
   "pid": "t1_dj9fwal",
   "date": "2017-06-22 17:30:45",
   "depth": 1,
   "text": "One the bringht side, it seems the manga is being translated regularly!\n\n[](#nico-heart)"
  },
  {
   "score": 2,
   "id": "djakjzv",
   "pid": "t1_dj9x07y",
   "date": "2017-06-23 05:27:03",
   "depth": 2,
   "text": "Regularly? According Manga updates the last chapter was translated more than 2 months ago."
  },
  {
   "score": 3,
   "id": "dj9xzsq",
   "pid": "t1_dj9x07y",
   "date": "2017-06-22 17:50:40",
   "depth": 2,
   "text": "How far along is it compared to the anime?"
  },
  {
   "score": 4,
   "id": "dja0fbi",
   "pid": "t1_dj9xzsq",
   "date": "2017-06-22 18:41:29",
   "depth": 3,
   "text": "I'd say it's between 2/3 and 3/4 of a season ahead.  Maybe a little less.\n\nEdit:  No, I'm being generous.  It's probably closer to half a season."
  },
  {
   "score": 9,
   "id": "dja02xx",
   "pid": "t1_dj9xzsq",
   "date": "2017-06-22 18:34:06",
   "depth": 3,
   "text": "Significantly farther ahead. I'm not sure of the exact volume/chapter numbers, but at least a couple arcs."
  },
  {
   "score": 3,
   "id": "dja09g2",
   "pid": "t1_dja02xx",
   "date": "2017-06-22 18:37:58",
   "depth": 4,
   "text": "What chapter should I begin at, if I want to read the manga from here on out. "
  },
  {
   "score": 27,
   "id": "dja0gpz",
   "pid": "t1_dja09g2",
   "date": "2017-06-22 18:42:19",
   "depth": 5,
   "text": "The beginning.  Always start from the beginning.  Even as excellent as this adaptation was, all adaptations always leave things out.  Never ever start from where an anime left off."
  },
  {
   "score": 3,
   "id": "djaadoh",
   "pid": "t1_dja0gpz",
   "date": "2017-06-22 22:42:39",
   "depth": 6,
   "text": "Is there a subreddit for it?"
  },
  {
   "score": 11,
   "id": "djadde6",
   "pid": "t1_djaadoh",
   "date": "2017-06-23 00:30:14",
   "depth": 7,
   "text": "There is, but it was a stillborn."
  },
  {
   "score": 53,
   "id": "dj9ga1n",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:23:44",
   "depth": 0,
   "text": "What a wild ride.\n\nWhile seemingly episodic, its still manage to pull one solid overarching plot amidst the comedy.\n\nSeason 2 when?"
  },
  {
   "score": 11,
   "id": "djac3gr",
   "pid": "t1_dj9ga1n",
   "date": "2017-06-22 23:41:17",
   "depth": 1,
   "text": "When Kami finally confesses why he was dicking around?"
  },
  {
   "score": 30,
   "id": "dj9iz6v",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:08:14",
   "depth": 0,
   "text": "I like how I could instantly tell the ED was different but i still have no idea what it's saying. "
  },
  {
   "score": 14,
   "id": "dj9rkt3",
   "pid": "t1_dj9iz6v",
   "date": "2017-06-22 15:43:56",
   "depth": 1,
   "text": "Guri's VA sang the ED, and they changed the title and some lyrics from \"'Suki' wo Oshiete\" (Say 'you like me') to \"'Suki' wo Oshiete Kudasai\" (Please say 'you like me').\n\nSomething cool is that the original ED was by SmileY inc. whose vocalist is Yuka Ootsubo who is the VA of Mari Shiina."
  },
  {
   "score": 47,
   "id": "dj9g95e",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:23:19",
   "depth": 0,
   "text": "Ok, as someone who hasn't seen the show but is vaguely interested, does the Yandere win?"
  },
  {
   "score": 9,
   "id": "dj9gdrn",
   "pid": "t1_dj9g95e",
   "date": "2017-06-22 12:25:27",
   "depth": 1,
   "text": "She is the main love interest, they are dating, but this show isn't just about the romance."
  },
  {
   "score": 16,
   "id": "dj9i02d",
   "pid": "t1_dj9g95e",
   "date": "2017-06-22 12:52:08",
   "depth": 1,
   "text": "[Manga](/s \"The manga is still ongoing, but the latest several chapters have had it lean more towards Guri than Akane. Dunno why 0mincious thinks Akane is the main love interest, either.\")"
  },
  {
   "score": 3,
   "id": "dj9ny2h",
   "pid": "t1_dj9i02d",
   "date": "2017-06-22 14:34:47",
   "depth": 2,
   "text": "[spoiler tag just in case](/s \"I feel like this is the first harem where I'm conflicted on who I want to be best. Does the manga make this shift more acceptable?\")"
  },
  {
   "score": 15,
   "id": "dj9pb1c",
   "pid": "t1_dj9ny2h",
   "date": "2017-06-22 14:59:56",
   "depth": 3,
   "text": "[just in case](/s \"There is no damn shift imo. Guri is just officially brought into the fold, given how she kind of wasn't serious before. It's obviously a harem, that'll end as a harem. They just introduced *another* girl after all...\")"
  },
  {
   "score": 16,
   "id": "dj9p9yl",
   "pid": "t1_dj9ny2h",
   "date": "2017-06-22 14:59:23",
   "depth": 3,
   "text": "[Manga spoiler](/s \"If you are having a tough time deciding who should you ship for, then worry more! Latest arc has a new character, a princess from another world! And she's a cutie, too! Kissed Seiji, too!\")"
  },
  {
   "score": 20,
   "id": "dj9pn9f",
   "pid": "t1_dj9p9yl",
   "date": "2017-06-22 15:06:20",
   "depth": 4,
   "text": "This is the epitome of harem isn't?"
  },
  {
   "score": 2,
   "id": "dj9x4vt",
   "pid": "t1_dj9pn9f",
   "date": "2017-06-22 17:33:20",
   "depth": 5,
   "text": "Has Yuki Rito finally found a contender?"
  },
  {
   "score": 3,
   "id": "djab3wg",
   "pid": "t1_dj9x4vt",
   "date": "2017-06-22 23:06:29",
   "depth": 6,
   "text": "No, since he doesn't fall into girls all the time."
  },
  {
   "score": 4,
   "id": "dj9ptbu",
   "pid": "t1_dj9pn9f",
   "date": "2017-06-22 15:09:35",
   "depth": 5,
   "text": "Aye! And it's a good one! Btw the manga has a lot more details than the anime, so I recommend re-reading it from chapter 1, lolz."
  },
  {
   "score": 6,
   "id": "djahqn5",
   "pid": "t1_dj9i02d",
   "date": "2017-06-23 03:48:07",
   "depth": 2,
   "text": "They both love each other even before Guri wrote their names in the Love Note. At this moment in time, in the anime, Akane is the main love interest with the rest being there for the harem."
  },
  {
   "score": 2,
   "id": "djahub2",
   "pid": "t1_djahqn5",
   "date": "2017-06-23 03:52:28",
   "depth": 3,
   "text": "Something tells me you're not too familiar with harems/rom-coms because this type of scenario is incredibly common, and almost *never* goes for the initial love interest, even more so when it's a harem rom-com with a supernatural element in it."
  },
  {
   "score": 27,
   "id": "dj9po6a",
   "pid": "t1_dj9i02d",
   "date": "2017-06-22 15:06:48",
   "depth": 2,
   "text": "[manga](/s \"There is literally no way this isn't a harem ending. His harem's mothers were part of a harem even.\")\n"
  },
  {
   "score": -1,
   "id": "djacsgm",
   "pid": "t1_dj9po6a",
   "date": "2017-06-23 00:07:16",
   "depth": 3,
   "text": "[Manga](/s \"I'd be more inclined to believe it was going to actually end in a harem if there was ever a precedent when it came to manga ending in harems. It just never happens outside of the fanservice heavy ones. This is a rom-com leaning far more towards the comedy, there's just no way this ends as a harem.\")"
  },
  {
   "score": 4,
   "id": "djahpq7",
   "pid": "t1_dj9g95e",
   "date": "2017-06-23 03:47:02",
   "depth": 1,
   "text": "Which yandere?"
  },
  {
   "score": 2,
   "id": "djaxdlc",
   "pid": "t1_djahpq7",
   "date": "2017-06-23 09:44:55",
   "depth": 2,
   "text": "there is only one yandere"
  },
  {
   "score": 2,
   "id": "djddtuf",
   "pid": "t1_djaxdlc",
   "date": "2017-06-25 00:46:18",
   "depth": 3,
   "text": "There are at least two if you are very strict on the definition of yandere."
  },
  {
   "score": 29,
   "id": "dj9resk",
   "pid": "t1_dj9g95e",
   "date": "2017-06-22 15:40:38",
   "depth": 1,
   "text": "[\\SPOILER](/s \" In the manga, the MC has definitely expressed his affection for Akane (red head). It remains to be seen if he does end up liking anyone later, but akane's ship is going strong. It does however seem that we will get a harem end. (especially given that we already have a man with multiple wives in akane's father \")"
  },
  {
   "score": 148,
   "id": "dj9ge3n",
   "pid": "t1_dj9g95e",
   "date": "2017-06-22 12:25:36",
   "depth": 1,
   "text": "It's a harem ending. Everybody wins in this show."
  },
  {
   "score": 39,
   "id": "dj9ruj5",
   "pid": "t1_dj9ge3n",
   "date": "2017-06-22 15:49:18",
   "depth": 2,
   "text": "Everyone except MC."
  },
  {
   "score": 22,
   "id": "dj9imux",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:02:32",
   "depth": 0,
   "text": "my most aniticipated anime of the spring did not dissapoint, beautiful ending to a harem that lets you have some closure from the end of an arc but still lets you know there's more to come ^season ^^2 ^^^when.\n\nthe way they left last week made me really scared how the season would end and they did not let me down, every one of their episodes is packed with so much fun, here we got a glimpse of Guri's mom and her relationship with demon king. Hell looking like a corporate world was a hilarious touch and loved how Akane came to get Seiji by imagining him with a happy family. \n\nknowing its an ongoing manga made me skeptical at first but i'm pretty sure this is going to take my AOTS simply for how much i looked forward to an episode every week, asking for a season 2 and some nendoroids isnt too much right ;)\n\n ^Akane ^^best ^^Girl ^^^Figure ^^^pls."
  },
  {
   "score": 3,
   "id": "dja0kqp",
   "pid": "t1_dj9imux",
   "date": "2017-06-22 18:44:41",
   "depth": 1,
   "text": "I want Nendoroids and Figmas so bad right now."
  },
  {
   "score": 34,
   "id": "dj9hvlw",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:50:05",
   "depth": 0,
   "text": "Man, that was a ride. \n\nI'm not sure that last arc worked quite so well as the rest of the show when it started shedding madcap comedy for slightly half-arsed melodrama, but Renai Bokun was a big and pleasant surprise this season. "
  },
  {
   "score": 9,
   "id": "dj9t5m4",
   "pid": "t1_dj9hvlw",
   "date": "2017-06-22 16:15:45",
   "depth": 1,
   "text": "> I'm not sure that last arc worked quite so well as the rest of the show when it started shedding madcap comedy for slightly half-arsed melodrama\n\nYou are not alone here, for a story which doesn't take itself seriously, drama falls short. Though this and Akane arc, are the only ones which try to be this serious in manga. Madness and crazy girls is what suits it best."
  },
  {
   "score": 15,
   "id": "dj9r000",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 15:32:27",
   "depth": 0,
   "text": "Overall the ending certainly wasn't bad, but I really wish they wouldn't have tried to redeem Shikimi's character. I was fine with her just being one of those people that is evil from her core just because that's how she is. "
  },
  {
   "score": 1,
   "id": "dja0nin",
   "pid": "t1_dj9r000",
   "date": "2017-06-22 18:46:25",
   "depth": 1,
   "text": "You probably shouldn't read the manga then.  She's redeemed even further."
  },
  {
   "score": 12,
   "id": "dj9tdhh",
   "pid": "t1_dj9r000",
   "date": "2017-06-22 16:20:14",
   "depth": 1,
   "text": "> but I really wish they wouldn't have tried to redeem Shikimi's character.\n\nI'm not sure \"I didn't have enough attention in childhood, so now I torture people for fun\" thing worked for anyone but Shikimi fans anyway."
  },
  {
   "score": 6,
   "id": "dj9tje1",
   "pid": "t1_dj9tdhh",
   "date": "2017-06-22 16:23:39",
   "depth": 2,
   "text": "I just don't like that they just shoved her in the harem. She was better as an outside antagonistic force, but whatever. Its a harem show, which I normally avoid like the plague, but this one was funny enough that it was worth it. "
  },
  {
   "score": 14,
   "id": "dj9rqug",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 15:47:17",
   "depth": 0,
   "text": "Lmao the way Akane died was hilarious, and she beat freaking Cerberus lol. This has to be the most random entrance ever.\n\nAlso Guri's mom is super cute, how could Kami had cheated on her? What a scumbag."
  },
  {
   "score": 37,
   "id": "dj9gs5l",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:32:06",
   "depth": 0,
   "text": "That was a nice ending but why isn't [best girl](https://i.imgur.com/y1u7lqI.png) in [the ED image](https://i.imgur.com/cp7d1HU.jpg)??? I kept waiting for her to be added and she never was!!!"
  },
  {
   "score": 3,
   "id": "djaxd5u",
   "pid": "t1_dj9gs5l",
   "date": "2017-06-23 09:44:43",
   "depth": 1,
   "text": "ikr? yuzu became best girl over time so it would have made sense to add her over time"
  },
  {
   "score": 2,
   "id": "djbc4jf",
   "pid": "t1_djaxd5u",
   "date": "2017-06-23 14:11:57",
   "depth": 2,
   "text": "I'm gonna miss that voice of hers. Am willing to follow other series that her seiyuu will be in. "
  },
  {
   "score": 11,
   "id": "dj9ye49",
   "pid": "t1_dj9gs5l",
   "date": "2017-06-22 17:58:35",
   "depth": 1,
   "text": "Best Girl always gets the worst deal. Are you surprised?"
  },
  {
   "score": 10,
   "id": "dj9i2wq",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:53:24",
   "depth": 0,
   "text": "Nice to have Guri essentialy realise her own problems given just a bit of stimulus and resolve the situation herself. With Shikimi also in the harem now I feel like it's bout time to include Akua to balance things out a bit, she already knows about Corraly anyway.\n\nAs for the show in general it's probably my favourite thing this seasonand did a surprisingly good job despite including just about every tag imaginable. Solid 8/10 overall."
  },
  {
   "score": 9,
   "id": "dj9q0yb",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 15:13:35",
   "depth": 0,
   "text": "I feel like things solved themselves a bit too fast in this show.\n\nEspecially this \"arc\", Guri turning into a demon seemed like a big deal, and yet, one episode later, it's over. \n\nLast episode I was expecting this to end in a cliffhanger to encourage me to read the manga and see how this Guri will eventually be turned back. Today... things are fine and now I'm not as motivated on picking up the manga right now.\n\nStill, this started and held on as my favorite non-sequel of the season. Then again. this was a great season for sequels, not so much for the others. \n\n[8/10] : Extra points for yanderefest. "
  },
  {
   "score": 6,
   "id": "dj9w248",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 17:12:11",
   "depth": 0,
   "text": "From a show, which I expected to be a generic harem type, I got a lot more. There were so many hilarious moments, especially in the beginning. \n\nThis show had all the tags: yuri, yaoi, yandere, tsundere, (almost)incest, angels, demons, demon rapist penguin, fujioshi, psycho, sadism, harem, stalking, bondage, love polygon, etc.\n\nThat being said, it's time to add it to my manga reading list."
  },
  {
   "score": 5,
   "id": "dj9qfxr",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 15:21:37",
   "depth": 0,
   "text": "Well that was fun, does anyone know at which manga chapter did anime end?"
  },
  {
   "score": 1,
   "id": "dj9r9s5",
   "pid": "t1_dj9qfxr",
   "date": "2017-06-22 15:37:51",
   "depth": 1,
   "text": "[deleted]"
  },
  {
   "score": 2,
   "id": "dj9xfqe",
   "pid": "t1_dj9r9s5",
   "date": "2017-06-22 17:39:17",
   "depth": 2,
   "text": "ch 33"
  },
  {
   "score": 7,
   "id": "dj9x8w2",
   "pid": "t1_dj9qfxr",
   "date": "2017-06-22 17:35:27",
   "depth": 1,
   "text": "I'd honestly recommend that you start the manga from the beginning. The anime was a nice adaptation but it really missed a TON of funny moment and interactions."
  },
  {
   "score": 1,
   "id": "djbusht",
   "pid": "t1_dj9x8w2",
   "date": "2017-06-23 21:10:20",
   "depth": 2,
   "text": "damn right i was i bit triggered because of it but enjoyed nonetheless. "
  },
  {
   "score": 9,
   "id": "dj9rt6u",
   "pid": "t1_dj9qfxr",
   "date": "2017-06-22 15:48:33",
   "depth": 1,
   "text": "This episode ends up in chapter 33 in the manga."
  },
  {
   "score": 3,
   "id": "djbulqf",
   "pid": "t1_dj9rt6u",
   "date": "2017-06-23 21:05:19",
   "depth": 2,
   "text": "I wouldn't read from there, they cut a lot out."
  },
  {
   "score": 1,
   "id": "djbuqt3",
   "pid": "t1_djbulqf",
   "date": "2017-06-23 21:09:03",
   "depth": 3,
   "text": "indeed. If you want to know the story very well just read the entire thing even though they haven't released a chapter in about 2 months but it'll help you understand what's going on here and there and the reason the anime version feels rushed."
  },
  {
   "score": 3,
   "id": "dj9l7y5",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:46:08",
   "depth": 0,
   "text": "Oh boy, this anime was so much fun. I loved every second of it, its random humour, its deconstruction of the harem genre, and it even asked some serious questions about [what is love](https://www.youtube.com/watch?v=STp84ahCURw)!\n\nI hope they make a second season, although I wouldn't count on it.\n\nHighlight of the episode: when Guri says what she want from Seiji. Too damn cute."
  },
  {
   "score": 5,
   "id": "dj9mgeb",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 14:07:40",
   "depth": 0,
   "text": "man we didn't get to see much of Guri's mom. In the manga after this part, Guri's mom makes a lot more appearances and I love her personality."
  },
  {
   "score": 8,
   "id": "dj9kgp8",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:33:09",
   "depth": 0,
   "text": "I'm all about Akane being best girl but damn I'd be lying if I said this episode didn't make me swap that out for Guri! \n\nDefinitely gonna have to read the manga now! \n\n**A solid 8/10!** "
  },
  {
   "score": 7,
   "id": "dj9lvk3",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:57:25",
   "depth": 0,
   "text": "I have mixed feelings..."
  },
  {
   "score": 3,
   "id": "dj9k8i5",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:29:20",
   "depth": 0,
   "text": "This was a fun show. Guri and Yuzu carried the sketches and story and the whiplash was weird at times but I enjoyed it. \n\nDefinitely an enjoyable comedy for myself and I think it belongs in the same realm in Jitsu wa watashi wa where it's aight but I feel the manga is where this stuff shines the best. "
  },
  {
   "score": 3,
   "id": "dj9kscq",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:38:43",
   "depth": 0,
   "text": "The ending of Renai Boukun was really sweet, Guri finally realising what love is and finally telling Seji-san that she loved him!"
  },
  {
   "score": 3,
   "id": "dj9pno7",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 15:06:32",
   "depth": 0,
   "text": "I really liked this show. Wasn't anything special but it was entertaining and pulled all the right strings for me.\n\nYuzu was probably my favorite girl but they were all fun."
  },
  {
   "score": 3,
   "id": "dj9qm2s",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 15:25:00",
   "depth": 0,
   "text": "For a comedy harem, that had more plot than I expected and I liked that Akane stayed Yandere to the bitter end, because she was an entertaining one. Actually the cast chemistry was good here and it's nice having a decent  harem MC for a change."
  },
  {
   "score": 3,
   "id": "dj9sstk",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 16:08:29",
   "depth": 0,
   "text": "Holy shit the feels at the end of that episode."
  },
  {
   "score": 3,
   "id": "dj9za8m",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 18:16:51",
   "depth": 0,
   "text": "Who's that girl with the black hair in the OP?"
  },
  {
   "score": 4,
   "id": "djavw3u",
   "pid": "t1_dj9za8m",
   "date": "2017-06-23 09:19:07",
   "depth": 1,
   "text": "The class rep from the student-teacher relationship. Took me a while to be sure of that too."
  },
  {
   "score": 1,
   "id": "djawch1",
   "pid": "t1_djavw3u",
   "date": "2017-06-23 09:27:02",
   "depth": 2,
   "text": "Thank you! It was annoying me for quite a while."
  },
  {
   "score": 3,
   "id": "dja1fzq",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 19:03:51",
   "depth": 0,
   "text": "I was going to give this a 7, but for being the only anime I seriously waited every week... It deserves an 8. Maybe 8,5/10. Nothing else to say, everything's in other comments. The ending was just **right**, nothing special, it was a nice little comedy that yells \"Now go read the manga\", perfect for one casual binge-watching night."
  },
  {
   "score": 4,
   "id": "dj9ks7a",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:38:39",
   "depth": 0,
   "text": "GURI!!!!!!! <3"
  },
  {
   "score": 4,
   "id": "dj9s9pk",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 15:57:45",
   "depth": 0,
   "text": "Glad I watched this gem !  \n8.5/10 => 9/10 on MAL because it has so much unique stuff (atleast unique for me)  \nand I loved all the characters. Every episode made my mood spike and I never  \nskipped the OP because it is just so awesome ! Hope to see more of it before I die."
  },
  {
   "score": 2,
   "id": "dj9jagv",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:13:28",
   "depth": 0,
   "text": "Well, that was a pretty fun ride. My favorite thing about this show, to this very day, is the OP, specifically the part where it zooms in on Akane's chest. Makes me laugh every time."
  },
  {
   "score": 2,
   "id": "dj9sqao",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 16:07:06",
   "depth": 0,
   "text": "It is a fine show, I had read good things about the manga, so maybe I set my expectations a bit too high. The show sometimes combined complete craziness with character development, and I'm not sure how much of that worked.\n\nI think that the biggest flaw of the series is Shikimi's character, her backstory it's poor, I've never been comfortable about how she was the main villian and part of the main cast at the same time. Also The MC was really forgettable, but besides that, it was ok, although it wouldn't be my first recommendation to someone looking for a harem romcom."
  },
  {
   "score": 2,
   "id": "dj9tgdi",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 16:21:54",
   "depth": 0,
   "text": "well, that was something. "
  },
  {
   "score": 2,
   "id": "dj9vsdr",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 17:06:56",
   "depth": 0,
   "text": "I thought this anime had a strong beginning and end. Enjoyed it overall, but nothing over the top. Characters were okay and likeable."
  },
  {
   "score": 2,
   "id": "dj9xppr",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 17:44:57",
   "depth": 0,
   "text": "How I would describe renai bouken \n\nLOL\n\n7/10 too, I enjoyed the parody element and all the cliché tropes "
  },
  {
   "score": 2,
   "id": "dja652x",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 20:47:42",
   "depth": 0,
   "text": "Is waking up beside best girl really that bad?"
  },
  {
   "score": 2,
   "id": "djab24e",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 23:04:43",
   "depth": 0,
   "text": "I only just realised that Maoh is voiced by Dio's voice actor. "
  },
  {
   "score": 2,
   "id": "djacdhz",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 23:51:32",
   "depth": 0,
   "text": "Will there be a season 2?"
  },
  {
   "score": 2,
   "id": "djam9ec",
   "pid": "t1_djacdhz",
   "date": "2017-06-23 06:12:02",
   "depth": 1,
   "text": "We can hope"
  },
  {
   "score": 2,
   "id": "djactm4",
   "pid": "t3_6ivpao",
   "date": "2017-06-23 00:08:31",
   "depth": 0,
   "text": "so no one is going to talk about the mario reference "
  },
  {
   "score": 2,
   "id": "djas67k",
   "pid": "t3_6ivpao",
   "date": "2017-06-23 08:12:39",
   "depth": 0,
   "text": "Oh man, that was great. It wasn't anything incredible, just a good old fun ride. When an anime makes me enjoy it's time with it, than that's a good show in my book. Does anyone know where the anime stops in the manga, I just need more Akane in my life."
  },
  {
   "score": 2,
   "id": "dj9j881",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:12:25",
   "depth": 0,
   "text": "A pretty unnoteworthy final episode overall, apart from some small things. Most of what happened happened the exact way I expected it to, but that's okay. Shikimi's lazily written backstory only makes me like her less, but other than that this episode didn't really change how I feel about this show. I also don't really like how they made her 'part of the gang' even though she was an antagonizing bitch 5 minutes beforehand, but I'll overlook it.\n\n**Final Verdict**\n\nOverall, this was a pretty enjoyable show to watch. Most of the cast was charming and had fun interactions with each other, and the comedy overall was enjoyable but not especially hilarious. The Drama was fine at times, but lacking at others. The overarching storyline and ending were unnoteworthy, but okay. Overall this show was about average. Its comedy was fun but nothing special, and its drama was a bit lacking but nothing offensive. Yuzu is best girl, and Yuzu x Seiji is best ship. Not much else to say about the show other than that I enjoyed it, and ended up giving it a mid to low **6/10**."
  },
  {
   "score": 2,
   "id": "dja00pa",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 18:32:46",
   "depth": 0,
   "text": "Well that was an anime, I guess."
  },
  {
   "score": 1,
   "id": "dj9gug5",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 12:33:10",
   "depth": 0,
   "text": "All it takes to turn a Guri back to Guri is a kiss from Guri! \nI expected the ending to be such, being a harem, but I really like it. Knife in forehead and all."
  },
  {
   "score": 1,
   "id": "dj9lnhr",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 13:53:34",
   "depth": 0,
   "text": "Pretty solid finale, as well as a not really spectacular show but still pretty funny and cute"
  },
  {
   "score": 1,
   "id": "dj9mwct",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 14:15:47",
   "depth": 0,
   "text": "I loved this episode, parts between this episode and the manga were different. I think the anime did this wrap up really well.\n\nI hope we get a second season! This show gets my five stars!"
  },
  {
   "score": 1,
   "id": "dj9rc92",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 15:39:15",
   "depth": 0,
   "text": "I liked it. Anyone know where to start in the manga or should I just start from the beginning? "
  },
  {
   "score": 1,
   "id": "dj9x9v9",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 17:35:58",
   "depth": 0,
   "text": "That's a fun show overall. I will have many complains, but this series have so many absurd moments there I don't care anymore. I will give it 7/10, no more no less."
  },
  {
   "score": 1,
   "id": "dja1glt",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 19:04:13",
   "depth": 0,
   "text": "The show was good and kind of funny at some points but didn't really stick any of the 'romance' it tried to do. 7/10"
  },
  {
   "score": 1,
   "id": "dja5fd4",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 20:31:01",
   "depth": 0,
   "text": "So Shikimi-san was a literal attention whore throughout her life? Wow. What's not so wow is the reveal that Guri was part-demon. Don't think you can come up with a more obvious twist from this season. All in all a great ending to the funniest show this season IMO.\n\nTV Tropes describes this show as a \"Love it or Hate it\" sort of deal, and I'm definitely in the former category. From wonderfully vibrant art/animation, a splendid cast of characters, and great humor in general. The elephant in the room has to be addressed though: the series' series moments. Actually not too bad. I mean, when each character that gets a backstory ends up being relevant throughout, what is there to complain? Still, I really don't get this trend of extremely silly shows turning serious all of a sudden. Nanbaka, Busou Shoujo, and now this. I really just want a purely silly show like KonoSuba, okay? Either way, I'm actually rather satisfied with what I got from this show. Now to go on to repeating the OP on loop. Shit that stuff's addicting."
  },
  {
   "score": 1,
   "id": "djcanip",
   "pid": "t1_dja5fd4",
   "date": "2017-06-24 07:17:06",
   "depth": 1,
   "text": "Nephillim"
  },
  {
   "score": 1,
   "id": "djaal47",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 22:49:10",
   "depth": 0,
   "text": "deleted: wrong sub xD"
  },
  {
   "score": 1,
   "id": "djachdt",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 23:55:27",
   "depth": 0,
   "text": "I'm sort of hoping for a season 2 in the future, that's if there's enough content by then."
  },
  {
   "score": 1,
   "id": "djaeayf",
   "pid": "t3_6ivpao",
   "date": "2017-06-23 01:10:25",
   "depth": 0,
   "text": "Wow, the animation this episode was just not good. EMT2 must have really been pushing it.\n\nAnyway, that was a satisfactory ending to the series. Everything gets wrapped up, and we confirm the feelings everyone has for each other. This show was never the best at serious drama, but it could be worse. In the end, this was a perfectly reasonable show. "
  },
  {
   "score": 1,
   "id": "djbx96n",
   "pid": "t3_6ivpao",
   "date": "2017-06-23 22:21:38",
   "depth": 0,
   "text": "SUUUUUPER rushed ending but I enjoyed it nontheless."
  },
  {
   "score": 1,
   "id": "djbxxwb",
   "pid": "t3_6ivpao",
   "date": "2017-06-23 22:44:22",
   "depth": 0,
   "text": "Guri is the worst girl ...no one should love her back, nothing but a burden on everyone"
  },
  {
   "score": 1,
   "id": "djbzt1g",
   "pid": "t3_6ivpao",
   "date": "2017-06-23 23:53:33",
   "depth": 0,
   "text": "So I'm understanding this to be the final episode...\n\nWill there be a season two or should I just take the L and read the manga? I started watching this on a bored whim, got reeled in and ended up loving it, and now I'm sad because I didn't realize the show would end up being short. "
  },
  {
   "score": 1,
   "id": "djc4tzo",
   "pid": "t3_6ivpao",
   "date": "2017-06-24 03:48:52",
   "depth": 0,
   "text": "It was all right."
  },
  {
   "score": 1,
   "id": "djcjsse",
   "pid": "t3_6ivpao",
   "date": "2017-06-24 10:48:46",
   "depth": 0,
   "text": "i come to this anime blindly, and like it in just 5 minutes. absurd, unique and funny af. need s2 ASAP.\n\nAlso i need more guri's mom, dat yukarin....."
  },
  {
   "score": 1,
   "id": "djhmhtv",
   "pid": "t3_6ivpao",
   "date": "2017-06-27 17:29:42",
   "depth": 0,
   "text": "Anyone who's read the manga, is it known who Seji ends up with?"
  },
  {
   "score": 3,
   "id": "dji79wt",
   "pid": "t1_djhmhtv",
   "date": "2017-06-28 04:06:06",
   "depth": 1,
   "text": "Manga is still ongoing, no winner(s) yet."
  },
  {
   "score": 1,
   "id": "djitio0",
   "pid": "t1_dji79wt",
   "date": "2017-06-28 11:42:54",
   "depth": 2,
   "text": "Guess I'll have to look out for it when it finishes then. Thanks!"
  },
  {
   "score": 1,
   "id": "dk1viko",
   "pid": "t3_6ivpao",
   "date": "2017-07-10 17:42:01",
   "depth": 0,
   "text": "Has anyone noticed the wrong background is shown in a few of the frames at 13:25? It is the school background instead of hell... "
  },
  {
   "score": 0,
   "id": "dja0oit",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 18:47:02",
   "depth": 0,
   "text": "Solid 3/10. Some funny moments but falls short overall. The opening song was the best part."
  },
  {
   "score": 3,
   "id": "dja8bch",
   "pid": "t1_dja0oit",
   "date": "2017-06-22 21:42:37",
   "depth": 1,
   "text": "the opening is from Wake Up Girls, an idol group, which has also its own anime with the same name. They also made the opening to Ping pong girls"
  },
  {
   "score": 1,
   "id": "djcjo4x",
   "pid": "t1_dja8bch",
   "date": "2017-06-24 10:45:42",
   "depth": 2,
   "text": "how was wug anime? the OP makes me interested with wug"
  },
  {
   "score": 1,
   "id": "djcjyhe",
   "pid": "t1_djcjo4x",
   "date": "2017-06-24 10:52:24",
   "depth": 3,
   "text": "It's an idol anime which has a realistic/ dark approach to that setting. \n\nPersonally I liked it. The idea was well presented, it had good characters and good music, only weaker than the other idol shows like love live or idolmaster in the animation part. \n\nI think Guri was also spoken by one of the VAs from WUG"
  },
  {
   "score": -12,
   "id": "dj9oixz",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 14:45:30",
   "depth": 0,
   "text": "oh god finally it's over. i hate romcoms and the direction this went after the first half or so. 5/10 for being somewhat funny and clever sometimes."
  },
  {
   "score": -9,
   "id": "dj9rtkj",
   "pid": "t3_6ivpao",
   "date": "2017-06-22 15:48:46",
   "depth": 0,
   "text": "Boring episode. The only good parts were the back-door to Hell (with the sound effect), Akane crashing in on top of a brutalized Cerberus, and everyone's reactions to Guri's plan to add Shiki to the harem.\n\nAnd they actually spent several minutes trying to humanize Shiki...\n\nAlso, early show Guri >>>>>> final Guri >>>>>>>> Demon Guri.\n\nAnd whichever fundamentalist refuses to translate Kami and Maoh needs to be fired immediately.\n\nOverall a 7/10, and only that high because of the pre-final-arc Guri."
  }
 ]
}